{"id": "HIH8Xr7ePF1SjDTotvNqCg", "text": ["Crisp, clear day for a pleasant half hour drive here today for lunch.  It was our first visit.  We quickly wandered through the beautiful multi room gift...", "The Apple Barrel gift shop and Cafe in Schoharie NY is a great destination spot in beautiful Schoharie County. The shop is divided into rooms with different...", "If you are planning a trip two Schoharie County stop in I they have a lot of stuff you can buy for yourself or for somebody else they also have a restaurant..."], "rating": [5, 4, 5], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch"], [], []]}
{"id": "GUGIFOAeTrj6bj-bwB025w", "text": ["Absolutely lovely stay. The inn is well kept and beautifully appointed.  We stayed in the fourth floor artist loft and it was nothing short of breathtaking....", "This is a very cool place of 1800's brownstone history to stay if you're ever in the Capital District of Albany, NY. The Morgan State House is a great,...", "This is a beautiful hotel, which offers more of a bed and breakfast feel. They have the main state house and then the rooms in the tower. I highly recommend..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "Ip-yx5mUB776EGUuXbouxA", "text": ["Had my fantasy football draft at Applebees in Glenmont tonight. I have been hard on Aplebees in the past. I wasn't a fan of the menu  and felt the portions...", "Service was lousy. It was very very slow and we had to go find our own\nnapkins.  The french fries were awful - cold.  they must have been sitting for a...", "I haven't been to Applebee's in quite a while so we swung in to grab a quick lunch. I really wanted to try the grilled shrimp and watermelon salad. Grilled..."], "rating": [3, 2, 3], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [0.2, -0.2, 0.2], "keywords": [[], [], ["lunch"]]}
{"id": "55mbrvxSMijLVrE2qKP3Fw", "text": ["When it comes to Cugino's Pizza there is no local pizza that is as good. Their specials are amazing. Their wings are delicious as well. Everything is fresh...", "I recently ordered from Cugino's. I ordered a personal pepperoni pizza and fried pickles for delivery. The food was delicious. The pizza was very good. The...", "We ordered a few slices to try it out. Fresh Quality ingredients on a crust that was just the right thickness (thin but not so thin that it was swallowed up..."], "rating": [5, 4, 4], "TBscore": [0.52, 0.48, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["pizza", "wings"], ["pizza"], []]}
{"id": "5w7Cv7JIWffBwi3ElYHH0Q", "text": ["Great tasting.  You will not be disappointed with the quality of the food.  However, once in a while the customer service quality isn't so great.  Hence why...", "That's how I feel as well great spot they know my name ..... \"Cheers\" in a diner !!!! At least there's no illusion of clean I love it no hair fair game.. My...", "What a wonderful find!  I had come from the courthouse and was waiting for the bus when some of my friends invited me to join them for lunch.  We found this..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 1.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "r5Rvd27eHLb_NUq0HhcS2A", "text": ["This is my favor Local Restaurant in the Capital Region Area. The service is excellent and the food fantastic. The atmosphere is quaint and cozy. Very...", "I'd like to give 3.5.  The Cat's Meow is a wonderful, throwback, traditional tavern.   You walk into a warm, homey atmosphere that is comfortable watering...", "Disgusting. Don't waste your time or money. It should be closed down by the health department."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "JJ5wlYTVENVnLVZhr7p1bQ", "text": ["I stopped in after an appointment for breakfast and had their 2-for-$4 croissant sandwich deal. I get that this is cheap breakfast food from a fast food...", "I cant believe that people have left anything but bad reviews for the Burger King in MENANDS not Albany... I work and live near it... I've been there a hand...", "Like the legend of the phoenix, this Burger King has risen from obscurity and death!  When I relocated my life to New York, this building was a hollowed..."], "rating": [2, 1, 4], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.6], "keywords": [["sandwich", "breakfast"], ["burger"], ["burger"]]}
{"id": "-ZbDpNHcUtu9SvXT7hfS9g", "text": ["What's better than getting to mix your choice of sliders and tacos?! \n\nI wish I could remember the names of the sliders as they are quite creative - either...", "Wing Tour:\n\nCrispy: 3 Stars\nFlavor: 4 Stars \nOverall: 4 Stars \n\n\nRecommended by a friend to try the Honey Sriracha wings here, and so we did!  Definitely...", "My friends and I often come here to get food and pregame before slidin' I'm down to Footsy Magoo's. Their service is excellent and they have great vegan..."], "rating": [5, 3, 5], "TBscore": [0.56, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["tacos"], ["wings"], []]}
{"id": "d756zNcLnEqll7dHc_soLQ", "text": ["Came here for a snack to us over until a late night dinner while staying in Albany.  I saw the area was famous for mini hot dogs and decided to stop here...", "Great dogs cheap price it really can't get any better. Service is great as well. I have had the hotdogs and burgers and you can't go wrong with either", "Whenever I'm in the Capital district on business or for visiting family, I always have to stop for Hot Dog Charlie with the works.  Yum!"], "rating": [4, 5, 5], "TBscore": [0.0, 0.37, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["dinner", "snack"], ["burger", "hotdog"], []]}
{"id": "q53j4Nel-LlJghRpsuf_fw", "text": ["Good stuff. But not for the reasons you may think....\n\nStopped here to see if the dogs are on par with the rest of the capital region dogs. I would say they...", "I honestly always have a good experience here. I stop by during lunch break and have eaten inside and taken it back to the office.\n\nThe employees are nice...", "Perfect hot dog and flat grill joint.   Good breakfast sandwiches, hot dogs with meat sauce and quality homemade soups.   Cheap too."], "rating": [4, 4, 5], "TBscore": [0.0, 0.47, 0.43], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["lunch"], ["sandwich", "breakfast"]]}
{"id": "XWD1X5COj9HpY4jNb2q9-w", "text": ["What a dog!!!! This place is marvelous for such cheap fantastic dogs it can't be beat", "Gus's Hotdogs was good back in the day, but now it's terrible. I ordered a cheeseburger and mini dogs  with meat sauce. The cheeseburger was old, burnt, and...", "Been here a few times. Always have awesome dogs and carry it back decades. \nOrdered loaded dog, Greek budget & grilled sausage. $5.90"], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["burger", "hotdog"], []]}
{"id": "l2sEA8T4kPgJOicXqI8KXA", "text": ["Ten years? \n\nIt's been ten years since I first reviewed Famous Lunch? That means it was one of the first places I reviewed when I moved to the Capital...", "I would have rated this place 4 stars in the past because it was mediocre food but at an amazing price. However now they greatly increased the price but the...", "We had some business in the Troy area, so we finally checked this place out. \nThe nostalgia fix here is great, but the food...not so much. \nWe each tried a..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["lunch"], [], []]}
{"id": "LfZBfDGd13uIOWSBsSWqfQ", "text": ["Absolutely love newest lunch every time I come to visit Schenectady New York I half to go here and have lunch it's the best it's the same as I remember it...", "Didn't enjoy the meat sauce like a lot of other people. But the fries and onion rings were perfect and the hotdogs without the sauce were up to par. The...", "This is a local establishment that has what I'd consider some of the best Hotdogs in the area.  I've tried several of the other local hotdog joints and most..."], "rating": [5, 3, 4], "TBscore": [0.29, 0.42, 0.23], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["lunch"], ["hotdog"], ["hotdog"]]}
{"id": "bjv2bf_kX1cNl-2OPm4Jig", "text": ["Hot Dog Charlie's simply has the best hot dogs there is. The buns are toasted to perfection while dogs are grilled to juicy deliciousness and then the...", "The mini hot dog is one of my great discoveries since moving here not long ago and Hot dog Charlie's is one of my favorite places to go for them when I get...", "Who does not love, love, love Charlie's? \n\nI am giving five stars for Hot Dog Charlie's being one of the best in their category.\n\nHot Dog Charlie's was..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "7C86z-g2Mz08oXZiwRL4FQ", "text": ["This place is a hidden gem, located right on the water. The staff is incredibly​ friendly, and the food is amazing. by far one of the best hot dogs I have...", "What a great find.  Had a grilled egg sandwich with bacon.  Generous portions and perfectly grilled on a Kaiser roll.  Friend had the original wrap - he...", "Excellent, and fast. Very tasty grilled chicken sandwich. Included caramelized onions and pesto sauce.\nPicnic tables above the river. \nGood size crowd for a..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.72, 0.25], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["sandwich", "egg"], ["sandwich", "chicken"]]}
{"id": "wY2nSJi_XLc8MrIMIPBBBw", "text": ["Broadway lunch was recommended to us. Hubby loves his hot dogs.  This place is known for its hot dogs and onion rings.  We were not disappointed.  Hubby's...", "I reccomend the Broadway diner. My friend and i stopped by for a late lunch and we couldn't have been happier!  My friend loves french onion soup and she...", "I visited Broadway Lunch today with my cousin who lives in Schenectady.  I was pleasantly surprised that this small \"mom and pop\" diner like lunch place..."], "rating": [4, 5, 4], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["lunch"], ["lunch"], ["lunch"]]}
{"id": "3dYARq0CfKF39pKdmwGtGA", "text": ["I generally don't buy food at the mall but my wife and I were shopping on date night and decided to splurge. We passed this place because it had a huge line...", "The food wasn't done I had to wait more then 30 mins Alicia was the only one fast and prompt", "I'm addicted to these pretzels!  I love the taste of soft pretzels!!!   No calories right?  Staff is nice.  It's my to go to place at Crossgates!"], "rating": [3, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "vyjy5otmQQtaJkEGA9OC4g", "text": ["Great Staff - Wonderful Cocktails! \n\nI met a couple friends at the bar mid week. The bar was crowded and the tables were busy. The hostess greeted us a...", "We visited most recently on a perfect summer day for lunch and sat at the bar, which had the garage doors open. It was perfect. \n\nOnce again, the beer list...", "Had a great lunch today.  My boys both had burgers and I had the lamb burger.  All were delicious.  The zucchini twirls app was delicious as well.  Kyla..."], "rating": [4, 4, 5], "TBscore": [0.48, 0.62, 0.93], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["bar"], ["bar", "lunch"], ["burger", "lunch"]]}
{"id": "6uvX1q88cHBHu8_5oFT9FQ", "text": ["I've been going to this restaurant sporadically since 2011. This is less often now that I lived outside of the area, but I still visit  family and friends...", "Went for 430 football this past Sunday\n\nOkay here it is, I have been here numerous times for mostly football games. The service is mediocre and it's...", "As a chain is expected to be, it feels like the normal. I had been greeted by a gentleman that ended up being the bartender. \nChris, the bartender is the..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "bzUUTMhwIWC45dmCeki9jQ", "text": ["Tugboat has the best cheese fries and the best stuffed cheeseburgers in the area. I love how they use real cheese and not the canned nacho cheese crap that...", "Stopped her with my wife and daughter. \nThe atmosphere was calm and inviting. \nWe ordered wings for an app and they were great!\nAlso got a sandwich and...", "Ice cold beer!  Yes!  Next calamari tender and crisp.  Very yummy.  Wings - all kinds of flavors.  We got regular, Thai sweet and spicy (my favorite) and..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.65, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["sandwich", "wings"], ["wings"]]}
{"id": "n4197svD4KOlUSn6Yxs85w", "text": ["Swifty's has been a long term delight(years) for us in DelMar, NY. We'll continue to try the menu, as of late the service & food quality has slightly...", "I came for the Buffalo burger: a deep fried hamburger covered in wing sauce? Yes, please! \n\nI lived in Buffalo for a few years, so anything Buffalo in the...", "We went to Swifty's about a week and a half ago and it was so good. The Irish nachos were SO GOOD -- they put them on potato crisps and you honestly cannot..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["burger", "hamburger", "wings"], []]}
{"id": "8F9aQjOnavlteMqukXPbdA", "text": ["First, to clear the confusion, despite they have a sign that says, cash only, THEY DO TAKE CREDIT CARDS.\n\nThat out of the way, we had a bad case of the...", "Used to LOVE this place for their Ruben sandwich.  It WAS the best in the area.  However, they recently lost their cool and now have a new one.  Too bad for...", "Extremely creepy men everywhere, felt very unsafe. Both times I've been here (with different groups of friends) everyone has ended up blacking out even..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], ["sandwich"], []]}
{"id": "ALRQOx5RZ_o9MZdiyCWgSQ", "text": ["Margarita pizza and 24 wings thai chili. Everything was on point. Order came out fast, staff was very friendly. I recommend others try this new place. Wings...", "I had to ask 3 different times to have my order read back to me to make sure it was correct. Still, they forgot 1 of my orders. Ordered a philly chicken...", "If I could give them zero stars I would. We ordered food that came two hours later only to find out not everything was there. We called the restaurant and..."], "rating": [5, 1, 1], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["pizza", "wings"], ["chicken"], []]}
{"id": "W17rZ6VrCydTAjwV_KZQNA", "text": ["Don't expect more than great sandwiches! (Though a bit on the pricy side $13 reuben & fries?)\n\nSure you can get a beer or a decent martini ($5.75...", "I haven't been here in ages. We decided to come here after having trouble getting service at another place. Glad we did! The dining area was full so we...", "We have been going there for years but last night was the end. W found seats at the bar,got drinks & after waiting'had to ask for a food order to be taken...."], "rating": [4, 4, 1], "TBscore": [0.54, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["sandwich"], [], []]}
{"id": "VZi5FKI9n0QmQt2Ow4rNkA", "text": ["The size of steak is suitable with people who have small stomach. You can just eat whole plate as full as you can afford. It doesn't like the steak from...", "Today I learned that food can take a long time and still be cold.  Also we have a strong suspicion that someone dropped salt on the food and either didn't...", "My friend and I came in and waited about 10mins just to get sat at a table. Employees saw us standing there waiting and made no initiative to seat us nor..."], "rating": [4, 1, 1], "TBscore": [0.21, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["steak"], [], []]}
{"id": "RZKrMWxq2N1uaBwiJdgpDQ", "text": ["I don't care what anybody says KFC while maybe unhealthy has some delicious food. First off, the fried chicken is always great. You always have to go extra...", "Dissapointing. Had to leave because after we were told it'd be another 15 minute wait through the drive thru, they then changed the wait to half hour...", "It started with ordering. The young lady waiting on me made me feel like I was bothering her. She may have just been having a bad day, and if so, I hope her..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["chicken"], [], []]}
{"id": "JDE6Op3wD3zwdLtAXxp-Pw", "text": ["Nothing worse than placing your order, have them repeat it back, repeat it while packing it and still forget things. Every time!!!", "I don't care what anybody says KFC while maybe unhealthy has some delicious food. First off, the fried chicken is always great. You always have to go extra...", "This place is disgusting!  I feel like I need a penicillin shot after walking in the door here.. sorry.. I walked in then right back out!! Doesn't this..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["chicken"], []]}
{"id": "cCEVGzalmcnGCrE6O6PDoA", "text": ["Good place to eat. Friendly staff. Sometimes very busy could be a short wait. Food is good. Process are fair. Bbqs sauce is amazing.", "Cfc, is one of our favorite places to go. If you want GOOD food fast- please try this. Our go to meal is the lamb kabob, and chicken kabob. Omg. So...", "We just moved into the area and I had a craving for an Italian Cheeseburger. What chicken spot doesn't have that? We stopped into CFC and have been hooked..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, -0.3], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["chicken"], ["italian", "chicken", "burger"]]}
{"id": "0oH1Dx8RiwPcyBOWks3JiA", "text": ["Second visit: So far -- It's as good as it gets.\n\nThe menu is as authentic is it gets. One of the skilled chefs, owner Mr. Douglas is very friendly as is...", "Worst food I have ever in US.. their meat taste like rubber and shit.  We tried different item like chicken curry. Lamb curry . Fish fry.. all of the items...", "Went there for the lunch box special, because they have the sign outside for it. After getting my meal she thought I said \"large\" instead of \"lunch\", gave..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.45, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["chicken"], ["lunch"]]}
{"id": "SaftP_L0n_ldn6g7WGSwtQ", "text": ["One word: Ghetto. This is a KFC/Taco Bell but it is not a full menu of either. The basics, however, are covered.\n\nThe wait is always long inside and most of...", "The drive thru is ridiculously long!! The girl who took my order took my full order twenty seconds it got quite, and then she welcomed me to KFC again. I...", "Glad these guys were open through all of the snow that we received from Winter Storm Stella, though I've had a couple of issues ordering their drive-in.  I..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "WRpnA1OWBYfSwoXpkoreuQ", "text": ["China Max is my favorite Chinese place around. First they offer you free samples of the sesame chicken and it is delicious. The chicken is crispy and the...", "This place seems like every other Asian (or \"Cajun\", as apparently the case may be) restaurant in any food court in America. They lure you in with free...", "This place is flat out horrible. They practically force you into line. I got into like and ordered 2 plates. 2 sides 2 meat. It should have been around $8..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["chicken", "chineese"], [], []]}
{"id": "zW2VHzxvl54wF1YNOCZDyw", "text": ["Food is consistent very close to work sometimes you just want a Subway sandwich and this is my location of choice from now on, try the veggie patty today...", "Very good bread! Always fresh! Veggies look great as well. Nice lobby area to hang out or eat. Would definitely recommend.", "The food is what you expect from Subway... which is never my absolute favorite, but is quick and health conscious. \n\nHowever, I am writing the review..."], "rating": [5, 5, 4], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["sandwich"], [], []]}
{"id": "CBZmeKkcrOuENvERgOx73A", "text": ["Not bad, but the prices are going up and up. I'm not sure if this is a local thing or nationwide. \n\nAlmost $10 for a sub seems like way too much. I would...", "This Subway I visit often when I am trying to get off from the central ave crowd. Every time I enter I am greeted, all the toppings are clean and in the...", "Service & food were great.  Really cool building.  Didn't try the drive thru but it looks great.  And nice to have black rock coffee drive thru right there,..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "WgCZb3HeI2sQZRJU7Jf5Mg", "text": ["Always accommodating, very fast service, good prices, and the owner can cook a good egg Sammy.", "Food okay, but $12 for a sandwich on a hard roll and a cup of soup??\nI can get a full sub with soda, chips and a cookie for that price.", "A little hidden gem in Albany that has great sandwiches thanks to quality ingredients and a friendly staff.\n\nWe stumbled upon this place after making our..."], "rating": [5, 2, 4], "TBscore": [0.55, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["egg"], ["sandwich"], ["sandwich"]]}
{"id": "cDcv2rmLIvOwXyhwzuaMlg", "text": ["Always an excellent meal! Friendly staff and the food is delicious and fresh. I've never had any problems or complaints. Portions are generous and every...", "Eat fresh? I don't think so. I couldn't even complete my order it all looked so awful. The meat they \"stacked\" (if you can call it that) on the guy in front...", "On 2/23/2016...Went with my 4 grandchildren, asked my son.. bro & his wife kid..All met there..as heading to sky zone around the corner..First sign it was..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "uggLYZZ5ICOFpAYlmOf46w", "text": ["I'm reviewing on a curve for quick service restaurants. I like to preface with that because it's obviously different coming to a chain shop like this and a...", "It always makes me laugh when I travel and find out about a chain that happens to be near my house. It doesn't always happen, but when it does, it's...", "Decent, I ordered the ham salad sandwich and it was good. Nothing special, not terrible overall everything was just fine. Service was fine, parking was..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.37], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], [], ["sandwich"]]}
{"id": "ZY9Jum6ewd1WWtoL0fK9kA", "text": ["While in the Albany area to attend a friend's Oktoberfest, I was searching (Yelp, of course) for a place to find German meats. Rolf's was the obvious...", "I visited Chester's and Rolf's a day apart and was struck by the similarities. One is relatively new with a fancy smoker, the other has been around forever,...", "Nothing better than the wurst!!! Incredible tasting.  The woman behind the counter helped me figure out what I needed.  Everything she suggested I brought...."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "Sj0wVPONmRMLIEX8pu9oHw", "text": ["Excellent food and service. My very first experience with this deli was delicious! I ordered a small roast beef sub and it was amazing! They cut their own...", "Italian sandwiches and subs are still pretty new to me. Sure, the area is filled with delis that will make you all kinds of cold cut sandwiches to order....", "I ordered a 4 foot sub with Mac salad party platter and cookie platter for a party I was having. The bread was super good. The Munster cheese excellent...."], "rating": [5, 4, 4], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["deli", "beef"], ["italian", "sandwich", "deli"], []]}
{"id": "O2XgFm7CwxkBSeIA3cYUjw", "text": ["If you haven't stopped in for a breakfast sandwich, you are really missing out! Most days I tend to be prepared and bring breakfast to work or eat before...", "A very solid deli with good prices. Usually I pack my lunch, but on days that I've been too busy to make food, you'll find me picking up a sub at Fiorello....", "We were in Albany just for a quick time, and looked on the GPS for a deli for a sandwich. We checked Yelp to find a good one and decided on Fiorello's. The..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.52], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["sandwich", "breakfast"], ["deli", "lunch"], ["sandwich", "deli"]]}
{"id": "QltbyIIlP6KgFhC2CQKqow", "text": ["Just came in for a turkey and ham sub and they literally put 2 slices of each on a foot long sub. I know it was special of the day but come on. Also they...", "Fantastic food. Once again, I was in a meeting allllllllllll day so by the time I got dinner, I had my inner fat boy come rushing out so I ate before I got...", "Great local sub spot. Great prices and good customer service. It's hot as Jupiter inside the restaurant though. I feel bad for the girls working in there...."], "rating": [2, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 0.6], "keywords": [["turkey"], ["dinner"], []]}
{"id": "b12g0tde2OjS2DKcSYiy8Q", "text": ["Your options for coffee if you're coming to the Empire State Plaza by bus--as many of us lobbying for the average citizens of NYS are--are slim. This time,...", "Use to be my favorite place to stop in NYC for some treats to bring home but been going now near home and I'm loving it. A great place to stop in for lunch....", "This Au Bon Pain is fairly the same as the others. \nThe quality of the food is what you would expect at a chain like this. The food is decently fresh, and..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "jo9WMTYOvoW_6WyM2flTOQ", "text": ["A simple turkey sandwich changed my life.\nI was in Albany last week, and payed a quick visit to Genoa Importing. The selection was astounding, the service...", "Oh boy. New ownership and here come the changes. Their eggplant parm was my go to because it was epic. But it has changed. Can't pin point it yet, but it...", "I tried Genoa recently. It was sold to a new owner.\nHorrible.\nGreek salad is not a Greek salad anymore.\nWho puts bland spring mix in a Greek salad?\nThe feta..."], "rating": [5, 3, 1], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["sandwich", "turkey"], [], []]}
{"id": "n9KSfii0GCOJOhDJLAXJ7Q", "text": ["Wanted Sunday brunch that would be quick and cheap, Alexis Diner did just that.  Ordered veggie skillet and added meat, along with a short stack of pancakes...", "The food was good had the pancakes royal, added strawberries. Wanted a short stack no\nwhipped cream got, 3 cakes and whipped creme.\nWhere the breakdown in...", "Food was great, service was good, but after eating there my stomach isn't having the best time, neither is the bathroom. \nIt might not be the food, but I..."], "rating": [4, 3, 2], "TBscore": [0.24, 0.35, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["brunch"], ["cake"], []]}
{"id": "iS_mqWkQmvD0OV6OKzdLKg", "text": ["Our church gets our bagels for the break from Bruegger's, and they usually have small portions (bagel bites?) of a sun-dried tomato bagel that is spicy and...", "It has been quite some time since I had the opportunity to enjoy a Bruegger's bagel.   Since it was lunch time I decided on a turkey chipolte on a toasted...", "This used to be one of the best locations around.  However over the last couple of months 2 employees at this location have made it one of the worst to deal..."], "rating": [3, 4, 1], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [[], ["turkey", "lunch"], []]}
{"id": "8RWFDMgP-NrpXtr-_G4e9Q", "text": ["I unsuspectungly came across these waffles while on vacation. \n\nIt may have been the best thing to ever happen to me.\n\nThese waffles are like a panacea. So...", "Stopped by in the indoor Farmer's Market. Lots of people buying them so thought I'd give it a try as well. $6 for a waffle seemed a bit expensive. The...", "Pretty much the most amazing waffle I have ever had. Want this place at my house on command, just a ridiculously tasty waffle.\n\nThese are special waffles,..."], "rating": [5, 4, 5], "TBscore": [1.0, -0.5, 0.26], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["waffle"], ["waffle"], ["waffle"]]}
{"id": "AZqsal3nzTkwQqxUol_UjA", "text": ["Good strong coffee, friendly professional staff, nice background music yummy food. I'm so glad I found this place.", "I'm passing through Troy for two days and found this spot just down the street. The staff is friendly, and the coffee is good. Two stars already.\n\nThe order...", "I had gotten coffee here a few times while in the area, but never had tried their food. I'm mad at myself for waiting so long to do so!\n\nVisited for a late..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "3B5Rlzc2gv912ujMuOY2UQ", "text": ["Really awesome experience here. I can't say enough positive things about the staff. Friendly, prompt, kind. Was exactly what diner service should be.\n\nI was...", "Been here several times, mostly for breakfast and lunch.  Service during the day is fantastic, food is fast and hot.  \n\nI wouldn't recommend for dinner....", "After a brief hiatus, I'm back in sharing my thoughts on eggs, pancakes, bacon, and/or homefries. I did NOT get to try the latter of these two items, but..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["dinner", "breakfast", "lunch"], ["egg"]]}
{"id": "zzOLRpd-Di6uUxktrhnoXQ", "text": ["Stopped by here for lunch yesterday. I had a cold turkey sandwich and a soda. All of the veggies on my sandwich were ripe and fresh! Also, the prices are...", "When are they ever open or here?!?\nLost a customer. Every time I have come they were closed or lights on but no one there... disappointed also looks kinda...", "I had the broccoli cheddar soup today. Super cheesy, loads of broccoli, and very filling! And for $4, you can't beat it! I'll definitely be back in the..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["sandwich", "turkey", "lunch"], [], []]}
{"id": "0hReEvRN5bO9EQ_YMSFb_Q", "text": ["I've gone to Maggie's on a few occasions. Today I was with a friend of mine who has never been. I described the place is quaint little local Tavern. That...", "Currently still sitting here waiting for a replacement burger that was not cooked and honestly at this point a check! Unbelievable; came out to celebrate a...", "I really wanted to write a decent review for this place as I sampled a big portion of their menu and was ok with it but when I paid tonight I had the $20..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["burger"], []]}
{"id": "oUz14jbRaG6aXLE9W5KeKA", "text": ["Most excellent cheesesteak!!  Not Ray's from Philly but dang dang good!!!!  And the cookie I got wth mine....again, mos EXCELLENT!!  Next time I'm in...", "Pretty solid option if you're in the mood for a hearty and filling lunch. My rating is based on the fact that I only ever get chicken subs there (buffalo...", "yea, get yor sandwich on.\n\nol standby, TB, shreddus, swiss.  asked for spicy mustard and got their home style version. expecting something a little more on..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["chicken", "lunch"], ["sandwich"]]}
{"id": "LXzYP8Yvp3aaywNUXDySEA", "text": ["This is all pretty standard. It's a chain so wherever you go it's pretty much the same, which I enjoy sometimes. They just began selling prime rib and I...", "They were open Easter Sunday, and I was recovering from surgery. Companion offers to pick up food, so what could I say? (I did offer repeatedly to cook a...", "I stopped in for lunch....It was a toss up Debella's or Boston Market. I had a the chicken breast sandwich. I guess all I can say it was what I expected. It..."], "rating": [3, 3, 3], "TBscore": [0.0, 0.0, -0.35], "normalisedRating": [0.2, 0.2, 0.2], "keywords": [[], [], ["sandwich", "chicken"]]}
{"id": "H2wtQ8Kniv7t5pBA6cTwBw", "text": ["This restaurant is located inside the Hilton Garden Inn that is located at the Albany international airport. At first I wasn't expecting much from the food...", "Good quality food. Quaint little dining area. It was a nice experience. Dinner was great. Good kids menu and very accommodating. Hotel managers were...", "Perfectly adequate restaurant, slightly overpriced but it is in a hotel so they have a captured audience. Staff is great. If you are staying here (which I..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.47, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], ["dinner"], []]}
{"id": "z7uhsbm2t1v1zSyVsXvf2A", "text": ["Location is in the hotel- not exactly what I expected when reading the reviews before coming here. I was happy with my service and my food came out good....", "I travel a lot for work and spend about  100 nights a year in hotels.  Generally, I avoid eating in them because they tend to be mediocre and overpriced....", "We all know that you take a big chance on a hotel lobby restaurant.  Tonight I did.  It didn't pay off. \n\nFirst off, the front staff is very friendly. It's..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "UTFvpZjzZZBvPOqQ0HbqvA", "text": ["Always a favorite of mine! Great customer service from a young staff. So impressed even though it was ten minutes to close no one acted annoyed at the large...", "When we visited here, all the employees were engaged in prolonged, personal chit-chat while blatantly ignoring customers. I had to finally interrupt them to...", "Cold Stone has decent ice cream, but nothing special. There is a lot of different flavors to choose from, but the ice cream is very heavy. Also they don't..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "tZLtxMw6jqvOJtO_TSO6AQ", "text": ["Title - in Albany area? Must Go Here!\n\nAs good as it gets bar none. We were just in Charleston SC last night and walked by Jeni's - the VERY popular ice...", "How could you not give this place five stars? It's some of the best ice cream around and it's all homemade.  \nThey have great unique flavors that are just...", "Only my husband is crazy enough to take me out for surprise ice cream in the middle of winter. After driving down 5th Ave for what seemed much too far we..."], "rating": [5, 5, 4], "TBscore": [0.49, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["bar"], [], []]}
{"id": "ci07CWpg-93lprYLtv895Q", "text": ["I am so sad to write a bad review, but I actually just had the most disgusting milkshake I've ever had from the Ice Cream Shop. Think about that for a...", "Just moved into the area and this was our first time trying an ice cream joint near the house. We were not disappointed. Coming from two adults and three...", "Great ice cream. But styrofoam cups? Please consider a more ecological alternative. Otherwise, good stuff!"], "rating": [2, 5, 4], "TBscore": [-0.34, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 0.6], "keywords": [["milk shake"], [], []]}
{"id": "HPdjz3CQ7sixCnjfThcqsA", "text": ["Classic Americana.  Go on a Thursday in the summer and get a free performance of the US Waterski Team at the same time.  For a simple burger and fries I...", "Seasonal venue that you cannot miss. As long as you enjoy quick, fried food, fun outside atmosphere and kids running around all hopped up on the best ice...", "I wasn't even supposed to be at Jumpin' Jack's. We were on a keto diet, and we were supposed to do ONE carb day. Well, blame it on the cold damp weather,..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["burger"], [], []]}
{"id": "mG5hJiSVfNbeYg88p9JJAA", "text": ["Very good soft serve. I have no idea how big the Medium or Large size is, but it's gotta be absurd. The small size was monstrous as it is. Staff was nice...", "Lickety Split is a fine place to grab some ice cream. They have a good selection of sundaes and ice cream. I ordered the soft serve vanilla and it was fine....", "I have been going to Lickety Split for about 10 years. From the beginning, the service was always good, the staff was polite, the ice cream was consistently..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "XvhtA6ArUcw_JmpXqBsKjQ", "text": ["Five Guys is the best! Our favorite place to get burgers and fries. Always fresh and all the toppings you like for no additional cost! The French fries are...", "Burgers were good and they do offer a great deal of toppings.  The fries are a bit greasy but have a nice flavor.  For me, this would only be a once in a...", "My boys and I have eaten here a bunch of times and it's always super consistent regardless of location. Food is priced reasonably for the quality..."], "rating": [5, 3, 5], "TBscore": [0.47, 0.53, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["burger"], ["burger"], []]}
{"id": "f718vUvXn86PoRnoxZY6mQ", "text": ["First time visit. Pleasantly surprised. From the commercials I thought it would be rubbish. They have an online order app and if I had to pull up and read...", "Came here for only my second time (first time was when they first opened) to try this place again. I arrived for breakfast at 9:15, only to discover they...", "The manager of this location should be fired.  I promised myself a few months ago I would NEVER come back.  Driving by tonight I thought I'd give it one..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], ["breakfast"], []]}
{"id": "bngkLytFhyP88BMGLOwlJQ", "text": ["Five Guys probably has the best burgers there is, it's that simple. The burgers are fresh and thick. The melted cheese mixed with the fresh meat is...", "We had lunch this Sunday. Very interesting dishes\nWarm welcome and good wine\nTo recommend", "Ordered online and the food was done right on time, milkshake was delicious, and the food was fantastic. The staff was also really funny and nice while I..."], "rating": [5, 4, 5], "TBscore": [0.22, 0.69, 0.51], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["burger"], ["lunch"], ["milk shake"]]}
{"id": "OjczqLl-q-NQ2oyvWUMagw", "text": ["Latham 76 is everything you want in a diner.  The decor is classic, staff are friendly and it's open all the time!  \n\nHaving lived here my entire life I...", "Been aver 10 years since I have been here!  My daughter and I stopped for breakfast and it was great!!!  Service was good, food was good and prices were...", "The friendly wait staff deserve 5 stars! Portions were generous but food was pretty mediocre hence the 3 stars. Spacious restaurant with plenty of seating."], "rating": [4, 5, 3], "TBscore": [0.0, 0.8, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], ["breakfast"], []]}
{"id": "YozJ8FCKDT98XRq16XkpWg", "text": ["I really like On the Farm, it's a place I have been coming to for years.  I prefer this spot over Guptills, which is the other local favorite.\n\nI mostly...", "My favorite place to bring the family for ice cream. Only reason for four stars and not five:\nThe chocolate milkshakes used to be amazing that's the only...", "We ended up here the other night after looking for ice cream. Their prices are reasonable and the atmosphere was nice. The parking is ample and there's..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["milk shake"], []]}
{"id": "E_q0T4rkXr_sQ4tEL0bRrg", "text": ["I had previously left a 2-star review. I wanted to follow up. The menu has been changed up, and the quality is vastly improved. More consistent.\n$11 buys...", "Having previously visited the three other food court style restaurants at Rivers Casino, we decided to try the remaining one, Flipt, a burger joint.  It's...", "Awful food.  Awesome but retarded staff!  Rather eat dog food though seriously!  Look at my pictures of their hot dog and hamburger!"], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, -0.22], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], ["burger"], ["hamburger"]]}
{"id": "4Asa_ZggWWgr5EAuTUY2cQ", "text": ["I've had lots of fried fish in my day, but never had or heard of a \"fish fry\" until I landed in Albany. After hearing about it, I decided to stop by Ted's...", "I grabbed a quick bite at Teds on my way through town. This place seems pretty popular and gets a lot of good reviews, so I ignored the fact that the dining...", "I thought the fish itself was very good: crispy batter with tender, moist white fish inside. Otherwise the bun and tartar sauce I did not care for and..."], "rating": [2, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "cHmZPanNXD34q0zgB6OVuw", "text": ["During a recent visit, the manager offered us free milkshakes as they messed up something with orders on labor day weekend and took 40 mins for a to go...", "The burger I had was absolutely disgusting. I'm almost positive someone in the kitchen spit on the burger. DO NOT GO!", "I ended up here killing time between doctors appointments.  I ordered a classic burger. ( I know, quite boring), hay stack onions and a coffee milk shake...."], "rating": [4, 1, 3], "TBscore": [0.0, -0.36, -0.42], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["milk shake"], ["burger"], ["burger"]]}
{"id": "-7cDP00Kwa7zOtP6-B3s0Q", "text": ["My husband and I frequent Red Robin. As far as atmosphere goes it's really fun, it can be very loud because kids are everywhere. \n\nWe always end up coming...", "Great burgers! Unlimited side-whichever you choose- and unlimited refills. Mozzarella sticks very good, fried pickles excellent, onion rings very good. Mac...", "Now I'm not saying this is the worlds best burger etc etc etc but let me just say I enjoy res robin! I think their burgers are good, the sides are good. I..."], "rating": [3, 5, 3], "TBscore": [0.0, 0.96, 0.73], "normalisedRating": [0.2, 1.0, 0.2], "keywords": [[], ["burger"], ["burger"]]}
{"id": "kTvx9wqipcl3c-BpeZtw2Q", "text": ["Fantastic.  We had the broiled haddock.  Starting with a delicious beef barley soup. Followed by a nice house salad and the main entree.  The fillets were...", "We came here because our neighbors told us they had a fantastic lunch menu, and we sticked around for the award winning cheese cake. Me and Dotty had...", "They made a great recovery!  I noticed many of the Route 5 traffic lights were out as we worked our way towards the location. Not a good sign unless..."], "rating": [5, 5, 4], "TBscore": [0.43, 0.45, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["beef"], ["cake", "lunch"], []]}
{"id": "QCkOmeHNUNusmFbjdcQ9qw", "text": ["This Dunkin' is a stones' throw from my office, so it's convenient. The staff is friendly, and i've gotten to know them over time, since I come in.  It...", "Love DD - this appears to be a 'newer' location (I'm not from here so I'm not sure how long but it appears to be newer from the decor).\n\nStaff is friendly...", "Staff is friendly early in the morning!  Parking is ok if you are there before 8.  Menu has some variet and place has a newer look to it.  Got in and out..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "X_lEADDx2rG_30sDtgPHfA", "text": ["Dim lighting, smooth music, and superb pork belly and loin fresh from the cookout hog. Good - not quite great, but really just taste-dependent - beer...", "Glad to have a farm with a cafe, brewery, events and fun for all in the area.  Coming from the city I didn't think I would enjoy the farm life but I'm...", "The apple cider donuts are worth the wait.  Grab a beer or cider prior to waiting on line and it'll make your time go by easier. The locale also includes an..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["donut"]]}
{"id": "qEi9uGrA6u8XyAv9AWbHZQ", "text": ["There are farm markets that are cute and precious, where all the produce is immaculate, and there are placards in carefully selected fonts describing the...", "This local farm is a worthwhile stop. They have excellent apple cider donuts which I highly recommend, sell a great deal of jams, pies, and produce which is...", "Great family farm. Been around 200 years or something like that. Produce always great. Staff friendly."], "rating": [5, 5, 5], "TBscore": [0.0, 0.49, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["donut"], []]}
{"id": "kbdXFOjzccfL1TuG6I-EAw", "text": ["I stopped here last week around noon due to a sign posted on RT 4. When the owner mentioned they serve breakfast all day long, I got a bacon, egg, and...", "This place is cute and it's nice to have a locally owned option in the area for breakfast, lunch and ice cream. I stopped in for breakfast and the service...", "Family owned and operated- I always thought of this as a little ice cream shop- but the serve breakfast and lunch too!  Loved my sausage egg and cheese..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.37, 0.23], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["breakfast", "egg"], ["breakfast", "lunch"], ["breakfast", "egg", "lunch"]]}
{"id": "7NRB05fmxqUuPuH47xn3Rw", "text": ["When I stopped in here the other day for a quick snack for 6 people in my  family, I thought I was walking into your traditional Dunkin Donuts.  But I ended...", "Dunkin' donuts, where you order what you want, but you can't have it. I have worked near this Dunkin' donuts for a while and it has a reputation of being...", "This place ALWAYS messes up my order... this time the coffee didn't look right, so I asked \"this just has milk, right?\" Andre assured me it was correct, but..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["snack", "donut"], ["donut"], []]}
{"id": "NT53kIcyeXO-7vPkxnGBxA", "text": ["Worst place ever. Laziest people around trying to run this place can't even call them workers because they can't even do their jobs correctly. Shame on...", "I work for an ambulance service, as this DD is only a short detour on our way home from Albany Medical Center I have visited frequently at all hours. I do...", "Customer service low quality as both hot food and coffee items were missing product. I ordered Caramel Swirl iced coffee and only received iced coffee with..."], "rating": [1, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "ho0jD86gmlZo32Z5-RmRbQ", "text": ["Hit the drive-thru this morning after checking out of my hotel next door.  Ordered a large hot coffee with cream and sugar and a bacon wake up wrap.  Pretty...", "Have you ever dealt with government workers day in and day out? I AM a government worker, and I can barely stand myself... so I can only imagine how these...", "The line gets long in the morning, so if your in a rush I'd suggest to-go-ordering. Friendly staff and good service."], "rating": [1, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "h3rWi6aCKV2UFaf8vXCC5Q", "text": ["This ice cream place does not seem to offer much from the outside, but don't let that fool you.  Behind that simple door, and brightly colored pink walls is...", "Limited flavors, but they're a small-batch homemade ice cream joint, so this was mostly expected. The place is bright and clean, with friendly staff, and...", "I don't think I've ever had a bad experience at Dutch Udder. They have vegan options, delicious flavors, efficient staff, and a clean building! I went for..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "0Y6VDj8JAQvY1q1k4jh-nw", "text": ["One of three restaurants in a mini-food court, this Dunky is below average - has a curtailed menu, and the staff didn't seem exactly all there in terms of...", "Horrible service!! The cashier messed up the order several.times even after patiently going over order. Charged for wrong items, when got order latte was...", "So, I have been here a few times and the service is slow considering that the line is always really long. (I mean, you are on a block where there is a..."], "rating": [2, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "HsuQW0F7yP0Lni1u4cOgFA", "text": ["Cinnabon is a great place for cinnamon rolls and other sweets. The cinnamon rolls are absolutely delicious. They are huge, soft, and sweet. The frosting...", "Do you remember your first Cinnabon? I do. It was in the winter of 1991. I was visiting Philadelphia. It was cold. I was walking on Walnut Street. And we...", "I don't get what the hype is about.  They smell good but when I got the regular cinnamon bun it was still raw in the middle and the parts that were cooked..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "gT1lsoViQXPzqljos53fOA", "text": ["This is honestly the best bagel spot I've ever been to. The prices are great, the bagels are varied in flavor, and the service is fast even when it is...", "A local coffee and bagel shop which uses as many local, non-gmo ingredients as possible. They have bagel sandwiches, cake donuts from Cider Belly doughnuts,...", "I ordered the wac n bac (asked specifically for the everything bagel (no flavor) to be toasted almost burnt and it was grilled soggy and greasy from the..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], ["sandwich", "donut", "cake"], []]}
{"id": "LFCsMJLDQ9U6zC2-YMt_-g", "text": ["Always a fun place to shop. Who doesn't love tasting cheese, deciding what amazing granola creation to try and, buying natural, fresh and healthy foods :)...", "This is a great co-op but as often is the case with co-ops, you do pay a premium. \n\nTheir bulk food selection is amazing, their cheese selection is amazing....", "Love this store! They've got everything any vegan can dream of! Super friendly staff and a packed market full of goodies for every foodie. \n\nFood bar, hot..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.42], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "tjHP033WFYUueIwTOeGG3A", "text": ["Way to long to receive our drinks, 15 min in drive thru for 4 drinks. Front doors locked at 7300 on a Sunday. When posted till 11:00. Will not return to...", "Didn't take the drive through order until we yelled after waiting for 5 minutes and then didn't have whole milk for my latte. Not cool...", "This place is the worst DD I've ever been to.  I pulled in during rush hour in Albany during a snow storm and thought it was odd that there was only one car..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "SuCj9BiojQWxnwv2SxLUBQ", "text": ["This place is a Carco vendor for insurance company inspection of your car.  I recently changed insurance company from Geico to the Hartford.  Usually, this...", "Went in quickly yesterday for my CARCO insurance inspection. The girl working was friendly, and the process took all of about 10 minutes.\n\nWhile I was...", "I frequently stop at this convenient Mobil Mart on the way home. It is open pretty late, well lit, has a Dunkin Donuts drive through or walk in adjacent to..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["donut"]]}
{"id": "M3EWoh8bh10E3dCt4y_5iQ", "text": ["I should have chosen a drive thru DD. The line is out the door. It must be the cold brew coffee. SO GOOD !   Very addicting.", "Great customer service, Chris at register is very friendly, helpful, Jay does great lattes!", "I love chains. I do. And I make no apologies for it.\n\nChipotle may be my favorite.\nBut McDonald's fries are delicious.\nThe breaded wings at Hooters are a..."], "rating": [4, 5, 2], "TBscore": [0.0, 0.0, 0.67], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [[], [], ["wings"]]}
{"id": "p4OnTLKrSrkPIHrvyhL0Pg", "text": ["We searched yelp for a place that has salads and sandwiches and although their menu is posted with these things, they only serve baked goods. Frustrating...", "Excellent baked goods, breakfast sandwiches and fabulous coffee and beverages!  The chai latte was wonderful!  As long as you don't expect an extravagant...", "There isn't much of a selection.  The grilled chicken  sandwich I got was good.  However, the portion was not very generous given the price of almost $10."], "rating": [1, 5, 3], "TBscore": [0.0, 0.61, 0.0], "normalisedRating": [-0.6, 1.0, 0.2], "keywords": [["sandwich"], ["sandwich", "breakfast"], ["sandwich", "chicken"]]}
{"id": "OAxqJNb34P95Zyp1rdNGkw", "text": ["Best philli around and the soups are great too! Delivery guys have always been top notch!", "LOVE STEAKOUT! BEST WINGS IN THE CITY! My son, daughter and I eat their food several times a month and have for years. Local family business. Always hot,...", "I've been ordering from nelsons for years. I've never had a problem with my food/order and it's always good! If you've had a bad experience here you're..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["wings"], []]}
{"id": "ER0IrCZ0iwgFC9mNjBRXUw", "text": ["Located in the foodcourt of Crossgate Mall, 2nd floor, is Charley's Philly Steaks.  The service was quick on a Saturday night but then again, there were not...", "Horrible service horrible food. Cashier Mexican lady is a real stubborn mean individual. I kindly complained about the order that they messed up. They...", "Awful....bread is cheap tasting, bland and doesn't taste like any Philly Cheese Steak sandwiches I've eaten."], "rating": [3, 1, 1], "TBscore": [0.0, -0.34, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["steak"], ["mexican"], ["sandwich", "steak"]]}
{"id": "lVLYo5tfq-S3BQJ4BOUyLQ", "text": ["The best steak sandwich I've had in a long time, topped off by a great beer selection.  Unassumingly awesome spot for a relatively quick, yet delicious bite.", "This visit was only to buy beer to go with food we purchased at one of the other stands inside Galleria 7 Market.  They have an excellent selection of craft...", "As a Philly cheesesteak snob, I've often noted there are two types of cheesesteak in the world: the true Philly melted-cheese and shaved meat, and the..."], "rating": [5, 4, 4], "TBscore": [0.68, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["sandwich", "steak"], [], []]}
{"id": "2W8GlFLLHNrndxTh8UYFOw", "text": ["Got a pizza delivery to my hotel just across the street from SUNY Albany.  Took about an hour from the time I ordered and the pizza was plenty hot....", "I've never quite seen anything like it. \n\nIf a dutch baby, met a round tavern pie (like they serve at The Purple Pub, but without chopped onions in the...", "\"The Days Go Pie\" by Josh K.\n\nIf you expect some kind of mind-blowing, gourmet pizza experience at PJ's Pizza, be forewarned, you won't.\n\nBut, I suspect you..."], "rating": [4, 4, 4], "TBscore": [0.25, 0.0, 0.6], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "6PdMtDkLAg_kDYCEi6VBwA", "text": ["I stayed away from DeFazio's for years. After getting hit with an hour and a half wait time, I decided that it wasn't the place for me. The pizza may have...", "I've been to DeFazio's several times since writing my last review -- which was about having DeFazio's at the farmers' market. If you've only ever treated...", "I can't think of any other better pizza place than DeFazio's!! I always get requests from my family to take a couple of slices of DeFazio's sausage pizza..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "hGwxhrR0sFwJRbyTdCH3Xg", "text": ["We have tried the pizza and wings so we went for the dinners. Eggplant Parm and chicken parm. Piping hot on arrival with spaghetti and bread. Whoa. The...", "Walkin ordered a large pizza with extra cheese and extra pepperoni for take out they said 20 minutes. Sure enough 20 minutes it was ready and this is...", "Was looking for a new spot to grab a pie the other night, and had heard good things.  The person that answered the phone to take my order was in a great..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["chicken", "pizza", "wings"], ["pizza"], []]}
{"id": "XALx5GBpXVZEaQ1e6MoW7A", "text": ["All I can say is \"eggplant Bella!\" This is my favorite pizza in Albany. Seriously. The eggplant is perfectly cooked, the roasted red peppers are delicious...", "My complaint is not with the pizzeria or the people that work in the pizzeria. I have nothing negative to say about them. My complaint is with the delivery...", "Ah! Pizza I can fold that isn't square! This is a first for me since moving upstate and what a wonderful feeling it is!"], "rating": [4, 1, 5], "TBscore": [0.43, 0.0, 0.62], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "6RUHJva4N19HoIDAkfV3ag", "text": ["Sara Bella has been around for years but only in Colonie. Well about less then a month ago they also open a third location in Troy , this has been a great...", "Wow. When you stumble upon a gem, I'm the kind of person that wants everyone to know. I was looking for pizza places and noticed Sara Bella's was across the...", "Great pizza and boneless garlic parm wings!  Delivery was fast. Nice to have a pleasant voice when placing order :-)"], "rating": [5, 5, 5], "TBscore": [0.0, 0.21, 0.61], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["pizza"], ["pizza", "wings"]]}
{"id": "2k8O7LJUEDMBR1VE7-HDzA", "text": ["They have since moved a few store-fronts down the plaza, expanding their establishment 10-fold.  The place is clean with lots of tables and seats.  More...", "I ordered online through there website for delivery. I ordered a bbq chicken roll and got pepperoni. Rolls are quit doughy towards the front and end so it...", "This pizza was the best in town, however they messed with something good and ruined it. The dough is bready and really thick, it was more like soggy, soft..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.6, 0.4], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["chicken"], ["pizza"]]}
{"id": "fqj4oTOPAZZCoGqRW1DtNQ", "text": ["I love this place. Fresh salads and great tasting huge slices of really good pizza. I highly recommend", "We ordered a couple times from home. Eh. My salad was on the bottom of the bag with a box of chicken wings on top. The chicken wing juice leaked into my...", "My wife picked up an 8 slice pizza tonight with sausage, peppers and onions. The slices were huge and tasty ( much like myself) but to be honest I think..."], "rating": [5, 1, 3], "TBscore": [0.48, -0.23, 0.4], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["pizza"], ["chicken", "wings"], ["pizza"]]}
{"id": "X0zuVUpA-BDpTkiWynX9kg", "text": ["The pizza place expanded in late spring.  The place now has a bar and proper seating for dinner.  Pizza is still the main menu item.  However, their beans...", "Great pizza place, I usually order To go but even dining in is nice, the food is awesome!", "Best in the area. Their vanilla and pizza are through the roof! True Brooklyn pie that you can't resist."], "rating": [5, 5, 5], "TBscore": [0.0, 0.54, 0.68], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar", "dinner", "pizza"], ["pizza"], ["pizza"]]}
{"id": "MRJ_JTAE_8djxekCky_hYA", "text": ["Love it, always on time delivery. Food is always fresh and hot. Highly suggest the turkey gobler sub!", "Takeout mix-up plus OK food.  Seven orders placed at our end, six orders booked on their end.  One person left without dinner.  The food was OK but not...", "Edit: man after such a great meal the last time I thought for sure whatever I got would be on point! This time it WAS NOT! I order the gobbler and sweet..."], "rating": [5, 2, 2], "TBscore": [0.31, 0.33, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["turkey"], ["dinner"], []]}
{"id": "WdFY1pkQdqwONfvw-iHCVA", "text": ["Compelled to write my first review simply because I left the place feeling like I was robbed and had zero recourse. They charged the two of us over $100 for...", "Definitely, a local drive.  Very eclectic crowd but strangers are welcome. Cheep drinks and a pool table..... say no more.", "This is only place can find open and will make you a fresh pizza pie at 3:30am. Plus for those after night out at bars they had a wide variety of sliced to..."], "rating": [1, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [[], [], ["bar", "pizza"]]}
{"id": "DpMOK0inVRAy8lq0L1NjRA", "text": ["The slices are huge! They are stacked with toppings. There are only counter tops and one four seater high top to stay inside. They had at least fifteen...", "My core test for any new pizza place is a simple \"plain cheese pizza\".  I gave this place 3 stars but really....it should have been 2.  It was the most...", "Perhaps this location has fallen off the mark over time but they still have a good selection of to go slices and good deals when you buy two slices and a..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["pizza"], []]}
{"id": "siZiBMVJLTf66uyru8d8Xg", "text": ["Was a late night up with some friends partying.  We decided to get some pies.  Since late, after midnight, not too many options on the ordering site we use....", "My boyfriend and I order from here all the time and every once in a while they forget part of our order but tonight the driver walked away before I let him...", "Ya know, I really wanted to like this, but pizza places that have pizza sitting out, never appeal to me. \n\nOther reviews talk about bad pizza, and I agree...."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, -0.21], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], [], ["pizza"]]}
{"id": "URqP0ZY4yJ21HZ4MLGjDKw", "text": ["Prices weren't that bad, but these guys just could not handle the pre-concert crowd.  I waited for 15-20 mins on a beer, the bartender just left for like 10...", "Food was ok, decent.  The reason I'm giving two stars is because of the attitude of the bartender/GM behind the bar. My friends and I were in from out of...", "Best Italian wedding soup I've ever had!  Along with the typical small meatballs, there were small pieces of chicken and potatoes. So flavorful with a..."], "rating": [2, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, 0.6], "keywords": [[], ["bar"], ["italian", "chicken"]]}
{"id": "yE7QoiE8CstO9hmLXFW0BA", "text": ["Just got reacquainted with this long time popular Schenectady restaurant and Pizzeria, and WOW are we impressed.  It is now my husband's FAVORITE take out...", "After listening to so many friends rate Marino's pizza among the top two or three pizza establishments in the capital district, I undoubtedly had to pay...", "In my opinion Marinos has the best pizza in Schenectady. Open until midnight the $2.50 slices always hit the spot. I love walking up and seeing ole boy in..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.5, 0.5], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "qKCvtcOKlSghzUav5fdRmw", "text": ["So after a long hiatus we decided to give Romo's another chance. I am happy to say they have improved almost everything since my last review (which was a 1...", "It was ok.\n\nWent on Friday evening.\nThis is unconventionally located in a plaza that resides within some chains franchises and boutique stores and laundry...", "This pizza has ruined me.  As a self proclaimed pizza snob, i am telling toy that this is some of the best pizza that I have ever had!  The fresh ricotta..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.65], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], ["pizza"]]}
{"id": "3JdK_sP9XP41U5wSZfSPSA", "text": ["This is so cool. It's like your favorite burrito bowl counter, only Italian! You make your dinner, the way you like it, and it's ready by the time you pay....", "Great manager and customer service!!! The meatballs were where it was at!! I love the chipotle style serving of the food. The only think is that we have to...", "Let me just say I was a huge fan of Bellini's and have been there often but have to update my review based on our most recent experience. My husband went to..."], "rating": [4, 5, 1], "TBscore": [0.21, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["italian", "dinner"], [], []]}
{"id": "kq7ewO5Qb3LOAor01RV29w", "text": ["Artsy cozy best coffee n hosty!", "Great coffee shop in the Mansion neighborhood. It doubles as a gallery so be sure to spend some time checking out the art on the walls, most of which is for...", "I had heard about Bonobo's art gallery, as well as, intrigued by its unusual name (is it like the primate of Bo-NO-bo or do you say BON-oh-bo) so I was..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "SVQ-ZHLG8z3Esy0vp6A0JQ", "text": ["I basically work out of this Starbucks every week day. It's close to the house (bike ride away) and the baristas are always friendly (not just to me, but...", "Busy Starbucks but if you use the app, it's all good.  I don't wait, I order ahead, I run in and I pick up!  What could be better?  So long as they get it...", "I've never had a bad customer service experience at this Starbucks. Their coffee and dessert drinks are fine. Their lemon and cinnamon pound cakes are fresh..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], ["cake"]]}
{"id": "c8ZF35DN9tWa-OcTAfsFvg", "text": ["This Starbucks is usually dirty (tables not wiped, floors dirty with napkins, forks, food, etc.) and their bathrooms are \"frequently out of order\" for no...", "This is my usual, everyday Starbucks.  I am a pretty low-maintenance iced coffee or drip coffee kind of gal.  I usually keep away from the fancier, more...", "Came here on a Monday at 1pm to get a small lunch and a cold drink while I was in town. Barely any sandwiches or boxes left. Lots of signage for the new..."], "rating": [1, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], [], ["sandwich", "lunch"]]}
{"id": "EpUP83KGJKPmRLeJVLVLnw", "text": ["Oh I love this place. I have family in the area and to be quite honest, I despaired at never being able to find a good cup of coffee when I was visiting. So...", "Stopped into this gem on a Monday afternoon.  \nCompletely impressed!  Way to step up the espresso/coffee scene in the Capital District.  This place is...", "Cute seating area - both inside and outside. Great drinks, everything from lattes to kombucha to beer! They also have adorable ceramic merchandise that I..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "jnBhWBIRHNeJtEJ_fC-Dtg", "text": ["One star for cleanliness\n\nOne star for reasonable wait times (all things considered) :)\n\nOne star for having what I want in stock\n\nOk--I still have two...", "Seriously, got the same order wrong, twice.  Right in a row.  Apparently tea is their kryptonite.", "Super slow...otherwise the coffee is the same of course. \n\nOrdered using the mobile app and waited for eons despite just a few orders."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "LXpU_400QQuxMGPsmQNwow", "text": ["If I'm making Italian food, I'm stopping at my grocery store and getting some Perreca's bread.   The two are mutually exclusive.   You'll get a nice crunch,...", "Where do I begin?! The service was excellent, Stephanie was a jewel. The food, omg the food!!! I had the sage egg sandwich served on their wonderful bread....", "Small.  Great food.  Slow service.  Worth the wait."], "rating": [5, 5, 4], "TBscore": [0.3, 1.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["italian"], ["sandwich", "egg"], []]}
{"id": "r9MEjFJUt41aOWk9k7EDLQ", "text": ["Food: delicious and human-sized. You won't find huge bowls of food here, but everything is the perfect amount to sustain you for a couple hours or share a...", "I came here with my wife on opening day evening, and it was a zoo. Literally, the place was packed full of people and the noise level was crazy. They...", "There was a delay in B&B opening- it seems, on first impression, to have paid off. \n\nit is hard to judge based on this morning's grand opening, of course,..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "wUDsBLsG3TrwE7A4apLjnA", "text": ["This is a quaint coffee shop in the heart of Delmar. Many locals patronize the shop, even ran into a coworker. At 9:15 on a Saturday morning there were 6...", "I absolutely love this place. My first experience here I met up with a friend, while on maternity leave, to catch up. We both just had babies (one day...", "I love Perfect Blend (and so does my four year old, who calls it \"The Muffin Place\" and asks to go for a treat every day!) The coffee is so good, and the..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "oYg8-g5mD1HPJSfj5U69BQ", "text": ["Best bagel spot in the area.\n\nAlso they have kielbasa available. So put that on your bagel with some egg and you're all set!", "Not so great... Greek salad with brown lettuce parts... first attempt was with blue cheese then the feta version was barely apateizing enough to eat....", "Excellent place for breakfast sandwiches!  I recommend the sausage, egg and cheese on an everything bagel.  Their cookies/pastries are great, too - hard to..."], "rating": [5, 3, 4], "TBscore": [0.75, 0.0, 0.5], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["egg"], [], ["sandwich", "breakfast", "egg"]]}
{"id": "Zy_6Yk0h5mNItuaF_rgC9Q", "text": ["Small cafe specializing in fresh baked desserts, sandwiches, wraps, subs, salads, and seasonal soups.  The cozy and spotless dining room had many windows to...", "Let me just say- the food is great.  The breakfast sandwich and coffee deal for 5.00 is worth it! I definitely recommend getting a breakfast sandwich on the...", "I need to come again and try breakfast off the griddle because the muffin I had was a disappointment. It tasted of uncooked flour. \nI've been before and..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.39, -0.35], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["sandwich"], ["sandwich", "breakfast"], ["breakfast"]]}
{"id": "1PLDzOlxYHppF6ralhv_qA", "text": ["There is nothing really bad about this Starbucks. It is spacious and convenient, though I miss the curved windows that recalled the building's former career...", "I stop at this particular location every so often on my way into work when I don't have time to brew my own coffee at home. In the past, I can say that the...", "Great coffee made to perfection and service with a big smile. Bathrooms were also good but they could have used better (and more) toilet paper..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "7kHYVs7iV2aFkUqqpSSxSQ", "text": ["Food took over 15 minutes to get ready when there was almost nobody in the store. The people before me had put in their order and it was completely wrong...", "I want to stat by saying I love Taco Bell, but today my feelings on the Latham location abruptly changed. I came with my whole family and the kids were so...", "Why bother reviewing a ubiquitous fast food joint?  This Taco Bell happens to be very clean and the staff is always pleasant.  Two reasons it is deserving..."], "rating": [2, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "PDHFFsurWMHYsG0L67K8dg", "text": ["I was going to give a one star due to my piss poor experience here the first time, but since then it has been ever so slightly tolerable.\n\nThe prices here...", "Consistently bad service. My orders are consistently wrong, the prices are higher here than at other Taco Bells, the restaurant inside is consistently gross...", "Can Yelp! add a way to give less than one star? Or how about negative stars?? Can they owe you a star when you enter a place? Here is why: \n\nSo, it's Taco..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "0dHRuQ995qW_wpPUb0gt5A", "text": ["I this place was good until last week grant it it was during slow hour \nBut I was looking at menu at bar love their beer \nThen I look down the bar and the...", "Okay here it is ,\n\nSalt., let's start off this convo with that.\nWow\n\nIf I was a snail \n\nMy compadre Ava Rose had the prime rib cooked to perfection mid...", "Service was good.\nFood was OK, basically good bar food.\nFood took a long time to leave the kitchen."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.46], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["bar"], [], ["bar"]]}
{"id": "d-QNjhGNxZIhUAMItMilFQ", "text": ["Very quick and friendly...food is great.  Good staff tasty food.  As advertised.  Great portions.", "Not really good service because take a lot of time to delivery. The food is OK.", "Not entirely sure why they do online orders... My take out order had a pick up time of 12:15. I arrived at that time and was told they weren't able to get..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "y53UmpR0i1xZsmZt9RJtWw", "text": ["Initially came here since it was near our hotel and had their yummy buttery lobster roll!  Since moving to the Capital Region we haven't been back due to...", "OH MY GAWD!!! Best fish tacos I've EVER had. Like to be honest, I don't think I will ever eat fish tacos again because there is no way that Hooked can be...", "HANDS-DOWN THE BEST OYSTERS IN THE CAPITAL REGION \nIf you are an oyster lover like my husband and I, Hooked will not disappoint!  The oysters are always..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.8, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["tacos"], []]}
{"id": "ZB09-QNjWFRGce8daHRT4w", "text": ["A great hometown diner! We were happy to discover this place so close to us. It's very affordable- about $20 for two of us to have hearty breakfasts. The...", "I have a soft spot for luncheonettes that execute. Mancuso's delivers exactly what you want. We split the deluxe cheeseburger (comes w fries), the...", "Another great meal at Mancuso's served by a friendly and efficient staff. Sadly I had to pass on the homemade Cherry pie as i am watching my figure. Well,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["burger"], []]}
{"id": "c1chG0gg9oKNnzcvUpu2jw", "text": ["I can't believe I've just only made my way here. \nThey had my heart at the sign outside, but they had my taste buds at the first sip of my French toast cold...", "Great coffee. Friendly staff. The lovely baristas were genuinely friendly and explained the menu. \n\nMy only concern about this SEB location is its...", "Stacks is great!   Super cool and friendly chickies working in here and they'll answer any questions you have about any of their items.  Nice vibe inside..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "bZlJCey81EmQbkEbE5gSnQ", "text": ["Cafe 111 is a ____ spot for lunch. I struggle with finding the best adjective to describe it. It isn't fantastic, and it will not blow your mind, but it...", "Cafe One Eleven is open for breakfast and lunch and is very popular with office workers downtown. They have good prices and portions and an interesting...", "A good cafe, nice location for state workers or workers near the Capitol or Education Building.  Prices are good but food is okay; nothing fancy.\n\nIt's..."], "rating": [3, 4, 3], "TBscore": [0.7, 0.49, 0.0], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [["lunch"], ["breakfast", "lunch"], []]}
{"id": "7DPaOcuM1kQZwKg5-kIMpA", "text": ["Great diner with fantastic service and food! Lots of food options for different times of the day too.", "Like most diners in the area. Dark red exterior draws your attention.  Lunch menu was the normal diner menu.  Liv order the The Italian Stallion and I...", "I once again ventured to the strange and distant land across the Hudson River to partake of the dats first meal. I walked into a busy and noisy  diner and..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["italian", "lunch"], []]}
{"id": "WmMvFjO_5AQ86Rj_3a-WZQ", "text": ["Friendly staff, clean inside. Definitely a 50s like diner.   Water seemed filtered.  I got mushroom omelet with 2 eggs, eggs were good. Bacon was blah...", "Cute, clean fast diner!  Food was hot and tasty..and very friendly waitress.  So glad we stopped!", "Pros\nFast service\nGood portions\nAmbience albeit a bit noisy.\nFriendly waitstaff  greeter and cashiers.\n\nCons\nFood\nCost is in the higher end for..."], "rating": [5, 5, 3], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["egg"], [], []]}
{"id": "6CAlFE0UJZH38uHriH4_xQ", "text": ["I had two drinks on separate occasions from this place.\nOne time, I had a large Ice Coffee.\nSecond time, I had a large Pomegranate Ice Tea.\n\nBoth drinks...", "I wanted to get something small and quick before going to work so as I was driving I bumped in to this little cafe. I thought \"why not?!\".\n\nI came in and...", "They have the best sandwich in town, especially Sheridan Ave for MEATLOVERS!!! They also have best TUNA in town. Best SALAD for vegetarians. Ladies there..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.75], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], ["sandwich"]]}
{"id": "xYn2snzBjsekn02jYUk1Kw", "text": ["Great service and good.  We stopped in for a quick lunch after seeing this place on a walk.  We were glad we chose this place.\n\nWe had the Greek salad with...", "The gyros are delicious from Lamb to Chicken. Very tasty sauce/dips. I rather enjoyed the Spinach and feta puffs appetizer. We had a pleasant time eating...", "I had an hour stopover at the nearby greyhound station, where I couldn't bare eating at their gross restaurant, so I decided to walk 5 minutes to this..."], "rating": [5, 4, 5], "TBscore": [0.47, 0.37, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch"], ["chicken"], []]}
{"id": "PCbmMgnIlojY68Ztpa7-Ug", "text": ["The City Line Cafe and Deli is an amazing hidden gem in North Albany/Menands. Food is great. Great family atmosphere. Shelley the owner is kind and makes a...", "Stopped in for lunch today after driving by one day last week. Happily surprised! Very cute place, great assortment of sandwiches, homemade soups, salads,...", "Such a cute little spot that is clearly family owned and run. They have a good variety on their menus and the prices are very reasonable. Great spot to pick..."], "rating": [5, 5, 5], "TBscore": [0.53, 0.39, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["deli"], ["sandwich", "lunch"], []]}
{"id": "_jxfP99oh8QWX8B88hhRLw", "text": ["We had dinner at Field Notes on a recent fall evening. There was a chill in the air, but inside the tent it was cozy -- and we enjoyed a unique and...", "We (my husband, toddler, mother-in-law, and me) came to brunch here on Sunday. It was a nice(ish) day and really enjoyed sitting on the patio (which now is...", "Fall is my favorite of the seasons in upstate New York. Like spring, it's temperate. But unlike spring, fall is when our local farms are at their best...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner"], ["brunch"], []]}
{"id": "jJ3xO5RFPLJ2QFLIKg5H0g", "text": ["I popped into Malcolm's when I saw that they had opened up on Union. My friend is a chef there during the day, and he explained their farm to table concept....", "Stopped in for a late lunch with my mom. Although a BLT sounds simple, it really can be ruined. However- at Malcolm's it was delicious and the bacon was to...", "What a special place! I came here twice on my visit to Schenectady, for dinner and for brunch, and it was a highlight of my trip. \n\nWe couldn't decide which..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.23, 0.45], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["lunch"], ["dinner", "brunch"]]}
{"id": "jh_owKpd10vqcKnrGGuDBw", "text": ["I like Carmen's. The food they serve isn't the best, but there's a homey feel to the cuisine. Paula, who is the main server there, is really nice and...", "Not so good of a first experience at Carmen's. When we arrived, we were offered a table outside! Beautiful weather so we didn't turn it down. We waited...", "I've been meaning to come here for a while, but the hours of operation haven't worked out for me. I was very excited because being from Florida I've had a..."], "rating": [3, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "PWZPW0ZyZ5N9TghfD_hEEA", "text": ["When people think small business coffee shop, this is the model.  There aren't a lot of specialty recipes or flavors but what they do offer is an extremely...", "What a welcome addition to the central Delmar area. The coffee has always been on point, judging from their stall at the Delmar farmer's market on...", "Stopped in here early on a Wednesday morning. Love this place! We have other coffee spots in Delmar which are great for their own reasons, and Brewtus..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "CPqh4h4IPQgwx5_9sR2d9A", "text": ["Just like all of the other chains but this location was super clean and well taken care of. The ice cream was delicious, staff was friendly and everything...", "My kids love Menchies (and so do we!). You get a nice, rotating selection of frozen yogurt and a variety of toppings. There are also usually some sorbet...", "I just don't get frozen yogurt. It is just a worse version of ice cream. I went to Menchie's and tried several different flavors. The vanilla was probably..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "HTVGu386V80ZnwZ1bbzasg", "text": ["Best milk in NY. Probably best bread too. Plus they have a loyalty program on milk. Its a quick shop with all necessary things.", "A review of Stewart's Shops as a whole, not just this location.  Yes, Stewart's ice cream is pretty good, and sometimes it's just \"convenient\" to go to a...", "This Stewarts has firewood for sale!  If that's not neighborly, I don't know what is.\n\nOf course, they have the usual Stewarts stuff, too: lots of ice..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "Wpl01DTToKqJqF-9Lz38Hw", "text": ["Been going there 4 years approx. 4 weekdays per week and ask for the exact description as \"Ice Coffee with cream & sugar\" and it is different everytime the...", "Recently this McDonald's had a renovation take place and I figured, it's been sometime since my last visit maybe it got better. With a renovation and quite...", "This McDonald's does not rate even one star. Only giving one so that I can post the review.I haven't been there yet when my order hasn't been messed up...."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "nCG-SDmDVxCMRkG2K-LiEA", "text": ["This food market is super close to my favorite beer and wine stores in Albany! I also have been needing to make an Asian market food run to pick up some...", "Go late at night ( they r open til 1030pm!!) to get help if needed on selections. Great prices on Chinese vegetables and psyched to try this chicken pho mix...", "I bought 3 bags of what I thought was candy. Ended up throwing all 3 bags. Waste of $9.00.\nThe \"ginger\" candy had no ginger in it.  I read the ingrediants..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], ["chicken", "chineese"], []]}
{"id": "TJYYKD02QJANspinT8TmdQ", "text": ["Love, love, love, love.\nIce cream AND a small presentation? Yes please.\n\nInside of the Galleria 7 Market in Latham one of the shops is for Thai ice cream....", "21 Below Thai Rolling Ice Cream is one of my new favorite summer spot obsessions. My son and I came across this place as we were driving around Rt 7 looking...", "This place was tucked in a cute market with other amazing restaurants. \nThe ice cream rolls from this place is amazing! \nI absolutely love the combinations..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "oWx5p1oNdwEjum-I2CuY6w", "text": ["Wow. I was wonderfully surprised. While cooped up in Albany Med for a week, I tried my luck with this place.\nTo my delight, it was really, really good.\nThe...", "Amazing food, Great staff! Oxtails perfectly seasoned, rice nice and fluffy ! Reasonably priced", "I love the rasta pasta! The jerk chicken is delicious too! Everything was delicious from the goat, chicken and Cabbage. I only was surprised with the Mac n..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], ["pasta", "chicken"]]}
{"id": "kIExhkFh-S-1pa5t3qmF5g", "text": ["This is a darn good McDonalds.  For some reason, the Big Macs just taste better here.  The fries, crispier than usual.  Out of all the McDonalds, this is...", "Why review a McDonald's? Because the food may be mostly the same, but the customer experience varies greatly from store to store.\n\nAnd this one has...", "This place is an absolute shit hole, after waiting for 30 minutes, I get to the drive-through speaker and have to wait an additional 10 minutes before..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "qqDKguwaNACp9pGJkSY71Q", "text": ["A few months after I stepped in on a UberEATS orders, last night after I got done with my last DoorDash dropoff of the night nearby, when I researched the...", "Efficient place as compared to others. Although the driving entrance was a little confusing the first time I went. Which was at night. Drive thru seemed...", "McDenny's and McWendy's are even worse, but McDonald's is pretty bad.\n\nThis particular location is a little run-down in the inside, rarely clean, and the..."], "rating": [3, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "K8NsdEvXimjSNzPvWjuQlg", "text": ["This is a review of the hot food section only! \n\nI am very shocked but very grateful to have found a place in Albany that offers traditional hot Chinese...", "We have been going to this supermarket ever since it opened a few years ago. It has so many products, it is easy to find what we need. \n\nThe store can be...", "Lots of products do NOT have expiration date on them. I just got a black-bone chicken（乌鸡）from them, which turned out to be rot. I can understand the..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["chineese"], [], []]}
{"id": "JkjHR7StocXN8bF6BKd1Sw", "text": ["There was nothing lacking from our visit to Delaware Supply- not one thing.  We stopped for a late bite and to taste some craft beer after seeing a movie...", "It is so nice to finally have someone fill this space so completely and perfectly. \n\nThe beer selection is great. The special plates they have are great....", "Do you believe in love at first sight?\n\nDelaware Supply is pretty much everything I've been looking for in an evening hang out spot. I can sit with my..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "d8SwzWBDymz1KByNdvy5kA", "text": ["A great bar with amazing staff! I have never been disappointed visiting here. The prices are not bad at all and the service is great.\n\nThey have a nice...", "Susie's isn't really loved because of the normal reasons but. Ecause it's the last place in the immediate area that's open after your long crawl\n\nThey've...", "Bar tender seemed irritated and not welcoming. Not sure why she was behaving that way. Dry personality as well. Not someone I would want serving me on a..."], "rating": [5, 4, 2], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["bar"], [], ["bar"]]}
{"id": "30Z2f7EFFflhEt3TGg_dvA", "text": ["You know what's great?  Suspenders.  Bear with me...\n\nI and my colleagues at TNDC have spent quite a few Thursdays and Saturdays in this fine establishment....", "I stopped into The Allen Street Pub for the first time tonight and it felt like a homecoming.\n\nThere is no way of writing this review without at least...", "Last weekend I heard over Facebook that the Allen Street Pub was having a Spring Cask Tap. They were bringing in a total of eight cask conditioned ales for..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "yegqQSId92uUOLMptWedXg", "text": ["Love this place, love their drinks, their gender neutral bathrooms, free condoms, and great service. The bartenders, Michael and Rizzo, are on their game....", "Love this bar. Everyone who works here is the best. Great selection of things to drink, awesome patio. I highly recommend this bar if ever in Albany.", "DO NOT HAVE DRINKS HERE! I just paid $40 to have 3 standard beers and a cocktail... the bartender was completely inattentive, had a serious attitude and was..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.69, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["bar"], []]}
{"id": "cSeRgLnKTPBOhcjo6g0H1Q", "text": ["New, clean, great tap list! All I can say is awesome and it's a must stop. Mostly NY beers on tap. Rare and unique drafts. If you like craft, you need to...", "Awesome place!\nThey have an excellent selection of beers and a knowledgeable staff.  The food was perfect and there was a good vibe based on the mix of...", "Great craft beer retreat!! Chill ambiance and a killer 16 handle list makes this a beer devotees destination in the Capital District. The owner, Rory, seems..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Q3J2Q54xJuyZVEljkkTC8w", "text": ["Met a friend before the theater for a quick bite. Was excellent. Was much nicer than expected. \nMenu is limited but something for all tastes a desires....", "The Tavern is a restaurant within The Desmond Hotel. The restaurant is dimmed and smoke friendly. There are 3 TVs to watch sports! It is decorated with...", "Got in Sunday evening, looking to wind down and eat. Friendly staff, tv's on sporting events. Ordered calmari and a salad. Salad was good. Calmari, was a..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "SgJsVmML23tHFzXrnEDo_w", "text": ["Fuzebox is one of those places that's great to head out to if you want to dance with friends, but you really don't want to put too much thought into how you...", "The last time I was at the Fuze Box, nearly a decade ago, I left feeling a bit dirty. At the time, the club was rather scuzzy and not in a punk sort of way....", "I refuse to ever return to this place. I had a tab open like you would in any bar. When I went to close my tab out they couldn't  find my card. They had..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], ["bar"]]}
{"id": "rdixQpOqq9X0qdmFbIlxzw", "text": ["I liked this bar!  It's nothing fancy, but it's a large bar with the a/c cranking.  There's plenty of seating and pool tables and darts in the back.  There...", "Expected the drinks to be really strong after seeing the amount of vodka put in, but after tasting them, I am CONVINCED they water down their liquor. Also,...", "Great beer selection and even better prices! I have a friend with a gluten allergy who likes coming to this place for their cider.  It's pretty fun on the..."], "rating": [4, 1, 5], "TBscore": [0.32, 0.0, 0.49], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["bar"], [], ["gluten"]]}
{"id": "ByZCI_0KWtHfvGsKOa69_A", "text": ["Please change your coat check out people! (I don't know thier names I was told Kim and Soyna probably not right) I have never had such a problem trying to...", "I had so much fun seeing Rumours, a Fleetwood Mac cover band, on Saturday. I walked into Pearl St. Pub and a sign directed me upstairs to the Upper Room. On...", "I've been waiting for a club like this in Albany for a long time. Where else in Albany can you see national and regional rock and blues acts. The room is..."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "tfozLpS3H6Tm33Se6rbnMg", "text": ["Small but very nice lounge. Owner is very helpful and friendly. Definitely a go to spot if you enjoy good hookah in Albany!", "Service sucks...they only have like 6 people on a busy day. I'm lost as to why it's so bad.", "Dope spot, chill vibes and awesome music selection! (I think they use pandora sometimes, but still enjoyed the hip hop reggae pop afrobeats music). Prices..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "lPIpFKYO-LCA1bABgaQubw", "text": ["I had my son's rehearsal dinner here . Everything was perfect from food to after show service . \nThe manager was so focused to detail and made sure...", "Really great place.  It has a fun vibe and my bartender was really friendly.    She also knew a lot about the history of the area.\n\nThe beer selection is...", "I was happily surprised when I came here. A bunch of friends wanted to go, but they don't have too many things I liked eating (aka most things are fried and..."], "rating": [5, 4, 4], "TBscore": [0.75, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["dinner"], [], []]}
{"id": "CzfqowTGOa55GM41RWo6bQ", "text": ["I got scammed by the bartender and two women who have clearly done crack at least once in their life. Of course I was drunk and there were two women at the...", "One of the limited nightclubs in The Capital Region, NY that plays non-stop EDM. Friendly crowd and bartenders", "I like waterworks overall, sometimes it needs better music but my real complaint was how when I was getting carded last night the guy at the door was..."], "rating": [1, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "4vz2M0Xj18CfvWYHGwPBPQ", "text": ["Experience the best service to where we actually got up to leave and was asked to sit back down that someone will be over to take our order. We did receive...", "This comment is nothing related to the food here. I just simple dislike their unprofessional way serving customers. \n\n1. \"First come first serve\" should be...", "I agree with many of the other reviews. The food is always very delicious, and the portion sizes are generous to say the least. The ambiance is strange, and..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "3Ca3DCa99FJZ0hoRhbo3RQ", "text": ["It's like a refined Northeast Chinese, which I LUV! \nThe fish (dry; sea bass) hot pot is superb; the Shanghai vegetable (baby bok choi) perfectly cooked and...", "This is my second or third try at Fairy Sichuan.\n\nWe wanted a spirited Sunday lunch with clear flavors and direction.\n\nVoila', Fairy Sichuan.  \n\nWe started...", "A worthy addition to our constellation of Sichuan places, with some nice differences vs Shu and Northeast Chinese. The standout dish on our first visit was..."], "rating": [5, 4, 4], "TBscore": [0.34, 0.0, 0.3], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chineese"], ["lunch"], ["chineese"]]}
{"id": "49G7Apg9Ir4g48SwTxNZew", "text": ["Cheap Asian food ($10 min credit card) that seems to mostly operate on Takeout or Delivery more than sitting down. There is enough space for probably 3...", "Used to be good, now the lady in the front is rude and the food is a lot worse. I've been ordering here for years and now I'm getting chunks of bones in my...", "Great place! The food is good. Great value for what you get, especially the pu pu platter. Delivery was right on time. The driver was very appreciative of..."], "rating": [3, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "beCqfUBi3cN4GxFT2U0wMg", "text": ["We love this place! Great service, reasonable prices, quick delivery, and REALLY FLAVORFUL FOOD. Every time we order, we get the Chicken in Spicy Tea sauce,...", "Received chicken pad Thai. Sooo many onions.  I don't even think I could take one bite of just noodles (Which is the best part in my eyes). I love onions...", "Friendly staff that goes out of their way to make your experience great.  They are very accommodating with regards to adjusting your meal to your tastes..."], "rating": [5, 4, 5], "TBscore": [0.26, 0.35, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chicken"], ["chicken"], []]}
{"id": "yQ1Z8orVH_A85I06J31WNw", "text": ["First of all, I don't know how they do it but every single time that we call for delivery our food arrives within 20 minutes or less! And that's including...", "First time we ordered from here. This was the worst Chinese food I ever had. The combination platters had a choice of shrimp fried rice that was mushy and...", "I usually could count on this place for good Chinese food take out. Last night our food was at least partly awful.  Our sweet and sour chicken meat was..."], "rating": [5, 1, 2], "TBscore": [0.0, -0.25, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], ["chineese"], ["chicken", "chineese"]]}
{"id": "htEd6QxPnitm5Oy3c8wMeg", "text": ["This is the best tasting Chinese food I have found in Albany. It's so great that now that I've moved out of their delivery radius I will actually take the...", "One of three restaurants in a mini food court on Madison, this one is marked inside as \"Chinese Restaurant\". It's pretty basic, with the generic Am-Chi menu...", "Xing Long has an incredibly clean atmosphere. You will not find another Chinese food restaurant like it. The food is extremely fresh and delicious. Their..."], "rating": [5, 3, 5], "TBscore": [0.45, 0.0, 0.32], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["chineese"], ["chineese"], ["chineese"]]}
{"id": "qXm_jVXwIMjHru8lG8mDDg", "text": ["I need to update my review. In the past two years we have eaten in probably 4 times, and ordered takeout another 4 times. Their dining in experience is...", "I ordered take out from here. Beef and broccoli, general tso chicken and some egg rolls. The food was very yummy & super tasty. Egg rolls were a little...", "I have ordered takeout from here a handful of times. Each order has been great. I am a fan of the shrimp with lobster sauce, beef with broccoli, wonton..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.8], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], ["chicken", "egg", "beef"], ["beef"]]}
{"id": "3kYLS7D1LeoakqOl0tNSZg", "text": ["Ordered twice thus far.\n\nSeafood in white wine sauce was ok. Crab was really mushy and eh. I wouldn't order it again for the price. All veggies. \n\nEgg drop...", "Was so so.  I ordered on Sunday, and arrived quickly.  The Moo Shu Pork was way too salty, and the Szechuan pork was full of onions and couple pieces of...", "I ordered for Plain Fried Rice and Chicken wings and I only got sent the chicken wings. When I called back, they said I was lying and didn't order rice with..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, -0.28], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], [], ["chicken", "wings"]]}
{"id": "wGl8A1zRMm_ITYilO5r0Hg", "text": ["We really liked it! We recently picked up a to-go order of the sesame chicken and General Tso chicken dinner combos, along with some fried dumplings. We...", "I would give them three stars except they didn't fulfill our order correctly. I ordered chicken chow mien and there weren't any noodles in our dish. It was...", "So gross. Inedible food. Took one bite of the chicken and threw the rest out. My husband barely ate his meal bc it tasted old and funky. Will never go here..."], "rating": [4, 2, 1], "TBscore": [0.0, -0.6, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["dinner", "chicken"], ["chicken"], ["chicken"]]}
{"id": "SJxM87qiBwE24buCQK83Ng", "text": ["Lucky Garden is a cozy Chinese takeout place located across the street from Bob & Ron's Fish Fry. I haven't been to Lucky Garden in several years! The old...", "We order from here for lunch at work on a weekly basis. I've tried a bunch of different things and the only dishes that are any decent are the chicken and...", "This has been my go to spot for nearly 20 years! I've sinced moved out of town but every time I return to visit fam, I stop here for the Curry Chicken and..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, -0.24], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [["chineese"], ["chicken", "lunch"], ["chicken"]]}
{"id": "oTPvKUnxHGNVehfM7eGN0g", "text": ["Delicious food and very affordable! There are different varieties to choose from! Must try it", "Wow. For Americanized Chinese food, it's awful.\nFor authentic Chinese food, as we are lucky to have a few great places in the Capital District, this place...", "Despite the reviews I figured I would give it a shot. I was in the mood for some Chinese food and it was near my hotel. I was greeted at the door by your..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], ["chineese"], ["chineese"]]}
{"id": "ZRMPGRnn2jNebG6Gko0ToQ", "text": ["Classic Chinese food good and cheap\n.they have the best garlic sauce not spicy but sweet.\n\nI used to like oceans down the road but they have been burning my...", "My office ordered delivery today. \n\nThe wonton soup was a different color than anywhere I've Ebert hag it from.  It was alright... once I picked the fly out...", "I stopped by Panda Chinese Kitchen for lunch takeout recently. This storefront Chinese eatery is very casual/old school, which is an order at the counter..."], "rating": [5, 1, 3], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["chineese"], [], ["lunch", "chineese"]]}
{"id": "eJcv_Lz4wF30rOaqjlOlUA", "text": ["Lorem ipsum dolor sit amet, consectetur adipiscing elit. Vivamus condimentum nisi eget urna fringilla faucibus. Curabitur convallis leo nibh, non fermentum...", "I often order from this place I think there food is great. Tonight I order something new, I asled for the 21 shrimp figured it is easy to share. I was...", "Very disappointed. Advertising as a vegetarian Chinese Restaurant they really should be more careful.- my to go order of tofu and vegetables with vegetable..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["chineese"]]}
{"id": "4tyitMs0E1QHr9Kc-1b6vw", "text": ["After three daytime meals here, I am in love and declare I love this Chinese restaurant best of all in the region. The Szechuan dishes are beautifully...", "As previous Yelpers have identified, this is a restaurant that goes beyond Column A / Column B - General Zao's chicken, beef and broccoli, Happy Family,...", "Bless Shu!\n\nKind of what you say after somebody sneezes. \n\nBless Shu for the lunch specials ($7.25 to $8.35) including soup (wonton, onion or egg drop),..."], "rating": [5, 4, 3], "TBscore": [0.57, 0.0, 0.6], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["chineese"], ["chicken", "beef"], ["egg", "lunch"]]}
{"id": "6j4YBtYqaXppoRHjQAhrTA", "text": ["This is my go to spot for regular Chinese food. It's probably  the most decent Chinese food in Albany. I'll recommend it for when you're having a good ole...", "This is my go to place for regular, schmegular NY Chinese food. Set your expectations low for customer service and ambiance! I come when I am in the mood...", "The fried tilapia was overcooked and tasted fishy. I didn't eat it.  The pork fried rice was heavy and sticky. \n\nIt is clean with plenty of tables for..."], "rating": [3, 3, 2], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.2], "keywords": [["chineese"], ["chineese"], []]}
{"id": "GTok1WYS2OblhWyY_Cujdw", "text": ["I ALWAYS give restaurants a chance no matter the reviews as everyone has their own opinions and experience. Unfortunately I was extremely disappointed. I...", "If I could give zero stars, I would.  I ordered shrimp and vegetables and literally the whole thing was slimy and stuck together. Tried to give it to the...", "Ordered delivery from here.  They got the order wrong.  When I called they insisted that it was right (it wasn't) and refused to do anything to make it..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "oDM1ZeYjsoQjlATz20OzYg", "text": ["We walked in with six people on a Friday night and were treated to a great meal. Terrific service, good wine & dessert!!", "This was to the apartment within 15 minutes... not thinking anything about it because i was hungry ... tried to eat this food ... honestly save your money...", "This is a quiet,charming place with beautiful Asian music, very attentive waiter who brings out teapot and noodles with sauces. The General Tsao chicken was..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["chicken"]]}
{"id": "BjDKgCzESJ-LWx3seF-IYA", "text": ["I ordered Sour sweet shrimp which was not deveined and not peeled, I chocked with the shell. Worst meal ever.", "I tried once, it was horrible. The girl I worked with wanted to order. I decided to give it a second try. The worst food I ever ate. Burnt. Tasteless and...", "After shopping in the area, I was getting hungry and decided to stop in at Ming's Wok of Colonie in the Kohl's Plaza for lunch takeout. This is a typical..."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [[], [], ["lunch"]]}
{"id": "pe-0Or0yD-MrO0M8bGybcg", "text": ["Reasonably priced fast Chinese-American food! Overall flavors were satisfactory especially if you're craving greasy Chinese food. \n\nThis review is based on...", "Don't have it delivered - The kid who brought my dinner parked on the street and called to have me get it. When I showed him how to knock on the door he...", "We were stranded at the Hampton Inn in Albany by Tropical Storm Irene. It was a Sunday and everything was closed.\n\nNotwithstanding a negative review we went..."], "rating": [3, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [["chineese"], ["dinner"], []]}
{"id": "P9FtUBmw9rWvTYq6Mtu1Og", "text": ["BLUF: Mr. Hui's is a welcome addition to the food landscape in the Schenectady/Niskayuna area.\n\nIt can be tough to find authentic Chinese food in the...", "I am happy to add another quality restaurant to my rotation.   Our wait staff were pleasant and knowledgeable of the menu selections. \n\nI tend to judge many...", "New place for here.  An authentic Chinese restaurant chain based out of Lincoln NE!  Food is really good and tasty.  Quite authentic but some American..."], "rating": [5, 4, 5], "TBscore": [0.23, 0.0, 0.31], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chineese"], [], ["american", "chineese"]]}
{"id": "zTNGsXqllrmB3pHjEOgBUw", "text": ["The bubble tea is good. I especially enjoy the taro flavor. It does run sweet and has a lot of ice, however, so be aware of that.\nI really enjoy their...", "So hubby and I had dinner in Troy and all of a sudden I decided I wanted some bubble tea, so went to my trusty Yelp to see what my nearby choices were. I...", "Stumbled upon this place on a New England road trip. The place is super tiny with very limited seating. You order up front and they bring the food to you...."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["dinner"], []]}
{"id": "JP-X76plY0su31SEK10_zQ", "text": ["Out of all the Asian spots this one is my best, the sushi delicious-Monkey roll, crazy couple and Spicy California rolls are my favorite! Singapore noodle...", "When we walked in we couldn't decide whether to sit in the dimly lit restaurant or outdoors. We chose outdoors, which didn't have much of a view. \n\nService...", "This is one of our standard places for sushi- it's consistent with the food and service. I normally go for the sashimi platter but am not allowed rawfish..."], "rating": [5, 3, 4], "TBscore": [0.26, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["sushi"], [], ["sushi"]]}
{"id": "4zxHHur4dHMcJ8YbPDU7EA", "text": ["I am always happy with our dinner here, no matter what we get.  Tonight it was a variety of rolls.  Hubby often gets sashimi, and the noodles are great too....", "The Sushi is top notch!  Fresh fish.  Rice roll is perfectly packed.  The rolls are also spectacular.  The other thing I would like to note are things as...", "We're new to the area and were in desperate need of takeout one night. Enter Tomo, which was delicious, prompt, and exactly what we were looking for! We'll..."], "rating": [5, 5, 5], "TBscore": [0.8, 0.48, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner"], ["sushi"], []]}
{"id": "I9YqZ7-W3V9T07rfO50Mww", "text": ["Strolling around Troy, The Little Rice Ball is a place to stop and explore. Arriving at this cute corner restaurant, you'll be greeted by an enthusiastic...", "Don't be afraid of this place! It may not be what you're accustomed to as far as Japanese food or sushi, but it is all delicious. From the drinks to the...", "Long story short: OK, (but not raw) japanese style food, tapas style. Service seemed naive and very awkward. Bill ended up being more expensive than we..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["japanese", "sushi"], ["japanese"]]}
{"id": "t6lnaQlyc0wvX_XWcekzxQ", "text": ["I'd like to think of myself as an expert in Asian food, just from eating so much of it, so often .  I have dined at dozens of Asian restaurants,...", "Yellowtail scallion hand roll had chunks of fish that were cut leaving them chewy.\nEel avocado hand roll leaked runny eel sauce when first picked...", "I came here for the first time last week.  I was looking forward to having sushi here, as others raved about it so I wanted to see for myself. \n\nWhile..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["sushi"]]}
{"id": "-4XmiOsjZaZToJRjzajUNg", "text": ["I believe they are closed.  I went there for lunch today and they weren't open.  The place looked empty and all of the lights were off.", "Just placed our order for the first time.  Placing order was not easy. Order arrived in less than 15 minutes.  Mai fun was good.  Ordered 2 spring rolls but...", "Not the worst - not the best. Take out order was on time. Facility was clean (albeit empty on a Friday night). Prices were on par with other  take out..."], "rating": [1, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 0.2], "keywords": [["lunch"], [], []]}
{"id": "AQlW1ixTJ7PusmbsKVKVeA", "text": ["I have been eating sushi for over 30 years. This place is better than average. The service is excellent. The place is clean. The Rock shrimp is the best I...", "This is probably the worst Chinese/Japanese place I ever ate at. I ordered the sesame chicken and it was horrendous. The chicken tasted like rubber and I...", "4/5/16 Update: Seems to me that a lot of the service issues have been resolved. We came in with 7 people tonight and everything went pretty smoothly! The..."], "rating": [5, 1, 4], "TBscore": [0.54, -0.73, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["sushi"], ["chicken"], []]}
{"id": "b1M9TB5zywo6DIVO9X6kfA", "text": ["Delicious food and nice atmosphere. The woman that served us on several occassions is wonderful. Soo kind. And she even had hot chili sauce on hand..which...", "My family and I were in the area and decided to try some Korean food. It was 8:30PM and the restaurant was closing at 9PM. The restaurant is located in a...", "Been here twice. They no longer have a liquor license, so consider bringing your own beer.\nFirst time we tried the Dol Sot Bibim Bap and the Soon Tofu..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["korean"], []]}
{"id": "h2R_ywsT7Zi-hF1KopkYCQ", "text": ["Finally got to try Sunhee's Farm & Kitchen in Troy, NY. We went on Friday evening 9/14/18. We found seats at the bar and were greeted by the bartender,...", "I was less than ecstatic to have left this place feeling a 3 star rating.  \n\nWhen deciding my next yelp I looked hard for a place to eat in Troy on a...", "Who wouldn't want a hot stone bowl of kimchi jiagae on a quiet fall afternoon?  We are back to Sunhee to satisfy a craving. \n\nNow that there's K plate down..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["bar"], [], []]}
{"id": "27sejNF7jLWhCLKj3vlUNg", "text": ["I never had Korean food and no idea what to expect, food was very good and serving size more than enough. They let me sample the beef before I ordered and...", "Food - 3 stars. Simple menu making the ordering process easy.  The wings are excellent. we ordered a dz but with half soy garlic and half spicy seasoning....", "There really isn't anything not to love about K-Plate. The employees are always friendly and kind, the food is very reasonably priced and delicious, and you..."], "rating": [5, 3, 4], "TBscore": [0.47, 0.22, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["korean", "beef"], ["wings"], []]}
{"id": "BcUTLjpN3TsJy2ap5z4PoA", "text": ["I've waited for over a year to have Chef Chai's  cooking again. Today I had the Pad See Ew. The noodles had a nice Char flavor, the chicken was tender and...", "Pad prik khing was spicy enough but quite greasy, more like Chinese food.  Very nice waitress, but not the best Thai.  Another dish broccoli tofu was bland.", "Had my first experience at Pinto last night.  I've been living here for 2 years and was having trouble finding good authentic Thai dishes.  My wait is..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["chicken"], ["chineese"], []]}
{"id": "Wu9aY8Xwey7gB5iDprGN4g", "text": ["Super helpful, some Asian markets are intimidating and unwilling to help you source items, not this place! Happy to help! They have fresh grandmom made Kimchee", "We happened to be in the neighborhood and often stop by Asian food markets so we pulled in and although parking spots were few out front managed to find one...", "Recently went to this Korean Asian grocery to find ingredients to make kimchi fried rice. They have all sorts of Korean food, snacks, homemade kimchi!they..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["snack", "korean"]]}
{"id": "mW3It3WLwryP8AbPSAyc2A", "text": ["Great do it yourself bowl. The flavor just works with the coconut rice, chilli sauce, and carrots. I was disappointed the pork wasn't char broiled but it...", "Within the Galleria 7 Market there are at least 8 businesses offering you a wide variety of choices.  Today we decided to try Teas n' Tapas which might...", "I've had the chicken bowl with vermicelli twice now. I really like the flavors, the fresh vege. Ordered ahead by phone and picked it up - service was good...."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["chicken"]]}
{"id": "WnODHzZYEMtGd9K8cbH39g", "text": ["My first visit, won't be my last. \n\nThe ambiance is great in the bar area, with a stage and couches. Bar service was prompt and drinks well priced. \n\nFood...", "One of my go-tos in Troy for both food, drinks, and entertainment.\n\nI follow Troy Kitchen on IG and am always drooling over the plates of food they post for...", "What's not to say,\nCorey is dressed to the nines in a pink blazer white button up and black polka dotted pocket square.\n\nHe was fun and very generous with..."], "rating": [5, 4, 4], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], [], []]}
{"id": "-XMcwhBM_vFxMacw13R_Bg", "text": ["My Favorite Spot! If you like a relaxing atmosphere and good food... this is the place for you! If you would have told me that I could get one of the best...", "Everything we had was great! We ordered the grilled ham and Swiss sandwich, the buttermilk fried chicken sandwich, and fries. Each was delicious and served...", "Went there on our way to hike at Thatcher State Park. It's a little place tucked past the barn, so if you don't know it's there, you'll miss it. It was a..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.47, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["sandwich", "chicken"], []]}
{"id": "F-NBNe4NEAuatLXba4sqhg", "text": ["I came here with my two teenage sons.   I asked them what to rate the food.  They both gave it a 5.  Me too.   The host was nice and the food delicious....", "Vegetarian reviewer here.  Lunch buffet. Three people in the restaurant when I arrived at 1 pm.  I had a sample of all the veg dishes.  Chana masala warm...", "Confession - we have been coming here and eating Saleem's  fresh and delicious food for over 10 years, and we like him even more than we like his food, and..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.6, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["lunch"], []]}
{"id": "HA6Qp15c0y72xdLoh50A9Q", "text": ["Taste awesome indo-Chinese food, lunch buffet food r very impressive compare to other restaurant and most important very attentive service, the person in...", "I had good experience here on my recent visit. The location is convenient, service was very friendly, and the decor is pleasant. The sauce in my chicken...", "A quick dinner here. Ordered two lamb dishes (boti kabab masala and rogan toshi) with my friend. Both were excellent. Service was good."], "rating": [5, 3, 4], "TBscore": [0.55, 0.26, 0.68], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["lunch"], ["chicken"], ["dinner"]]}
{"id": "bor251DWWvirBZRsjLNRvA", "text": ["Excellent spot. \n\n1) Their malai kofta is fantastic. Plus, I got the Mulligatawny soup, which was good, although I had better Mulligatawny soup elsewhere....", "Ordered from this place for the first time the other day and was pleasantly surprised how tasty it was! I love Indian food and am always looking for a new...", "We have ordered take-out from this place twice and both times we were extremely happy with our food. They have delicious vegetarian options and offer..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["indian"], []]}
{"id": "ArfY8b3kASTcTQPd551iug", "text": ["I had them deliver.  Damn good stuff.  \n\nRight to the point:\n1. They delivered SUPER far from their location #Impressed\n2. The food was still warm...", "After receiving the message (three months after the original incident) from the restaurant saying I am confused and that the photos I posted were NOT of a...", "I've been here for their lunch buffet and I've also ordered takeout. Both experiences were good. The last time I ordered, I got the mulligatawny soup, lamb..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "2hpcdo_qB0eQAgupdUPu6A", "text": ["Grubhub and Lazeez are the best combination ever. You mean you can have a Pakistani/Indian dinner, in a great budget. When you download the grub hub app,...", "We ordered 1 plate chicken seekh kabab, baingan bharta (eggplant dish), chicken vindaloo, naans, mango lassi and chai.\nChicken seekh kabab was very tasty,...", "Stopped in to grab some lunch. Great clean buffet. Friendly staff and tasty food. Will definitely go back. The Chicken Tikka Marsala is some of the best..."], "rating": [5, 3, 4], "TBscore": [0.5, -0.4, 0.32], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["dinner"], ["chicken"], ["chicken", "lunch"]]}
{"id": "IK4bvcTFkkwQj41T_RAz_Q", "text": ["I've been driving past this place for month looking at the $8.99 lunch buffet sign, of course thinking I should go one day. Well today was that day. Small...", "I love this place. The buffet is awesome and affordable. I also enjoy their takeout. Garlic Naan", "I've been wanting to get their lunch deal for the absolute longest and with some time off work it was really the perfect time to go. I got there right at..."], "rating": [5, 4, 3], "TBscore": [-0.25, 0.0, 0.42], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["lunch"], [], ["lunch"]]}
{"id": "tsoxpZ3QTA23HtbybkVc-A", "text": ["Absolutely NOTHING wrong about this restaurant. The food, the service, the atmosphere...everything was just delightful. \nI ordered the Mixed Pakora and the...", "I really enjoyed Taj's lunch buffet when I stopped in this week. The salad was fresh and crisp especially paired with their yogurt dressing (next time I...", "After hearing about Taj of Glenmont from several friends we finally visited to see for ourselves if the food was really great. I was not impressed, neither..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], ["lunch"], []]}
{"id": "ehaOFJfRPKfjTYVSgJMvKw", "text": ["My husband, 3 year old, and I came here last week on a weeknight for dinner. While a bit further than we typically venture, it was worth it. The restaurant...", "One of my college friends was turning 30 and decided to host a small party with friends and family here at Nirvana. She lives in the Capital Region and says...", "God this place is good. I don't know how I can even convey in words how happy this food makes me. I will do my best to hit the high points:\n1. The..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["dinner"], [], []]}
{"id": "2XDmkAVAQ65yUv9GJTTTnA", "text": ["Food is very good.  The lunch buffet is top notch.  I would recommend getting there around 12:30 to allow for the buffet to get fully spun up and to allow...", "Terrific flavors for most of the dishes.  \n\nCompletely indifferent incompetent and lazy service.  All the staff has to do is take away used plates and fill...", "Food is good and very authentic - it tends to be on the hot/spicy side, so choose your spice level carefully - even mild special chicken biryani packed a..."], "rating": [4, 3, 4], "TBscore": [0.7, 0.0, 0.22], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["lunch"], [], ["chicken"]]}
{"id": "okB0F-jadyQ0ctH-A8nF2g", "text": ["Absolutely delicious. Every visit results in good food and drink. Tried multiple items on the menu and no disappointment in any of them. Staff and owner are...", "Shalimar is so good that when I discuss my reasons for wanting to move to Delmar, they are always one of them.\n\nThe food is absolutely incredible. The menu...", "Awesome selection of dishes and the naan here is superb! This food reminds me of home in the East Bay so I'm glad I have a little slice of home. The staff..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "BlNA6KvIvfTDeM6ShjjkOg", "text": ["Delicious Indian food. I ordered the chicken tikka - meat was tender and the flavors were delicious. The rice was cooked perfectly and the kheer I ordered...", "Buffet lunch today on Wednesday with two friends who liked the food more than I did.\nNeeds improvement, for example:\nNaan was undercooked and...", "Lunch buffet has good options and flavorful. This is a great place for lunch during their buffet.\n\nWaitressing and waitering is nearly non existent any time..."], "rating": [5, 3, 3], "TBscore": [0.6, 0.55, 0.53], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["chicken", "indian"], ["lunch"], ["lunch"]]}
{"id": "THPDeKwowt8XZuUcIgtzjQ", "text": ["I can't believe I've never reviewed this place. This is my favorite Indian restaurant. I've never been for dinner but I have been for their lunch buffet...", "No no no no. Please do not go here if you're looking for authentic or even half decent Indian/Pakistani food. I usually go to Karavelli but they were...", "So after a few bites from the lunch buffet it was clear the quality and flavor of the food is not as fresh or tasty as other Indian restaurants in the area...."], "rating": [5, 2, 2], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["dinner", "indian", "lunch"], [], ["indian", "lunch"]]}
{"id": "ZxsH6H7hujYlEDnAaYqh9A", "text": ["So let me start by saying, when I saw that this restaurant delivered to Wynantskill I was super excited. We do not have much in the way of variety and this...", "We've been here several times now and it's consistently tasty. Ordered the malai kofta and Lamb rogan josh. \nI am not sure why the hours on Yelp make it...", "Up here on business and my coworker absolutely had to eat lunch. He couldn't skip like we normally do, so we ended up here! I don't regret..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "3rAhX3G1TphpjrlMKmN9Vg", "text": ["I have a funny feeling that the reason the dining room is perpetually empty is because most people don't have the time to sit for a quick meal with...", "A good, decent spot to eat several blocks from Union College, away from the busy downtown area of Schenectady (yes, I also found out that it has a hard...", "This place rocks. We both ordered the two-entree, $8.99 dinner special with the meat option. Our chicken masala was delicious: creamy, mildly-spiced garam..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], [], ["dinner", "chicken"]]}
{"id": "FdQcP3TShU6uKXIUsiqwyw", "text": ["Down a sleepy side street right off the bustle of State St in Schenectady you will find Taj Mahal. While the building itself may not have the same presence...", "We picked up some take out at the Schenectady Green Market. Really tasty! They had chana, tikka masala, samosa with a variety of fillings,  mixed...", "Food is good most times but not today and the service sucks lately. I use to come all the time. At least 3 times a month at least. We had to get our own..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "sCPH5jyB8vYjA9tyaUEsGg", "text": ["I discovered Thunder Mountain Curry at the Troy Farmer's Market. I'm so glad I did.\n\nTheir food is incredibly fresh. And you can taste all of the fresh...", "Mike & Mike are very nice, friendly & patient in explaining their food, ingredients & how they make it. They know their stuff!\n\n1st: I Do Not recommend the...", "I love their food so much and the value can't be beat!  If you're at Troy Farmer's Market you've gotta get a giant plate of this incredibly flavorful food..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "_eDNXSw7pGbI6VkgsePuqA", "text": ["Ordered delivery late on a Saturday night. Everything was so delicious! I've had shalimar before but there's something to be said for a place that can...", "Craving Indian food, I quickly searched online for a lunch buffet and ended up here. I did not find the shabby dining area off-putting as other reviewers...", "Le sigh... \n\n LONG REVIEW - Skip to the last big paragraph for actual food review! \n\nI hate to give them even the 2 stars but the customer service was quite..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], ["indian", "lunch"], []]}
{"id": "lcFxWzFOET-WX4TJbHzDxQ", "text": ["This is a very very simple place with excellent food and rock bottom prices.\nDo not go here if you are looking for a fancy place or want a luxurious...", "Visiting from NYC I found this restaurant on Yelp. This is what I will refer to as a hole in the wall kind of place . The food is good but they are...", "If I could give this place 6 stars, I would. Get ready for a long review...\n\nIt may be that since I expanded my palate into Indian subcontinental cuisine at..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], ["indian"]]}
{"id": "jz-v0MN-wSyeoUiM45LD5Q", "text": ["This place is fantastic. It's a order and pickup style (rather than waited tables), but that does not diminish it in any fashion.\n\nI tried their lamb rice...", "Oh mantu, so good. I like dumplings from all cultures and this one did not disappoint! \nGot the lamb on rice plate. Big serving of rice,\nModerate to...", "Came in with a huge group of 20 people on a road trip and the service was fantastic. Food came out in a timely manner without any mix-ups, and everyone..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "VIPHCej7pUEfnakgGeOw6g", "text": ["This is the second location for Casa Real, and in my opinion ~ the best one! \n\nWhen you first walk in they have a great bar with plenty of tv's to catch a...", "Went back last night for the $3.99 margarita special - quite a few people in for that and the fajita discount. My daughter and I ordered from the a la carte...", "This is Casa Real's second location. I have to say that it's just as good as the original. Atmosphere, food, service all excellent. I hope this location..."], "rating": [5, 4, 5], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], [], []]}
{"id": "QzgR5j9EoP7O8aW3pGXZsA", "text": ["Im not usually one for mexican but I really like this place. So far Ive gone twice and was very happy with the food and service.\n\nMy most recent visit was...", "Two of us went for, what we were hoping was a quick lunch. Since we seem to go to the same places, we thought we would try something different. Good Mexican...", "This is not the orthodox Mexican restaurant you might expect. The food was creative, and delicious. The service was far above average and the melon..."], "rating": [5, 2, 5], "TBscore": [0.28, 0.21, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["mexican"], ["mexican", "lunch"], ["mexican"]]}
{"id": "pm40y5DhypTiLRek3WjakQ", "text": ["I really like the idea of Troy Kitchen - it is a good fit for Troy, and I want it to succeed. And I will say upfront that this visit is my first visit. The...", "Finally I was able to wake up early enough to come and try Magdalena's Menu! I had chicken tamale and chicken burrito, they are pretty good! I was brave...", "The Night Hawk review inspired me to make a place that Magdalena's Menu could call home.  \n\nLet me start off by saying I hail from a land that you can buy..."], "rating": [2, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "UYmY6oY6lsdKjmSdZ7UOeA", "text": ["Great food and service. Food is served quickly and hot. Prices are reasonable and portions are huge- we always take half home. We have never had a meal we...", "This has been our go to Mexican restaurant. For starters they have some of the best salsa. One of these days I'll just have the tortilla chips salsa and...", "Celebrated with my family here for cinco de mayo. The food was okay in comparison to other Mexican restaurants that I've been to. The buffet opens 3x a year..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["mexican"], ["mexican"]]}
{"id": "-WdrR-F-YDlozzskHTr4QA", "text": ["My first Chipotle experience was recently (I know....I know) and this location was great. The staff was friendly and patient with my inexperience. I have...", "I am increasingly impressed at this Chipotle location, especially for being a newer location you would think that it would have some quirks. I've never had...", "Excellent location. Have gone many times and the food is always fresh, the staff is always friendly and attentive, and they are very speedy. Some other..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "x8ItK8qOHSjT0nD_tgzteg", "text": ["One word: AMAZING!\n\nHubs and the little guy came with me to try out this new(er) Colombian place for dinner. I've heard good things from coworkers who have...", "This was my first time trying food from Moliendo's and it was also delivery because, well, snow. First things first, delivery came super fast (around 20min)...", "Moliendo café has the perfect soups for winter! I had the Fish soup, nothing like I've ever had before. So rich with flavor and goodness! The portion is..."], "rating": [4, 4, 4], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["dinner"], [], []]}
{"id": "7sD9rCi9RPrU_UQoLD4xfQ", "text": ["We received a menu in the mail and decided to give it a try. It was a good decision. We ordered a beef Taco Salad and a Mexican Sausage burrito. Both were...", "Great Food; Service was good or very good. The Portions were Large/Great.  I ordered Italian: Chicken Fanchese and Dad ordered \"Southern\": Flautas served...", "This place is fantastic!  Their variety and ability to provide quality within that variety is really unique and so great.  My food is always fresh and hot..."], "rating": [5, 4, 5], "TBscore": [0.35, 0.3, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["mexican", "beef"], ["italian", "chicken"], []]}
{"id": "FNyqPsVmpQLM-GjCssgavw", "text": ["We don't have a Moe's in Boston, and I used to love it when I lived in Syracuse. I figured it'd be worth a side trip on the way home to see family. Website...", "I couldn't have been more disappointed in Moe's Southwest Grill. We went to the location in Colonie Center today and it reminded me of being at a sleazy...", "They ran out of change and didn't inform me it was credit ONLY until it was time to pay and I only had cash. Terrible service."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "e7Lkn1HZ7vcYs_Ns7NMHYA", "text": ["This is the best brueggars location in colonie! \nThe food is always fresh and the customer service is very good. Unlike many food retail places like this...", "I love Bruegger's but this place is filthy.  Clean the filthy windows!  The whole place is tattered.  They are always short staffed and always out of...", "One employee on a Saturday morning on the line. Nothing is stocked. People walk out on this place. Trash. New ownership of Bruegger's is showing their colors."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "P2W3xAtIaYq7ChzmJl5_fQ", "text": ["I ate here twice while in Albany. Large portions of Italian food, reasonable prices, and decent ambience. The Sunday Gravy was a load; every possible  kind...", "Okay food, great waitress, truly horrible manager. Was here for a business dinner with a party of 8 and we were told that while they could not split our...", "TERRIBLE, JUST TERRIBLE.....\nThe only reason this place could be in Business at all must be because the Folks in Albany don't know the difference....."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["italian"], ["dinner"], []]}
{"id": "zsoAEhc_V0fYCYpGvEYPFQ", "text": ["Hot damn that was the best eggplant parm I've ever had.  Don't sleep on this spot, on point service, good prices and most important top notch quality.  Good...", "Pellegrino's is a great place to grab a sub. The bread is firm and crisp. The meats are fresh and tasty. The subs are huge and a six inch can fill you up...", "This is my go-to deli in the upstate region. After moving up here a few years ago from just north of NYC, I struggled finding an authentic Italian deli that..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["italian", "deli"]]}
{"id": "0PYSg18rIsI2n_O-JXepHA", "text": ["Food was excellent. Penne alla vodka, served with a salad. Dressing was extremely acidic but I loved it. Price was $16 which was reasonable. The rest of the...", "I was really disappointed with my meal here. A friend and I got caprese and calamari appetizers to share. The calamari was pretty standard but their pesto...", "Located in Downtown Albany, doesn't look too impressive on the outside but the inside kind of gives you an upscale restaurant feel. The service was great -..."], "rating": [3, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "mpLS4CQXymYAfqDO3OeQuQ", "text": ["very nice place for semi formal dining, Very nice facility , good food, friendly staff. Easy to locate, Good for large groups.", "Came by the Italian American Community Center today to hang by the pool w/ my mom & sis and it was pretty chill ... Several people hanging out with...", "I come here semi-regularly for work meetings (weekdays). My experiences here have been with catered lunches during said meetings. \n\nThe food has always been..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], ["italian", "american"], []]}
{"id": "25a40h6BkxkRZbNv4nYXuQ", "text": ["Best Italian food in Bethlehem\nA little pricey but the food is worth it!\nDon't miss out on the mozzarella bread appetizer or the delicious gnocchi. The...", "The beer list is straight out of 1992. Not a single craft beer. It's all mass-market American beers such as Bud​ and Coors. The only non-watery beer they...", "Saturday: noontime: Bellini's: I needed a chicken parm hit, oh, and maybe a couple of glasses of wine.  Yes, I love the luxury of daytime drinking, don't..."], "rating": [5, 2, 4], "TBscore": [0.44, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["italian"], ["american"], ["chicken"]]}
{"id": "yeGl3dLD-7od_1DZmCFtnA", "text": ["Really great! The house salad is so delicious ! The warm bread and oil was amazing! Service was great.", "Our Christmas party was hosted here this past week, so it gave me the opportunity to try a place out I probably wouldn't have stopped in to on my own. I...", "We've dined here twice - first with a group of 7 including a child and we had a great meal. The waitress did mess up my drink order and then charged us for..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "_AxxGJ6HVkcAGO5OKlTTjw", "text": ["I have been to this restaurant over and over again since they opened 10 years ago.  The sauce is amazing.  The best sauce ever.  Always had great service....", "This was not the Italian lunch I was looking for. \n\nLook, I didn't grow up around Italian-American red sauce restaurants, but I do have an appreciation for...", "Dined here Saturday night. I have to agree with a previous reviewer, the food here is good but you pay more than what you get. I ordered the Pesce alla..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], ["italian", "lunch"], []]}
{"id": "Eb8QaXmVVsWdODJ-1AXuhw", "text": ["I've been going to Ferrari's for 40 years and the one thing they have above all others - consistently good food! I've never had a meal in all the years that...", "Lunch! Go for lunch.\n\nThis is typically my advice for these classic old-school temples to Italian-American cuisine. The sauce is still the sauce. The pasta...", "This is our second visit to this mom and pop shop on the tip of Congress Street in Schenectady.     It's an older establishment with pictures of..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["pasta", "lunch"], []]}
{"id": "eQPeiG1oOb3gbKgputeCew", "text": ["Always delicious and great service.  Canalis has a gracious owner and staff are kind. Food is always delicious - we can always count on consistency with...", "Canali's is the best Italian restaurant around.My husband and I eat out quiet often,I can honestly say this restaurant has the most delicious veal and...", "Went here last Wednesday for dinner with my parents.  We arrived at 5:30, early for our 6pm reservations.  The restaurant was standing room only.  To be..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.52, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["italian"], ["dinner"]]}
{"id": "ckfelzFYLnzPF5_G7DtB3w", "text": ["This is a great Italian restaurant.   I came here with family for dinner and we had great time.\n\nI ordered the scallops, which were quite tasty.  Someone...", "Located on residential Foster Avenue near Union College in Schenectady, this restaurant has a loyal local following dating back to 1962.  John Riccitello,...", "John Riccitello's restaurant is an Italian gem located on Foster Avenue, a residential street off of Van Vranken Avenue in Schenectady. \n\nThe same family..."], "rating": [5, 4, 5], "TBscore": [0.53, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["italian", "dinner"], [], ["italian"]]}
{"id": "7iyFxEpxxSOAfuhXSfWbYw", "text": ["Stopped at my favorite chain for lunch today and was not disappointed.  Chicken parm was very good and wife enjoyed her steak. Always good to find...", "This place tries to write itself off as authentic Italian food, but it's really just a cheap knockoff, barely one step above Olive Garden.  \nEverything...", "My husband and I were there Haloween night,even though we got there late our server Erica was sweet ,attentive and gracious. My husband and I both had..."], "rating": [4, 3, 5], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["steak", "chicken", "lunch"], ["italian"], []]}
{"id": "OV3MdfxlUaXKOQqwhumyMA", "text": ["I don't often hand out 5 star reviews, but this place is excellent. Never had a bad meal here and I have had many. The Italian dishes are excellent..... I...", "Be warned, the prices listed on the website are VERY inaccurate. App sized macaroni and cheese is actually $16, not $10 as listed on the site! Entrees are...", "The food is great. Not what this review is about though. \n\nThe online service and management are HORRIBLE. I have ordered from here countless times...."], "rating": [5, 2, 1], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["italian"], [], []]}
{"id": "pNNB4QSFaVD0-Gm3EMtH6w", "text": ["Wonderful dinner out.  Began with a delightful glass of rose'.  My niece and I decided to split a salad and a pizza.  Since they have daily specials we...", "This has been me and the wife's favorite place for a long time. Before that my parents used to frequent there. Every time there is a special occasion we go...", "Came here for dinner after my brother's graduation from Union College. Very nice ambiance and attentive servers. Everyone enjoyed their meals. Center..."], "rating": [5, 3, 5], "TBscore": [0.65, 0.0, 0.4], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["dinner", "pizza"], [], ["dinner"]]}
{"id": "kp9C1f1NpeC89T_r-zbS1Q", "text": ["Hubby got cheesecake to go for my b day. Nothing said \"I love you\" more aptly than cheese cake. He did so, times 6!\n\nSix pieces of heavenly...", "I'd like to give it five stars.  I really would.  Just like I would like to give Franklin Barbecue, the famous joint in Austin, TX, that runs out of food...", "OH. YEAH. No one makes better cheesecake anywhere in the Capital Region, maybe anywhere in NY. And NY is the cheesecake capital of the world. So, let's see..."], "rating": [5, 3, 5], "TBscore": [0.58, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["cake"], [], []]}
{"id": "xc4r7OU2sVrHaRe0wphDhw", "text": ["I contacted Kate's Kakes via email hoping to get a custom cake for my sister's birthday. After talking back and forth for about four days I was ready to...", "I ordered a Belgian chocolate birthday cake with raspberry cream filling.  At first I was a bit disapointed in the appearance bc to me it looked simple but...", "We asked Kate to make our wedding cake. We gave her a recipe to use because we wanted it done very specifically. Kate made three different versions, all..."], "rating": [1, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.2], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "a3T3O3hS2N1YrWcahz8BwA", "text": ["UGH! Why do I keep forgetting to stop here on the way to work??? \n\nSo, it's been some time since my last visit, and since I was in a good mood after having...", "A few weeks ago I was craving a cinnamon bun and that same, exact week All Over Albany had a post featuring cinnamon buns at Fifth Tier Baking Studio. How...", "I finally had a nice day to walk down to this small quant little bakery, a few blocks from my office.  The lady working was very friendly and helpful...."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "BznweCu67JEc_6U1WVKUOA", "text": ["After seeing all the great reviews I was excited to order a grooms cake from here for my sisters wedding. I showed one of the workers a photo of exactly...", "We first heard about this bakery from a friend who hired Joan's shop for her baby shower. I saw pictures and I called and the lady on the phone was very...", "Amazing!  Not only are the cakes amazing, she can do anything (including a 3 dimensional, life-sized yoda!) but the cake itself is delicious.  HIGHLY RECOMMEND!"], "rating": [1, 5, 5], "TBscore": [0.48, 0.0, 0.54], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [["cake"], [], ["cake"]]}
{"id": "WdB0rTUh0eBOcqROdsIldg", "text": ["I have purchased several cakes, many cupcakes and cookies from Cake Street and have never been disappointed. The cakes can be as simple or as elaborate as...", "I called Cake Street Sweets based solely on their Yelp reviews. All of my go-to bakeries were closing for the 4th of July week, leaving me crumbles for my...", "By far the best place to get a specialty cake! Not only beautiful but taste is amazing!!  Staff was so helpful in designing a flavor combination."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.58], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "RBkMs0fxtmsURNdCwyHV4w", "text": ["Loved it! It was delicious, with many options, and lots of great topping choices. The person behind the register was friendly and helpful, and the place was...", "This is your standard 16 Handles.  The employees were very attentive (maybe even too attentive) offering samples of the various flavors.  The place was...", "Yes it's good. How can it not be? Lots of topping choices! I especially like crushed Oreo cookies and crushed butterfinger candy bar. I had the Tahitian..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "sfuZ6LeWCSvP2vqLO4yNiw", "text": ["I was thrilled with the service and delicious cupcakes that I ordered recently for my son's Birthday! Thank you to Sandyes!", "I just happened to hear of this place today as I was asking where I can get a quick meal, as I had a dr appointment shortly. My mom and I decided to give it...", "Very disappointed with the outcome of the cake , specifics were given and was  I told that it could be adjust and when i picked up the cake it Wasnt exactly..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, -0.36], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], ["cake"]]}
{"id": "krqcsL-PVY6m5yh1iqOHyw", "text": ["+++\n- Pulled pork is everything they say it is\n- bring this food to your next function and you will definitely be VIP\n\n++\n- The sauces are on point\n- Mac n...", "It was ok but I don't think that I will be back. Meat was ok tasting but not the best I've ever had. Cornbread muffins were raw and I had to cook them more...", "2.5 stars. The workers are very nice so I'm sad to give a somewhat negative review. We tried the ribs, brisket tips, mac and cheese, seasoned fries,..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "-PI06xN5_mRKsVW39tbSvg", "text": ["Super tasty! Big Dave uses a real barrel smoker which you can see when you arrive. HIs meats are deliciously, smokey and super tender. I really like the...", "BBQ is BBQ , never the less there are some great places in the capital district, Daves got the right start.\n\nI order the Daves platter and a 1/4 chicken...", "Very tasty BBQ and a super nice dude. Our son loves going to \"Big Dave's\". Love the laid back, nothing fancy, just good ol food vibe."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "B5LDYOi743glQBj3tBJGAg", "text": ["So for a first time visit to this establishment, I would have to say that it was actually a decent overall experience. \n\nUpon our initial entrance we were...", "I used to go to Smokey bones frequently when I lived in the area a few years ago. Since moving, I visit every 6 months with family and each experience has...", "Perhaps the largest pile of stale, flavorless, half cold nachos I've ever had... And with an ice tea it came to WHAT??? $17.50!?!? #NeverAgain"], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "D8j4MWKX9yoCD_Bhzf2-bg", "text": ["I come here once a week and remember why I come back every time. \n\nIt is not just a grilled cheese. These sandwiches are reminiscent of what you got as a...", "Fast friendly service and the sandwiches are tasty!   The tots are also delish. I saw another review where they the sandwiches were really greasy but I...", "This place is upsetting. You end up paying near 15$ for the lunch of a third grader. Its literally just grilled cheese everyone. Nothing special and..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["sandwich"], ["sandwich"], ["lunch"]]}
{"id": "t-GP-S1koCRrfDOMAeVA6g", "text": ["We were there today!! The food is amazing!! Simply delicious... as a vegan I experienced flavors that were just wonderful...  We were served quickly...", "I visited this restaurant twice this week and got the smoke house quesadilla.  It was amazing, the bomb sauce is very tasty! \nThe chips and cheese sauce...", "Melted cheese on a heated flour tortilla is always going to taste good, even with the fairly average quality cheese used here. \n\nBut if you don't eat meat..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "kgAI8-LevDQS0mRqNrarAw", "text": ["The reason this review is a day late is because I was in a doughnut coma yesterday when I got home after this amazing yelp elite event. I loved all the...", "What time is it? It's donut time! Obviously Cider Belly got together with friends from Rare Form Brewery, Albany Distilling Co, Barkeater Coffee + The...", "How many things can you do with a cider donut? That was the theme of this night's OYEE. Cider Belly starts out by making over 300 varieties, every one with..."], "rating": [5, 5, 5], "TBscore": [0.23, 0.0, 0.5], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "liyzA50PUCjO4hHcKoEOVg", "text": ["The fried chicken and biscuits here are really, really good. We came in not long after opening, so all the hot foods were freshly made. The chicken was...", "It's called Luke's Pizza but when we visited we were greeted by an extraordinary display of different fried chicken dishes. We ordered an 8 piece chicken...", "Just know that their '10 piece munchers: jalapeno poppers' is actually 6 piece. Fried chicken is a cheap franchised brand called \"Krispy Krunchy Fried..."], "rating": [4, 3, 1], "TBscore": [0.0, -0.22, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["chicken"], ["chicken", "pizza"], ["chicken"]]}
{"id": "MSVg_pA3I0t2Z-kTm1k8AQ", "text": ["This place has the best, repeat, THE BEST Thai food anywhere from here to NYC.  They are incredibly hospitable, sweet, personable and the spices are food...", "Thai is probably one of my favorite foods. This was my second visit and I am not really blown away. The service was not the best. They rushed us out both...", "I have been to various Thai restaurants in the Capital District (Sri Siam in Rensselaer, Sushi Aroydee in Queensbury, former Blue Spice in Delmar, former..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["sushi"]]}
{"id": "muJnDitugFx6y64QVgllig", "text": ["Usually my boyfriend and I come here for an easy bite because I love literally 4 minutes from it, I've timed it. Sometimes they have a LivingSocial deal or...", "Okinawa is a below average Chinese and Japanese restaurant. Inside it's dirty and the decor looks like something from the 80s. I ordered sesame chicken and...", "Nice fresh sushi/sashimi and other Japanese and Chinese entrees for they members of the family who prefer cooked dishes.  I always start with Miso soup,..."], "rating": [4, 2, 4], "TBscore": [0.0, -0.27, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], ["japanese", "chicken", "chineese"], ["japanese", "chineese"]]}
{"id": "OpOZH_lGPGOT_s1eeMqeNA", "text": ["I had not been here for several years, but I am pleased to have become reacquainted at lunch today.  The dining room is colonial, rustic, and charming....", "My husband and I celebrated our anniversary and took our seven month old son (the first time we took him out to eat with us), so it was a big night. We made...", "So disappointed. I met friends for lunch. I ordered the special soup of the day (carrot ginger) and the salad special (spinach, nuts and sliced apple). What..."], "rating": [4, 4, 2], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["lunch"], [], ["lunch"]]}
{"id": "1Ip9LD92OaNFbzbyTj22Ow", "text": ["Just love everything about Smith's.\nThe minute you get through the door, the history and warmth surround you. Classic, old-style tile floors and deep, dark...", "Worth at least one visit - if to support Cohoes.\n\nWalking through the front doors on a Saturday evening, we were greeted by sorry looking bar with no...", "We came to Smiths with a groupon and arrived at around an hour after they opened on a Sunday. (Their hours are a bit strange on the weekend)\nWe walked in..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["bar"], []]}
{"id": "DoApf8WzhYHSqLPdrHnbxA", "text": ["solid 4 stars!\n\nso, the ocean is being depleted. its running out of seafood because Dukes is giving you WAY TO MUCH in their orders.\n\nok, this isnt a real...", "Dukes is disgusting! I've been to Duke's a handful of times since they opened, and it is the most disgusting tasting steakhouse I've ever been too! Food is...", "In spite of their high prices, my boyfriend wanted us to eat here. When we got there, it was a little late and not many customers. I was somewhat worried..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], []]}
