{"id": "kdB3pGq_HU6W3TCuEDHW8A", "text": ["It's oftentimes a miss rather than a hit.i have ordered multiple times and they have served me so many sub par sandwiches from either a stale bread,  burnt...", "Mean old people. Ate there 3 times. First time food was decent. Second time the owner husband gave me the wrong #9 sandwich. I ate it anyway, didn't like...", "Sammy's is a family owned place that feels like a Jewish family reunion, which is great.  However there should be seating.  Maybe there is a second floor..."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [["sandwich"], ["sandwich"], []]}
{"id": "IBKMFPrwuRGjhZrjkCxgDA", "text": ["Originally from Philly. Stopped in and had the Italian sub(hoagie). It was excellent was not disappointed. I look forward to trying the cheesesteak sometime...", "I was very repulsed that no one here wears gloves while preparing food. I love supporting small business but can't support this one unless they change this...", "The food is generally good, service I've never had an issue with until today, the regular manager or owner wasn't there, a bunch of teenage boys working..."], "rating": [5, 2, 2], "TBscore": [0.44, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["italian"], [], []]}
{"id": "Njk1pIBLr_5yjyjr-aDbcA", "text": ["Always great burgers and fries. Added bonus, at least today, is an all woman crew. What a treat!", "I love coming here the staff is amazing  great food great response  time with the order I love the new look they did to the place looks a lot better but...", "Super friendly staff. Clean, Clean and CLEAN even the ladies' restroom. Generous with toppings and frys.\nI have never eaten a bad or just okay burger at..."], "rating": [5, 5, 5], "TBscore": [0.21, 0.0, 0.23], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["burger"], [], ["burger"]]}
{"id": "lKeW6Q9dXhTwk5oVe1YKFQ", "text": ["I went looking for a hole-in-the-wall sammich shop and found it. Very nice young women working there, excellent philly cheese steak. Yelp! says (said?) they...", "Pulled into Port Annapolis while delivering a yacht from Florida to Rock Hall last night. Happy to see the Wet Dog Cafe open at 0730 so I can get an early...", "The Wet Dog Café is a hidden gem tucked away in the main building of Port Annapolis. I've been in a handful of times and my experience only gets better each..."], "rating": [4, 5, 5], "TBscore": [0.63, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["steak"], [], []]}
{"id": "GUFUbs5m8US80MDfYdBRRA", "text": ["Best. Experience. Ever!!! We've never really had an awesome experience at any of the local Buffalo Wild Wings so we prepared for the worst. We were totally...", "If I could give this place zero stars I would. My husband and I came here when they first opened and sat at the high tops in the bar area. We recognize our...", "slow as shhhhhhhhhiiiiiiiittytt!  food took foreverrrrrrrrrrr.  chili is already cook but took about 30min.  SMDH\n\nOF COURSE IT WAS COLD.  MANAGER SITTING..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["wings"], ["bar"], []]}
{"id": "3CnsEOOHg90MMTTHwMGFKA", "text": ["I was walking through the Harbor and needed a quick bite.  I was attracted by the sign outside saying fried chicken and fresh fries!  \n\nI ordered a 2 piece...", "I would only recommend the sweet tea. The fries and crab cake could use some work. I'm confident the business will take feedback well and understand what to...", "We love our trips to Annapolis Harbour.  Last year, I had a nice Crab Cake Sandwich.  And, with friendly service.\n\nTonight, the two guys working the counter..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.28, 0.37], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["chicken"], ["cake"], ["sandwich", "cake"]]}
{"id": "cgRG8S03SoQsaQiHKGWzFQ", "text": ["In and out! The drive through line was LONG, but there are good systems in place, if you can go inside. \n\nStaff came through the line and took orders and...", "One of the nicest Chick-fil-A's  ever. Super nice staff. Restaurant is clean. Service is fast. Friendly staff. Always on point. Plenty of room to sit and I...", "This used to be the one fast food place in ANP that didn't mess up orders and got you in and out quickly.  Maybe it is under new management or they've hired..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "yo_qMOE3W1Gj7pdafwBNfA", "text": ["I love RoFo (what the cool kids call Royal Farms). They have the BEST snack options. Also, and this might surprise you, their chicken is killer. I'd drive...", "Bottom Line:  A small Royal Farms convenience store with ample parking but no gas pumps.\n\nThis Royal Farms isn't as big as most locations and doesn't have...", "This is the second time this store has ripped me off! I ordered the family chicken meal with family fries and 6 rolls. They stuffed the rolls on top of the..."], "rating": [5, 3, 1], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["chicken", "snack"], [], ["chicken"]]}
{"id": "6Jm8ghkOvDaRIrfkOXUc8Q", "text": ["I was here in early November while visiting Annapolis for packet pick up for my Across the Bay 10K race. We googled seafood market and settled on this...", "Annapolis Seafood Market is an exercise in conflict. The seafood, both shellfish and fin fish is darn good if a little expensive. The service is spotty -...", "People who live around here don't know how lucky they are to have this place.  This place is absolutely amazing.  You walk in and just see a bunch of fresh..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "xJoinkCO1RL484NvZa8FGw", "text": ["The location is really convenient, and it's a fine place to buy non-perishable items. \n\nBut if you buy any food, you have to carefully check all the dates....", "Oh, well, how do I say this, because I live around here, but I have to write it:\n\nI brought back the following:\n\nFish\nChicken\nEggs\n\nThis was over a two year...", "Great selection of food. Glad to see organic available in almost every aisle. Convenient location. Better prices than Whole Foods. Excellent customer..."], "rating": [2, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "UTtm_EW2XVF_Xvjlj7xJXA", "text": ["I was craving some wings from Safeway & the lady didn't give a crap & gave me these wings - I asked for 8 she acted like she was closing & didn't want to be...", "I have been shopping in the Safeway since 1974 and it has been in a down hill spiral all these years.  Yes they did a total remodel years ago, but the...", "I stopped in Safeway early this morning to get some flowers for a coworker. The flowers are fresh and beautiful and so reasonably priced. Jamie who manages..."], "rating": [2, 2, 5], "TBscore": [-0.8, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, 1.0], "keywords": [["wings"], [], []]}
{"id": "s6iNZvTQVOXA7zjZPjfSdA", "text": ["Great Subway location.  I had visited another local one several times, and found the staff there to be terse and dour.  This one, in the Festival Center,...", "i came here earlier with my buds from my broke sucky job at Annapolis high school I was not impressed with the service . Rude people", "I appreciate the value and convenience of this store.  It's an easy 5-minute drive from my house, and the subs we got were really good for an affordable..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "Rolj8KGyaEz8oOHjzlKX5g", "text": ["Average subway. Everything tastes sort of bland and processed. Veggies are ok but don't taste or look fresh. The customer service is mediocre. Usually the...", "Worst Subway I have ever been to. Entered the shop 15 minutes before closing, there were no other customers. The teen on the counter was visibly upset about...", "It's subway, so the bar is already set pretty low. It would take something extraordinary to even consider five stars.  Subway seems healthy compared to a..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [[], [], ["bar"]]}
{"id": "gS7O_WnAQu3h1Jtbu8n0YA", "text": ["When a touch screen menu asks the following:\n\nWhat extras would you like with your toasted everything bagel?\n\na)Cream Cheese\nb) Lettuce\nc) Tomato\nd)...", "This is probably my favorite Eastern Shore gas station/pit stop. If I'm travelling near the Bay Bridge, it's guaranteed that I will stop here.\n\nI'm really...", "I am not a Wawa fan in general, but this has GOT to be the WORST one ever. Always packed and they have two bathroom stalls which results in a huge line...."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "kdh713XaFvExFi6FXOPSJw", "text": ["Simply Prima and its spectacular chef-owner Sylvia are amazing! I've been ordering her jams (do NOT miss the pineapple-nectarine!!), spiced nuts, granola,...", "Sylvia was amazing! She delivered her bruschetta and Arroz con Pollo... delish! You get your money's worth too. The trays were huge! We had leftovers but...", "We LOVE Simply Prima!!  Thank you for all of your delicious GF delights!  The granola is to die for, the meals are amazing, and the cookies....I am in..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "g4EARzcyXnfcy2Sdf7Q1-A", "text": ["Went to Panera one night after going to the Navy Temple game. \n\nI ordered the u pick 2- broccoli cheddar soup and green goddess cobb salad. \n\nAs usual, it...", "Absolutely awful service! I arrived at 9:30am on a Thursday. They were out of most of the bagels. I settled for a cinnamon crunch bagel. I asked for it...", "Nice to find a great location very close to my regular hotel in Annapolis. Restaurant is very well maintained and l love the layout that allows for more..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "wYN86eDmdMK4sGkWkK5-aw", "text": ["This was an good experience my daughter want to go here for her birthday... it's a great atmosphere for families and adds bonding time preparing your food...", "Great place to go with friends! They often have specials and event nights, especially on Mondays. You typically get a salad, cheese course, meat/veggie...", "I'm  just a novice fondue junkie. Once upon a time I had a kit at home, but burned the chocolate one too many times so, nowadayds, I'm more than happy to..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "Pol2ghUsrp1AsZZGuk27SQ", "text": ["It's the only one that makes sense after coming home from the beach. Not sure what happened to the one in Easton???\n\nSonic is sonic. If you have a large...", "Stopped in with my husband looking for a junky little treat after a disappointing afternoon. We ordered a chili dog, large mozzarella sticks and a large...", "Horrible service I stopped by moments ago on a small break from work to order breakfast and I was the only person in line I ordered a breakfast burrito and..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, -0.42], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], [], ["breakfast"]]}
{"id": "EVf674YnUxDn7cDnR3c45A", "text": ["I love ice cream and I usually love coldstone but not this time. The girls behind the counter were rude and annoyed that I even came in to buy the ice...", "Visited the Edgewater location as I do once a week; as I was the only customer there was complete silence the clerk Ryan was standing there behind the...", "Poor customer service. Just selling a product and not caring about your experience or satisfaction with the product. Never again!!!"], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "Z57pP15SFM6N0q1Fe5DU3w", "text": ["Small inside and rather crowded with people on computers - \n\nImpressive - They made me an outstanding Latte \nand carrot muffin - better than Starbucks. \n\nAs...", "Love this little coffee shop.  I went yesterday and had a mediocre experience and had some time this morning and wanted to try again.  So I will give you my...", "It was my first time there this morning. I got a latte with almond milk. I asked how many shots of espresso small cup comes with, and the barista said 1,..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "0eBCbHnC5i5z2xCoMX991w", "text": ["This location has a strong following.  They do a nice job and recognize regulars.  Friendly fast service.  Great experience and I come here often.", "It's Dunkin' donuts. The coffee is pretty good as are the donuts. \n\nHowever, the garbage cans are overflowing and the tables are dirty. They aren't so busy...", "​Awful experience at ​this DD again!  The Cape St Claire location in Annapolis MD has provided me the worst customer care twice now!  This morning I wanted..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], ["donut"], []]}
{"id": "-aEmIZ42MnjXkBMVMTBlGA", "text": ["They don't toast the bagels enough and they don't put enough cream cheese, it barely covers it.  Maybe it was just my experience.  Wish the veggie cream...", "First and last visit to this Einstein. The staff was rude and barely spoke... no hello... thank you or have a nice day. My order was to go. It was not even...", "I ordered a toasted salt bagel with lox spread and onions.  It came w barely a smear of cream cheese and hardly any onions.  Even if the amount of each was..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "XxByHMJexvz3JMMOc13MVg", "text": ["New Englanders know a few things:  how to survive in cold weather, sports and donuts (the original DD is still alive and well in Quincy MA).  We give...", "Bottom Line:  A newish and very nice DD location with a bright interior and drive through.\n\nMy SO had to go to the MVA around the corner so I volunteered to...", "This is possibly the worst 17$ I have ever spent on food. It took me 25 minutes to get through the drive-thru. And when I got up there I could not..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["donut"], [], []]}
{"id": "6nBvNR2bNIvSFoqUvpqhFA", "text": ["I know this is just a Dunkin' Donuts, but even with that in mind, 2 stars is about the best I can give them. The only reason for the 2nd star is one of the...", "Since I'm at this Dunkin Donuts at least once a week, I guess I should bless this place with a review. You're not going to find anything spectacular here...", "SLOWEST dunkin donuts I have ever visited. Only 2 people working on a Friday morning, what gives? Management, get it together"], "rating": [2, 3, 1], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, -0.6], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "A95kSaK2HNiq2Fa_osswGA", "text": ["I eat lunch at sams they have specials on subs and stuff vary reasonable price vary good food i would and have recommended them to other people", "This store reminds me of the old Mom and Pop stores of days gone by. The owner is charming and so sweet to our daughter. We have frequented this convenience...", "I'm not sure how this was labeled a supermarket as it is a small independently owned convenient store.  The previous yelper is correct though, for a small..."], "rating": [4, 5, 4], "TBscore": [0.26, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["lunch"], [], []]}
{"id": "_V0DWAf9IaGL5c1CRAamWQ", "text": ["A family owned restaurant and man do they know how to cook.  A donut shop by day and hole In the wall Thai restaurant at night.  Consistently amazing Thai...", "Hands down, the best donuts I have ever had!  Friend brought them into work to share and never had a Boston Creme donut that just melts in your mouth....", "Hole in the wall but great Thai...and donuts if you get there soon enough! We always carry out. Great panang curry!"], "rating": [5, 5, 5], "TBscore": [0.6, 0.42, 0.6], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "ySwvA4sgy5ds9mVxEqFO9Q", "text": ["No big changes since my review five years ago. Wow! I do find myself shopping at Shoppers more frequently. I like the aisles that are wider than at most of...", "Shoppers has great prices. What really keeps me going back is the international food selection. They have Asian, Indian, Caribbean, and many more exotic...", "The seafood department customer service is horrible. A month ago I went in and was ignored for five minutes. Standing there trying to make eye contact and..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.31, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], ["indian"], []]}
{"id": "8xjVAcUg0xXa3q8nRN-lbQ", "text": ["La Prima and Catering by Seasons are the same company if I am not mistaken.  They did a fantastic job at my recent party.  The website is easy to navigate...", "Favorite caterer so far, as far as tastings go. And they grow their foods locally. Chef comes out and talks to you and most importantly the food. The food...", "We used La Prima College Park, MD for a Saturday event and they were extremely easy to work with. We made a last minute change without issue. The delivery..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "soYBvOLikTrd9iddBgmzDw", "text": ["Pizza was stuck on the top of box and box was smashed when delivered. Really disappointed...", "Funny story. I saw there was an extra large two topping pizza special online. My sister's kids are finicky with toppings and wanted cheese so I tried to...", "Delivery of cold pizza with a handful of cheese in an hour and 5 minutes.  The money you saved on cheese cost you a customer, Papa John's."], "rating": [1, 1, 1], "TBscore": [0.0, 0.21, -0.6], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "WGF8-k6GYOHj2mc0NZl77A", "text": ["I don't order papa johns for the pizza, I order for the sauce. When you pay near 3 bucks for a cup, you expect them to show up. When they don't and it takes...", "One of my go-to delivery places. Pizza quality is on par with every other Papa Johns I've ever had. \nThe real selling point on this location is how quick...", "Terrible service. Awful. Rude staff. Slow delivery. The franchise should be revoked from corporate."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [["pizza"], ["pizza"], []]}
{"id": "C5w_zVTQqVKBbsQCor1xCg", "text": ["The place is spotless which means a lot to me, seeing how other people keep their restaurants. This is a tiny place in a hole-in-the-wall shopping strip,...", "Folks, ignore the reviews before 2016.  Sarah and her mom took over and the food is tastier and service friendlier.  We've ordered delivery and ate in the...", "Tried to call for 20 minutes straight and just got a busy signal.  Going down the road to eat.  This seems to happen near the cutoff time for delivery???"], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "FfJMZibk-PXvdgBYFW4m0g", "text": ["We cannot thank, nor recommend Josh and the entire CapMac team enough! The entire process was seamless, and it was such a joy working with them to help make...", "I had the Classic Mac, and much to my dismay, it was disappointing. The menu says that it is 60 day aged white cheddar with Cheez Its. I guess it is in lieu...", "Taste like butt. Sauce is disgusting. Meat is meh. Lady sweet talked me and gave me poison pasta"], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, -0.33], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], ["pasta"]]}
{"id": "j7arHEu-IsOaB-oRQVtsoQ", "text": ["Ordered from postmates. They packed the food pretty bad, I guess plastic bags are really running roughshod on their budget so they mashed 9 containers into...", "So sad. We've been coming to Fat Pete's since the very day it opened. Have eaten here perhaps three dozen times. The food is some of the best BBQ anywhere....", "My co workers ordered food on door dash. 8 wings dry rub, pulled pork sandwich, and baked beans. The wing I tasted was flavorless and it wasn't done. It was..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], [], ["wings", "sandwich"]]}
{"id": "D-RWa2Ans-ZhaFR3FbPUhg", "text": ["One of my favorite American restaurant chains. The food is delish and the prices on their menu are not expensive given what they serve. The drink selection...", "Ordered the scratch soda (grapefruit) and the Spicy Fried Chicken & Jefferson Donut and it comes with Mac & Cheese and green beans. \n\nThe grapefruit scratch...", "I had a reservation at founding farmers this morning and I've been looking forward to it for several weeks! I had been to the DC location several times,..."], "rating": [5, 4, 1], "TBscore": [0.25, -0.4, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["american"], ["chicken", "donut"], []]}
{"id": "zQ4VOHh3Jv1Q5jNvkvJh6Q", "text": ["Came for Thanksgiving and had a good experience overall. The food was really good. She Crab soup was nicely spiced with plenty of crab meat, Cajun shrimp...", "Went here for thanksgiving meal. I got the shrimp grits for my app and that was amazing. All the meat had good flavor. \nMy friend got the crab soup. The...", "VEGETARIAN/VEGAN REVIEW: So...is Georgia Brown's vegetarian friendly? Yes! Is Georgia Brown's vegan friendly? Not at all... unless you just want salad. I'm..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "UToNAlfVve0b50dUs2uOWQ", "text": ["When I first moved to DC, The Park was one of the few places I would go to party. The club scene was mature and sophisticated enough where you knew a fight...", "Park at 14th... Oh how you were one of my favorite places to be while in D.C. during Howard's homecoming. So much my favorite that we came twice! Came on a...", "I would've loved to give this place a 5-star, but since we were only given a hour table reservation, when it should have been 2 - I'll have to settle with a..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "G2zcMcoko2OBNh9-eVnpTg", "text": ["I had pretty low expectations for Teddy & The Bully Bar, as a result of their sister restaurant, Lincoln, leaving a pretty bad taste in my mouth... and by a...", "People's expectations for Teddy & The Bully Bar seem to be all over the place depending on what you come in for.  I was very happy with our Sunday evening...", "This was not a good experience. Teddy & The Bully Bar is a pretty restaurant/bar with a cool decor concept. The cocktail menu is interesting. Our table..."], "rating": [4, 4, 2], "TBscore": [0.0, 1.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "u-amlodaLALeHRlmc4x6nA", "text": ["Once again great service and great food but this time sitting down stairs it was too loud. I noticed that the people sitting next us along the divider that...", "I was in Washington on a business trip.  I meet my friend, Shannon, for dinner. The restaurant was in Old Town Alexandria. The area was absolutely...", "CUSTOMER SERVICE: I thought the service was great! Very accommodating to answering our questions with patience and knowledge.\n\nFOOD: We ordered Appetizer:..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["dinner"], []]}
{"id": "TT5Af_Renrrw0VKWpT0VWg", "text": ["Cute restaurant. Clean bathrooms, friendly service. Vintage burger and pulled pork sandwich were delicious. The fries were good as well. The mac and cheese...", "We found the Vintage on our drive to Morgantown WV.  I really wanted to love this place because it is so cute.  Tastefully decorated and several different...", "Such a wonderful and cute/casual fancy restaurant in New Market. The building has so much character and the decor is very warm, welcoming, and goes well..."], "rating": [4, 3, 4], "TBscore": [0.59, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["sandwich", "burger"], [], []]}
{"id": "NaGx_QMxnGQLutBxfHgneg", "text": ["I celebrated my 50th birthday at Ruth's Chris. The welcoming birthday table splashed with birthday confetti and accompanied by a birthday card signed by...", "I can't say enough about this place. When our rooftop wedding ceremony was rained out at another location, they were quick to accommodate us by allowing us...", "Went to pick up Yams for Thanksgiving dinner. The food came out wrapped neatly. With the topping in 2 different containers. The directions on how to warm..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.3], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["dinner"]]}
{"id": "sZs_Ns4w8LX4pVlYZFr_9Q", "text": ["2nd time at this location. To die for!!! It was hot, good, and hit all of the spots. The cashier (a guy) was also very welcoming! Will be returning!", "Went through the drive through. Took a little while but thats ok because it was busy. I was loving the country ham and egg biscuit and potato rounds when I...", "This is the worst experience ever. The gentleman st the drive thru window taking orders has no customer service skills. He rushed me to order my phone and..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["egg"], []]}
{"id": "u4J0llPPQDXNuRq2mNX6LQ", "text": ["I came for dinner on a Saturday night with a coworker. We were immediately seated in their back section, which felt like someone's cozy living room. \n\nWe...", "They do everything too well it's almost a problem.\n\nI am currently a happy drunk bloated man sitting on the couch of this wonderful restaurant. The...", "Really, really good!  Perfect place for a date night, as the setting feels a bit more intimate with dim lighting and a lot of high table, two-seat options...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner"], [], []]}
{"id": "YDEwy0AVXPEksttWE2CgYg", "text": ["We ordered Warm Crab & Artichoke Dip, Thai Lettuce Wrap, and Crispy Shrimp Pasta.  \n\nThe Dip is creamy with real crab meat!!  It's so good.  Then, Thai...", "3.5 stars is my rating.  Used to love Cheesecake Factory back in the day when they first started expanding and opened in MD 20+ years ago. The restaurants...", "The Cheesecake Factory has been on a steady decline since I start to come when I was in high school (that's over 7 ish years ago). Personally I don't like..."], "rating": [4, 3, 3], "TBscore": [0.54, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["pasta"], [], []]}
{"id": "j7Nq6IY3bZLYQSKKg4SlDA", "text": ["French fries are seasoned just right to a golden crisp. Tomato and onions on my hotdog were juicy. Brioche bun for the hot dog is a delicious extra. They...", "Access to this location can be a bit tricky, as you have to enter the lot from a side road off of Fairfax Blvd.  This Freddy's location is always spotlessly...", "Freddy's is a super nostalgic place for me. It's on Fairfax boulevard, just 5-10 mins from GMU, and they're open pretty late. I take just one bite of that..."], "rating": [4, 4, 4], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["hotdog"], [], []]}
{"id": "9uuDSvj9b7ntCq0ETuizzg", "text": ["Service and Attentiveness - on point!\nFood - on point!\nAmbience - very comfortable!\nWill certainly be back. Thanks Bistrot Du Coin!", "Looking for French food in the DuPont Circle area of Washington DC? \n\nBistrot Du Coin should be on your list. I came here with a group of seven and we had a...", "In town on business and staying in the neighborhood.  Had BFF meet me for dinner and we decided on Bistrot du Coin.   It was a Monday evening and the place..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["dinner"]]}
{"id": "E_eUG2Jb7gp6ulp2XGPm3w", "text": ["Bottom Line:  Fancy olive oils and balsamic vinegars that you can sample before buying.\n\nMany moons ago I went wine tasting, chocolate tasting and oil and...", "You should absolutely experience this sensory delight. They let you taste the olive oil and balsamic vinegar to appreciate what you're purchasing. The...", "Chic little store on the Main Street in downtown Annapolis that specializes in high quality olive oil and vinegar. Some unique flavors and suggested..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "px1QNfZ9PEQ4XONLcgvxRQ", "text": ["Their pizza is delicious!  I ordered delivery, and they were earlier than the estimate. The gentleman delivering my order was friendly and professional.", "Had pizza from here once and it was undercooked and all sauce\n\nAlso their delivery drivers race up and down the road, inconsiderate towards others,...", "Delivery to hotel fast and courteous but no dressing with salad (didn't forget croûtons though!) and no paper plates, pepper or Parmesan. Called back but..."], "rating": [5, 1, 1], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["pizza"], ["pizza"], []]}
{"id": "4zWzfiuHfNWNvXwwIpxOGQ", "text": ["Looks like this place was converted from an old garage bay, and I love the industrial feel of the place coupled with the big windows giving a ton of natural...", "A little spot that can be impossible to find unless you walked in from the nearby neighborhood. These people are serious about their coffee. The atmosphere...", "While I have had decent coffee from here before, today it was awful.  We couldn't finish the cappuccino or coffee.  The bagels had very little cream cheese..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "yU4vBXEWvgiUpTKAJv71Qg", "text": ["So, I called up Gluten Free Bakery Girl with a last minute request. Like super last minute - a cake for 50 people.. WITH an image printed on the cake, done...", "No options for soft cookies. Unresolved issue with purchase of \"crispy\" (hard) cookies.\n\nFollow-Up 1: Owner leaves a voicemail saying she doesn't understand...", "MUST get the lemon bar. Better than any even non gluten-free lemon bar I've had. To die for. \n\nFudge brownie is also incredible. And the buckeye brownie...."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.7], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["gluten", "cake"], [], ["bar"]]}
{"id": "oTZUpBChBut9-4pVULObQw", "text": ["DO NOT COME ON THE WEEKENDS. \nTHEY NEED TO TRAIN THEIR STAFF!!!!\n\nYour Frappuccino shouldn't look like this after 2 minutes ! Especially when you asked for...", "The service in this Starbucks is continually and horribly slow, and the employees absolutely don't seem to care. I am done with this Starbucks. I will not...", "Usually the staff is very nice they have to figure out a better way to rework the drive-thru-  it's a complete disaster in the morning. Coffee is always hot..."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "BIrd6NudQi3FbWGVSzizcg", "text": ["I have been to this Starbucks a million times and love it! It's my first choice of coffee shops in the area. The workers are always very friendly. The shop...", "I am a FREQUENT customer and the one star is for the service I just received.  I literally just pulled off and I cannot believe the poor customer service I...", "I was at this location this past Friday when they advertised the free reuseable cups. A friend and I went in probably around 5:30-6pm and when we asked..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "q7dpRuzh8clVy1w70QbOKw", "text": ["This place is the best!  Just a small little deli with lots of choices and 3 or 4 specials everyday.  If you work around here it is worth the walk for sure....", "..well shit! Not expected of a hidden little deli. \n1:This place is CLEAN! \n2:Their food is great!\n3:These staff was very nice.\nOrdered a Ruben and got an...", "Cheap, quick and delicious. I used to work next door and people kept bringing in these yummy looking lunch meals and told me it was from the deli in the..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.24, 0.43], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["deli"], ["deli"], ["deli", "lunch"]]}
{"id": "Ok0bP4LQ64UTquefWUyDWg", "text": ["The product is unassailable, super high quality ingredients prepared with skill and care that deliver fantastic fresh juice and healthy snacks/food. My only...", "Love how they've gotten more great food options here. Today I got their classic bircher vegan oats (very filling), pumpkin chia pudding, and the no. 2 green...", "Rutabaga is a delicious homey Juicery in West Annapolis. Minutes to Annapolis & the bay bridge and easy access to Rt 50. Their açaí bowl is perfect not too..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "viOTPZfxxpyrBhjEZfwStA", "text": ["I've passed this place several times, but I've never went in....man have I been missing out! I ordered the Acai Energizer smoothie and it was sooo good!  It...", "If you love healthy fresh vegetables and fruits... this is your place! Their wheatgrass shots are bomb and you can taste the freshness. \n\nConveniently...", "Never knew this was here. Or i saw it and didn't know what it was..... \n\nAnyway i found it on Yelp!  I went in looking for a green juice. I am always leery..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "mglXqCoH0luN3dfM_759_w", "text": ["This place takes a cup of iced tea to whole a different world. I got a \"virgin mojito\" , which is green tea with fresh mint leaves, lime, and I chose lychee...", "Do you know bubble tea is? Come on and try it, you just like it. At Kokee Tea some bubbles are free but some are not. It is a fun drink anything but...", "My new go-to place for bubble tea! It's super yummy and the flavor is on point! It had enough bubbles and they're not stingy with their flavor. Yay! I'm so..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "g8gRMsePFxJvNFoE6bXlnA", "text": ["I don't live in Annapolis but wanted to send gifts in town.  She made 2 different baskets that were unique, fun and wonderful AND delivered them! The gift...", "I had a very unfortunate experience here. Its partly my fault, I admit. I read such great things on Yelp that I came here to buy a couple bottles of wine...", "Great selection and great service. They do some sampling and allow for growler purchase and fill ups.\n\nDefinitely will be back to fill up our growler!"], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "hMLh4382wsh2Gk9JgKRG_g", "text": ["Oh dear do I love Menchie's. If Menchie's was a person, I would be verging on stalkerish. I cannot get enough of Menchie's. When Menchie's opened, it was...", "Bottom Line:  A good variety of yogurt and toppings with great windows for people watching. \n\nI used to be slightly turned off by the cartoon feel of...", "My favorite frozen yogurt spot to date! It's always very clean and cool in here since they have the A/C blasting which makes it a great place to run from..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "y8q9JYAOd584SvbwA7ap9A", "text": ["The new Bacon Smokehouse burger is the best fast food burger I have ever had. The fresh beef is so much better and it's a perfect combination of flavors....", "Worst time here . . .\nso, I pull up with $19.00 ,which I had counted multiple times, and ordered a quarter-pounder with cheese, 2 hash browns, and a 10...", "Wow they are so lucky there isn't a 1 star button cause that's exactly what they deserve. Cmon Annapolis your way better then this. First of all I walk in..."], "rating": [5, 2, 1], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["beef", "burger"], [], []]}
{"id": "8sOh_mNSVDdG3lU50TvkpA", "text": ["This place rocks!!! I found it while perusing the general store after a lunch with friends. Uncle Bob's is located in the general store in Annapolis on...", "The two stars are for ten years ago when my cousin worked here and this place was off the chain. This weekend I had a terrible experience and I want to tell...", "So we walked in here yesterday after a great lunch at Iron Down the road. I always enjoy watching when they make fresh fudge. As I walked along the counter..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.34], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["lunch"], [], ["lunch"]]}
{"id": "-V3vMLjnOn7HLktz4y9hFQ", "text": ["I was here recently for a Munzee event. I love the self-serve concept and the multitude of yogurt flavors and toppings that you can choose and mix any way...", "What a fantastic store! Great management and friendly employees! They are quick to great the customers and offer them sample cups, and always have a wide...", "The manager is very childish. He took money that the employee earned and put it in his pocket. Do not tip unless you know the money is going straight to the..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "MuZFrKL24o_2ga64tV2AfA", "text": ["This morning I went through the drive thru for breakfast and coffee.\nOrdered a bacon, egg and cheese bagel, medium coffee sugar and cream. Got to Ritchie...", "How long does it take to get the ice cream machine fixed?  \n\nAlso, more friendly customer service training.  These McDonalds employees got up on the wrong...", "The staff here is friendly and professional. Unfortunately when you go into the store instead of the drive thru you are served very slowly. They give all..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [["breakfast", "egg"], [], []]}
{"id": "cf4a2LsXulaJcEjzgxTmzw", "text": ["Do you like hambegrs?\nDo you like firs?\nDo you like toys?\nIf you ansered yes of one of these quwstious you can go to...McDonalds!\n\nMcDonalds is a good plase...", "Ordered very basic food; sausage, 2 strips of bacon, and a plain oatmeal. They could only manage to get the sausage right. Bacon was beyond over cooked...", "This McDonalds awful food, Service, Dirty environment, rude, cant get it together, night time manager making out with employee in plain site. Orders messed..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "5-7LFJW41FydkFW6whCm8w", "text": ["Plenty to like about The Brass Tap. Food is solid. Kind of basic bar food, executed pretty well. I have had several menu items over the course of 4 visits...", "We stopped here because we could get a table quickly on a Saturday night and we were hungry. It would s a beer place but they have a bar food type menu....", "We came, we could not hear a thing. Terrible acoustics, not well designed. we left."], "rating": [4, 2, 3], "TBscore": [0.0, 0.33, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["bar"], ["bar"], []]}
{"id": "0N_8e83n_1vkZevmtrTJxg", "text": ["Great pub atmosphere with delicious cider on tap and a friendly waiter to round it out! This is the perfect cozy place to sit around the bar, swap stories,...", "If you're coming for food, don't even bother! Sounds like a decent place for drinks, but our mistake was coming here for lunch. Slow service, our food came...", "The grilled chicken sandwich tasted subpar at best: the Chicken was tasteless, the sandwich came with a plain supermarket bun, and the toppings were very..."], "rating": [5, 2, 2], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["bar"], ["lunch"], ["chicken", "sandwich"]]}
{"id": "ksTl-KkKcJ8Q7h9NGj-wqw", "text": ["We attended a concert here last night for the first time.  It is a nice, smaller venue, and very accessible in terms of traffic and parking, unlike most DC...", "Recently visited the bar and  restaurant and some how I found myself back there. Just so happens there was a live band so I took in the show with friends....", "I'll start with the positives, because this venue has hope if they can make some changes. It's small, so if you're seeing an act you love it will be..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], ["bar"], []]}
{"id": "-VfTBkdQWsud2x0cW0_NRg", "text": ["I have started coming here recently and have grown to really like the place. It does have a bit of a disorganized appearance inside, but the back room is...", "Hidden secret in Annapolis. Traditionally in Annapolis it was a pipe town and this shop keeps that tradition alive. They also have a great supply of cigars...", "We visited this shop on the DC Cigar Tweetup.\n\nAt first I was really turned off with this place.  A big sign at the front reads \"If you didn't buy it here,..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "1gUpLGWR6qwcU8D5WSP1aA", "text": ["Bottom Line:  A lovely street fair in downtown Annapolis featuring quality arts and crafts.\n\nAs the name implies, First Sunday Arts Festival takes place on...", "First timer here! It was a great variety of artists and music. Great food options as well. The vendors were friendly and were enjoyable to speak with. We...", "The element of surprise can often be enjoyable. Happened upon this street festival which is held the 1st Sunday of each month from April-October with a..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Me376TGuoxORUM56QFab9A", "text": ["This review covers three different dining/delivery experiences. The first two had me concerned. The food was not what I had experienced in the past so I...", "Honestly. This place is trash. Save yourself the money and LONG wait time for either delivery or carryout and go up the street to China Garden in Bay Dale...", "This could be one of the worst options for Chinese food around. This was once the best and the \"chain\" was consistently above par ... the last time we..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], ["chineese"]]}
{"id": "Z8D9b8K3PxZzEkXPMG-z_Q", "text": ["Had a great meal here on a visit to Edgewater. Had the soft shell crab and the mahi mahi special with my wife.  It was absofrickin delicious! I would...", "Actual address is 827 CENTRAL AVE E. Owners have addressed it with Yelp to no avail. Amazing place. Owners were super attentive and caring. Place was very...", "Food was just okay... the lady at the front tried to push her political views on me. I will not be going back."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "7tP2JjylVfubdNG2FugeaA", "text": ["This is the best chinese food I've had since moving to AA County 1 year ago. We got general tsos, sweet and sour chicken,  chicken lo mein, won ton soup and...", "This place made everything fresh. It came out hot and delicious and not like it's been sitting in a warmer for hours. The employees are really friendly and...", "Wow, this place is great!\nMy girlfriend and I are definitely coming back every weekend.\nWe are vegan, so we eat tofu, but they crisp it perfectly and cover..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["chicken", "chineese"], [], []]}
{"id": "dckMin4OQV5Cu9KAFUtIYw", "text": ["The food is good and the staff are friendly. This is your typical Chinese Food Carryout, so don't go into it thinking you're getting PF Changs carryout. The...", "This is my go to lunch spot  Boneless spare rib lunch special   great prices always friendly soup or soda included", "This hole in the wall place has the best \"american\" Chinese food I have had in AA county.\nCoating on all of there fried chicken is perfect. Ask for spicy if..."], "rating": [4, 4, 5], "TBscore": [0.23, 0.51, 0.28], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["chineese"], ["lunch"], ["american", "chineese", "chicken"]]}
{"id": "LwMM369I3pzhN2DKZmt-Lg", "text": ["Best Chinese food in the Annapolis Area. We moved away from Arnold years ago, and still go back for their pork spring rolls and they're all white meat...", "The more we go here the more we realize that this is the best Chinese in the Annapolis area.", "I got the orange chicken lunch special. I was pleased to see that the lunch specials are available on Saturday too. It came with a choice of soup and fried..."], "rating": [5, 5, 4], "TBscore": [0.25, 0.5, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chineese"], ["chineese"], ["chicken", "lunch"]]}
{"id": "iihwbsKCMrMg7c6mf2FlQw", "text": ["We have been ordering from this place for over 10 years n never took time to write a review, it's good, hot, fast and of course salty like all Chinese food.", "This place used to be so much better. The Chan Family used to own this restaurant years back, and it was really good then. The father was an excellent chef,...", "Don't ever eat here. I am Asian girl who work here couple years ago. Very nasty kitchen never wash their vegetable before cook."], "rating": [4, 1, 1], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chineese"], [], []]}
{"id": "m6Vu0icvX20JqH_mvNbPeQ", "text": ["This is the REAL deal. I was amazed how good a place ,tucked out of the way in a shopping center ,is. I had the drunken noodles at it truly was the best I...", "Food was so good I forgot to take a picture! Service was great. Food was great. I enjoyed the Tom yum soup and my mom ordered the Tom yum with noodles....", "An unexpected find in Edgewater, this Thai venue welcomes with plenty of parking and readily available Saturday afternoon seating. An extensive menu offers..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "1i7J-ChCAtY-71H9fDDKgg", "text": ["We really enjoyed our visit. I love good asian food (which can be hard to find in Maryland) and this place is legit! The restaurant is decently sized, with...", "One of my favorite places to get jajangmyun in Maryland. \n\nThe ladies that work there are very very nice and always make you feel at home.  They remind me...", "This is located in Glen Burnie, close to where I am..\nThe service and food here is on top notch.\n\nTry their black bean noodles it's one of my favorite!\nwill..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "5zAgEF2nxNUAdZQDrqbtlQ", "text": ["My go to order when here is as follows:\n#1 noodles with pork and black bean sauce\n#11 fried rice with beef\n#30 or 31 depending on what wings I want, comes...", "Some of the best Korean fried chicken I've ever tried! The garlic fried chicken is seasoned to perfection and the skin is crunchy but the meat inside is...", "My go-to \"Koreanized\" Chinese restaurant. I became a regular after my relocation to DC a few years ago. Black been noodle is my soul food and they are..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["wings"], ["chicken", "korean"], ["chineese"]]}
{"id": "0IPQX-16PMDMIjzKkmqW7Q", "text": ["I am so grateful for my friend taking us to this place. I probably would have never came here on my own. \n\nI am a frequent eater of Asian food. I usually...", "In all honesty, this review teetered between two and three stars. I couldn't decide which one, but opted for two stars because everything was just...", "Really dont get how this place had a 4 star rating.\nThe whole place smells like something is rotting and the place is so outdated.\nSo yelp and google says..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "k-R6wcHPH5dw2lihEf8-ZA", "text": ["The place was so nice and there was so many delicious choices on the menu. It took us such a long time to order! We would like to sincerely thank them for...", "We had a terrible experience at this restaurant.  If I were you, I would stay away from this so-called Korean restaurant. The food is disgusting: I've tried...", "Worst Korean food in Maryland. Don't get fooled by the good reviews, they give out free food to reviewers.\nCustomer service sucks, service is super slow and..."], "rating": [5, 1, 1], "TBscore": [0.0, -1.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["korean"], ["korean"]]}
{"id": "DdfPBhmtojGr65Yr4Zen1A", "text": ["Came here hungry and ready to eat good. Host welcomed us and said to wait a moment. As soon as we were seated their was like 5 small dishes of kimchi,...", "We came in at 11 and was told that last call was at 11:30. We thought they meant drinks but we realized soon that they meant food even though they were...", "First, they are definitely a Korean bbq place ... but not owned by Korean, & so you won't have the traditional Korean appetizer options you would normally..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], ["korean"]]}
{"id": "wywdThfcwgMcuWe0EgyD8A", "text": ["Myong Dong is my go to Korean restaurant on days when I'm dining alone. The food is good enough to share, but this is one of the few places near me that...", "I've passed by this area so many times and I've never even noticed this quaint establishment! I had a little bit of trouble finding the restaurant but it's...", "This place has lost some consistency as the cooks and waitstaff seem to vary every time I eat here, as does the color and flavor of their signature..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["korean"], [], []]}
{"id": "nt02si3s-NbfKENpzbi7HQ", "text": ["This is one of the most authentic and delicious Korean barbecue experiences one could ever hope for. The juicy and tender meat and home made sauces make you...", "Unacceptable poor+slow service+expensive. I highly not recommend coming to this restaurant.", "This used to be my go-to Korean restaurant in the area. I think the owner changed, which caused the change in menu- much more limited options and not very..."], "rating": [5, 2, 2], "TBscore": [0.67, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["korean"], [], ["korean"]]}
{"id": "sDaOdNHv7C1fFledPKH6Jw", "text": ["What a great find while visiting the area! My favorite types of food at a great price.\n\nEnded up getting the Meatball Pho and adding some round, broth was...", "Stopped in for a weekday dinner and were pleasantly surprised. This place doesn't look like much from the outside and there isn't much for parking.\n\nThe...", "This was my second time here. The first time my husband and I stumbled across this lovely place. We went off of the reviews and got the kimchi fries and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["dinner"], []]}
{"id": "6qPfnpx7BftAEHtHKk03Dg", "text": ["So let me start by saying I am very particular about my cheesesteaks. I've been here 6 times in the past 8 days and gotten a cheesesteak every time. That...", "The #7 \"Ojingo Bokum\" (spicy stir fried squid served with vegetables and rice) now if calamari is the appetizer this is the entree to its successor. \nWorth...", "I've driven past this place a thousand times and never thought to stop until a friend wanted to come for lunch. I'm so glad we did! I ordered the bibimbap..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "eWR9HirYN7jMKSX7CdRpFQ", "text": ["Yelp fam!\n\nI'm back with another review of a dope local fry shop that has it all from wings to sandwiches to specialty fries.\n\nOne of my good...", "I always get the honey old bay wings because they are the perfect combo of sweet and spicy. The hawaiian fries were also good and they give a GENEROUS...", "I got plan fries no seasoning and they were deliciousssss-- I added just a little salt and dipped them in the sauce I got with my honey obay wings and ranch..."], "rating": [5, 4, 4], "TBscore": [0.23, 0.54, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["wings", "sandwich"], ["wings"], ["wings"]]}
{"id": "hsw9LvsrjfOWuIk11N6HHg", "text": ["If you want crispy, sweet, and highly addictive wings you should definitely check this place out! The wings are perfectly cooked, a little crispy with the...", "We came for the wings! We got the wings. They were awesome.\n\nThis location is a bit smaller than the Hyattsville location but it still served its purpose....", "If you are looking to eat a moist pork belly bun with authentic Korean sauces, don't eat here. My pork belly was dry and looked like it had been basted with..."], "rating": [4, 3, 2], "TBscore": [0.23, 0.5, 0.22], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["wings"], ["wings"], ["korean"]]}
{"id": "etGcIkQAMQmizQp-ErtG8g", "text": ["We have been going to this sushi buffet since 2008. We come here almost every weekend to have a very nice and satisfying meal.\n\nIt is not perfect but it is...", "This was one of my worst experiences in a while.\n\nI used to come to this place a decade ago when I was in school. It was a good and okayish place back then,...", "I've eaten here more than twenty times and it's a favorite for my girlfriend and I. The sushi buffet is OFF THE HOOK!\nAnd the rest of the buffet is really..."], "rating": [4, 1, 5], "TBscore": [0.26, 0.0, 0.44], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["sushi"], [], ["sushi"]]}
{"id": "bOBtYsWAXqo2Sjh6ThEJdQ", "text": ["I can't believe it took me this long to discover this place, and I have not stopped talking about it since! The food is super authentic, and prices are...", "Authentic Korean BBQ.\n\nShin Chon is a traditional Korean BBQ restaurant.  Their menu has every dish you'd expect from a Korean establishment, with an...", "A very authentic Korean BBQ. The server ladies there are very nice. I felt like I was in a Korean movie everytime I stepped my foot into this restaurant for..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.25, 0.72], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["korean"], ["korean"]]}
{"id": "WHTsqJVghonRHwTUBeBJ5g", "text": ["One of the best Korean fried chicken I've had in the area! This is definitely one of my boyfriend and I's go to place when we're craving some fried...", "We came here with a group of 9 or so after checking out the new Sapwood Cellars. It was about 8pm on a Saturday night, but we didn't have a wait at all. The...", "Let me get this right. I am not a customer that is hard to please. I do not have delicate palates or expect a supreme service, especially when I walk into a..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["chicken", "korean"], [], []]}
{"id": "gHrzl9PveygjUXcThgFlXg", "text": ["Location is legit. It's not on light street, which I hate because of street parking and so damn narrow.\nChicken is bomb. Spicy ain't spicy, but it's a...", "I'd been wanting to try this place since I passed it on my way to McHenry Row. \n\nSmall and Quaint, Jazz+Soju has some delicious korean fried chicken.  I...", "Drove down for the day to have some seafood and during the wait at LP Steamers we walked here for a few drinks (other bars in the area seemed small and..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["chicken", "korean"], ["bar"]]}
{"id": "44Xi6oGsiW1SEkmWaoTJGQ", "text": ["Found the Raspberry Deli on Yelp. Under new management for a week. The family runs it and the specials were great. Cheese steak and Ruben were great What a...", "Great little deli in an assuming location.  I've stuck to the sandwiches and have never tried the salad bar, but the sandwiches have always been a crowd...", "All their food is great but Korean Bulgogi cheese steak is to die for! Service is fast and owner of the establishment is very friendly and customer oriented!"], "rating": [5, 4, 5], "TBscore": [0.58, 0.31, 0.6], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["steak", "deli"], ["bar", "sandwich", "deli"], ["steak", "korean"]]}
{"id": "jlc-L0LoU0JUgYC0admeGg", "text": ["Bonchon never fails. \n\nThis new location is nicely decorated, with spacious seating and a bar with TVs for sports. The staff is still training and everyone...", "I'll go with a 3 for now and start with the good... \n\n+ Next to Columbia Mall\n+ Plenty of seating\n+ Half & half combo was on point (it better be!)\n+ Waters...", "The first challenge I had coming here was finding a parking space across the street at the mall. I had told my husband to get out and go in first to secure..."], "rating": [5, 3, 2], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["bar"], [], []]}
{"id": "L4QDGo-AUBrn0Rhjwrf6ug", "text": ["Initially, I thought Rainpia would be a good place to get our Korean Fried Chicken craving fix. After trying places around Ellicott City and being impressed...", "Rainpia is a solid Korean restaurant that serves korean fried chicken and an extensive list of traditional entrees and stews. It appears to be a casual...", "A perfect place to chill and catch up with friends after a long week of work! I would recommend calling ahead of time to make a reservation if you come on..."], "rating": [5, 3, 4], "TBscore": [0.28, -0.22, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["chicken", "korean"], ["chicken", "korean"], []]}
{"id": "Rpz3iGiMdUXD7s19c25zDw", "text": ["I had never been to this chain before, but my fiancé likes Korean food and most Korean restaurants do not offer vegetarian options for me, so this has been...", "Bonchon is a favorite among our household.  We like that extra spicy flavor chicken that you can only really get at a Korean fried chicken place.  We always...", "When I saw we had a new Korean place, I was excited to try it. Only took a month to make it here. The place is really nice on the inside. Comfy benches and..."], "rating": [4, 3, 4], "TBscore": [0.5, 0.0, 0.28], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["korean"], ["chicken", "korean"], ["korean"]]}
{"id": "OqEWBcDWxMV64GeQt_X8lg", "text": ["Great food and awesome people, never in the world would I expect this in Deale. We visit at least once a week and never been disappointed. Would definitely...", "So tasty! Super fresh and yummy, maybe not as world changing as the fancy DC sushi joints we've tried but for a small country town on the water I was...", "Nice. Local. Clean. Super friendly. One of my favorite places to go in the area. The owners take great care in the plants that surround the outside and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["sushi"], []]}
{"id": "S2cmnee8TZ6lkC4qm6NELg", "text": ["Makes you feel at home. I was sad when the first tofu house was closed but now this one is here. It is great that it is updated and fresh! \n\nBeat value for...", "Used to be located in a food cafeteria next to the Hmart in Catonsville and they relocated to Ellicott City. I've heard many things about this location even...", "During the hot summer korean people love to eat cold buckwheat noodles (naengmyun). This place has changed ownership a couple of times, but Ive heard so..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["korean"]]}
{"id": "vSs1vlkY7C9ZaoDEa1o1uw", "text": ["We had dinner on Saturday night and arrived at 6pm. We waited about 40 minutes for a group of 9 but ended up sitting at two separate booths. They were...", "We came here to celebrate the teenager's birthday, because he loves Korean bbq and it's all you can eat. \n\nReasonably priced, and super hip inside (felt...", "Have visited this location of Iron Age a couple times. It is located off of rt 40 where a lot of Korean businesses are established. The shopping center..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["dinner"], ["korean"], ["korean"]]}
{"id": "IfZikaBP2_nCyMaiNjVM1Q", "text": ["Came here one late night with a friend because we were craving Korean food and looking to check out a new spot. The interior is very modern chic. We ordered...", "I kind of don't want to write this review because I don't want this place to get too crowded!  I love the staff here - super friendly and attentive.  Food...", "I ordered non spicy pork bulgogi with rice and barely tea.  The side dishes are kimchi, sprouts and fish cakes.  It's Friday at 530 and I'm the sole..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["korean"], [], ["cake"]]}
{"id": "pcOMmdBXyi8ffq4M8T0JPA", "text": ["So, I took off 1 star because of the service. I know authentic asian restaurants have poor service, but it is a big deal for me to have exceptional service...", "Interesting how there's many comments about rude waiters. I did have an experience last time so wouldn't discount the comment altogether, but when I went...", "Tasty, authentic Korean food! I've been here many times, and I've tried soondooboo (soft tofu soup), hwedupbap (like bibimbap with sashimi), yookgaejang..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.41], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], ["korean"]]}
{"id": "wnLyK4H1Fryn68j1o7q48w", "text": ["Stopped at  food truck and glad I did\nFood is awesome and staff is very friendly \nThey make to order and the food is fresh and hot he offers a lot of...", "What can I say? These guys rock!\n\nThe service is FAST and friendly, the food is very AFFORDABLE, and it's DELICOUS!\n\nThere's a variety of Korean food to...", "Based on experiences elsewhere, I didn't even like bulgogi, but when I sunk my teeth into the moist, marinated, thinly sliced, dark laces of bulgogi in my..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["korean"], []]}
{"id": "KSQmQ7myPBY-z8xic0ng4g", "text": ["So glad there's a good Asian spot in Pasadena ! It used to be a place called fit noodles previously. They specialize in yummy, delicious healthy bibimbap...", "Great food. Great service. Very friendly staff. Doesn't have the hipster atmosphere or wider menu choice like Dooby's in Mt. Vernon. And doesn't have the...", "We love Red Tiger!! The food is delicious and the owners are very nice. Highly recommend."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "ynuv5y74SB2gEXFPjMYb_Q", "text": ["Absolutely Delicious!\n\nWent to The Rolling Cow based off of a recommendation and I was not disappointed! I got the Lunch Box with Bulgogi with eggs over...", "I didn't know why to expect because I've never had this kind of food before but after all the buzz around this food truck I had to try it. \n\nIT WAS AMAZING....", "Food trucks are one of the most interesting things to me when it comes to food. Each food truck is unique in its own different way. So my coworkers and I..."], "rating": [5, 5, 4], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["egg", "lunch"], [], []]}
{"id": "w5wHE3ZoIYRM4aL01cT9jw", "text": ["A friend in California told me about HMart and man was I surprised to see all the fresh fruits and veggies, as well as a wide variety of ingredients for...", "If you like seafood this is the place to go. The shrimp are much bigger than the dried up ones you see at Giant or Safeway. I buy different types and really...", "This is my favorite neighborhood grocery store. Whenever I am in the mood to cook Asian food this is my to go to spot. They have a wide variety of fruits..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "zYHvVuDbwkNW0bnU2m4NHw", "text": ["I really enjoy coming here for the soon doo bu. The broth is wonderful and the seafood in the stew is plentiful and delicious. I think it's a family...", "KOREAN HOME COOKING....Great Eats! Fresh ....made to order...\nIf you love Korean Food...this is a spot to hit.\n\nIt's a simple food court in a supermarket.....", "Cafeteria-style food.... usually not Yelp worthy. But I love this place in a large Asian supermarket. All of the Korean grocery stores in Baltimore have a..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.27, 0.23], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["korean"], ["korean"]]}
{"id": "4SKXw3OtYd1eiN-BkegzXg", "text": ["I almost didn't get out of my car to go into this place once I realized it was in a grocery store. I said what the heck and went in anyway. I'm so so happy...", "This stall is in a food court inside Lotte Mart.  I ordered the beef bulgogi and my favorite dish ojinga bokeum. The meal came with 2 types of the simplest...", "It's been years since I've been here.  The food court signage, prices, and space have improved for the costumers and some ownership has changed. The white..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], ["beef"], []]}
{"id": "ZhZ6IqvEWhsuDx_XEN4FVA", "text": ["After spending some time at Crossbar, my group of friends wanted to grab a bite to eat somewhere close.  I yelped this place and saw how close it was, so we...", "Amazing tacos! This is definitely a take out place though.  I came to the city to try it and since I didn't have anywhere to take my food, I sat on one of...", "Pop Tacos is a convenient little hole in the wall asian fusion taco shop in Federal Hill. The place is a tiny shop with a few tables and a order up counter...."], "rating": [5, 4, 4], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["tacos"], ["tacos"]]}
{"id": "GHF9D4GtOZvzZZ6zZ5mWtw", "text": ["Get the chicken tacos.  They are amazing and the extra sauce they have is great to add to it.  This doesn't need to be an indepth review since it's just...", "It was a delight to order food here on Fridays! As a Korean, the way they combine dishes are a bit more cushion than expected, but the taste of marinated...", "Solid bulgogi platter for $10 which includes rice and some lettuce. Meat was very flavorful and the man running the truck was pleasant. Will try the honey..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken", "tacos"], ["korean"], []]}
{"id": "kp4R7UJcQCk8ld2kmsq-Ew", "text": ["I love the food, a fun atmosphere, a little loud. You have to be in the mood but when you are, they are a great place to go!\n\nBetter with larger groups, my...", "I honestly wasn't very excited about going here when my friend sent the invite for her birthday dinner. I'm not a big meat eater and when i looked at the...", "We went there for our first time. Newbies! We tried several things. The spicy chicken was the best. It came with cabbage.  The beef brisket was thinly..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.36, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], ["dinner"], ["chicken", "beef"]]}
{"id": "GBVSyouA5KxhqWRsg3hv0Q", "text": ["Solid jajangmyun (JJM) and jampong (JP).  Growing up in LA has spoiled me, which is why eating at places that make these dishes right is important.  I've...", "My boyfriend and I have eaten here a few times, and we always leave disappointed. I usually order the jajangmyun and jampong combo, while my boyfriend...", "The quality has gone down. Don't know why.. We ordered Yoosanseul (sea cucumber) and jajangmyum. The sea cucumber was so hard and tough to chew when it..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "OMDUcEfjGAI_Qz8LHx9kSA", "text": ["Stopped by for lunch one day and my husband and I got purple rice bowls with chicken and steak. I loved the plentiful and fresh topping choices. The Korean...", "I have to say Bibibop has been a good replacement for shophouse that used to be around this location. We stopped by this location on a Saturday night around...", "This was my first visit here because I received an offer in the mail for buy one bowl, get one half off, and wanted to give it a try. The restaurant is..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chicken", "steak", "korean", "lunch"], [], []]}
{"id": "owiBTDG4YWMAVw5ZKVz14A", "text": ["The best place for when you're craving Korean fast food except for Tuesday's because they're closed and I always crave it on Tuesday! \n\nMy boyfriend and I...", "$10 minimum for credit cards. \n\nHere's to the hardest working lady I've seen today. During lunch there's a one-woman crew doing everything on the frontline....", "This place is a little hard to get to when you're on the other side of the turnpike, but it's definitely worth the hassle because the kim bap is so good!..."], "rating": [4, 4, 4], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["korean"], ["lunch"], []]}
{"id": "DCx8JryrvqlDmVjNWi513w", "text": ["They draw their own hangheung naengmyun noodle. The noodle was so chewy and the soup  had a deep flavor. \n\nAlso, their Jjambbong was so good. Highly...", "Should've check the yelp review first before we went.\n\nWhy are servers such a in bad mood unless they're talking to older Koreans? I didn't want to tip any...", "Walked in the front door and the smell of traditional Korean food hit me. I knew we were off to a good start. \n\nWe ordered the steamed pork and mixed..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.23], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["korean"]]}
{"id": "_QUNq9j7-Zs3wKbXY94uhw", "text": ["This is my hidden go to Korean restaurant. Thid place is better than even manna rang in Ellicott City Lotte food court. To start off, it's affordable, the...", "All supermarkets should have a food court in it, or nearby. This spot is a fast/casual food-court based \"restaurant\". They serve a large variety of Korean...", "Fresh ingredients, nice atmosphere-basically everything you'd want from a quick eat-in spot. Awesomely authentic and my go-to place for Korean eats. I..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.21, 0.43], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["korean"], ["korean"], ["korean"]]}
{"id": "GhBB5cvrvWiu4mFFBbs0pw", "text": ["I have been coming to Lotte since I was a kid with my family back before they even did their recent renovations. Before it was very rustic with log chairs,...", "I haven't been to Seoul Soondae for a while.  The restaurant used to be the only place to get soondae in the area (this was years ago when trendy Korean...", "Dont know where to start. This afternoon lunch hour I ordered the Soondae Combo. After few sip from the soup, finally trying the soondae. And guess what? A..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], ["korean"], ["lunch"]]}
{"id": "reO8EJly9fPMBf5NK-Gf7w", "text": ["Service was awesome. The server/restaurant manager is super friendly and attentive. The place is a bit small so you might have to wait a bit. People come...", "Conveniently located beside the Korean market for a good late night bite after grocery shopping (they're open late til 1:30am) in contrast to the other...", "Let me be honest. This is not my regular spot. My friend and I decided to come here because the other korean bars on route 40 were packed. This is one of..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], ["korean"], ["korean", "bar"]]}
{"id": "a5c8AmmG9y8kehmk92NP3w", "text": ["Absolute hidden gem. They make authentic korean fried chicken wings better than any I've tasted in the states- no joke. I've had bibimbap here and it's the...", "I tried the korean bulgogi steak sub today. It was very delicious, it reminds me of the bulgogi burger that I used to eat back in Korea. The meat is...", "The ice cream was freezer burnt there was a fly in with the ice cream boo they could do better"], "rating": [5, 5, 1], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["chicken", "korean", "wings"], ["steak", "korean", "burger"], []]}
{"id": "6gWWj1pob308AzU-XtBSiw", "text": ["This used to be Miracjo. I really like this restaurant.  It can get busy but not as busy as some of the other places that can have a long wait time. I have...", "I don't think I am coming here anymore. 12:30pm on a Friday for lunch service. Radio silence. I've been waiting 42 mins for my order. What? \n\nThe server was...", "This place was packed and busy! We had to ask for side dishes and water to be refilled. The food tasted good but I did not get to enjoy my soup..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "N2RV-wd10gSAUE2h2mzj8w", "text": ["The University of Maryland at Baltimore campus gets a lot of food trucks for lunch.  The newest one I've seen yet is Road2Seoul, a modest looking white...", "Yayyyyy!  It's about time Baltimore got a Korean BBQ food truck.  When I checked them out, they only had 2 menu items and didn't even have a twitter, a...", "I've scouted this truck out twice now. They've expanded their menu to include tacos and the option to order a side of kimchi, beyond what the previous..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["lunch"], ["korean"], ["tacos"]]}
{"id": "xvZW9JXQjqgVx5nTmN30VQ", "text": ["I've been to bonchon many times but only the Ellicott City location. Ellicott City is closer to my house so I always go there but this location is close to...", "More quaint than other Bonchons I've been to, a little less friendly and definitely more strange than I've experienced, I'm pretty sure I won't be back to...", "*edit: this place doesn't even care about the product.\n\n*friday day after thxgiving\n\n\nSucks anytime I feel compelled to give a bad review. But since I'm a..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "7gfkgnY6Wrot-GeQvo5h0A", "text": ["I've been ordering from this location for a few months after realizing it's tucked off to the side in Canton. Usually get delivery or carry-out so I can't...", "The worst Bon Chon, I've EVER had. Ellicott City is a ways from me, so I decided to try this location. I called ahead and was told my order would be ready...", "This is not representative of other Bonchon locations. Oh how we were excited of it opening in Baltimore! And how disappointed we are every time we get it..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "mCbWqDS41gzUJn_wrQ1sOQ", "text": ["Food is grrrreat. Reasonable and delicious is a terrific combination.\n\nDo not let the almost hidden location fool you--it is worth the trip.", "This place is amazing! I only started eating Indian food this past year thanks to my best friend and I can't get enough of it! \n\nCame here with my friend...", "I decided to try them again and this time my experience was great! My chicken tikka masala was spicy and delish. \n\nAnother plus... whole wheat naan...."], "rating": [5, 5, 4], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["indian"], ["chicken"]]}
{"id": "yErOUfcOsQV8wuFHTh3cfw", "text": ["This is truly a hidden gem. More than a cafe, it's buffet style so you can get as much as you want and trust you'll want to. \n\nMy first time trying Indian...", "I would give 6 stars if I could.\n\nI took my starving self straight from the airport to this little spot on my way to Baltimore, and ate everything they had...", "This is one of my go-to Indian buffet places, and for good reason(s). I love that they've got all the naan out, so you don't feel like a pig for asking for..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.6], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["indian"], [], ["indian"]]}
{"id": "EFQRzTgCgUv9Bepa-kbtYw", "text": ["Neighborhood gem nestled on Benson St.  Ate at the bar and started with a very well made Manhattan and friendly bar tender!\n\nThe food, service and...", "Went there with my fiance for lunch after a hike. We went for the lunch buffet, as it was still going on when we got there around 2 pm. The place was pretty...", "I came back for the lunch buffet which was long on my to do list and OMG! \n\nFirst, the service was absolutely amazing. Even though it was self serving,..."], "rating": [5, 4, 5], "TBscore": [0.33, 0.25, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], ["lunch"], ["lunch"]]}
{"id": "kd3MW-FkfYyiWbEhljXN8A", "text": ["Delish Indian food (not too spicy), and an amazing staff!\nWe try to get over here once a week for their lunch buffet.\nTry these guys out, you won't regret it.", "One of the best (if not THE best) Indian buffets in Laurel. This restaurant was recommended by Yelp and although it was a bit far from where I live, the...", "I'm going to go on record to say that this was the best Indian food that I've had! The menu states that all meat is Halal. Not that it matters to me, but it..."], "rating": [5, 5, 5], "TBscore": [0.75, 0.56, 1.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["indian", "lunch"], ["indian"], ["indian"]]}
{"id": "jfV5pIYOnVmUiYAmeWoAZA", "text": ["My aloo gobhi was simply delicious, and my pappadom were perfectly thin and crispy, just as they should have been.\n\nThe best part of my last meal at...", "This is my 5th visit to this place and I cant believe I've never written a review before. We usually come for the lunch buffet but tonight it was the dinner...", "Excellent food - I'll be back soon.  The space is cozy and comfortable, and the food was delicious.  We shared the vegetarian dinner (papadam, yellow daal..."], "rating": [5, 5, 5], "TBscore": [0.0, -0.25, 0.37], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["dinner", "lunch"], ["dinner"]]}
{"id": "g4Py2QdLGl7CsX7UlxL14Q", "text": ["I really liked this restaurant!! I am usually not a big fan of Indian food, but I was pleasantly surprised on how great and fresh tasting everything was....", "Took my children to Indish for the first time,I had been two previous times before. The oldest is like myself, love to step out of the box and eat foods...", "This is good!! \n\nIf you're a fan of traditional Indian food, in my novice opinion, you will enjoy this culinary experience here..\n\nNow total disclaimer: A..."], "rating": [5, 4, 4], "TBscore": [0.43, 0.0, 0.28], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["indian"], [], ["indian"]]}
{"id": "FOV1rB-Vt5CGSfuYC_sugg", "text": ["Wow! So happy I found this gem. My meal was comparable to Rasika or Bombay Club in DC for $11. I had the chicken Vindaloo. He warned me it was spicy, so if...", "Inconspicuously tucked  to petrol bunk - lacks in ambience but makes up on the food, awesome Indian food  #royalkabab #indianfood #baltimore #vegeterian...", "Don't sleep on gas station restaurants! We wanted Indian food and this place was close to home since Namaste wasn't open. We decided to go light and spilt..."], "rating": [5, 4, 4], "TBscore": [0.0, 1.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken"], ["indian"], ["indian"]]}
{"id": "y3LxuISi5at89ApvY32l1Q", "text": ["I came in for lunch and was excited to try the Lunch Thali. A platter of small round dishes. My server explained that it is a more traditional version of...", "Excellent option for Indian Food near Columbia.\n\nI highly recommend the Shrimp Tandoori as well as the Butter Chicken (order a side of Naan... it's a...", "This place is a gem! They are so sweet and welcoming. They can customize the spice level of their dishes. Also try their gulab jaman and ask for the special..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch"], ["chicken", "indian"], []]}
{"id": "db81-8wjWRraQDQBk4-Jgg", "text": ["WOW what an amazing meal.  The lamb mo mo, the chicken tikka masala and the garlic naan.  This place is the real deal.  The spicy level was a little below...", "Came to Himalayan Bistro after reading all the great reviews on Yelp.  We ordered the lamb biryani, garlic naan, vegetable samosa, mulligatawny soup....", "I'm so glad I tried this, it did not disappoint. The owners were this very friendly couple. I ordered the lamb korma extra spicy and goat curry extra spicy..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken"], [], []]}
{"id": "2JAginFmBlKiq_knc6206Q", "text": ["Follow up-Still great food! The owner is also so kind and helpful as well. Truly love this place.", "I have eaten Indian food all over the DC/Baltimore area and this had to be my most disappointing experience. I may not have a refined Indian food palette,...", "This was my first visit and I don't think I will return. I ordered a veggie wrap, side of chickpeas and sweet rice. The wrap was advertised to have feta..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], ["indian"], []]}
{"id": "a95sxJcC6Gqb1U4PXw4B1A", "text": ["Food//\nVery well done Indian food. \nFancy and done right. Quality and presentation are both on point.\nThe portions are a smaller than your typical Indian...", "4.5 stars for food. 3 stars for price. Service was fine, but we did receive one incorrect item which they corrected... but didn't let us keep the first. As...", "Lovely ambiance. Beautiful view. Delicious, spicy food. \n\nDefinitely coming back here, I felt very cozy that I almost didn't want to leave . The food tastes..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["indian"], [], []]}
{"id": "vRk04JqRuDixxbpflGX3tA", "text": ["I've eaten here three times now.  Super excited to live so close!  Great, great Northern Indian food.  The bindi masala and the samosa chatt are to-die-for....", "This place is definitely good competition for the nearby Indian buffets! I visited on a Saturday and was seated immediately. They have a variety of meat and...", "First time for the dinner.\nNot many customers. Did not get any wine list. Looked other tables that no one order any drinks. Wonder if they don't have a..."], "rating": [5, 4, 3], "TBscore": [0.5, 0.88, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["indian"], ["indian"], []]}
{"id": "k-rhQOAA4L6Xjgm6qYccYw", "text": ["I have been eating Indian food at this location for years now. Previously when it was Curry Leaf, and now have tried Godavari. I have a few things to say...", "GO TO AMBER SPICE 2 MINUTES DOWN THE ROAD!\n\nThe owner of this restaurant renamed Curry Leaf to Godavari when his chef opened AMBER SPICE down the road (in...", "One month after my last review I'm giving this place another try. I can't lie, I'm still not a fan. But that's my own taste preferences. They have improved..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["indian"], [], []]}
{"id": "GSD3Gf4Yryt9w0n8Sce1fg", "text": ["We decided to visit Tandav based on the awesome yelp reviews and needles to say they did not disappoint. We ordered a lamb dish sautéed with peppers and...", "Tandav may be a new kid on the block in terms of the Baltimore restaurant scene, but it is not to be taken lightly; it's packed with flavor, served with...", "Was excited to try this new place in the old Tarbas space, as the best Indian I've found in the area so far has been in the suburbs. Everything local is..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], ["indian"]]}
{"id": "YfgZBZWeJWkAwctImN0rrQ", "text": ["I order delivery from this restaurant using Grub Hub often and it's amazing!  The chicken tikka masala is delicious and reminds me of my first foray into...", "Ordered lamb Karahi got chicken Karahi didn't complain thinking it would be flavorful  but it wasn't i had to put a lot of salt in it and pepper . It was my...", "So we are new to Crofton, and decided to give 4Seasons Curry& Kabob a try. My husband ordered their Italian sub. Expecting a real Italian sub. You know like..."], "rating": [5, 2, 1], "TBscore": [0.35, -0.6, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["chicken"], ["chicken"], ["italian"]]}
{"id": "V1-X5WfWRUK6u_n4SWPNZg", "text": ["My roommates and I order from here often. They are professional and polite. They do deliveries in suits!\n\nThe food is excellent. No complaints.", "I did take out on Grubhub which was excellent for delivery.  Not too many compliments left for this order. \n\nThe assorted appetizer had no flavor and it was...", "We LOVE this place and are regulars BUT too often do they get our carryout orders wrong. It is never done on time either. Usually 45 mins for a pickup..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "A4VVvi8D9ak9rezJXTzGxw", "text": ["Absolutely my favorite take-out Indian food in Baltimore City (and I'm Indian!)\n\nLocation/Parking: \nSituated in Little Italy, such a gem among all the cute...", "I've ordered delivery and eaten here twice. Their lunch buffet is amazing. \n\nMy fave dishes are the daal, saag paneer, rogan josh, and the tandoori chicken....", "Little India is in Little Italy and the only non-Italian restaurant in Baltimore's Little Italy. Because of this, you assume it isn't good, but mark my..."], "rating": [5, 5, 5], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["indian"], ["chicken", "lunch"], ["indian"]]}
{"id": "djG2dmzYSBdat0jg2h6JXw", "text": ["Cozy quiet clean smoke free with great food and warm staff.  Nicely located by Arundell Mills Mall\n\nTandoori chicken and Kodak chicken with tandoori Roti", "It's an average Indian food restaurant! \nThe food tastes extremely bland maybe they considered the taste of locals rather than Indians! \nNot a right place...", "I received a mailer about this place and decided to check it out. Now I go out for Indian food frequently so I'm familiar with  the outstanding hospitality..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.44], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["chicken"], ["indian"], ["indian"]]}
{"id": "d_a23HWENed-bBI1toKySw", "text": ["I come here a lot for their food.  I'm thinking it is going to be a staple for me.\n\nTheir samosas are amazing.", "I took my wife and daughter here yesterday for the dinner buffet after a coworker's recommendation. The place was packed, which is a good thing. The very...", "Haven't been here in a while, but glad to see they have done some interior renovations that made the restaurant a more inviting space. We came to the as..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.45, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["dinner"], []]}
{"id": "R0XMdBUgPmVZSVUiA7ePwA", "text": ["This may be my new favorite Indian restaurant in the area. Their weekend buffet was absolutely fantastic!\n\nI always take it as a good sign when I walk into...", "Painful pleasure of spicy food! \nI could give 3.5 stars , if there was an option. The overall taste of the food is good but it's super spicy   , overpowered...", "I would rank this as one of the really disgusting places in town. Since I wasn't able to go the kitchen, I can't vouch the chef didn't or wouldn't spit or..."], "rating": [5, 3, 1], "TBscore": [0.46, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["indian"], [], []]}
{"id": "G078UjR05ZL7_lUAK6hMEg", "text": ["I've been to this location twice, and I'm still not sure what to think.  This place reminds me a lot of Chipotle, as you can order a bowl with whatever meat...", "We were in town for work and decided to go to this place after yelp reviews. Best decision ever!!!\n\nMutton dum biriyani \nMirchi bajji \nIdli \nDosa \n\nWe tried...", "This was my first time here and the food is definitely authentic. \nThe lady that was taking my order wasn't very helpful even after I told her this was my..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "zo143UIr5WVNwBp4k8OIxA", "text": ["This was our first, and definitely not our last visit to House of India! The order was ready for pickup in 20 min, correctly prepared, and packaged well. My...", "What a delightful restaurant. Hidden in a strip mall, about 5 minutes off the Broken Land Parkway exit, is a fantastic experience, not just with taste, but...", "Free parking in front of the restaurant. Takes both cash and credit card.\n\nI came here on a weekend for their lunch buffet. For $12.50, thats not a bad..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["indian"], [], ["lunch"]]}
{"id": "-HEn4Pl0IqIzfEZz8AuMfw", "text": ["First off, the owner is the nicest man you could ever meet. He's a real chef, who is always trying new things. \nIts a fairy new business, so he's the only...", "If you've read my reviews being from upstate NY I'm a wing snob..take that with a grain of salt. \n\nPlus\nVery tasty sauces\n\nMinus\nwings are not crispy, soggy...", "Came from out of town as we were leaving liquor store in strip mall we saw a sign that said WINGS and I'm like boom let's Yelp it. Good reviews, halal and..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.7], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["wings"], ["wings"]]}
{"id": "EGhS4ex03h4BYWXeHRAKEg", "text": ["It was so good that I finished it before I remembered to take a pic for my review...oops", "My partner and I waited over an hour and a half for our food. I had to contact the restaurant several times to get a hold of their driver. Come on guys,...", "We went to the buffet today, I did not think the food was very good. I thought it was a little bland and there was not a lot of spice. The cauliflower was..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "ch2skAMJsCVSyB9aXD3hJw", "text": ["A haiku to express my appreciation for Tandoor Grill:\n\nChili naan so good\nLamb vindaloo is delish!!\nThank you Tandoor Grill\n\nI got the chili naan and lamb...", "Another hidden gem.\n\nThis small Indian restaurant is located in a strip mall full of good restaurants. They appear to be a local favorite and offer take out...", "We got delivery from here - Appetizer: Chaat. Entries: an order of Shrimp Biryani, Saag with mixed veggies and Tandori Paneer with roasted veggies. (My wife..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["indian"], []]}
{"id": "ara-iMG1WKoFfI41nlcMDg", "text": ["Excellent, small South Asian...diner? It's an inviting order at the counter place in Canton square, the primary Indian food/kebob spot for the area, which...", "WOW! Talk about top five folks! \n\nJasa Kabob's food literally leaves me dreaming about chicken samosas and all kind of kabobs. Lol I'm so sad it took me...", "Years later...still 5 stars. Quality is very consistent. They always have my favorites on hand  - spinach, daal, and at least one type of chicken. The naan..."], "rating": [5, 5, 5], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["indian"], ["chicken"], ["chicken"]]}
{"id": "M6-m6DaBoLaaApnXWbaA4A", "text": ["Good service and chicken korma - would recommend.  The atmosphere is simple and open.", "My wife & I stopped in at their new location on Nursey road for the lunch buffet.   The goat curry was fantastic as was everything else.   Highly...", "They had door open for some reason.  Air conditioning must be broken. Was so humid inside the restaurant that we almost fainted, and lighting was way too..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.23, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["chicken"], ["lunch"], []]}
{"id": "xKno1sY6FBHB5xYyHLfOcg", "text": ["We tried them while our visit to baltimore. Its family owned business. My wife is vegetarian and very selective on the veg food.  We tried aloo chilly for...", "Long curly hair in my saag paneer...gross!\n\nKofta in my malai kofta so hard...terrible.\n\nWhen I called to tell them about the hair a lady told me manager...", "I had purchased a voucher on Dealhere.com ($12.50 for $25) to try this place. The voucher could only be used for dining in, even though it looks like this..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "fZ_7llLZzKXlSBggB6ZZTA", "text": ["The 2nd best pizza I've ever had so far in my life. The 1st best was in Italy. Seriously... The butter chicken pizza is something I never knew I needed in...", "Super wordy in my reviews typically but this place is easily summed up in a couple sentences.\n\nI live for these pizzas. You absolutely must try one.", "So for reason I was craving Indian food at 10 am so I came to Bella hoping for some good Indian food. I wasn't disappointed at all. Obviously the place was..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken", "pizza"], ["pizza"], ["indian"]]}
{"id": "7g3SvxXRzkQCjA2fmWnEvQ", "text": ["This place is just nasty if you are looking to  take a shower, keep looking, I took some pics so you guys can see this mess", "The service is very friendly and polite. They are also  make the food in a timely manner. I ordered the butter chicken and garlic noon, it is very good. I...", "Top notch Indian food. They also have other stuff on the menu that looked really good. This place is a hidden gem. It is clean and the food is fresh. Prices..."], "rating": [1, 3, 5], "TBscore": [0.0, 0.27, 0.26], "normalisedRating": [-0.6, 0.2, 1.0], "keywords": [[], ["chicken"], ["indian"]]}
{"id": "X5esd9zMCaLBIR2cdi333g", "text": ["I have been coming this restaurant for few years. The restaurant is very clean and well decorated. Separate bar area other than regular dining area is a...", "Hit and miss.\n\nI've been here twice and enjoyed all the entrees a lot, but the add ons hardly at all.\n\nLamb Korma, Chicken Tikka Masala, biryani,...", "This business is so unethical. I placed a catering order over the phone and we negotiated a price of 300$. He asked me to pay $50 deposit over the phone and..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["bar"], ["chicken"], []]}
{"id": "ayL2kJsWbpRN_IfCVMTjbA", "text": ["This place is an oasis of delicious authenticity in the desert of the mediocre, unreal, ambivalent America. The owner, a kind and humorous family man,...", "OK, so this place isn't going to be for everyone, but I'd still give it 5 stars.  Very simple - paper plates, plastic utensils, maybe only 3 or 4 small...", "I ordered the Lamb Biryani, which was a large portion. I was very happy with it. My brother liked his Chicken Tikka Masala, but the portion was small and it..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["chicken"]]}
{"id": "RRJAOEKaCyVhcs-JDQ7lnA", "text": ["One of my favorite Indian place and it must be good because we drive 45 min from north Baltimore. It has huge vegetarian spread . Food is fresh, flavourful...", "And In Conclusion......\nThe first few times I went here I liked it. But this last time it just wasn't a good experience. The waiters just weren't nice at...", "Having tried Mango Grove for dinner a while back, I returned for a lunch buffet, and it was most impressive. The staple channa masala was proudly presented..."], "rating": [5, 3, 5], "TBscore": [0.48, 0.0, 0.57], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["indian"], [], ["dinner", "lunch"]]}
{"id": "bTuJCbbJpnstUouUWMlHMA", "text": ["Great food. This is not the place you come if you want to sit in a fancy establishment but if you want great biryani, naan, tikka, you name it then this is...", "I'm expecting to upgrade this to at least 4 stars next time we go and order more wisely. Meal stayed off great with the crispy cauliflower and tandoori...", "I had the fish Biryani, it was rice over fish sticks!!!\n\nNothing else.\n\nVery dissatisfied.\n\nI'm sorry , what spices do they use?"], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "quU9LppignKrlxnStD360g", "text": ["I want to share an amazing experience that we had with Darbar recently. We placed a to-go order for 3 orders of garlic naan among other things. We got home...", "We are from out of town, and we tried this place based on online reviews. We were immediately greeted and seated upon our arrival. The staff was friendly,...", "We went here with my new in-laws the weekend we were married.  The server was incredibly polite and prompt.  He brought us house wine gratis, and dessert...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "SY-2sHUnTx-iCpG6hcqoNg", "text": ["OK. So I may very snobbily begin my reviews of Baltimore restaurants with this sentence, but I am going to do it anyway ;-). I spent nearly 15 years of my...", "One of my favorite Indian restaurants. A must try for authentic India food. Nice staff and clean. In the heart o Lexington Market.", "Went here for a team outing. I am someone who packs lunch every day and never ventures out so when someone suggested buffet I was a tad weary. But this..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.49, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["indian"], ["lunch"]]}
{"id": "-UuN_cACRqqD2gpdbzHzMQ", "text": ["I think this goes by Himalayan Spice now? \nWas happily surprised to have such quality food and service so close by! \n\nThe garlic naan was fluffy and...", "I have mixed feelings about writing this-let me tell you why!\n\nI was looking forward to Indian so close by (within a couple miles), and good Indian, at...", "This is, hands down, the best Indian food I've ever had- certainly in Baltimore if not anywhere. \n\nThis new little place took over a former restaurant..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["indian"], ["indian"]]}
{"id": "e-ghBjsnIHlaizn7Xpi6jw", "text": ["No more long drive to Chantilly for Chicken Biryani as we found this place PK (Prince Kabob) !!!  The place was clean and bright. The service was attentive...", "The food is amazing! I visited this place when it had a different name. It had been a while since my last visit so I was surprised to see a new name when I...", "Delicious and wonderful service!  We arrived on a Sunday evening and we surprised it was completely empty.  Later on we realized it was Ramadan because more..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken"], [], []]}
{"id": "of9oiYms87o4Ai8cArgYsQ", "text": ["This review is based on delivery (through Grubhub). \n\nDelivery was quick and polite and the food arrived piping hot. We ordered two entrees (mutter paneer...", "I travel to Baltimore every year.  I found this place about 5 years ago and have come back to this place every year.  Great Indian food. It's a fairly...", "I had dinner here once. The food came out extremely slow and had to take it to-go because I imagined I would come and dine for one hour, but it took 50..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.5, -0.3], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["indian"], ["dinner"]]}
{"id": "2kxdVyIpuMX-kif1svRnDg", "text": ["If I toot my own horn, it is only because I am probably the most qualified customer here to write a review for this restaurant. I have been here close to...", "This place was pretty decent. I went here on a Sunday morning so there was much people there so food came by fairly quick. \n\nMy friend and I got the Lamb...", "What a charming place, with lovely, fresh linens and sparkling tableware.  I met a friend for lunch on 10/16, and posted photos that day but never finished..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "JmgPEjjhIRm5tE1MKtbtbw", "text": ["I  picked up an order from this restaurant 20 min ago. We ordered biryani lamb and the Seafood drunken noodle and some naan bread.\nDelicious!", "The quality has gone down over the years. I have been coming here longer than I have been on Yelp and in the beginning it was fantastic. The perfect mix of...", "The Sapphire restaurant is a long time local restaurant. With authentic Indian food. The lunchtime buffet futures plenty of vegetarian selections and some..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["indian"]]}
{"id": "0fxM-PYmmEt38pzJPFDwbA", "text": ["A One is hands down the best Pizza/Sub shop in the area. The prices are good and the food is delicious. I order from them at least once a week. My go to...", "Might have tasted the best food of my life last night. We were staying in a hotel near the airport and didn't want to leave to find food, so I tried the...", "The Chicken Tikka pizza is a MUST Try item. The Greek salad was just okay but tons of feta. Not too shabby for take out when you're stranded. Quick service..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["chicken", "pizza"]]}
{"id": "8xg3h6JprOj9rVQgL-lQAg", "text": ["I am such a fan of ordering from Gateway. I've never eaten here or done carry out, but regardless, the food I get doing delivery is great. \n\nWe frequently...", "The Indian is outstanding. We ordered aloo saag, chicken saag, garlic naan, samosas, and some fried zucchini. All amazing. Great flavor, seasoned perfectly....", "I've been this restaurant's customer for many years and I consider myself a steady (about once every 3 weeks) customer. They know me by my name at this..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["chicken", "indian"], []]}
{"id": "0ZlDij7dPh--FUGqOQEhNQ", "text": ["I was a little skeptical about the lamb biryanis. I grew up eating this food so I'm picky . I was pleasantly surprised that the biryani was good it was like...", "DO NOT EAT HERE UNLESS YOU WANT FOOD POISONING\n\nI ordered samosas and saag paneer, two dishes that are hard to mess up. \n\nI was halfway through the saag...", "So this time I tried Metro Tandoor and instead of using the app to order the food I called in my order. I had a menu from my previous takeout order and..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "-0vv34TN3TcezIpXUEO_8g", "text": ["So far so good! This was my first experience. I ordered takeout (garlic naan and mutter paneer) tonight. I ordered spicy and should have heeded the advice...", "We have ordered Veg Biryani during happy hour tasted too good. We would like to order again. \nWe are expecting some appetizers to be included in happy hour.", "Congrats ! you have made the list of worst chicken biryanis I have ever tasted. If you are ordering biryani during happy hours be cautious. I wish I should..."], "rating": [4, 5, 2], "TBscore": [0.0, 0.0, -0.27], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [[], [], ["chicken"]]}
{"id": "biYMRXIIs-26CFql9K6E0A", "text": ["This is my second time here. I ordered the vegetable plate each time. The first time I got spinach, chickpeas and rice with the yogurt dressing. This time,...", "No the place is not the cleanest nor the nicest in decor. The preparing of food behind a curtain did not make the atmosphere feel very appetizing either....", "Great Biryani Place in the Largo area! Ordered Chicken Biryani today. The Biryani was delicious, freshly cooked and well presented. The customer service is..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.42], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "Nwf-_2s1ZJ_cxqvP_3ZfFw", "text": ["Delivery today was fast and they always listen to comments and whatever you add on to your order! Loved the delivery girl very nice and patient. Will always...", "3.5 really. Just had their fish curry (salmon), it was tasty (tho i prefer Little India Cafe's), fairly priced.. most places give bread AND rice with their...", "Wow, is The Treat under new management? Every time this year I have ordered they forget something and then lie about bring it back! The customer service is..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], ["indian"], []]}
{"id": "lpREGZ-CS4hOWsYDLUCpsg", "text": ["The kabab wrap combo is my favorite. Its super filling and a great deal. However, it can be messy, so I learned firsthand not to eat it in the car. I...", "This place is great for a quick lunch. I Called my order ahead for carry out. The food is always hot and fresh and most of the time the service is friendly....", "Kabab Hut is an excellent value. I had the samosa chaat appetizer and it was a large portion and flavorful with overlying chutney and tamarind sauce. I had..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "ZCL_1hLWp080dSdKtEkNzw", "text": ["There was some hair in my food which is disgusting. I came here a couple times place quiet small and gets packed on the weekends. Not somewhere I will go...", "Very tasty Latin sit down restaurant. Small, inexpensive, very traditional cuisine. Highly recommended for those who appreciate good Latin dishes.", "Came here because another place was closed.  It's a small hole in the wall but yummy. We had the pupusas (1 chicken & cheese + 1 pork & cheese), beef..."], "rating": [1, 4, 4], "TBscore": [0.0, 0.0, -0.32], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [[], [], ["chicken", "beef"]]}
{"id": "6bFGLCf9xYKaYpv6yKKMzA", "text": ["The worst Chipotle! Dirty, nasty and poor customer service. I will not be returning even if the food was free!", "Went to this chipotle the other day to get a dinner for my mom and I and was greeted upon entering and they were exact with the amount I wanted in each...", "I have never been so disappointed at a Chipotle before. I have given this place multiple chances (4 to be exact) and every time I was disappointed. There..."], "rating": [1, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [[], ["dinner"], []]}
{"id": "47_5BbU_oB-yjvmQR5U57Q", "text": ["Came here after some plans got cancelled, dang rain, and found it on Groupon. $14 for two people, tour/tasting and two tumbler glasses.\n\nWe got there and...", "Best distillery in Baltimore, hands down. I got an amazing tour by one of the owners and learned so much about how they make their whiskey and the history...", "Great tour and the aged Caribbean rum is the best I have had. All they need is a cocktail bar (already in the works) and a place to eat.  A food truck like..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.57], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "eu4O3sQBFOCgxKbdUdUs9Q", "text": ["The one bartender was too busy throwing down shots with a co worker at the bar. While the other bartender/bareback was eating food/Motts sticks off the bar....", "Service very slow at bar high table. Had to ask for a waitress and service. Food terrible. Eggs Benedict: ham so thin you could see through it, 1 Tbsp...", "The service at O'Brien's is actually beyond good. Everyone from the hostess to the server and runner were spot on. Shame the food was tired and old.   I..."], "rating": [1, 1, 3], "TBscore": [0.0, -0.41, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [["bar"], ["egg", "bar"], []]}
{"id": "jRiqbRHA4juscHhRctar-g", "text": ["Hmmm...I'm trying to think of a reason not to give Smallcakes 5 stars and so far, I haven't come up with anything yet. Yesterday, I found myself in a not so...", "Customer service leaves a lot to be desired at Smallcakes. Came in here on a slow Tuesday afternoon, not a single customer in the store, and was barely...", "I really wanted to like this place when a friend suggested it. He and his wife stumbled upon it and knowing I love cupcakes. So, I made the trip on the way..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "yv-gVZKRef8nEpvlYT_cTg", "text": ["These cupcakes were delicious. The employee there was so nice. She asked if it was our first time there and she explained how the cupcakes had fillings and...", "I ordered the mini cupcakes for a going away party and was recommended snickerdoodle, chocolate fudge and vanilla. They were absolutely fabulous. The camo...", "Cupcakes and cakes that are amazing. I wrote a review some time ago and their excellent quality and taste has not changed.  If you are traveling eastbound..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.8], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["cake"]]}
{"id": "WGyWHzVnw-cihlx6UeG7OQ", "text": ["So, this is my happy place. Hands down my favorite candy store. If you are a candy junky like me, the endless refill jars are totally worth it. \n\nThe...", "Kids who likes eating sweet head over here. The Lolli and Pops is a colorful fun place to spend money on sweets. Kids make sure you ask your parents if you...", "I went to the Lolli and Pops in Annapolis last week with my 11 year old daughter. As we browsed the store, I noticed one of the employees following us..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "Np1Ft9znqiTeTYGms1y1Ww", "text": ["I was introduced to Blossom's Catering by one of my coworker's. She lives in Crofton and found out that Blossom's provide individual Meal prep weekly. She...", "ANOTHER wonderful experience with Blossoms catering. They made my cake for my daughter's baptism and everyone RAVED about it as \"The best carrot cake they...", "Blossoms Events catered a birthday party for us - the food was delicious and the cake was especially enjoyed.  Roberta was sensitive to both budget and menu..."], "rating": [5, 5, 5], "TBscore": [0.0, 1.0, 0.7], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["cake"], ["cake"]]}
{"id": "YxDGPk8Q1HbxOc3UZA0zWw", "text": ["It is summer and it's time for some Rita's!!! They offer amazing custards and Italian ices. If your adventurous, I'd recommend getting the Gelati. It's a...", "Not the best Rita's I've been to. Questionable location, although easy to find. Parking can get a little messy with parking and all kinds of debris...", "The custard is kind of gross. It's almost like biting into firm cool whip. Why isn't it cold? I'll take soft serve vanilla over this any day. The \"ice\" is..."], "rating": [4, 2, 2], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [["italian"], [], []]}
{"id": "e3Pl9hWvdv8DaRudBdCgWg", "text": ["I was really excited to try this Food Truck after reading at all the positive reviews, I must say I was \na little disappointed. I ordered the Pulled Pork...", "The reviews do not lie - this is some LEGIT bbq.  Holds a candle to some of the best I have had in Texas and the Carolinas.  Get the brisket or the pulled...", "The Smoking Swine paid my job a visit, and needless to say it was well worth the wait standing in the blazing sun.\n\nThere aren't enough words to describe..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "w2fiJ0auCq2w8owACH4J4w", "text": ["got a chance to eat a beef brisket burger at a food truck festival. It was tender, juicy and overloaded. The only thing i remembered from the festival is...", "Driving down the road and BBQ flags up ahead mmmm that sounds good!\nstopped and found a food truck/trailer talked to the owner he said he just opened. \nAll...", "Can I give this 10 stars??? Absolutely amazing!! Wish I knew about this truck sooner! I will be tracking them down again"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["beef", "burger"], [], []]}
{"id": "8Q7eENcLuPw3wxqnPPNw3g", "text": ["I will award one more star for the simple fact that the new owner has added the ability to use credit cards and debit cards.  This has made me come back...", "Bayside Bull has been my go to place for Open Pit Beef Sandwiches for over 20 years.  I have fond memories of the old trailer they used to be housed in....", "Whenever I visit family I make sure to stop here at least one time for lunch or dinner.  My favorite options are the Pit beef sandwich and an order of..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.23], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["sandwich", "beef"], ["sandwich", "beef", "dinner", "lunch"]]}
{"id": "DomASIcUPRiL_bEqT3RWzA", "text": ["Get $50 off Territory Foods order using promo code: VPNK\nhttps://www.territoryfoods.com/yum/VPNK\nEXPIRES SOON!", "Territory is delicious and convenient. I've started ordering 3 meals a week and no regrets!\n\nTheir spicy and paleo dishes are my favorite! The pick up...", "My wife and I have really enjoyed Territory!  We are able to eat clean and healthy while having delicious meals.  Their customer service has been great and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "gd2zIByuOgfERPNh3-jb4A", "text": ["Argh Matey!! We came to the Maryland Renaissance Festival to celebrate Pirate's Weekend, and had a great time! We came dressed as pirates to get into the...", "If you're looking at reviews for a renaissance festival, chances are you're into this sort of thing. In that case, you'll like this. Tons of activities,...", "Going to a Ren Faire is fun. Md's is large and has been doing the same thing for a LONG time, which means that they do it very well.  \nThere are tons of..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "9jYZvXHQILzjdX5KV6eKNA", "text": ["Boooooooooo..... \n\nTried to take pictures of good service and got shunned.  Got a zero thank you or have a nice night or anything. .. so sad! !\n\n\nFood is...", "No baked potatoes this is the second time!  No chocolate frosty....vanilla tasteless!   Not worthy of stopping by.", "I know it's a joke about greasy floors in fast food restaurants, but I actually did slide around both the dining area and bathroom.  And then the chairs,..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "WK94Fg0TAu4ndzHl7sPJ7g", "text": ["Zeffert and Gold was one of the best choices my wife and I made when we chose our vendors for our wedding. We worked primarily with Matt, and he was...", "I'm actually posting this review ahead of my event. Our wedding isn't until May 2018, but my fiance and I booked with Zeffert & Gold back in April 2017....", "Working with Iris and staff at Zeffert and Gold was truly one of the highlights of our wedding. We wanted a very specific menu (Italian and Maryland..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["italian"]]}
{"id": "e8COWKvjQLJwK-AsMx86fQ", "text": ["I was in the mood for blue crabs on my recent visit to the Maryland/DC Area and my friend wasn't in the mood to cook any. She suggested instead of going to...", "Their only saving grace is that the food was good. The place is confusing. There isn't a clear entrance and we walked around the whole building to find a...", "This place has a  cool atmosphere.  It's right on the water with a great view.  \n\nI ordered a shrimp salad sandwich.  It was good, but very messy to eat...."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], ["sandwich"]]}
{"id": "b2pF-Y8QFWPIX8aws9gUrQ", "text": ["Veggie tacos ($8) were just lettuce, salsa, tomato guacamole, cheese, and sour cream (aka no actual veggies). Very disappointing.\n\nFrench fries were crinkle...", "Ok yelp peeps..let's get in formation...\n\nYou gotta try this new food truck!! Their food was absolutely delicious and filling.\n\nI tried the 3 taco meal,...", "My review about this food truck.\n\nI cannot comment about their food but I went to them and I could not get to the window because their truck was blocking..."], "rating": [2, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, -0.6], "keywords": [["tacos"], [], []]}
{"id": "TlLz8mO0DQhtGsvCOwYMHQ", "text": ["Crabs were packed heavy.  At them at the bar.  Friendly staff.  Loved the local allure of the place.  Will definitely be back.", "I honestly wish I could leave 0 stars after last night. It took over an hour for us to get our crabs even though everyone around us that got there way after...", "The decor is a little bit dive... it's fun. Staff is great and super attentive. Tiffany, our server, was awesome!! We found a new hidden gem. Sweet corn..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["bar"], [], ["corn"]]}
