{"id": "pdHv3SmBI1lqelX9kx0lFA", "text": ["Bit of a word of mouth, hidden gem, suggested by a coworker. Got an Italian grinder on white with chips. Ordered the larger sandwich because I  thought the...", "I'm surprised this place didn't have more reviews because this restaurant had a consistently good flow of people going through so I thought more people...", "Great local spot! Excellent old style \"whatdya want?\" type of flavor, tasty sandwich, great prices."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.54], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["sandwich", "italian"], [], ["sandwich"]]}
{"id": "dBlrlVmLHm__d6spyU_33Q", "text": ["This place is a well known sandwich shop around Auburn.  The sandwiches are made upon order.  The sandwiches also are crafted to have a dash of flair that...", "Joined the rewards program and it was a great decision. I got a free sandwich today. Momma Gs on Thach is the best.", "Pet friendly on the front porch, which is definitely a plus. It's a great spot to grab a quick bite or indulge in Momma's Nachos. If you don't have tickets..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.73, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [["sandwich"], ["sandwich"], []]}
{"id": "DsNeLojtyZi--Dc183ZyWQ", "text": ["Wow!! Best cookies I have ever had. Honestly the owner has a God given talent to bake! Love she is spreading joy through amazing cookies.", "This was one of the best cookies  I've ever had! A cookie  so healthy, tastes so good. It was loaded with all of the mixed nuts  you could think of plus...", "The cookies tasted fantastic!  I ordered a huge batch of cookies and rice krispie treats for an event and was sooo grateful that they allowed me to pick up..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "0dwt46dAQh5o9TYhxnuHIA", "text": ["Okay so Ive been wanting to try this place forawhile now, as I moved from the northeast and the south doesnt do grinders like we northerners do. The menu...", "I was tired of the same old lunch places and I had never heard of a Which Wich, so I decided to give it a shot and I am glad I did.\n\nI got a Rueben sandwich...", "I am extremely disappointed, especially because this restaurant usually never does this horribly. I waited for 30 minutes in a line and once I get to the..."], "rating": [3, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, -0.6], "keywords": [[], ["lunch", "sandwich"], []]}
{"id": "a9bvTP9mfpHbUXMYoa4sEQ", "text": ["Wings are great, sauce is excellent (I ordered hot).   These are my new favorite wings in the Auburn/Opelika area.", "It's exactly what you pay for. Wings are kinda small, like drumettes so if you're hungry get at least a 15pc. But the sauces are good. Great hot lemon...", "The wings are outstanding!  Small, tender, juicy.  The Buffalo sauce is heavy on vinegar - a nice twist.  Very clean, fast service.  Excellent place for a..."], "rating": [5, 3, 5], "TBscore": [0.54, 0.24, 0.35], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["wings"], ["wings"], ["wings"]]}
{"id": "jiU_EMLoZISUQgT65mEGow", "text": ["Pretty convenient shopping center.  Sort of typical though.  It has a variety of shops, services and restaurants to include, but not limited...", "Tiger Town is the changing face of shopping habits in America.  No longer does the mall reign supreme.  If you need a clear example of that, look at Auburn,...", "I had a pedicure done here because of the ratings at Yelp and it looked clean.  The person that did my pedicure I told him that I have a toe with arthritis..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "fBKpXhBf5ggXKXSYLN0uWA", "text": ["The service, comfort and just all around atmosphere blew us away. Have stayed here twice before and will probably stay here always from now on. \n\nThe front...", "Staying here for the past 5 days. \nThe rooms are nicely decorated, however there is no water pressure and you can hear everything in the hallway. It is nice...", "We have stayed here numerous times and use it as a quick getaway spot. It is a simply wonderful hotel, and Marriott seems to know that now with the awards..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "pvBI4AV2L73nyuPsLMyo6A", "text": ["Great food, but the service is terrible. The dining area, the drink fountain and the table tops are always unclean. There's always at least a 10 minute wait...", "Asked for 3 wings and a biscuit and got 2 thighs and a biscuit instead! Don't make any sense!! When you spend your money you want your order to at least be...", "Went in for lunch, ordered food at 12:30, after 20 minutes of waiting, every single person who came in after us had received their food. Waited another 10..."], "rating": [2, 1, 1], "TBscore": [0.0, -0.3, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], ["wings"], ["lunch"]]}
{"id": "BPBa4TyvI8SFZQBnaMLt9A", "text": ["Workers all suck. My sandwiches always fall apart when eating and the older cashier is creepy as fuck. Not coming back again", "I've had pretty good experiences at this Subway location. As some others have stated, sometimes it seems like the workers are annoyed you came in and...", "This is one of the better Subways in town. The veggies and bread are always fresh and the employees are always super friendly."], "rating": [1, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 0.2], "keywords": [["sandwich"], [], []]}
{"id": "wzhuAthU_FbvSTHGOm3MAQ", "text": ["Walked over for a scoop of ice cream after having early dinner with friends. Apparently, this place is both an ice cream shop and a children's gift store....", "Thankfully O Town Ice Cream has nothing to do with that forgettable and awful boyband O-Town.\n\nThere is plenty of seating, both booths and tables, at the...", "The lemon custard was amazing!!! Old-fashioned ice cream parlor in my favorite little spot of Opelika... Place was clean, one employee working and she was..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["dinner"], [], []]}
{"id": "tQo3bF5TwaRcr1OqBVjLDw", "text": ["A-mazing!  Super friendly staff.  Very fresh cake and raised doughnuts.  All doughnuts have at least a glaze, so no plain.  The apple doughnut was like a...", "Loved the doughnut at D Square! They have a tendency to sell out in the morning, so make sure to call in your order first thing and pick them up. We also...", "Amazing donuts, super friendly staff, and locally owned. Can you get any better?!  I say, no. These are hands down the best donuts in Auburn. I highly..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.54, 0.37], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut", "cake"], ["donut"], ["donut"]]}
{"id": "UGt2CAEA6cOt-KLWgdVy3Q", "text": ["I'd sworn off Krispy Kreme after eating way too many original glazed doughnuts back in the day but found myself at a KK recently. Oh well, when in...", "Just went through the drive through with my loyalty app. The lady at the window was extremely friendly and helpful, and happily scanned both my loyalty card...", "Grandkids and I ate in today and enjoyed some quiet time. A couple of hours later, I discovered my wallet missing. I called and was assured it was there and..."], "rating": [4, 5, 5], "TBscore": [0.22, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["donut"], [], []]}
{"id": "aoaaUt-nhCprbQ_C4dLPew", "text": ["Great little brewery! Fun atmosphere! Good beer! Friendly and helpful staff! Yummy pizza and the giant pretzel is amazing!\nI would definitely recommend this...", "The beer is pretty good, there isn't any denying that. It's the only brewery in town so there isn't a whole lot of competition. I like the cozy, open...", "Came here with my friends as he had a beer tasting for 2 through Groupon but his wife didn't want to do that. So he and I had tastings of 5 different beers..."], "rating": [5, 3, 5], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["pizza"], [], []]}
{"id": "3Ol8G4FRat8exRVFP0GRUQ", "text": ["I was really excited to find this on our drives, but I'm just not impressed with the store at all. The produce looks nice and neat but the employees seem...", "Good luck getting service at the deli here. Stood there for 10 minutes hoping to get a sandwich. No acknowledgement from the few employees there. They...", "Love this place! I stopped by for the lunch time sandwiches & they're delicious! The sandwiches are so big & stuffed to the max with meat! I love there..."], "rating": [2, 1, 4], "TBscore": [0.0, 0.25, 0.53], "normalisedRating": [-0.2, -0.6, 0.6], "keywords": [[], ["sandwich", "deli"], ["lunch", "sandwich"]]}
{"id": "u6DyG67qcSDIWam_ytKnGg", "text": ["I had possibly one of my best dining experiences here. Our host was outgoing and nice, and our waitress was amazing. Our waitress came back often to check...", "Tropical sunrise with a Triple Dipper. Can't beat it. I enjoy the sliders, honey chicken and the southwestern egg rolls for my three choices.  Sometimes the...", "Great place to come at this hour of day 4:30 not crowded nor noisy. Atmosphere calming while enjoying comfort food.....\nOrdered the Cali  turkey club w/o..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.65], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["chicken", "egg"], ["turkey"]]}
{"id": "KblMvn0Ocg5x9ObyiwJFIg", "text": ["I was in town for three days and this Starbucks made me feel right at home!  They were genuinely interested in providing my favorite bulletproof coffee...", "Usually if there is no line for the drive thru, you order and get your drink pretty quick. However if there is a line, it may take some time. And this is...", "The absolute SLOWEST drive thru of all tome. Waited 30 minutes and it made me late for work!!!!"], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "MNPGmmxGo82_gu370YM8OA", "text": ["Many options from lattes to Turkish coffee.. Pimento cheese, bagels, oatmeal, falafel, salad... Good atmosphere. All is decently priced too. I got a peanut...", "Lovely environment and hot tasty coffee.\n\nI also tried the sausage egg and cheese biscuit.  Not as good as a place that specializes in breakfast food but...", "They have the BEST chai latte I have ever had. And they had a few flavor options for it like vanilla and raspberry but I just got a plain one and it was..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.48, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["breakfast", "egg"], []]}
{"id": "7odQ0PzGh33gwdxcXuy1SA", "text": ["It was my first time at this newly opened cafe. My friend told me great things about the virgin mojito so I was excited to try out a new cafe drink. Auburn...", "Great environment but the chai tea latte could use some help. Kinda tasted like hot milk....", "Stopped here for a quick breakfast on the way to the beach. This was close to the highway and the pictures were cute, so we dropped in. Little did we know..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "UTN_VcRt86cloSXSPY7cLg", "text": ["I tried this Jack's a few weeks ago and I am hooked. The service is good and the food is so good. I have eaten at quite a few restaurants in town and the...", "South College is flooded with fast food, so not really sure why they opened another one, but Jack's is pretty tasty. It originated in the Birmingham area,...", "We don't have this fast food chain in California so I have to review this place. This HAS to be the first fast food place I've ever seen to serve crinkle..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "-bseXffyReYDO54eKhtcVg", "text": ["The cafe is adorable, hip, and modern all at the same time. One entire wall of the cafe overlooks the fountain and the park. Even though it's oddly located...", "An upscale lunch spot with very reasonable prices (6-9). They have about four menu items that rotate weekly (usually a panini, a soup, and an entree+salad)....", "This is the best lunch in town TUESDAY to FRIDAY. Good parking, service, prices, and especially the food. Plus the JCS Museum is FREE! Try the soups and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.55], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["lunch"], ["lunch"]]}
{"id": "xAmnZ9jBh0IPBs0sXcPC9g", "text": ["AMAZING!!! The BEST staff and managers in the world. I spilled an entire pitcher and they gave me another free of charge. Best food best prices best deals....", "We had a great dinner and a fantastic server.  The beer was cold, the wings were hot.  What's there to complain about?", "Given this place two shots and both left me feeling very \"meh\". Appetizers are pretty good, and have a good variety, but the overall menu feel is that there..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["dinner", "wings"], []]}
{"id": "doo1S9rx3Yv18NxPJ8mBng", "text": ["Really good experience, great vibes staffs are friendly, the space is very cute as well!", "The Coffee Cat is tucked away in the perfect location with trendy decor. Love the unique touch on drinks- bourbon caramel flavoring! Lots of seating options...", "This is a super cool place! In a really cool town with lots of parking in the area. It's a good place to study or come with friends to catch up and hang out!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "sdb0WQNPca2PWFtonrdJpQ", "text": ["The perfect complement to a blisteringly hot day!  $2-$2.50 will get you a cup full of soft, delicate ice flakes with scrumptious flavors drizzled on top....", "Awesome place to kick ones feet up and enjoy a drink. Loved pulling away from life at this little stop", "Best place to come on a hot day. I have been coming here ever since I was a little kid and love it to this day! The owners/staff are so incredibly nice and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "GGqx2cmXhsVsQFR2BNW4uw", "text": ["So yummy and fresh! I love Smoothie King! I don't even live in Auburn but every time I'm here I go.", "THE SLOWEST FREAKING SMOOTHIE KING EVER. ALWAYS understaffed, slow, and rude. If you want one smoothie from here factor in 30 minutes!!!!", "I love this place! There are so many options of smoothies that the only trouble you'll have is deciding which smoothie to get. The smoothies are pricey but..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "uX_6YHVR32TqAA762ubXrA", "text": ["Pros: really good strong drinks (my favorites are the Victoria, a dirty martini, and their Moscow mule); their Moscow is the best I've ever had; good for...", "Two joys:\n\n\nThe Silver Dollar Suzy is the best cocktail I've ever had. Way to go, Alabama!\n\nGin, lemon, spearmint, peppermint, bitters\n\n\nThank jah that the...", "My new go to night spot in Auburn. The bar is more of a mature crowd which is perfect if you want to avoid the chaos that can be associated with a \"college..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.43], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "SEAvlxZ0fzY4HHmD-sS5Lw", "text": ["I've been going to SkyBar Cafe for years...first as a student and now as an alumna/adult! The drinks are cheap and the atmosphere is fun. However, unless...", "Hello! I am a white man that speaks spanish. I was waiting in line for the bathroom. i said \"que tal\" to an hispanic man. i was kicked out of the bar by a...", "You don't allow military from Ft Benning? Well then you don't need my business or that of everyone I know. Take your crappy restaurant and shove it up your @$$!"], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], ["bar"], []]}
{"id": "_MGJIZ8AmHxIBjXvImy5yA", "text": ["Very nice lounge and wife's favorite lounge, that is attached to Ariccia at the Auburn Hotel. They have excellent cocktails that can be enjoyed with live...", "Very nice lounge that is attached to Ariccia at the Auburn Hotel. They have live jazz on Friday and Saturday nights, as well as very good cocktails. There...", "We sat at the Piccolo Lounge bar one night after dinner and enjoyed chatting with the bartender while trying out a few drinks! It is a laid back atmosphere..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["dinner", "bar"]]}
{"id": "yh_Yc_vfQ1VOEmoY8gFkDA", "text": ["Awesome cigar bar. Rex and Suzanne have the perfect establishment for enjoying an magnificent cigar selection. Staff is very friendly and knowledgeable. The...", "Loved the atmosphere, and the set up of the outside tables. This a good little date night spot, but the drinks are pricey. The parking is very difficult...", "Found this gem during a short visit back to the plains after arriving entirely to early for my tee time. When I used to live here I was a huge fan of Cigar..."], "rating": [5, 4, 5], "TBscore": [0.8, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], [], []]}
{"id": "uXePDCFaeibzEv3DOKI4Cg", "text": ["We discovered 17-16 during the homecoming rain delay. Popped by for a quick beer and ended up watching the remainder of the game. It was not busy that...", "This always seems to be my best option when in Auburn.  It's always crowded, but never too cramped.  The inside bar is huge and wraps around, so you can...", "Bartenders are good but good to know that the fat bouncer with the dirt sack beard in the front and the broad enjoy stealing money from individuals who they..."], "rating": [3, 4, 2], "TBscore": [0.0, 0.7, 0.0], "normalisedRating": [0.2, 0.6, -0.2], "keywords": [[], ["bar"], []]}
{"id": "5PXMd9lYpI7zranY9gs92Q", "text": ["You will pay more cover in this tiny little bar than you would ever at Opera in Atlanta on any given night. It won't be worth it. The floors always seem to...", "Bourbon Street Bistro is a happening place! The bartenders are always there with a helping hand. The bouncers are there for your safety not to make you feel...", "Wasn't a fan of Bourbon Street - too much of a meat market scene, though honestly what bar in college ISN'T a meat market?\r\n\r\nThe place gets crazy crowded,..."], "rating": [1, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [["bar"], [], ["bar"]]}
{"id": "4eG4kBuT1ZJqQCEp8v1Abg", "text": ["I was impressed!!!'\nThought I was going to a good ole stuffing. And I did. But it was really good\nService 5+* great!!!!\nFried shrimp 5*\nBang Bang shrimp...", "A great place to be exposed to various country-style buffet. Definitely a lot of variety but the quality is its consequence. Very affordable and you can get...", "As far as buffets goes, this is A1. Very clean. Plenty of seating. And fresh food. Overall everything was tasty. No bland food or over cooked meat, so..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "QI8s6V1yqtjGLc5BZE9K0w", "text": ["You can't get Chinese food cheaper or a restaurant more gross in Auburn or Opelika than this. New China delivers flavorful and generous portions of Chinese...", "Sidebar... I was here visiting family. RUDEEE! I called to place an order and the lady on the phone was very rude! I asked if I could substitute the egg...", "Wonton soup not to bad, general tso's the best of everything I got. Chicken with garlic sauce had more vegetables then chicken but flavor was good, fried..."], "rating": [3, 1, 2], "TBscore": [0.0, -0.49, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [["chineese"], ["egg"], ["chicken"]]}
{"id": "41C0IQI2vDQN7XAFH89Nqg", "text": ["It was absolutely tasty!!! \nChewy knee bone soup with vegi.\nYou should try if you like a rice cake lol", "Not good at all! Been there three times, always bad service and terrible experience, and the Seafood Pie here tastes like burnt, every time..\nWON'T BE BACK HERE", "I had lunch here couple days ago\nFirst thing i noticed was the smell..\nIt was awful and place wasnt that clean either But the food was alright..(i had the..."], "rating": [5, 1, 3], "TBscore": [0.6, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["cake"], [], ["lunch"]]}
{"id": "aA-oHTSxJWUqbxhz3heKcg", "text": ["Absolutely one of my favorite restaurants on Earth.  Very welcoming and, of course, delicious.  Be aware though- the language and cultural barrier is very...", "A great lunch with a gracious host, Grace. We came at the end of lunch service on a sunny Saturday afternoon, but we were welcomed and coached through the...", "Hmm\nI would say Young Dong is one of the best Korean restaurant that I've been to while working at MOBIS. \nEvery time I have the craving for Korean food I..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.8, 0.55], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], ["lunch"], ["korean"]]}
{"id": "6KHpR408-5q4zIGTIyiydA", "text": ["We stopped on Christmas Eve desperate for Korean. We knew it was a winner when we walked in because it reminded my husband of Korea and they had an English...", "We all loved eating here including my 6 & 7 yo. Very authentic and super tasty. Some stuff spicy but it goes down very well. Recommend. Don't be afraid and...", "We stopped here to eat while camping in the area. We ordered a meal served family style and it was fantastic!  The short ribs were especially delicious, but..."], "rating": [5, 5, 5], "TBscore": [-0.3, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["korean"], [], []]}
{"id": "pZKEH7GZy2ys3mud5kV8NA", "text": ["The food is good. Setting is nice -  but the best part about this place is Peggy.  She is the sweetest, most attentive waitstaff and she's attentive and...", "Service - Excellent. It's rare that the service cares so much about their customers.\n\nDecor - A little dark inside, but still inviting.\n\nPrice - Wonderful....", "Just had our first experience ordering from Wasabi. We had the Steak Hibachi and Pad See Eww with beef, plus chicken katsu. The steak hibachi was delicious,..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["chicken", "beef", "steak"]]}
{"id": "razTLw5yKrRjUUBISBUnSQ", "text": ["Trust me. It's the BEST wing place in auburn/opelika area.\n\nNot to great atmosphere to dine in ( I recommend togo), but the taste of all the sauces are...", "It was okay. The food was pretty good, but it seemed to just be a Chinese takeout restaurant that happened to make tons of wings. The building was somewhat...", "Wings are par-cooked and tasted like old leftovers...strange seasoning on them, reminds me of the Tyson Anytizer frozen wings reheated up...\n\nShrimp fried..."], "rating": [5, 3, 1], "TBscore": [0.9, 0.36, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["wings"], ["wings", "chineese"], ["wings"]]}
{"id": "M8-tfV2NdJmsVFB8b14olw", "text": ["Just ate there last night for my anniversary.\n\nVery nice atmosphere. We chose one of the cute little nooks - they have little privacy booths - made my wife...", "They had minimal vegetarian options. Although some where not really vegetarian because they use fish sauce and the server was also not sure if they even had...", "Excellent sushi for a small town.  4.5 stars if it was an option.  Always reliable and friendly staff.  Try the bento box for lunch and don't be afraid of..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["sushi", "lunch"]]}
{"id": "keytcD3MSoGsIMbJJDHy1A", "text": ["If you like genuine Indian food cooked the way it supposed to be I highly recommend this restaurant. It's my new fav.", "I really enjoyed the lunch buffet.  Indian cuisine is not something that I have eaten a lot of but I have always liked.  I've had another Indian buffet that...", "Buffet, it's okay.  Not a grand selection but just enough to make it okay.  Food was good enough."], "rating": [5, 5, 3], "TBscore": [0.23, 0.55, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["indian"], ["lunch", "indian"], []]}
{"id": "bCJMollYKcdOvD40Wx-4LQ", "text": ["Excellent, excellent, excellent!! Ordered butter chicken on a whim (pregnancy craving) for a pick-up order while visiting family here from out of town. I...", "Very good! Samosas, Lamb Rogan Josh & Gobi Manchurian were delicious! Very nice server.", "We came in and were seated around 7pm and didn't get our food after 740pm. There were 7 tables in the whole restaurant and 5 of them have already gotten..."], "rating": [5, 5, 4], "TBscore": [0.6, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chicken"], [], []]}
{"id": "3xOSCdjaz0t_SyniJATFLw", "text": ["I went to Rias' Indian Cafe last night with my wife. We always celebrate our big events with dinner at an Indian restaurant. We had gone to Bombay Bay a...", "While on a TDY to Fort Benning I stumbled upon this cafe by my hotel and happened  to try it out three time. Here's my first experience the chef/ owner...", "Great peaceful atmosphere with great food, food is not heavy yet fulfilling. Ria is a wonderful hostess as well best place to get Indian food in town."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.66], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["dinner", "indian"], [], ["indian"]]}
{"id": "7GcYkxOzTbI_erqD3XfKtw", "text": ["Great tasting and fresh options! Very friendly, open and prompt service! Loved the samosas to start. The Lucky Buddha beer was flavorful and light. The meal...", "Great food and great service. The lunch buffet was well stocked, hot and had a great variety of meat and vegetarian dishes. The servers and the manager went...", "The food was GREAT! It is a little pricey...rice and a lamb dish with water and no bread or sides $16"], "rating": [4, 5, 3], "TBscore": [0.0, 0.66, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "5mwnNd0h3DgqoeniZyWF8w", "text": ["Food was delicious, I ordered the 5Point sandwich, it was nice and hot and tasted very good.\n\n4 stars for not having the lamb which is what I really wanted...", "UrbanTaali is a halal food truck, based in Atlanta, that launched in 2013. Like most food trucks, the name of this one is a play on words. In this case,...", "Went to Urban Taali when it was held at the Suwanee Food truck Friday festival in May, and there wasn't a whole lot of selection for me to choose from,..."], "rating": [4, 3, 3], "TBscore": [0.59, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["sandwich"], [], []]}
{"id": "Z5vTPUnG4sJVRe1mWHZ4kA", "text": ["Made our first visit to El Rodeo and it was fabulous!! We love Mexican food and have eaten at most of the Mexican restaurants in the area, but El Rodeo is...", "The best thing was the price. Plate was hot but the food was warm. The menu is very limited, no combo or make your own combo like most Mexican restaurants,...", "This was excellent.  This was one of the very best Mexican food I have eaten.  The restaurant has been remodeled and is very clean. The waitress was very..."], "rating": [5, 2, 5], "TBscore": [0.31, 0.41, 0.54], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["mexican"], ["mexican"], ["mexican"]]}
{"id": "T6BI6lSmQHKwPPpslpsKKA", "text": ["2018-9-14 This was not my first visit to this chipotle. I visit this location every time i visit my family member who is attending Auburn University. I have...", "I usually have an awesome experience here but the last two visits...not so much. I order online and schedule a pickup which is fast and easy. Love this...", "Came to chipotle hoping to get in and get out but instead came to neither, white nor brown rice available. Both rice took 15 minutes took, which was added..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "KPWd7ce7Mnu3seVf6DdQEA", "text": ["These women are AMAZING! I've been dreaming of my wedding day (and cake) since I was a little girl. My fabulous Mother-In-Law saw a cake that Carie had done...", "These folks made an amazing custom made lemon cake (Stranger Things Theme). Cake was delicious!  There was a mix up & for whatever reason we didn't get a...", "Carie and Cakeitecture Bakery made the most amazing cupcakes and cake pops for my son's birthday. She even delivered them to his frat house, feeding some..."], "rating": [5, 4, 5], "TBscore": [0.32, 0.8, 0.55], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
