{"id": "WQSl_0Z9u0qroobVLNzY6A", "text": ["This is my favorite place to go for lunch now. The Waterville/Oakland area has a shockingly low amount of fast/casual places to grab lunch for some reason?...", "This place has been here for a couple years and every time I come in the staff is so pleasant and makes amazing food every time! Very fast, convenient and...", "Went here for the first time today . We found the ordering process unusual , one line for cold another for hot . Of course we each picked a different line ...."], "rating": [5, 5, 3], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["lunch"], [], []]}
{"id": "dgMmGtalDjsxKdcsujhlqw", "text": ["Our new favorite stop on our way to the cabin! You can get frozen ready-to-eat meals, wine, fresh seafood, and a fresh baguette! The cheese counter is full...", "In my honest opinion, best lobster roll in the Augusta area!  I've tried them at nearly every establishment in the area (including Red Barn) due to the fact...", "I'd give it 5 stars, but I want their attention. Lobster roll was delish.  And they were nice enough to walk it outside for me even though this isn't a full..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "7cGPGeVKth8NrV9zGV9AAg", "text": ["My first trip to a Five Guys was last week when I visited this place in Westerville. It's been the stuff of legends with some of my friends so I figured...", "I usually love the burgers here but today I ordered on the phone and when my friend went for them and brought them back to me they had ketchup on them and i...", "Went here for the first time and I am in love  I love that they have a burger bowl option and they ask you if it's an allergy or a preference. This is the..."], "rating": [3, 1, 5], "TBscore": [0.0, 0.25, 0.42], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [[], ["burger"], ["burger"]]}
{"id": "QlRWqebPXuI0jbTXKn3HWw", "text": ["Heard nothing but great things about this place and they were correct. The ladies that work there are extremely friendly and if it is your first time there...", "Ok, hot dogs... welcome to America, where most people are overweight and should eat better. That said, their dogs are nothing spectacular and only taste...", "This family run restaurant has been operating since 1908 and not much has changed and that's good. Don't change what works. This delightful little  spot is..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "Dz-0B8UVUcf4jU34MB6XNA", "text": ["Stopped at Tubby's while passing through Wayne and knowing they've got a good rep for their lobster rolls.\nThat rep is well founded -- the lob roll is...", "Amazing homemade ice cream at a great price! This is a must stop for ice cream lovers! The portion sizes they show for scale are way smaller than actual...", "The place was packed but the service was super sweet and efficient. I don't mind paying premium prices for the real deal - Tubby's ice cream is the real..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "SSPWAJp-YnKO6LeJWclQGA", "text": ["We stopped here for breakfast on a Sunday morning. It was ok. I got a breakfast crepe stuffed with eggs, bacon, and cheese and it came with home fries. The...", "Basic breakfast.\nBreakfast was a little pricey here. \nFor 2 adults basic breakfast ( eggs, your choice of meat,  toast and coffee) will cost $26 excluding...", "The place is always packed. The wife and I went out for breakfast. The food was decent. The price was New York City. Lmao. Nearly $30 for some eggs, home..."], "rating": [3, 2, 3], "TBscore": [0.5, 0.0, 0.25], "normalisedRating": [0.2, -0.2, 0.2], "keywords": [["breakfast", "egg"], ["breakfast", "egg"], ["breakfast", "egg"]]}
{"id": "z9axr5wKyinDDSO6TNw2cw", "text": ["I've enjoyed Buffalo Wild Wings for years. I used to work for the one in Texas back 17 years ago so I've seen it when it was around earlier up until 2017....", "They had awesome food when they first opened. Now that they've been open for a while they have gone down hill. Ordered take out last night as I didn't want...", "My daughter stopped at BWW after work to pick up a Honey Barbecue Chicken Salad. She specifically asked for no meat on the salad. She didn't check her order..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, -0.6], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["wings"], [], ["chicken"]]}
{"id": "r-otG6-ca8XEW2tqqEFR4g", "text": ["Very nice every time I go in. Sometimes the older gentleman gets a bit irritated with me because I add so many extra things onto my philly cheese steak...", "I ordered a pizza at 6 pm, was charged, waited over 1 hour, I called the store, they said there was no order, and they canceled it because they were out of...", "Whoever was answering the phone needs a lesson on customer service.  Very rude.  I ordered pizzas for delivery waited two hours didn't show\n  So I called..."], "rating": [5, 1, 1], "TBscore": [0.36, 0.0, -0.39], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["steak"], ["pizza"], ["pizza"]]}
{"id": "F7Y8YJKcSQE6g8kjOWRuBw", "text": ["Randomly stopped in to this place and wow!! Great selection of flavors from standard to more eclectic (ginger snap with real ginger snap cookies, baked...", "Don't get me wrong, love their ice cream. Thing is... When you order a baby scoop, that's equivalent to tell scoops! I'm not joking\n\nSo if you order the...", "Wonderful ice cream place. Always very cleam and although they can be extremely busy with long lines, they have a system that works! Love the Dugout sundae"], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "qgmz4hoQtppdLxfBfQya2w", "text": ["Good ice cream!! Very creamy.. my favorite is the pumpkin ice cream in a waffle cone or a windup", "This place is cash only and no restrooms for customers. Sorry this place isn't worth it.", "Love the maple, maple walnut, blueberry and peanut butter! I am us wish they had a preemie size because the baby is a little too  big. Love this place!!"], "rating": [5, 1, 5], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["waffle"], [], []]}
{"id": "qwH1mQEN8EblOHG-FHrkTw", "text": ["I hired Coastal Critters to cater my central Maine wedding last year and people are still talking about how good the food was. Even my husband, who is a bit...", "We hired Coastal Critters to cater our Wedding in Bucksport ME just last month. Everything was fantastic. We had shrimp and scallop skewers, along with a...", "We recently had a large family reunion and after being disappointed by other caterer's cookie cutter menus selected Coastal Critters. James did 2 meals for..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "9VR_hWw3QUZhczXNvelbiQ", "text": ["Musings: This new location is just as good as the others (and closer to my house as well, which I haven't decided is a good or bad thing; only time will...", "I've had the pleasure of having Frosty's Donuts a few times. They are quite delicious! Unfortunately, many times I've come to find that they are sold out...", "Fun treats and family atmosphere, it's a good place to stop. The employees here are absolutely top notch. Only four stars for the review because I had the..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["donut"], []]}
{"id": "5YHoKtMs9T46o731jCGgrg", "text": ["Wonderful orchard and farm market. Apple cider donuts were the best after trying others. Homemade apple cider. Pastries and deserts. Pumpkins of all kinds....", "My weekly trip to my camp is never complete without a visit to this wonderful orchard on the way. In the summertime, it is stocked with fresh grown fruits...", "I was really excited to be living down the road from an orchard. Fingers crossed we went into the store today. I was not disappointed. \nFor $20 we got, two..."], "rating": [5, 4, 5], "TBscore": [1.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["donut"], [], []]}
{"id": "JtMhGrRx9ljr2NR1OYgPRg", "text": ["My love for Dunk's knows no bounds. I don't know what they put in their coffee, but it's good enough to drink black (and I usually do).\n\nThis location, in...", "One of the older ladies making the coffee was very nice, but one as we walked up rolled her eyes and she saw us. Instead of saying \"sorry, the frozen...", "Worst service and the most care free crew there. The cashier was friendly but the crew there was just a bunch of clowns. The lady who served the food and..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "0mZy4NB2YGVRIpYXkr27bQ", "text": ["Went in to get a fishing license for the weekend and was told they were \"too busy\".  Not very good customer service.", "Day's is a wonderful general store with everything from fishing tackle to groceries to gifts and clothing. Oh, and their whoopie pies are the best anywhere!...", "Thank god for this store. Was looking for a place to get some basic supplies recently and was pleasantly shocked. Who would've thunk such a great little..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "fq4ZnTisCqio-BvwCkFZYQ", "text": ["Theres always so many flies. I understand because its inside of walmart with the doors constantly opening and closing. But the donuts are uncovered and the...", "Typical fast food chain restaurant.  The staff is not very friendly, almost to the point of being rude.  The coffee is subpar and donuts are just okay.  I...", "Just a standard Dunkin's. Nothing really outstanding here."], "rating": [2, 3, 3], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 0.2], "keywords": [["donut"], ["donut"], []]}
{"id": "N4lL9suF6QfJ0UqCFWscEg", "text": ["A long line at the drive thru, but went relatively fast and accurately. Guy taking the order and giving it to us was so funny and personable, it really made...", "I don't normally go to Dunkin' Donuts, but I paid $3.55 for a small mocha latte (hot). I would have been better off paying that at Starbucks and getting...", "Slow, forgetful, and a little off.\n\nThis is the slowest Dunkin I've ever been to. We stood in front of the register, moving around and waving a hand trying..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], ["donut"], []]}
{"id": "Ym-4K2z2QuEy8n85AWwyYw", "text": ["There is no doubt this has always been my favorite placed go for breakfast or just to get coffee or whatever. It has always been 1 of my favorite places to...", "Hands down, CHRONICALLY the slowest service of any DD ever visited NATIONWIDE! Why did I waste my time returning thinking it was a temporary condition?", "I went into DD the line was very long, people were getting so angry, I finally got up to the counter ordered my coffees, and sandwiches, and the cashier..."], "rating": [5, 1, 1], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["breakfast"], [], ["sandwich"]]}
{"id": "ftxZUGlbv5ZvrQFv2x2FYA", "text": ["Stopped here based on yelp recommendation.  Bought bacon... thick, very flavorful and good.\nGot 2 pork chops with bone-in. Excellent,  tender, very good...", "I always make the drive from the Lewiston/Auburn area to come here. I would rather give local business my money verse big box stores. They are a small mom...", "Super friendly and great service, it what a butcher shop should be love the prices and better quality meats then hannaford"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "gytd1cj0yEFTZIQTfH3B4g", "text": ["Stayed in the area tonight ordered food the man answering phone was ignorant and quite frankly should never answer a phone from any company.", "It was made a few minutes before I picked it up but tasted so old and stale. Plus there wasn't enough sauce or cheese. Not enjoyable at all.", "Tried ordering delivery in the middle of the night to be delivered to Bog Rd in Augusta which is literally a 10 min drive. However the manager claimed its..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "qHR0aSRrt6SAt8TBJsDgOg", "text": ["Now in its second season, 168 Main is garnering well-deserved praise for the best Thin-crust Pizza for miles.\nThe steady stream of repeat customers is...", "Awesome brick oven pizza. Everyone was super nice. Will definitely go back! Dough was perfect balance of crispy and chewy.  The Margarita was yummy! Pizzas...", "Awesome Pizza! Sure, wood fired ovens make the best pizzas.... but this guy makes his own dough, and it is perfect. It is only open seasonally Fri-Sun...."], "rating": [5, 5, 5], "TBscore": [0.33, 0.59, 0.59], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "d2pFzo4mMJ0yC98F873KUg", "text": ["So yummy, quick and the price is reasonable! They have so many options, and even have non-dairy cheese. The garlic chicken pizza (forgot its actual name)...", "Pizza Degree in both Waterville and Augusta are great! My family loves coming here when we have our pizza cravings. Their pizza is so different from the...", "Great brick oven style pizza. Highly recommend any of the employee picks and a micro brew."], "rating": [5, 5, 5], "TBscore": [0.0, 0.5, 0.48], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken", "pizza"], ["pizza"], ["pizza"]]}
{"id": "L_MpkWb3q9AUoTcMbDkIrA", "text": ["Good: Pleasant interior, attentive, efficient service. Garden Salad was composed of fresh ingredients including broccoli florets. \nNot so good: Pizza crust...", "Great, accommodating staff right in downtown Waterville. We loved thin crust with Pesto! Excellent college vibe.", "Showed up in a Saturday night and got right in. They did a beautiful job renovating the building. Food was prompt, hot and yummy. It has only been open for..."], "rating": [3, 5, 5], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["pizza"], [], []]}
{"id": "2mUn_ozJiGLB6X0w9JKfxw", "text": ["Best garlic dough pizza around! They should show the other two locals how to prepare a pizza", "This is a wonderful little country store located in the heart of Litchfield. While it is no longer the only place to go, it is where the locals go and trust...", "Great little corner store. Good gas prices, pizza slices, whoopie pies. Sandwiches are hand made as you wait. Fresh pizza as well as slices. Baked goods and..."], "rating": [4, 4, 4], "TBscore": [0.44, 0.0, 0.4], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["pizza"], [], ["sandwich", "pizza"]]}
{"id": "qCRB6u-E8JFTh0xS4ERv1Q", "text": ["We did not plan to eat here. We drove by, we saw the line, the we got into the cue.\n\nWe waited for an hour in the line to get our food. The cashier was very...", "It's been about 4 months since my girlfriend and I stopped by Red's Eats on the way down from Acadia NP. I was thinking, do I really need to get around to...", "100% the best lobster roll I've ever had. Absolute perfect specimen of a lobster roll. Buttery bread, and came with like THREE lobsters worth of meat, which..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "vkqZcecPu-mPVltjDJCMTQ", "text": ["This place was not what we expected, but in a good way. What we thought would be a hopping and elegant bakery was actually a beautiful hole in a wall room...", "Went here once its right down the road from me. Had the Belgian chocolate chunk cookies they were good.\nBread was really artisan.  \nGreat atmosphere nice...", "Excellent little bakery in Litchfield. Bakery is located in an old historic home. The oven and kitchen is right in the middle of the bakery. There are racks..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "YWHSVF06bhYOsuxX8loGNQ", "text": ["I love that cafeteria , great selection for breakfast... creative sandwiches and delicious coffe", "If you're looking for somewhere to study or use the internet for anything productive, this is not the place for you.\n\nThe main attraction for Jorgy's is...", "No kidding, waited a half hour for a half sandwich to go. The young cashier apologized at least 4 times. I felt for her. The older woman working there..."], "rating": [5, 2, 1], "TBscore": [0.7, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["sandwich", "breakfast"], [], ["sandwich"]]}
{"id": "lG7aKyIAaAV8cKduqYf1pA", "text": ["Detoured to Farmington to Wicked Whoopies because of the good reviews.  They are delicious!!  I wish there was one in Texas.", "I am sooooo not a dessert person but the woopies are delicious! I'm so glad they have different sizes to choose from. I'm slowly working my way down the...", "The best whoopie pies!  The oatmeal and peanut butter ones are my fav.  Very convenient to be able to order on line and send to family out west."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "6RqKg6Lr-574QGRn_x_yog", "text": ["Great general store with freshly made bakery items like donuts, creme horns, bread, cookies and more. They also have home made pizza and sandwiches. Great...", "We had a spinach, feta and olive pizza tonight and it was absolutely fabulous!! I grew up on NY pizza and my husband on Boston pies. Our own dear Wayne...", "Very friendly owners, gr8 selection of beer and wine, delicious pizza and sandwiches, lots of soda and juice choices, all in the best small town in Maine."], "rating": [5, 5, 5], "TBscore": [0.49, 0.61, 0.56], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut", "sandwich", "pizza"], ["pizza"], ["sandwich", "pizza"]]}
{"id": "jxR8IjrITtgiIdxLxCgzew", "text": ["A fantastic place! The folks were very knowledgeable and eager to help. The wines are varied and delicious. The beer selection is great. It's worth a visit.", "My favorite spot to grab the latest craft beer, a local cider, or a wine I've never tried. Josh, Nate and Dave are all super knowledgeable with wine and...", "The owner taught me quite a bit about cheese while I was deciding what to purchase. A person who knows their product inside and out is worth buying from."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "mNpRsoovt8g29X4kPKGFfg", "text": ["Amazing fresh dough pizza!  Great sandwiches and desserts.  Reasonably-priced.  The only down side is that they close by 7 p.m.  Staff are professional and...", "A bit out of the way and hard to find, and not at all what you would expect from the outside.  When you walk inside and look at what they have to offer you...", "Not bad. Very middle of the road food. Juliette's is a pricey convenience store in a poor part of Waterville that also does pizza, sandwiches and, at..."], "rating": [5, 4, 2], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["sandwich", "pizza"], [], ["sandwich", "pizza"]]}
{"id": "fT_Iu3ZFkH_LJue3fTCoyA", "text": ["I love weird bars--they're my favorite. For a while I thought there weren't any to be had around central Maine. Enter Easy Street.\n\nI would love to know...", "Ok a great place. The drinks are wonderful and the atmosphere is fun and eclectic! I like they have a pool table and plush couches. Great place for meet and...", "What an interesting little bar/lounge. They have a great staff and a great selection of brews. The decor is also super funky and interesting! I love the..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "nutkGwx_C0EpJpMYXadqUQ", "text": ["First of all, this space is gorgeous. There are tables, comfy couches, beautiful art, and soft, beautiful lighting. My coworkers and I arrived for happy...", "Expensive!  Be prepared to pay upwards of $10 for a small drink or $7 for a half glass of wine. It's hardly the warm environment that some have described....", "Great wine selection, fancy yet casual atmosphere, careful presentation of wine and foods. Delicious cheese and meat plates that complement the wines well...."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "183CkBt06zBn6IGHBBxhiQ", "text": ["I don't know why I always assumed this place would be a complete dive, but that was the impression I had. It was a wrong assumption. Situated above...", "I was kind of surprised I had not reviewed this amazing place. They make a slamming drink! The BBQ..shut up good! Love the atmosphere...service is on point...", "Went to dinner with a few friends.  Dinner was great and drinks were good.  A little to pricey for what they had for good."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["dinner"]]}
{"id": "jxW7a2MaM2RLHa7uuCUeJg", "text": ["Great music.  Good burger.  Friendly and kind owner.  Come join the fun.  Great homemade salsa.  Open mic was great music.  And Jell-O shots for $1.  Can't...", "The Wharf is a great place to see live music almost any night of the week. Although it is a dark basement of a pub it has a nice feel in summer or winter. I...", "If you're in the mood for a dive bar, you can't do any better than The Wharf. Cheap drinks. Live music. Dancing. \n\nWhen I walked in the door, I couldn't..."], "rating": [5, 4, 3], "TBscore": [0.55, 0.0, 0.35], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["burger"], [], ["bar"]]}
{"id": "pr8HN6eALI_WNjGRgLTORQ", "text": ["Went down for dinner. Had plenty of TVs and multiple football games going. The beer was cold, popcorn available, and the burgers we ridiculously  good. It...", "They gave us spoiled gravy we waited 45 minutes to get are food and when we got our food it was cooled and mediocre.", "Not sure how they manage to afford to do this, but they have free wings (with purchase of beverage) from 4-7pm on Mondays. If you like wings, you should..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["dinner", "burger"], [], ["wings"]]}
{"id": "VjD2YyKb_OHSE6ExGp-saw", "text": ["Went last night (01-12) for a b day party. Was a party of 12 on a friday night but that didnt slow any service down at all. The waiter was on the ball each...", "A nice little pub for college students and young professionals.  The food is the usual pub fair, with burgers and fries and onion rings. The fried string...", "Always enjoy our time at The Pub- yummy burgers/chicken fun 1/2 price pizza night!  Fries are delish, fresh and hot!"], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["burger"], ["pizza"]]}
{"id": "NIzSHa3d3dmffaQTjLSVPA", "text": ["We stayed at the Best Western and came here for our daily breakfast that was included with the reservation. The food was delicious and much better than the...", "I stayed at the Best Western and had breakfast here with my wife and 3 kids. I got a breakfast skillet, my wife got a meal with eggs, bacon, toast, etc. and...", "Went to O'Briens for a good but casual Friday night dinner. We got seated immediately. Nice atmosphere in the bar area with TVs all on. We ordered loaded..."], "rating": [3, 5, 5], "TBscore": [0.5, 0.5, 0.27], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["breakfast"], ["breakfast", "egg"], ["dinner", "bar"]]}
{"id": "vDhj78ujE4GeeYXMP38okw", "text": ["We were warned beforehand to make reservations for dinner and I'm\nsuper glad we did so.  There was a sign when I entered for my 7:30 reservation stating no...", "This was the best sushi I have ever had! Me and 3 friends travelled an hour and a half to get here and it was totally worth it. We each ordered the omakase,...", "RESERVATIONS HIGHLY RECOMMENDED!\n\nSuzuki's knocks it out of the park. Keiko knows how to make some mouth watering, beautiful masterpieces with her food. If..."], "rating": [5, 5, 5], "TBscore": [0.42, 0.38, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner"], ["sushi"], []]}
{"id": "rUmuYvb_MxEe2U2a2fG1ew", "text": ["Wow.  The sushi and the tonkatsu at Little Tokyo were really good and I'd go back just for that but there's more.  The portions were large enough to make...", "The sashimi slabs were large and decent in freshness and was thawed out well. But the cuts were not great--just supermarket quality.\n\nThe vegetable stir fry...", "Little Tokyo had passable sushi. It was perfectly fine, but there are many other Japanese restaurants I'd rather visit. \n\nThe inside design had less..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["sushi"], [], ["japanese", "sushi"]]}
{"id": "ltapFUSSc33EbABWum86Lw", "text": ["From the moment I walked into this place till the time I left and walked out the door, the costume service was AWESOME!!!\n\nI went to another restaurant in...", "This is an excellent place for dinner! The hibachi is incredibly fun and delicious but for me, the highlight is the sushi. A big menu with a lot of variety....", "Best sushi chief ever! The fish is fresh, I love the salmon a lot! The environment is super nice! I will definitely come back to here next time!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.57, 0.38], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["dinner", "sushi"], ["sushi"]]}
{"id": "h3PGARv8E7fvJ4BmoAlHRA", "text": ["Great staff. Good food. We brought our 2 year old and were a little worried about it not being kid friendly but we didn't get any stares and felt really...", "DRIVE ON BY.....  I'm amazed at the good reviews here, maybe it's because it was several months ago and they were trying a bit then.  I've tried twice....", "Sushi and noodles! I think I have died and gone to heaven. There are few things in this world that I truly love, family, the Red Sox and Pad Thai. Tomi's..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["sushi"]]}
{"id": "8NkNRRHFsXqlEUeY5agjXA", "text": ["I'm not the biggest fan of sushi.  It's a hard world for us non-raw-fish eaters when we're surrounded by friends and loved ones who ADORE sushi! But, I...", "This place was awesome. The inside clean and modern. The food was great and the service was on point. The effort they put into the food presentation was...", "My wife and went there for lunch today. I knew we were in trouble when our server could not understand my drink order. I asked for a Vodka Martini stored..."], "rating": [4, 5, 1], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["sushi"], [], ["lunch"]]}
{"id": "1JQbWndLHoyE-qkLw5onLw", "text": ["One of my favorite restaurants in Brunswick.  The service is wonderful (I love the hot, moist towel to begin the meal) and the dishes are colorful,...", "I dunno... This place was really bland. \n\nWe came here after seeing that they had ramen. We order shrimp shu-mai for an appetizer. This came out with a few...", "I read other reviews and mine was pleasant.\nI ate here with family and it was scrumptious!\nThe prices were a little high for the amount of food/rolls we..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "wal3avUJAE-pr_PxcjROCQ", "text": ["Lotus is one of my favorite buffet style chinese restaurants. I found the staff to be very friendly upon entering and exiting the establishment. This review...", "Lotus Restaurant is perfect for when you are looking for something quick and easy. My family and I were starving and craving some Asian food. We found this...", "My family just loves Asian buffet restaurants.  When I have my kids over, or my husband and I are looking for something quick and flavorful, we start..."], "rating": [4, 3, 4], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["chineese"], [], []]}
{"id": "-Y0fpY-EXv5BXrcF_d8-AQ", "text": ["The food is really good and relatively authentic (for Maine, anyway). The service is fast. Prices are a bit high, but it is the norm for Thai food in this area.", "Came here a year ago and loved it ... today, not so much. The floors, entryway, bathrooms, and table top was not just dirty, it was filthy! \n\nOrdered the...", "One of the few good sushi places I go back to regularly. The service is average for the area but that's the only thing I think is average. At this point I..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], ["sushi"]]}
{"id": "RKXI7iY_jTemfV028QxtHQ", "text": ["I really love this place. Best sushi South of Portland.\nMy wife loves the hibachi.\nI recommend the surf and turf sushi. I also love the dried crispy orange...", "Below average meal. Duck sauce was some sort of sweet and sour concoction.\nCrab ragoons and Hot and sour soup was  good. \nRice was sticky and bland. General...", "Went to lunch with my good friend Charles  this afternoon. Beginner experience with an authentic Japanese miso soup brought piping hot in a wonderful..."], "rating": [5, 3, 5], "TBscore": [0.45, 0.0, 0.49], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["sushi"], [], ["japanese", "lunch"]]}
{"id": "_yWd9aCLHvOjut_VEndveQ", "text": ["I just did a 6-day ME road trip and this was by far my favorite meal. Nice ambiance, great wine and superb dinner. Brownie points cause it's in Camden which...", "The dumplings were an insult to dumpling everywhere.  Hardened wrappers and tasteless pork, and an horrible sauce.  I had one and gave it back.  \n\nService...", "Ate there the other night. Here is my review\nWaiting for a table\nWe came for lunch around 1:30 without a reservation. Big mistake. Very hard to walk in and..."], "rating": [5, 1, 3], "TBscore": [0.6, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["dinner"], [], ["lunch"]]}
{"id": "HY9M4pV39yEKcVJd_cfMjw", "text": ["This place has a great ambiance in lewiston, maine. Their sushi is good and the staff is extremely friendly. There is a bar area or you can sit at dining...", "I have only been to Orchid once, but its one of the better sushi restaurants in the Lewiston/Auburn area. I like to sit at the bar where the Sushi Chef is...", "I have been living in another state for almost 30 years. Been back for 2 now. Was a huge sushi fan and ate it regularly. Have not found a good place until..."], "rating": [5, 5, 5], "TBscore": [0.62, 0.25, 0.28], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar", "sushi"], ["bar", "sushi"], ["sushi"]]}
{"id": "nIujPGEnWzGhjDKCRuTg4A", "text": ["We haven't been here in years and everything was very good. We ordered at the restaurant to take home and the wait wasn't that long. We ordered a pupu...", "We were in the area antiquing and was looking for lunch. I of course prefers Asian cuisine and I'm also in company of family who like it too.\nUnfortunately...", "Nice choices, able to make substitutions, and delicious.  Perfectly cooked - not greasy at all!  Food was served quickly.  My only issue is that the one..."], "rating": [4, 2, 4], "TBscore": [0.0, -0.25, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "MOxKRuRqmqVBuo7qltnvfw", "text": ["Absolute garbage. At 6pm there was nothing that was fit for consumption. Everything was hard, cold, congealed, just absolutely awful. We left immediately...", "Came here for dinner on a Saturday around 8:30 pm, $17/ person, as part of a large tour group traveling to Maine from New York. It's a nice establishment...", "LOOKS LIKE THEY CLOSED AGAIN.  Place is locked up and dark.  Ten years ago this was the place to go, always a waiting line.  How times change"], "rating": [1, 4, 1], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], ["dinner"], []]}
{"id": "l2izSc0a2lhHLaDpK9MuZA", "text": ["Great place for great food. We went when it was in the 50's outside. We had reservations by the wood stove outside. Perfect time of year for it. Any colder...", "It's been a couple of days since a group of friends and I had dinner at Cafe Miranda. Let me preface this by saying, we are a chatty group, but when our...", "AMAZING food! Went out to dinner the other night and the service was outstanding and the dishes were mouthwatering! I highly recommend if you are new to the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.31], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["dinner"], ["dinner"]]}
{"id": "ULDu69xNT_ORQY2lAvQILw", "text": ["I have been to several Panera Breads during my travel and this one is no different from a decor and location perspective. This location is adjacent to the...", "Service was not very good. A worker was eating right next to where my food was being made and touched my sandwich with her bare hands. The sandwich was also...", "Very disappointed in this franchise. In the past month I have gone twice, ordered the broccoli and cheddar cheese soup and have pulled out a long black hair..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], ["sandwich"], []]}
{"id": "LCwunQc1n2LXeJpZEuecLw", "text": ["Portland gets the lion's share of attention in Maine when it comes to food. It's our largest city and there are a myriad of options across all types of...", "I have been here a few times now and I love everything! I love that Boba uses fresh local ingredients and doesn't compromise in traditional cooking methods....", "Really great Pho! Like every Pho I've tried it has its own unique flavors but still stands true to the traditional richness with a nice balance of savory..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "bbgBDKAPrrKxsytGpJVO0w", "text": ["This is a wonderful small restaurant.  We adore their House Bun dish, but soups and noodles are great, as are spring and egg rolls.  We always take doggie...", "The service....the food.....the atmosphere.  \n\nThe service was quick and inviting. The waitress and her helper were on top of things.  Our glasses were...", "The best Vietnamese in Maine!\nFood is very fresh but not so hot.\nOutdoor seating is a great value.\nWe stop by very frequently"], "rating": [5, 5, 5], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["egg"], [], []]}
{"id": "WPFIvly0usKXYEP-KoLowQ", "text": ["Great food - check\nGreat beer - check\nLive music - outstanding \n\nDo yourself a favor and go to their live music. The performers they get are amazing and...", "Cute restaurant, great staff, very friendly and accommodating, but honestly, the food is not that great, at least not what I received. I came by the other...", "Excellent menu. Great beer selection. Music. Laid back vibe. Really friendly staff. What a find! Came to listen to Griffin do a solo gig. He did not..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "QxlPT50biQD2S3sZOEr_vQ", "text": ["If you are in a small college town like Farmington, Thai Smile is exactly the restaurant you want there.  If you have one Thai place - having it be quality...", "I had been a frequent diner here for a couple of years until I noticed they sometimes add exactly an extra $1.00 to your card AFTER you've signed for the...", "Very pleased! Very welcoming and so far the best banana curry I ever had in years! My waiter was so kind and very attentive, who said is from Thailandia and..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "aiNlJMHDGxjrbyLYHXgpGg", "text": ["Stopped in for a quick lunch. Wife had chicken makhan, and I had lamb korma. Food was fantastic!  Will definitely be coming back!\n\nFood is served family...", "Absolutely exquisite. It's not very popular yet but it's the best Indian food I've had. Try the lamb curry , mulligatawny soup and papadum. The prices are...", "\"Food was just ok as per Indian standards...\" \nWe reached there just before closing time and it seems like they were not happy... haha...\nLike not..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.59, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["chicken", "lunch"], ["indian"], ["indian"]]}
{"id": "-ZieSG74Z_Pvk3T0Be-Q4w", "text": ["Lamb Boti Kebab and Chicken Tikka Misala are staples.  Good service.  Good people.\n\nGarlic Naan is a family favorite and the vegetarian in the family always...", "An excellent rendition of royal cuisine--Punjab being one of the Northernmost regions of India, and close to Rajasthan, the state of nobility. The familiar...", "The best Indian restaurant in Maine so far!\nJuicy, delicious and very authentic Indian food.\nGreat thing is the outdoor area"], "rating": [5, 5, 5], "TBscore": [0.32, 0.69, 0.72], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken"], ["indian"], ["indian"]]}
{"id": "UmplIokgSpGn59w3VxyJJA", "text": ["This place is legit, which might surprise you since it's in inland Maine and doesn't look very \"authentic,\" whatever that means. The curries are the stars...", "My husband, friend and I ate here this past spring. The restaurant was quite quiet, which was nice. The food was very tasty and full of flavor. We will...", "Throughout the years the service, atmosphere, and food at Mother India have remained harmoniously consistent. Despite all the new and shiny restaurants..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["indian"]]}
{"id": "SrzoIRcPh4uhxnMCWOflvg", "text": ["Hands down the best Indian cuisine found in Maine. A Brunswick staple. Friendly family owns and operates. Food is ALWAYS spot-on. Tasty,\nHot, fresh. The...", "What a neat spot! Supposedly the longest running Indian restaurant in Maine.\n\nThe ambiance here is great. We got in just before the dinner rush. Our server...", "I came here for the sunday lunch Buffet, as I was driving through the town. Chose this place as it has received great reviews and awards.\nHowever, I was..."], "rating": [5, 4, 3], "TBscore": [0.35, 0.8, 0.8], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["indian"], ["indian", "dinner"], ["lunch"]]}
{"id": "jY-EYm7BgUb4oW7soByA7g", "text": ["Ok I hate giving two stars. I ordered take out with a coworker. He drives 20 minutes to pick it up. People came in and ordered and he stood their waiting...", "Tried this place multiple times as I figured maybe I just had a bad run in. No. I placed two meal orders both times. Both times the chicken was grisly and...", "Took the family here the other night. The location is very odd nestled between local bar and Chinese place.  The interior of the place is very new and..."], "rating": [2, 2, 3], "TBscore": [0.0, -0.43, 0.0], "normalisedRating": [-0.2, -0.2, 0.2], "keywords": [[], ["chicken"], ["chineese", "bar"]]}
{"id": "p_64O-4EDYvVzX6k8js3wQ", "text": ["The food I got was pretty good, what you would expect from a fast food joint. They did give me close to 20 packets of mild sauce for no reason which I...", "If you like grade D beef this the place for you, horrible fast food poison, may taste ok but very bad for ya.", "have had better but is ok in a pinch . had a 3 taco combo it passed"], "rating": [4, 1, 3], "TBscore": [0.0, -0.3, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], ["beef"], []]}
{"id": "KZGU6jtySRDUvPn_KL7txg", "text": ["I have had issues a few times in the past with employees not being honest... I am partial to how the store was when Jim and Vicki owned it. \nHowever we...", "The pizza here is really good. Tonight my family ordered two large pizzas (one pepperoni and one mushroom).  Each slice included plenty of cheese and the...", "Dirty inside and out.  Gas prices are unreasonable."], "rating": [4, 4, 1], "TBscore": [0.0, 0.46, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], ["pizza"], []]}
{"id": "_LCVFPptWIq4tJNYr6_Aug", "text": ["We ordered the Pizza Mac pizza. We've had this pizza a few times, but this time we had them add bacon to it.... DELISH!!! It tasted like a big bacon...", "New owners, some things don't need changing! We recently ordered a pizza! Let's just say \" where's the beef\"? Little to no meat and little to NO flavor!...", "Tried them for the first time tonight with a pepperoni pizza. The sauce was way too salty , crust not good, cheese tasteless. Take your chances."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, -0.23], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["pizza"], ["beef", "pizza"], ["pizza"]]}
{"id": "hNZwq6VeeIzs7saO75ArvA", "text": ["Gray pizza, just the way I like it, crisp and flavorful. Reasonable prices, quick and friendly, dining area not fancy, but great for quick pick-up or sit...", "Just awful. The absolute worst excuse for food I've ever been handed. The sandwich I ordered was so skimpy, it might as well have just been bread. The pizza...", "Good Dagwood with fresh bread , plenty of ingredients . Liked the pizza . Place is clean and well maintained . The dining room has been all redone and is..."], "rating": [4, 1, 4], "TBscore": [0.38, -0.46, 0.49], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["pizza"], ["sandwich", "pizza"], ["pizza"]]}
{"id": "VAvaGRgchsbkIuUQxBNdFQ", "text": ["Road Dog Alert. This place is it.! Delicious. Super Fast Delivery. Polite professional driver and staff. Home made soup was perfect. The gyroscopes too....", "My husband and I ate there last night. We both ordered steak and cheese sandwiches with onions and mayo. I thought they were made well and tasted good, BUT...", "They made a women pay full price for day in half old pizza.... lost my business.  Rude to her and instead of working with the customer they treat her..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["steak", "sandwich"], ["pizza"]]}
{"id": "DcwU2sbP5XUezsqYAwx92w", "text": ["The cake for my 62nd birthday has been a hot with my 14 guests. Each one was in rapture by the moist dark chocolate cake that was rich bit not too...", "Carolyn and Edmund made our wedding cake for our wedding at Stonehouse Manor in Phippsburg, ME.  It was phenomenal!  The cake was just delicious.  We knew...", "They made our wedding cake and it was wonderful!!! The cake was beautiful and delicious! They were a pleasure to work with. Pricing was clear with no last..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.81, 0.59], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "bAJCMpM6QKE72TMEQOFBAg", "text": ["I like coming here since it's real close to where I live. They carried name brand Yum Yum Sauce but now they have the store generic brand, yuck. \n\nPrices...", "Great Hannaford supermarket. Not as huge as some Hannafords, but definitely as nice and with everything the larger ones have, plus it is easier to get...", "I ordered a plain white sheet cake and this is what I got... You can see the cake through the icing.. there are gaps where the icing should be... all for..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], [], ["cake"]]}
{"id": "6m60R29wxyXpUZcqXFvfOQ", "text": ["This is the finest ice cream in Maine -- highest quality ingredients, numerous honest flavors, and all hand-made by John. The coffee ice cream is beyond...", "Coconut chocolate almond and Quadruple chocolate ice cream, what else could make a pregnant woman happy? \n\nJohn's Ice Cream is both creamy and smooth. I've...", "My absolute favorite place in all of Maine for ice cream. My favorite flavors are the fruit and cream offerings. Today I tried raspberry and cream and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "MPy35P_dYkSRhFmW07losA", "text": ["The comment that the ice cream was better than Giffords is what brought me here. I have to say I was very disappointed. While the had a favorite flavor that...", "Oh you want to get ice cream in Waterville? This is the place to do it.", "Nice, homey place with a lot of different flavors of ice cream.  The ice cream\nItself was smooth, but unexceptional.  Coincidentally, I had home made ice..."], "rating": [1, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "RaJfN1zRG6oRBYfu1hHjTQ", "text": ["This fair may be my absolute favorite fair in Maine.  Before you argue with me, I know that Fryeburg is definitely the grand daddy of Maine fairs, but in...", "I'm giving this 4 stars instead of five because of the type of vendors. There are a lot of vendors that sell junk items not at least there are vendors! Just...", "We feel this is the best fair in Maine. Not too big or small. A good balance of agriculture and midway. 7 or 8 bucks entry. We enjoy the 4H exhibits and..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
