{"id": "FKXnwJufL-BBI61eDtSKTg", "text": ["My favorite sandwich place! They have very reasonable priced subs and are super filling. They have tons of different toppings and sandwich options. Very...", "Came by after working out at the Urec for a quick bite. Great sandwiches at a fairly low price. 7\" sandwiches range from $4-5.50 and a 14\" is $7-$10. 7\" is...", "Nice place on campus if you don't want to eat at the dreaded Subway behind Middleton or any of the artery-clogging Union options. \n\nCozy, yummy food, plus..."], "rating": [5, 5, 4], "TBscore": [0.28, 0.38, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["sandwich"], ["sandwich"], []]}
{"id": "wnRxWyEx8FooPhl6hZLMUA", "text": ["The staff is really friendly and they make excellent recommendations. Today, I realized I hadn't eaten yet around noon, and I started heading to a store to...", "Fantastic food! It's a small super market with a great butcher and deli. It's a made to order deli sandwich and it's a nice hole in the wall. You should go...", "If you are looking for a mom and pop kind of feel with a high end kick to it then Maxwells just might be your place.\n\nMaxwells has always set themselves..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["sandwich", "deli"], []]}
{"id": "X-oZORO6_QluIr-WsgTEBw", "text": ["What a great place to come and enjoy a decent meal. Absolutely love the salad bar, everything is fresh and the staff is constantly making sure the bar stays...", "For what it is, Jason's deli is right for me. I come here often. I like their low CAL menu. I get the heart happy/healthy turkey wrap. I also like their...", "Everything at Jason's Deli is great! I have been so many times and they never disappoint. Jason's\nDeli is great for a quick lunch or dinner! My go to is the..."], "rating": [5, 4, 5], "TBscore": [0.38, 0.0, 0.68], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], ["turkey", "deli"], ["lunch", "dinner", "deli"]]}
{"id": "1hIf7rteXNOGUHdHZkT_aw", "text": ["Best poboys in the world! I'm not kidding! I go to PBE about once a week and usually get the roast beef poboy combo at sharp road location. I brought my...", "Great food and good service. The Lyft driver was courteous enough to give me a great recommendation before going to my hotel. It was super bowl Sunday and I...", "My SO and I stopped by this Po Boy Express on our way home from New Orleans while driving though Baton Rouge and we absolutely loved it! I got the catfish..."], "rating": [5, 4, 5], "TBscore": [0.21, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["beef"], [], []]}
{"id": "9nXZ1PGly7yqKlVn4GWUIA", "text": ["Panera I love love so much.  There soup and salads are amazing. I wanted to get the broccoli and cheese soup but they didn't have any. So instead I got the...", "Years ago when they first started building this location I was genuinely excited. A fast and healthy option in an area I frequent? How that go wrong?...", "Hadn't eaten all day and wanted something quick and fresh, so I placed an order to go at 8:20 pm online. I realize they close at 9, so I ordered 40 minutes..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "I2VdauNn16cyqEgdjhewOw", "text": ["Another long wait delivery for one sandwich, one mile away.\n\nThe only reason they get one order per month or less from me.\n\nMay dispute the delivery charge...", "A step below Subway.  Service was sad and uncaring. When I asked for napkins, the employee completely ignored me.  Another customer ended up helping me....", "Ordered two sandwiches for my son and myself. The girl was very polite but apparently only rang us up for one sandwich. After 10 minutes we asked for our..."], "rating": [2, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, -0.2], "keywords": [["sandwich"], [], ["sandwich"]]}
{"id": "eeaZBNb-yyD1FfZ5vOahMA", "text": ["Delicious sandwiches.. This is my favorite sandwich place hands down. Deliciously fresh ingredients consistently made into the ultimate munchie. \n\nHowever,...", "Ordered delivery. Guy forgot my drink that I paid for. When I ordered the food online I requested that the sandwich be cut in half and it was not. Delivery...", "Honestly y'all are pretty good and shoutout to fast delivery but y'all really need to consider toasting your sandwiches. After a long day the last thing I..."], "rating": [4, 2, 4], "TBscore": [0.32, 0.0, 0.27], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["sandwich"], ["sandwich"], ["sandwich"]]}
{"id": "_iFm0qL7abDhimVnCPc9mQ", "text": ["Nice and quiet place to grab a quick lunch. The girl working works by herself and is pretty efficient and really nice. \n\nWe ordered \"The Soho\" which is a...", "I love having this restaurant at Price Leblanc to eat at! The Philly cheesesteaks are really delicious! Not too mention we got to get a free meal for my...", "First time here while waiting for my car's oil change. \n\nI ordered the Brooklyn bomber. Wow, this was my first time ever eating a bagel sandwich. Where has..."], "rating": [4, 4, 3], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["lunch"], [], ["sandwich"]]}
{"id": "M07ppHyVik54IwyqIAGC8g", "text": ["So when Zoe's first opened here, I was extremely excited. I thought for sure I'd be here all the time! However, I was wrong. I picked a couple of so-so...", "Great spot for a healthy lunch or dinner that won't leave you feeling weighed down. They have tons of choices - soup, salads, sandwiches, bowls. Everything...", "What can I say that you don't already know. They're awesome in what they do. There's no wow factor dishes they offer but they're great at work they do. This..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["sandwich", "dinner", "lunch"], []]}
{"id": "2AhUBwKIaCPP06A5g5QRew", "text": ["First time visit to the location down right off Highland near the new Shuckers. Just wanted to stop and check it out but left with a late lunch and a bag...", "This place is solid, especially as our pitstop between New Orleans and Houston.\n\nWe decided to stop at this deli, as it seemed by far the best option on our...", "Maddie and Emily were extremely RUDE, my friend and I have a Texas DL, and because mine was still vertical, even though i am about to be 22, they wouldn't..."], "rating": [3, 3, 1], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [["lunch"], ["deli"], []]}
{"id": "6xTxjSn5ClP5koUBAt2CNw", "text": ["Swung by to try out their contribution to burger week.  Burger was really good.  I didn't care for the chips, but I don't really like potato chips anyway.", "Amazing food and great service. We celebrated my son's birthday with a crayfish egg roll for appetizer and a crab cake croissant  sandwich that was one of...", "This is such a great restaurant! I've been here multiple times and every time has been perfect. The service is always on point and the food is to die for. I..."], "rating": [4, 4, 5], "TBscore": [0.45, 0.58, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["burger"], ["sandwich", "cake", "egg"], []]}
{"id": "zHKFySx_Wf2SKOEJ0ehMYQ", "text": ["The food here is yummy! There's a \"buy one get one free\" coupon in those Valpak coupons so I figured why not? This is the only place I've been to that asks...", "Grabbed an appetizer and played some games with a drink. Food and beverage were both really good. The staff were friendly to me and my friends. The bathroom...", "Wow,  was super impressed!! It may be a dive bar but it was definitely spot on with the food! The burger was juicy, flavorful and yummy! The bread was..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["burger", "bar"]]}
{"id": "An-sSPhPoFvBAfkEe8HLBw", "text": ["Best burger fore sure also it's huge!! Also great price and the milk shakes are on point. Soo good", "Some time ago a local magazine ranked Dixie Maid's hamburger as the best in Baton Rouge.  It is still the best burger.  I like mine with an order of tater...", "The best burgers and sausage sandwiches ever.  Juicy and fresh always.  The place is a hole in the wall but the taste makes it worth it."], "rating": [5, 5, 5], "TBscore": [0.72, 0.67, 0.53], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["burger"], ["hamburger", "burger"], ["sandwich", "burger"]]}
{"id": "-hIyQAXrzIhNwRWuXnwfrQ", "text": ["BEST FOOD IVE HAD SINCE I'VE BEEN OUT HERE. The food is amazing at both locations and Roul is super nice! Great service, highly recommend!", "This is the perfect example of not judging a book by its cover.\n\nFrom the outside you wouldn't know that there is an amazing burger waiting to delight your...", "I love how friendly everyone is here. The owner always shouts hello while he runs around working hard. Food is ready in a flash! Everything is homemade from..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["burger"], []]}
{"id": "qbvjhlJCy4GekwGOprcxMQ", "text": ["They get an A+ for customer service, but oh my there just wasn't anything exciting about that burger. So, I ordered a BLT... a double patty BLT. I've had a...", "Whoever go here download the app first or ask to be signed up for the rewards program you get the burger free when you purchase a side and drink. Your total...", "Quick lunch during my shopping spree to obtain clothing for my spontaneous trip to see the Saints play in Minneapolis. Lots of enticing options at the Mall..."], "rating": [3, 1, 3], "TBscore": [0.0, 0.22, 0.47], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [["burger"], ["burger"], ["lunch"]]}
{"id": "ZeEC6W2SD8T0q-hUcsWCLQ", "text": ["i can't go to baton rouge and/or gonzales without going here. ill be going back when i come to siknic, a car show held at lamar-dixon expo center, later...", "Best chili cheese dogs in Baton Rouge! As a child we ate at the one on airline all the time, so while home I a visit and out at LSU I decided to reminisce...", "I was thrilled to recently find a Wienerschnitzel in Baton Rouge. I used to eat at one as a kid all the time when I lived in Illinois and hadn't seen one..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "JOg3wUVctgIkM_BmrA7ARw", "text": ["Would have given zero stars, if possible.  Tried to use the new app.  After going through a ridiculous process of ordering, was requested to buy a $10 gift...", "Chili cheese coney! Yes please! Chili cheese tots! Definitely! I love my chili cheese! Sonic has all you can ask for really! I love being able to just drive...", "Let me tell you a thing or two about this sonic. This review won't be grammatically correct but it will praise the sonic for it's amazing service. Not only..."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "unXMSl9n6T_v0nOtYRvAkw", "text": ["This is daughter's favorite place to get grilled cheese! She claims that her grilled cheese is done to perfection! She likes how her grilled cheese is...", "This fast casual burger joint just opened in Ascension Parish within the last month or so...there's been one in Baton Rouge for awhile but had never had an...", "I'm in this area with my wife and young kids every week.  Saw that it was finally open and decided to give them a go.  \n\nIt's a fast food place...so I..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], ["burger"], []]}
{"id": "4vHpUeJcsMrdiG0DAoR8lQ", "text": ["Best sonic ever!!! These dudes were so awesome and kind...they even roller skate! Stop here for your cravings and for the customer service", "The service at this Sonic is the best, hands down. The food is hit or miss though.  It's not terrible, just not great. Normally the problems are with the...", "I'm not much for fast food, but like to get a sweet tea here, especially during happy hour. Occasionally, I'll grab a tater tot, as well. \n\nThe service is..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "Hlk_byPcUBPPbPug8BaMdg", "text": ["Consistently the least accurate, slowest, rudest, least honest BK I've ever been to, by far. Unfortunately, it's the closest one to my house, so I've been...", "I ordered for the first time in years from Burger King because I got tired of them messing up orders and my sandwich or fries being cold so it's been many...", "I have not been here in quite some time and the more recent times I have been was via the drive thru.  Part of the reason is that past experiences at this..."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [[], ["sandwich", "burger"], []]}
{"id": "SDB_3GPpxVrgmOJwpCFezg", "text": ["My review needed an update and this location is still an A-OK 3 stars for me (but improved service I'd like to say 3 1/2 stars). The spicy toastada is just...", "I thought the Taco Bell in Highland IL was the WORST TB in the USA.  This incompetent excuse for a restaurant is even worse. I would give it negative 10...", "Ok so let's start by saying, I'm from California. Taco Bell is always a fall back plan for late night munchies. Vincent was so nice and we got our food so..."], "rating": [3, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "6_kySYRGMdgZN_hnyaRlHQ", "text": ["Growing up in Shenandoah I can remember when George's first opened! I can honestly say it is still a four star neighborhood eatery to me!\nI am home to visit...", "Food is\nHit or\nMiss.\n\nBeer can be the same.\nI hate sipping a cold\nBeer\nAnd it\nReally tastes like it is old or has been warm and chilled and warm a...", "Not a huge fan. Very dingy spot. Feels like a hole in the wall place. You walk in and place your order or just write it down. And it's pretty expensive with..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "nKknKTbsjbiWEGt-QT-W-g", "text": ["Didn't particularly care for this place. Had the Louisiana Rub boneless wings with potato salad. \nThe chicken was greasy and very salty. \nThe potato salad...", "By far the best wingstop location that I've been to in the Baton Rouge area. The owner needs to model the other locations after this location! \nThe service...", "Popeyes across the parking lot was not in our stars but we see hope after spotting Wing Stop. We decide on the 10 piece boneless, a 40 piece crew pack and 6..."], "rating": [1, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [["wings", "chicken"], [], ["wings"]]}
{"id": "9JuIIDzSxlT06pdp0jJ10Q", "text": ["This place has free pool. That makes it awesome. There were dogs in the bar so that made it cooler. Also the wine was $10 a bottle. Value.", "Very fun place great drinks and good food outside area is very nice gathering spot to party.... not fancy but DEFINITELY comfy", "This was my go-to place for football games, fun nights out, and crawfish events. I will definitely miss this place. Most of the bartenders are super sweet..."], "rating": [5, 5, 5], "TBscore": [0.7, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], [], []]}
{"id": "nWzecJdhzcdASTZ5HUiedA", "text": ["It's called Paul's Deli now! I went there this weekend to check it out! They totally upgraded! The inside looks really clean and they take cards now! I...", "They have the best burgers in town! The shrimp burgers with extra cheese add jalapeños. YUMM!!", "Omg I just had the most horrible experience.\nLet me say I frequent this place often and always ordered the wings!\nWalked in and there were 2 small roaches..."], "rating": [5, 5, 1], "TBscore": [0.23, 0.5, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["deli"], ["burger"], []]}
{"id": "fJ5BhsY2QW0tC5Kt5Q1gwA", "text": ["We absolutely love the mythical meat pizza here. Also have great wings. And bonus...its next door to my hair dresser!", "I I would never in life spend a Dime here. Especially if You're African American. This establishment and its owners are RACIST and they enjoy filing...", "This was the only place open. But I would go back again if I was in the area. My husband and I both had calzones. Lots of food. Very fresh and tasty. Great..."], "rating": [4, 1, 4], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["wings", "pizza"], ["american"], []]}
{"id": "uj0OdCpjVaae6SDllT1HDQ", "text": ["It was my wife's turn to pick a place for our normal Friday afternoon lunch date and she picked a winner.\nI had the chicken fried chicken with mashed taters...", "I have been here twice, both have been mediocre. It's a cute place so I really wanted to like it.\n\nOn my first visit the service was slow and inattentive....", "My fiancé and I came here today for lunch for the first time! I had been itching to try this place just based off of the photos on their page. \nI had tomato..."], "rating": [5, 2, 5], "TBscore": [-0.35, 0.0, 0.31], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["chicken", "lunch"], [], ["lunch"]]}
{"id": "33A4WpPefkNeXwnEaZkTbQ", "text": ["The food here is ALWAYS AMAZING! The customer service is on point EVERY time I've been. I've never been disappointed with anything I've ordered. You...", "Good service.  Prices are so so. \nBut wing king they are not. \n\nNo seasoning on wings. No blue cheese. Only ranch.  Sauce was barely there. \n\nI will say the...", "Good wings, good service.  Food hot and to order.  I come here when I need hot wings fast!"], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.43], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["wings"], ["wings"]]}
{"id": "5IJqb2mjiQ7TeDHkpV5f1w", "text": ["While the kids enjoyed LSU softball camp we enjoyed some of the local food. Day one gave us a great waitress and I tried the devils on horseback appetizer....", "Well we came back to Walk-Ons today for my wife's birthday! Every thing was wonderful! The staff was great! Our waitress was welcoming and attentive. When...", "I find myself at Walk On's quite often during the week. I can always rely on the food to do the job and taste pretty good. I often order take out, which..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "MCpIb-XmDKRLdLnQ7IPg3Q", "text": ["This is a great place to get your fresh seafood.  I had the shrimp basket.  More food than I should have eaten. The shrimp had the best batter on them....", "We paid 13.50 for two shrimp and catfish plates, It was sloppy and didn't have enough shrimps and fish, and we didn't get too choose a side too go with it!...", "Don't go here! I understand this is a new establishment but no one knows what they are doing. Not the cooks, waitresses, or manager. There was a screwup..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "_3rpscctnvNDD3kPEj0pWQ", "text": ["A great Father's Day get together with my daughter, son in law and his dad.  Great service and great food. Had chargrilled oysters for the first time in my...", "Acme was your average middle of the road, college stop, \n\"let's just stop for a beer and appetizer\" kind of place.\n\nWe meant to get just oysters, because,...", "Great Place! I was there in Mother's Day picking up food for my wife and I!  \n\nThey have an Oyster Bar!!!! Who knew? I did because I read Yelp! LoL..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.9], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "laqZfcYxGCKAwJVTdBMOCw", "text": ["I love Jack in the Box. I've been eating at Jack in the Box my whole life. This one is clean and the crew is usually having fun. I like that. I have a...", "I love JiB, but this one is the best I've been to.  The employees are happy and care that you're happy.  They bring it out if they're slow.  And it's so clean!", "For whatever reason, this was the first time I've ever been to a Jack in the Box.  The burger was surprisingly tasty.  I had the bacon Swiss buttery jack..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["burger"]]}
{"id": "tcyO7fw9oqKeEvz_4Z1w8A", "text": ["Got my order wrong. No apology.. and had an attitude..the lil gay manager(I'm guessing)! The workers are disgusting at that place! They're fixing on the...", "I order a big fish sandwich, and got a fuck ass hamburger. They mess up my order", "This place sucks.  I wasn't greeted, the line was slow, my order was wrong, and the bathroom was disgusting."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["hamburger", "sandwich"], []]}
{"id": "sp_rUOk7Nm9szCgba4YAAQ", "text": ["The chicken was cold, over fried and I got the wrong order and I went right back in and asked for them to fix it and even showed my receipt and the manager...", "I'm a fan of Cane's just not this location. I've been here twice this year and service has been real slow both times (over 7 mins from the time I paid to...", "This Raising Cane's location is always solid. For what it is--a fast food place-- it's a 5 star establishment. \n\nI love the double drive-through. I believe..."], "rating": [1, 2, 5], "TBscore": [-0.28, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 1.0], "keywords": [["chicken"], [], []]}
{"id": "z5FXJQkFyf62owmdz1yVmA", "text": ["Have you had Raising Cane's Chicken Fingers before? If so, nothing at this location will surprise you. You can expect hot fried boneless chicken fingers...", "Multiple times I've requested a xtra canes sauce, been charged for it...it is truly disappointing. I'll just decide to go to Chick-fil-A next time.", "My first time eating at Raising Cane's (we don't have them in San Francisco). I'm not a fan of fast food but the beau tried their chicken since moving to BR..."], "rating": [4, 1, 5], "TBscore": [-0.32, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "8K5N_dzMXKNChPh0CUKB7A", "text": ["Worst customer service ever! Went to this Church's Chicken Restaurant 09/23/18, waited 20 minutes for my order, only to have to return and wait 15 more...", "Probably the worst experience for me period! Fast food or not. I've also work fast food before and never have I've seen so many people working with lack of...", "Whomever was working at this churches in the drive thru on 10/7/16 at 12-27 pm, had to be the most ignorant and rudest person I've ever met in fast food and..."], "rating": [1, 1, 1], "TBscore": [-0.28, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["chicken"], [], []]}
{"id": "1rAZ_d-axFzqQrIyjKDpLw", "text": ["I ordered the $20 family 8pc meal w/3 sides. The worker at the drive though menu went back and forth with me about the number of sides that I should...", "Recommend a drive by. Now offering a new twist to KFC original recipe. Get it crispy & crunchy. Twice disappointed..", "My hot wings were hot, fresh and pretty good.But 7.99 plus tax for only 10 wings is kinda high. Customer service was ok."], "rating": [1, 1, 4], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], [], ["wings"]]}
{"id": "fu0PsU8lmPdLX7__Xset_g", "text": ["Of all my times dining at this establishment there hasn't been one dull experience.  I regularly eat here and have never had any issue. Others may disagree...", "So thankful for Raising Cane's everywhere! When I want to eat fast food and don't want low-quality food, then Cane's is where it's at. I have never received...", "Start counting the chicken fingers....a six piece means 6 not 5 last time I checked.  It was 2 caniacs and both had 5 pieces....sign shows 6"], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, -0.3], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], ["chicken"]]}
{"id": "zgFxWCCDYjHqYiNorfGKng", "text": ["Albasha Express provides a convenient escape from the greasy and heavy foods that are indicative of the South. While the Mediterranean food certainly isn't...", "Same awesome Albasha's in a fast-food setting. Served in take-out containers with about 12 tables to choose from. I had the combo (chicken and gyro) plate....", "Great! Just wish they had tabbouleh for the veterinarian plate!"], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "x5NxQG8miu5ssE3_CPYEZQ", "text": ["Great food I always get my order quickly and it's hot and fresh. The canes recipe is great sauce is amazing the toast is on ten. Honestly a lot of people...", "Fast service and great food. Hot chicken fingers and great dipping sauce. If you are in the area and want raising canes this is your fix.", "Was hungry for seafood but line was too long at Tony's and this is right next door. Service was fast and friendly, food was hot and served quickly. The only..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "fVI2hTXtxRUlr3U4FpGDwQ", "text": ["Oh Raising Cane's. How I wish you would expand out to Florida. Eating at Cane's brings back great college memories, I can't be in a city that has a Cane's...", "Chicken that I got today was undercooked. Crispy on the outside, but the inside looks nasty.", "I haven't had Raising Cane's in YEARS up until recently.  I was driving back home to the MS gulf coast and was famished by time I got to Baton Rouge.  I..."], "rating": [5, 2, 4], "TBscore": [0.0, -0.53, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "ocmn9pioJqiCM9iyArglpA", "text": ["I love Geisha! Literally my favorite sushi place. All of the rolls are unique with their different flavors and sauces. It's the perfect size and portions. I...", "I've heard so much about Geisha, so my boyfriend and I decided to give it a try. Beautiful place- open space, very clean, tons of workers that were ALL...", "Went here with some friends and we enjoyed the food. The portions are huge. Our server was nice and she did a good job in explaining some dishes to us.\nThis..."], "rating": [5, 4, 4], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["sushi"], [], []]}
{"id": "B_1KhRZxECi_Ed4QExaI5w", "text": ["Service was lovely.... i would rate her alone as a 5.  She was at the table \"enough, but not too much\".  Lunch itself was good, we were both pleased but...", "Kona is beginning to be one of my favorite spots in Baton Rouge. The location in PERKINS Rowe is great, Happy Hour specials are awesome, and service and...", "Last night, we were here for a birthday dinner with a party of about 20. Right off the bat, I was shocked that our waitress didn't even know what a high..."], "rating": [4, 4, 2], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["lunch"], [], ["dinner"]]}
{"id": "wOdChHhavXyutv3D022j_w", "text": ["I was pretty happy to see a second Southfin Southern Poké location open on Corporate, across from Town Square. It is tucked into a nondescript strip mall,...", "Ambience: 4/5\nService: 5/5\nTaste: 2/5\nValue: 3/5\n\nI really wish I liked this place more. I came here for lunch one day and ordered a custom bowl (salmon,...", "I came in for the first time today with my mom and we were greeted by a friendly employee who was ready to help and answer some questions that we had for..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "nCQxH-qfeCGpjKNK_rEyhw", "text": ["I love sushi. I really do. I love sushi more than Green Eggs and Ham (by Dr. Seuss). Lol When my friend suggested checking out the new AYCE sushi place in...", "Yuck! \n\nI was expecting sushi, buffet style. I was sorely disappointed. Buffet had limited variety and small quantities in each spot. \n\nIt was very similar...", "Checked this AYCO sushi place out the first week they were open. \n\nThe establishment is very clean, our server, Wendy was nice and attentive. \n\nThe menu..."], "rating": [3, 1, 3], "TBscore": [0.37, -0.27, 0.35], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [["egg", "sushi"], ["sushi"], ["sushi"]]}
{"id": "67nya-zaKsp-Rq01IeS8xA", "text": ["By far one of the best international stores here in BR - all of their meats are slaughtered as humanely as possible fresh the morning before sale, the staff...", "This place got everything you want for real especially middle eastern food I love it. I think it would be one of my best places to go", "I've been here three times this week for lunch so far.  The food here is very good, fresh and the staff is very friendly.  I will be back for more."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "HbV_Ekj4pSQ80fpY4RLqNw", "text": ["I love that there's a Subway right before you walk in to Lowe's or right before you walk out.(which ever way you want to look at it.) I've made so many...", "The Resturant is adjoined to the Lowes hardware store.  Which is great for lunch and shopping. The service is usually very good and the staff is friendly....", "Wow! I can't believe I am about to rave over a subway restaurant. This is the subway in Lowes. I came here bc it's close to where I live. The workers were..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.69, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["lunch"], []]}
{"id": "cqudekOeI0Cvb4xkPWVhoA", "text": ["They've seemed to have done an overhaul of everything here. New employees who smile, greet and pay attention to their customers, and they no longer have...", "I go here because this place is close to my house. I always get the turkey 6 inch on honey oat. I really like the fact that this one has fuze raspberry tea....", "Usually Subway is extremely inviting and the service is great. At this location, it was a different story. \nWe walked in extremely hungry and had been in..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], ["turkey"], []]}
{"id": "vCxqLO4uElPQxsjVp-_fdA", "text": ["This might be the cleanest subway I have ever visited! The service was quick but yet my sandwich looked like the picture ! Thanks for not just smashing...", "Screw Thomas and his 5 star review. This subway is as gross as all the others. Terrible bread, microwaved gross meat. Don't eat here.", "Probably one of the friendliest subways I've ever been to. The staff is always nice and pleasant. It's also very clean and quick."], "rating": [5, 1, 5], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["sandwich"], [], []]}
{"id": "8XukOfAwGhI700S9wHCtGw", "text": ["I arrived at 10 am\nSandwiches prepared  ahead for lunch or catering  Its my first visit to this chain\nI ordered the tuna club $6.99, but apparently the...", "The number of times I have ordered takeout/ catered food here officially should make me their star customer, lol!\n\nBut, seriously, their sandwiches are...", "How can you go wrong with Jimmy Johns?  They are a very fast paced establishment yet they still manage to be friendly.   Decent variety of sandwiches made..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.33, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["lunch"], ["sandwich"], ["sandwich"]]}
{"id": "fVpcHVNUTHqyAqa6EbUv6Q", "text": ["Food here is pretty basic. It's pretty much that mall, filler food with decent quality. I almost always see an employee handing out samples. Because of...", "Yeah sure it's a national franchise, but this mall food court place serves a mean sub. I was very pleased with my cheesesteak which included grilled...", "I decided to try this place out after a few hours of shopping. It's located right by Izzos in the Mall of Louisiana's food court. The line isn't the..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "SdUMrIyoAowX9tB2bQLJMg", "text": ["Totally love this location. The sandwich artists are a hoot! They make the place! \n\nEvery sandwich we get here is perfect! You want it double-toasty? No...", "My family and I like subway.  It's usually fairly consistent, pretty easy and everyone gets what they want.  We started using Waitr recently and were happy...", "Was visiting a friend and was hungry.  So we decided to stop by and grab some sandwiches.  The place was busy during lunch time but the staff was very..."], "rating": [5, 2, 5], "TBscore": [0.89, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["sandwich"], [], ["sandwich", "lunch"]]}
{"id": "It_qMVnINSem80Wif6D2pQ", "text": ["What a terrible experience we just had with an employee there who identified themselves as a manager. Will be ordering from another store from now on. It...", "Running errand and needed a quick bite and JJ's was just the place! Went through the drive through and ordered the #3 tuna  and it was delicious. Very quick...", "I'm a fan of their subs! Every once in a while, I will stop by for a sub and switch up between roast beef or turkey. Their simplicity is all it takes to..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], [], ["turkey", "beef"]]}
{"id": "euLTPuqcd-TrpYxnoPMd2w", "text": ["This is the closer subway to LSU (apart from the one inside the campus). The staff is friendly, and I think its kinda cool. The ingredients are fresh and it...", "This subway is ran well. The food is fresh and the employees are friendly. Sometimes they are no where to be seen when you enter the building be that's why...", "It's Subway....but the service was a little slow."], "rating": [3, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "WgzdgARSWCmkIuPbMQogsg", "text": ["We found this place by following the signs for food off the highway. We were hungry and cranky and had been on the road forever! So despite having a craving...", "Ordered baked chicken white meat, with Mac and cheese, and green beans. When did they start putting cooked tomatoes on top of the baked chicken?? Soggy and...", "I have to be honest, I'm such a fan of this place. They're affordable and the food is really good. What else is there to ask for (that was a rhetorical..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "zNffBVAlHVv0G-0oF2QENA", "text": ["We are literally kids in a candy store at this very moment at Popaletas Michoacan. \nThis place is bright, clean, and has a wide variety of treats for all....", "My new addiction! Took my girls here with some friends who have been raving about Popaletas. First off, so many options to choose from! Homemade popsicles,...", "I've gotten the chance to visit Popaletas twice and I have to say that I love it more each time. On my first visit I was amazed by all of the flavors they..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "A4pivTJ7tUM9xlcvjbacDA", "text": ["Generic place, not bad when I came here a while back with a friend, the waiter was friendly and the service was decent.\n\nBesides that nothing interesting to...", "Listen you get what you pay for. To that end I paid the right price for some great food. I visited his location twice while in Baton Rouge and they were...", "Summary- bad Waffle House, bad!\n\nFood- 2 Stars\nWaffle House is for fast cheap morning slop, but this was worse than normal. We literally watched them hack..."], "rating": [3, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [[], [], ["waffle"]]}
{"id": "_hy6Xijw1mbXiVFKAMNtEQ", "text": ["I went here early this morning with a friend for \"late night cravings\". When we arrived, and employee told us that we may have to wait 10-15 minutes because...", "Food was ok they took care of me and my brunt waffle the services was nice and our waitress Ashely 4didn't want to get to full cus sleep comes next lol but...", "Heck yeah I am a fan.  How can you not be a fan of Waffle House?  OK... maybe not everyone can appreciate waffle House the way I do, but I love Waffle..."], "rating": [3, 3, 4], "TBscore": [0.0, 0.45, 0.5], "normalisedRating": [0.2, 0.2, 0.6], "keywords": [[], ["waffle"], ["waffle"]]}
{"id": "CReQtUlznsYv4Cv8JSXaXg", "text": ["Excellent food!  The cook was amazing! My eggs were absolutely perfect and I'm a little picky about how I order my eggs!  Hash browns were great!  Crispy on...", "Possibly the worst service that we have ever received at a Waffle House. We came in around 3 am and got a seat. There were no other people dining in at the...", "Decided to give it another try today.  Wished I hadn't wasted the time.  8am, 6 employees and the place still has dirty tables and everything is sticky...."], "rating": [5, 1, 1], "TBscore": [0.7, -0.31, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["egg"], ["waffle"], []]}
{"id": "1Kb6oKrTVMOVX7RFg57u1A", "text": ["Worst Waffle House location. The employees arrive late and then get yelled at my management in front of customers. Not only that but we sat at a table for a...", "We were not greeted manager and workers were talking to a friend numerous customers had to get their own silverware. My family and I waited 20 minutes to...", "Nothing better than eating in a fast and friendly environment. We were greeted as soon as we went in and our food was tasteful and quick to be at our table"], "rating": [2, 1, 5], "TBscore": [-0.43, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 1.0], "keywords": [["waffle"], [], []]}
{"id": "yOB2D2hY9LOsDjWfLJ98KQ", "text": ["Can I give less than one star? \n\nQuick: \n-Long wait time, no matter how many ppl working or in line \n-Poor customer service skills: not being greeted or...", "I come here ever once in a while when my bf and I have a sweet tooth and everytime we come back we think maybe this time it will be better .....nope. We...", "Every time I come here I get the same thing. Chocolate Devotion.\n\nEvery time I come here, regardless of empty or packed house, they always miss an..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "wOozkOtRR5D-YwTLx23Q8w", "text": ["I was so excited to see Baker was getting a Waffle House the one in Zachary is always packed. I'm sure once people realize this ones open it will be packed...", "This is a nice place to eat at other then IHOP it maybe sometimes be pack because of the food you have convenience parking so don't have to drive around to...", "Excellent establishment - Food was great and most of all the service was on point. Josh our server was very attentive and went out of his way to  make sure..."], "rating": [4, 5, 5], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["waffle"], [], []]}
{"id": "DZ3DExFOADeTplFXVucMrQ", "text": ["What can you say about this place?  No longer 4 words but known known as 4 letters with a P at the end although for promotional purposes earlier this year...", "On Christmas day, what is the one place that's for sure will be open? Yep, IHOP!\n\nI was half-expecting that the people who worked here on Christmas day...", "Long drive from stuttgart ar got to baton rouge @2am starvin like marvin walked in and was greeted with a smile and friendly service! Food came fast and was..."], "rating": [3, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "PLZxjkRV-auxc3K0W_IRBA", "text": ["Not very good...small portion sizes, (online ordering) made incorrectly, just overall not impressed. Can almost guarantee something else nearby makes what...", "It was horrible I had the stuffed pork chop with cabbage and mac n cheese. The stuffing was so nasty I couldn't eat it at all. The pork chop was dry and the...", "I refer to it as \"the waffle truck\" but it's so much more than that. The chicken and waffles brought me here but the creamy grits, smoky ribs and lima beans..."], "rating": [2, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 1.0], "keywords": [[], [], ["chicken", "waffle"]]}
{"id": "ZYWcPHTShOF6aFmaADIK9w", "text": ["This place is close to home and one of two places open for breakfast at 4 am. My out of town visitor arrived at 3 am (having heard the horrors of...", "Okay, come on, first of all it's IHOP. I am not expecting a gourmet meal or service that blows me away. I've never had either here. However, during the...", "The food is ok, but the service is slow and kind of rude. Unfortunately, they always seat me in the same section with the same waitress who seems to hate..."], "rating": [3, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.2], "keywords": [["breakfast"], [], []]}
{"id": "X3rJexnHEPrsegsaEwasoQ", "text": ["You cannot beat this soul food place! The food is great! The prices are great! The people are so nice! If you're looking for a hole in the wall then this...", "A lady told me about their fried chicken... It was great!! Great price for all the food. Candied yams and mustard greens were on point! I would go back and...", "I heard about this place from someone on Facebook. The resturant is kinda easy to miss if you have never been to it before and is located in a building that..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "AcmdmKctYUjYdwh0obGk5A", "text": ["Baton Rouge has so many seafood restaurants, but Mike Anderson's is definitely at the top of my list. It is located off of Lee Drive and has its own parking...", "Today wasn't the best day for the seafood gumbo I raved about in a previous review. I had more okra than anything else. It wasn't seasoned very well....", "About 10 years ago, we visited Mike Anderson's on a road trip. We had read about the restaurant in Southern Living. We were traveling again through Baton..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "HaZCHgF-jS3HloxiJvKvuw", "text": ["Man where have I been that I have never eaten here before. I went to a women's bible study and the food was catered by KC's grill . I didn't eat the food...", "Let's get down to business... had lunch here on a Friday and, lucky me, it was crawfish fettucini day!  It was the best I have ever had.  The portion size...", "Where to start...\nService! \"How can I help you?\" What am I here for? Do you do anything more than serve food? I'm here for a table and a menu! Maybe I'll..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], ["lunch"], []]}
{"id": "kYT0WRCL5CWydb-O2R2Gug", "text": ["This place is legit.... Great poboys made on Leidenheimer French bread. Boiled crabs were excellent. Great cracklins and \"salmon candy.\" And don't forget a...", "Sorry, the plate says it all! Maybe they were having a bad day, but the food should always come correct! My friends and I would have loved too give it more...", "Thank you Yelpers! Driving along I-10 with a hankering for some crawfish etouffee came across this spot and it was fabulous. Had the special of crawfish..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "Nmd7sZHUVB-pF6StrZrA1Q", "text": ["Best food on our 2 week vacation to the south. I wanted to try crawfish Boil and this was the only sit-down restaurant still serving them (we were...", "I came here on a Friday afternoon for lunch. Our server was very friendly and greeted us right away. The menu had a wide variety of foods--poboys, soups,...", "Hubby wanted to try a new place. After looking through the news mobile app and finding the advertised price of $2.29/lb he chose this place. \nBeing that..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.22, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "M9shWaA8LyrxYoTJ-CQjgw", "text": ["If you are looking for an all out seafood selection the Cajun way you found your spot! Montalbano's offers a wide range of seafood options cooked several...", "Fantastic food at this little hole in the wall place!  It is crawfish season and I am there EVERY week, because I just can't get enough.  Their crawfish are...", "Love the new spot, so glad to see that they have rebounded after the flood. \n\nI needed to get my seafood fix while home and this was the perfect place to do..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "ABMumPl2qsRkdh1Dxuqv-A", "text": ["My Wife and I went for diner on Saturday Sep-1st and noticed that it was very quite especially for a Saturday evening.\n\nWe ordered our drinks I had a glass...", "We went here on a Friday night after we tried for another spot and couldn't get in. The only thing that really took away the one star is when we first got...", "Update: The Juban's gumbo is the star of the appetizers. Skip the seafood gumbo - it lacks depth of flavor. The Gulf Crab Cakes are always good and can be..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.7], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], ["cake"]]}
{"id": "72RNWzfsJI2RJhPbvK2e5A", "text": ["Always enjoy the seafood etouffee over dressing with fried fish \nLarge portions \nPriced reasonably for the amount of food served on plates", "The smoker rabbit sausage sandwich was excellent. Everything on the menu looked good. Next visit to Baton Rouge I'm returning here always. \nIt's basically a...", "Simply amazing Cajun food and a fantastic value...huge portions for the price. The owner couldn't be nicer or more generous...he gave us samples of 4..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.57, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["sandwich"], []]}
{"id": "jzERROJpqWblmN3ViLUOlQ", "text": ["My favorite place! The Pho is amazing! Service is always quick and friendly! Seriously have never had a bad experience here!", "Nice atmosphere and good food. The grilled pork rolls (#3) were a bigger hit than the spring rolls with shrimp (#1). I enjoyed my grilled beef and shrimp on...", "My second favorite Vietnamese place in town (after Dang's). They have some really interesting items here, such as the ground pork/baby clam dip (#99) and..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.45, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["beef"], []]}
{"id": "ImD2PKwrRTYeGRgORUxPeQ", "text": ["Don't go to this store.  Food was nasty and they made us sick.  Turn around and go somewhere else", "Crew is nice but they mess up a lot. Today I ordered an oreo blast and got a big ole cup of ice cream with like one oreo mixed in. I got a refund and gave...", "As soon as I pulled into the parking lot, I saw a vehicle moving from one space to another. I just thought it was weird until I pulled into a spot only to..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "YhB_PwN9KSXO0pN9qfd-2g", "text": ["GOOD MORNING YELP! Marco and Elijah are amazing! Due to an illness, I have been relying on this place for vital nutrients - and these guys at THIS PLACE are...", "Stopped by for two smoothies today, I got the light and fluffy and the angel food! So good, love smoothies as a healthy-ish treat every once in a while....", "I love this location! It is convenient and super friendly. I always get the vegan-mango-kale smoothie, substitute the bananas for strawberries, and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "NdeVxQUpvEqo-Bm4zCC7tg", "text": ["I love Mary Lee's! I'm obsessed with donuts and since I left my diet after I stopped working out (at AnyTime Fitness next door--don't judge!), I can't help...", "Donuts had good flavor(average). \n\nKolaches were very dry, definitely won't be ordering again. \n\nGood customer service.", "Much better than all the other Mary Lee's ! Bigger selection! Bigger donuts and friendlier staff!! Always my choice over the other locations!!"], "rating": [5, 3, 5], "TBscore": [0.0, 0.33, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "teqPwOW025T9XzoIEBQKPQ", "text": ["Theses donuts are still frying when they hit my mouth... consistently. The staff is friendly and they have enough employees to keep up with demand. If you...", "Stop here to get a dozen of donuts for my employees and its always a winner. There consistent with taste, always fresh and warm. I wont  venture again.", "It really just does not get any better than Mary Lee Do-Nuts. They have become a Baton Rouge tradition, with multiple locations throughout the city. This..."], "rating": [5, 5, 5], "TBscore": [0.21, 0.38, 0.23], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "Lzc9k5Gzk9vb30Z_SCBLLw", "text": ["I love the variety of donuts here and the staff is always friendly!! The drive thru is very convenient! I love how they decorate donuts according to the...", "Great donuts. Only reason they even run out is because they are so delicious. Get here early to get the best selection.", "Got there at 7:45am and they had already ran out of glazed donuts. Never seen a donut shop run out and not offer anything else. Won't be coming back."], "rating": [5, 5, 1], "TBscore": [0.46, 0.58, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "JvTKrmxBW8bYhSIqQ0vaTg", "text": ["I came here this AM just because I wanted to grab some donuts for my daughter. It was about 9:45am and perhaps they just finished their morning sugar rush...", "There is no donut better than a donut from Mary Lees. They are warm, doughy, and sprinkled with sugar! I love getting the donut holes, but it's hard to not...", "This is our favorite doughnut shop in Baton Rouge. Ms. Susan makes us feel like part of the family, and greets us warmly every time. The glazed and..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.36, 0.55], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "a-Es_LQZUfZP0520_7MKMg", "text": ["I can confirm the review from 2011 that this Mary Lee is an excellent mainstay here for great tasting donuts from a well run shop. \n\nOur family has been...", "I was surprised on how few donut shops exist in Baton Rouge, but got the craving one morning and this one was conveniently right on the way, although I...", "My favorite place to get glazed donuts & kolaches! The service and quality is always consistent. The owners are also super friendly and very family-oriented."], "rating": [5, 3, 5], "TBscore": [0.9, 0.0, 0.36], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "ucbexUWgito2vWZE2BNIxA", "text": ["It was an already busy morning filled with errrands and tasks that needed to be done before the day ended. When I saw this place, I was reminded that I...", "This is our favorite spot for my daughters birthday! It has been a tradition since moving to Baton Rouge! 4 years in a row here at Mom's Donuts!!", "We've been here several times and each time they impress me - the donuts and kolaches are delicious and the staff is incredibly nice. \n\nI adore donut holes..."], "rating": [4, 4, 5], "TBscore": [0.0, 1.0, 0.53], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["donut"], ["donut"]]}
{"id": "2vlUf3HRiam705oIE8hLJA", "text": ["Surely did not know Mikey's Donut King has a full breakfast menu. \nEggs and Rice, Pork Chops, Eggs, Grits, and Biscuits along with the selection of donuts....", "The food here is wonderful! Porkchops are tender and Delicious, eggs cooked to perfection, hashbrowns are wonderful and sprinkle with Cajun seasoning giving...", "This place was somewhere I would stop at for a quick breakfast on the go, but today I was disrespected and yelled at by an employee of this establishment..."], "rating": [4, 5, 1], "TBscore": [0.42, 1.0, 0.33], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["donut", "breakfast", "egg"], ["egg"], ["breakfast"]]}
{"id": "m9CZ12cGvqP-EsF7sU1DKQ", "text": ["It's Krispy Kreme! Who does t love a hot glazed kreme donut? I stopped in one morning to get breakfast for my employee. I needed 6 dozen, the cashier, so...", "When the hot light is on, it leaves you with no choice but to stop in for a fresh dozen of the best doughnuts in town. They simply melt in your mouth and...", "I would simply advise you that if you, your kids, your family, or anyone loves donuts stop in when you see the red Hot Now light on. You can't hear the hot,..."], "rating": [5, 5, 3], "TBscore": [0.38, 0.39, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["donut", "breakfast"], ["donut"], ["donut"]]}
{"id": "pK3QNl0Hvh_RXWeEzLSgfg", "text": ["Our go to for the donut fix. Love the apple fritters and cinnamon buns too.\n\nAnd they serve THE best coffee......Community Coffee.\n\nGood location too.", "Husband and I came in at 11:15, they close at 12. We even called before to make sure they still had donuts. Donuts were fine but the employees were SO rude....", "There are a dozen and half of these in and around Baton Rouge, and after having been to several of the others (Florida, O'neal, etc) I think this is the..."], "rating": [4, 1, 5], "TBscore": [0.73, 0.21, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["donut"], ["donut"], []]}
{"id": "C21yVcBE_g_vxzLb1zGfrQ", "text": ["What hidden gem! Located in central, this drive-through family own donut shop is a must to try. Lucky for me and my coworkers it is directly on my route! \nI...", "These donuts were horrible. I had a glazed donut and couldn't get the taste of dirty oil out of my mouth. I hope the owners read this and step their donut...", "I have eaten these donuts while interning at a local high school, and they do not disappoint.  Baton Rouge does have some good doughnut shops, and Central..."], "rating": [5, 1, 5], "TBscore": [0.0, -0.8, 0.21], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "aMA_0Dr7D76bW9xMKpaC_A", "text": ["Yum! I had a kolache and my daughter had a braided doughnut. We both got 2 free donut holes, and the nice man at the counter gave my daughter a hot glazed...", "the kolaches are to die for. the staff is friendly and the donuts are always fresh and yummy. they usually throw in a few donut holes for free too", "Fresh donuts with great texture and flavors the kids love. They also have breakfast sandwiches but you'll wait a few minutes for those. I think what we like..."], "rating": [5, 5, 5], "TBscore": [0.42, 0.0, 0.35], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], ["donut"], ["donut", "breakfast", "sandwich"]]}
{"id": "XbEXRxQcEh5xqcTM8BnPAg", "text": ["Good visit! This is definitely one of The City's oldest locations. It tends to be a little less expensive than some of the other ML locations. Fresh, hot...", "I hate to say this place is very overrated :( The donuts are ok, the coffee is ok, the people are very nice. I respect the fact that they've been around a...", "Good donuts. I love there chocolate covered donuts."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.6], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["donut"], ["donut"]]}
{"id": "WpTzoYO3tKIx34WRdCRKzw", "text": ["Daily donut is a quaint little shop tucked on airline Hwy in Gonzales that serves up warm and fresh donuts and pastries daily with a side of always friendly...", "Best donut holes I have ever eaten! The owners are very friendly as well. Highly recommended!", "I love that place.  Great donuts and excellent service!  Krispy Kreme has nothing on them:)"], "rating": [5, 5, 5], "TBscore": [0.0, 0.56, 0.7], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "GCOxvMvElq1_HfDz6WuGYg", "text": ["I love donuts and these little mom and pop stores put all others to shame! Such a sweet family who make the most beautiful and creative donuts in town! I...", "For whatever reason, no restaurant of any kind has ever made it here. This may be another one. They can't seem to follow their own schedule. Not the...", "Really friendly family owners! They exemplify the concept of Louisiana lagniappe. They always give you \"a little extra.\" The last time I went in, I got..."], "rating": [5, 1, 5], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["donut"], [], []]}
{"id": "IF2WVRosIl5QRatz8YGI2g", "text": ["Excellent service!!! Another great yelp find. Don't be scared of these \"little pigs in a blanket \" they are sooooooo good!! Not all dough and great tasting...", "I haven't had the pleasure of visiting this donut place, but my co-worker lives around the corner from them and swore they were the best. She finally...", "Nice surprise at the work this morning.  Someone brought little sausage rolls from Southern Maid. First time sampling anything from this place. Boy were..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["donut"], []]}
{"id": "mUwmGMyYegEHOIwX3iLSTg", "text": ["This little bakery is an amazing place! It is located next to the famous River Queen Drive In on Highway 1 in Port Allen. It is very popular with the...", "After days of driving past this tantilizing bakery, I had to stop and check it out for myself. The service was fast and friendly. The plain glazed donut was...", "I am one lucky girl, because this place is within walking distance to my house...which also makes me a fat girl, but I'm fat and happy. \n\nGo traditional..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["donut"], []]}
{"id": "RPdiWyzFpCbctsG2Df2Dxg", "text": ["I stopped here one morning on the way to work and boy, was I surprised! Warm and delicious are only two words to describe the glazed yeast doughnut I had. I...", "97% of the time you get hot donuts! I wish they had more of a variety for kids with bright colors and different designs. Overall great quality and good...", "Coming from north LA I'm a lover and devotee of Southern Maid Donuts... however my niece and son turned me onto Mary Lee's and I'm thankful they..."], "rating": [5, 4, 4], "TBscore": [0.43, 0.43, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "APj2hKva04QZmXWZs5_iEg", "text": ["Just heard there was a new steakhouse in Central on Hooper and Blackwater Rd so I went there for lunch today.\nThere was a smiling hostess by the door she...", "I really enjoyed coming here and the food and service was great. They are currently on a limited menu (see photos) but it's all very good. The steaks were...", "We decided to try a new place near by our home last night. And we were served Chicken Alfredo fries with no chicken and a fully dressed hamburger with..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["lunch"], ["steak"], ["hamburger", "chicken"]]}
{"id": "AZqlHvpXGHtfVcf46-q7Ew", "text": ["I called in an order on a Sunday night, and got the medium pepperoni power pizza with extra cheese. It came out to almost $18 but was fresh, hot and super...", "Johnny's Pizza House reminded me a lot of a neighborhood pizza place back in my hometown (in California). It was night of my 15th wedding anniversary and...", "I hate pizza. I know that this makes me a traitor to my country. That being said, my family loves this place. All of these stars are for the fact that they..."], "rating": [4, 4, 3], "TBscore": [0.22, 0.0, -0.8], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "ldyKSQjJyDDoAJGe4ml0tw", "text": ["Schlitz is one of my go-to places for carry out pizza. It's so delicious and fresh, you can't possibly substitute it with any other chain pizza delivery...", "After having gotten a few good pizzas from this location, got a really sub-par one last night.  The crust is now super-thin, reminding me of what I'd gotten...", "Stopped in here the other day for a late lunch and was very satisfied. We had no wait since it was that weird in between lunch and dinner time. \n\nWe had the..."], "rating": [4, 2, 4], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["pizza"], ["pizza"], ["dinner", "lunch"]]}
{"id": "5FeHsZflix4ALgcO4refGA", "text": ["I think about this pizza everyday. Three Cheeser Pepperoni Pleaser on garlic+herb crust was my go-to when I was doing my undergrad at LSU. I get it whenever...", "'m very tired so excuse any errors because it's 3 am and my pizza was just delivered (placed order at 12:40). \n\nAfter waiting an hour and a half I called to...", "Decided to try this place after staying up all night and luckily this place stays open pretty late. They also deliver pretty late which is pretty great. I..."], "rating": [5, 1, 3], "TBscore": [0.0, -0.25, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["pizza"], ["pizza"], []]}
{"id": "u0pxJF6eVZzTUstdA6IyHA", "text": ["Made By hand with love. New York style. Great meatball po-boys. 5+ salads. Owner really cares. White or red sauces\n\nNeed cauliflower crusts otherwise 10 out...", "This is the closest pizza joint to us, so we frequent it, but that doesn't discount the fact it's just really good. \n\nThe pizzas are huge and it truly is a...", "Wow! Best Greek pizza I've had in years! Quality ingredients for sure.  Gourmet quality, I'd say & a good chewy crust too. Soooooo flavorful & lots of yummy..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.4, 0.47], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "dI34sLlCovmWD7LVsSw76g", "text": ["Mmmmm that cauliflower crust!  \nDefinitely my favorite pizza place!\nEverything is always perfect!", "I was able to get the cauliflower crust pizza and was so ecstatic that it was not only good, but great! I hope they never stop offering that option! \n\nThank...", "I love this concept.  Its pizza just the way you want it and cooled in a brick oven.  The crust is not \"paper\" thin but still thin enough to crisp-up within..."], "rating": [5, 5, 4], "TBscore": [0.81, 0.55, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "EgR5voSRNZlXzBgjfe5JPQ", "text": ["We have been loyal customers through some ups and downs since moving to Baton Rouge last fall. Generally we get pretty decent if not excellent customer...", "Who reviews a Dominos? Well, when your customer service is at this level you think to do so! Bear and Quang -- I know their names because they make an...", "Love this place along with the one on Jones Creek. The only downfall is that around a certain time at night the doors are closed and you have to pick up..."], "rating": [1, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "NaiVQLMifbsmilAD8QgrZg", "text": ["Well I have to update my rating so it seems. I've been ordering from this Location for the past nine months, usually tip your driver is pretty good. Now you...", "I usually order from isabellas, but they wouldn't delliver Sunday,  so I tried papa John's... Got a pizza that wasn't fully cooked.. Lol .. better...", "Fast friendly service and great pizza! We ordered 4 XL pizzas and they were all fantastic! I would eat here again."], "rating": [1, 1, 4], "TBscore": [0.0, 0.35, 0.52], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "qJEa45dOt9ly8KBwp0wd5A", "text": ["This Papa John's is like the the Chick-fil-A of chain pizza places if that makes any sense. You know how Chick-fil-A has awesome customer service? well this...", "I may be jinxing myself now but I am not certain if there has been a time when I was not satisfied by this papa johns location---orders are not messed up,...", "I order from here all the time with no problems. Tonight the delivery took over an hour.  When the food finally arrived the order was wrong.  When I tried..."], "rating": [5, 5, 1], "TBscore": [1.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["pizza"], [], []]}
{"id": "0Ol_T__LHkaWGGdrAQrwDA", "text": ["Roast beef poboy was flavorful, more bread than meat. \nEverything pizza was tasty although the crust was different than what I've experienced--not bad, just...", "The one star is for the hush puppies. I ordered a large pesto pizza, and after a reason wait time, a room temperature pizza was placed on the table. It...", "I used to love the roast beef poboy here and would get it every time I come through town.  However, the amount of roast beef (or shrimp) on their poboys has..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.21, 0.5], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["beef", "pizza"], ["pizza"], ["beef"]]}
{"id": "2FILGf_MH_BmZQ5ITVGzdw", "text": ["I have had some bad experiences with Domino's Pizza in the past, but for this establishment thus far it has been fair to great.  The last night I visited...", "Hi! My name is Domino's and I cannot bother to bring you what you actually ordered - you will have to call me and then I want YOU to tell ME who MY driver...", "We placed an order 50 minutes in advance paid for the pizza ahead of time and waited for the app to say the pizza was ready. This dominos location has two..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "i-nsPvHST3XP0N95VKnMSA", "text": ["I barely remember eating here. Yelp keeps bothering me to review it. \nY so needy yelp?\n\nPizza so good i nutted allover myself. Happy now yelp?", "Ordered a pizza from here. Never showed up, no call. Ended up going to the store myself to pick up the pizza and they were extremely rude too me, and by...", "Terrible service. We are now going on 2 hours of waiting for our pizza to be delivered and conveniently their phone is busy so we cannot cancel our order. I..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.3, -0.45], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "HPc2RLSanqft5iNj1ZTrOg", "text": ["In the past, I have had no real issues with this Papa Johns location; however today I am having an issue with the toppings. I ordered a pizza with chicken...", "Burnt pizza most of the time. Barely any sauce. Used to love this location. The stuffed cheese bread did not have any cheese at all in some of the pieces....", "Love me some Papa J's! Always greeted by hellos and smiles here. The pizza is still hot and delicious whenever I come to pick it up. The pizza sauce tastes..."], "rating": [3, 2, 5], "TBscore": [-0.32, 0.35, 0.62], "normalisedRating": [0.2, -0.2, 1.0], "keywords": [["chicken", "pizza"], ["pizza"], ["pizza"]]}
{"id": "SAInipIRg5SbtkBrmhgjig", "text": ["The cauliflower crust is good! Try it. L the veggies looked and tasted fresh. Will definitely be going back.", "I wanted this place to be a success so badly! Baton Rouge has a handful of go to pizza spots so it was a nice dream come true to have a real pizza spot at...", "This is one of my son and my favorite places to eat in DS. He likes watching the pizzas get made and cut. The cauliflower pizza is as good as any. The..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.6], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "BSFd9s5REGrv_kjRgoQBFA", "text": ["Went today for lunch and they have a great pizza buffet and salad bar and it's only $7.99\nEverything was delicious, so many different kinds of pizza on the...", "This the best pizza around! In my opinion it's better than most of the pizza places around, The people are friendly and the place is clean.", "One of the best take home pizza in the state . Perfect crust with a lot of toppings . Employees very friendly and professional. First visit and won't be the..."], "rating": [5, 5, 4], "TBscore": [0.46, 0.55, 0.57], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["bar", "pizza", "lunch"], ["pizza"], ["pizza"]]}
{"id": "uzlJ8vQEZMp6T5eW2lc0Fg", "text": ["I have always ordered a classic pepperoni with extra cheese pizza.  I came to a different location and I am being charged almost $8 for a pizza with 1 extra...", "The pizza is what it is - it's very inexpensive, and you can almost always get one hot. My problem is this location has some staff members who are rather...", "For quick, fast, affordable and good tasting pizza for your wallet hit up little caesars"], "rating": [1, 2, 5], "TBscore": [0.0, 0.23, 0.26], "normalisedRating": [-0.6, -0.2, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "_mAIg89aW_Ox27GefU1PDw", "text": ["Stopped in for lunch. Very clean and put together, greeted and seated promptly. I had the Roasted Beet Salad was absolutely incredible! Topped with shrimp...", "Today my wife and I went for lunch and it was quite good. We started with the \"flaming cheese\" appetizer called Saganaki, and also had the Pasticho (baked...", "Decor: 4/5\nService: 5/5\nTaste: 5/5\nValue: 3/5\n\nI came here during Restaurant Week with my husband. This was our first visit and we were excited to try the..."], "rating": [5, 4, 4], "TBscore": [0.74, 0.7, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["lunch"], ["lunch"], []]}
{"id": "N5mNBYd719af4nhdHwm7fw", "text": ["My wife and I have visited here before. Their salads are great and I had a calzone. Both were good. I didn't like the fact that we had to listen to the...", "There are some good choices on the menu, and this used to be a family favorite. But it's like a glamorous old lady who has let herself go. First clue: a...", "If I could give this place no stars I would. We walked in and half the lights were off and it looked dirty. The wait staff was texting half the time, not..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "sMDJjih5GG9fIb4aYY_v2A", "text": ["I have been praising this company to all of my clients, family, and friends. The meals are delicious. They dropped off meals for us to sample at work. You...", "Great new meal prep place!  Today was the first day they were opened for business.  The associate at the counter was very helpful in making recommendations....", "They seem like a good price until you receive them and it's all rice. Seems like they cut corners with the protein to save on cost. So you're really paying..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "PJywsiaGs4qU38WmKXwBeA", "text": ["I  love the deli here. Everything tastes so good. The prices aren't walmart prices, but the quality and service here is 5 star. Everyone is personable and...", "Let me just say this!! I stopped in Calandro' s a week ago to get some lunch and saw Ooey Gooey Bars in the Bakery. They are made fresh in the Bakery!!...", "Calandros is great local market. The name brand items cost a small amount more than the dreadful big box stores. The local products, fresh meat and breads..."], "rating": [5, 5, 4], "TBscore": [0.6, 0.47, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["deli"], ["bar", "lunch"], []]}
{"id": "vyPtq56JIcIfbh9ifegmdQ", "text": ["I used to like Dominos ALOT more with all the options of food, Pizza crusts, etc. This like for Dominos lasted about a year. However: \n2nd time in a row...", "So bad. Order online and it's downhill from there.  Pizza tracker let's me know that Andrew has be preforming a \"quality check\" on my order for the last 45...", "My fiancé and I normally get pizza here quite often, because it's in our neighborhood and the large pizzas are always 7.99. But last Friday was probably our..."], "rating": [1, 1, 1], "TBscore": [0.25, -0.35, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "1Jf-_7CmzEW6GWgRThaluw", "text": ["I stopped in here while seeing a show around the corner at the Varsity theater to get a quick caffeine fix. This appears to be a college indie coffee shop....", "As I was making the drive from New Orleans back to Dallas I had an urge for coffee and stopped at this highly regarded coffee shop. From the moment you walk...", "My coffee was delish and the attendant was courteous and knowledgeable. The restaurant tables were quite crowded & not very comfortable which made our table..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "8OoB7ESzcajiLHPM4yaZnw", "text": ["Where has this place been all my life?!?! Its fresh and delicious! The vegetarian plate is 2 boxes of food. Enough for 2 meals. Includes baba ganoush,...", "Why change a good thing? I was in love with the spices in the homemade dressing...they recently changed it. Not sure if it's out of a bottle or not, but...", "Place is expensive compared to similar places on the Northeast. \nAnd I have been waiting for 15 minutes now on a slow day to get my falafel wrap...."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "Zu72cDCBx8G8q5droLBQ-Q", "text": ["I came here before I went Shopping in target. The girl that was working was super friendly and sweet. She was making sample for people to try and they were...", "Staff is extremely rude!! To say we pay good money for supposedly good service. Will NOT be returning to this location. This is not my first time dealing...", "This is must be a worst place to get my favorite Starbucks coffee. Customer service is really poor, they made you pay for your drink even they made a mistake"], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "-TGI8q76yAt2B6tjzZYZoQ", "text": ["I've been meaning to visit this place but I always passed it up. I decided to go one weekend. I love it! A great quiet place, hidden so that if you need to...", "I often continue to go to Garden District Coffee out of nostalgia as I've always loved their granites, variety of iced coffee and pastries which have not...", "This is a wonderful local coffee shop near the Garden District. This shop has different coffees, teas, scones, cakes and cookies. I am guilty of buying the..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["cake"]]}
{"id": "xFzMsVXp7qS0letfJKPHoA", "text": ["I normally get an Americana, which is pretty basic. Today I branched out and got the New Ultra Caramel Frappuccino! So yummy! Taste more like an ice cream...", "Good and fast service, always well stocked with coffee and food ! I come in usually when I'm getting my nails done across the shopping center at Iris nails....", "This is one of the best locations in the area. Every staff member is very friendly & my coffee is always perfect. I usually mobile order & my drink is ready..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "i1Q0gISxVV4v4WGu901APw", "text": ["They hosted us for a meeting and a personal Chef and his assistant cooked lunch for us in one of their kitchens and it was fabulous and delish.\n\nChef...", "This is a very nice culinary school! Boss lady is very sweet and they seem to have a lot of talented ppl around. Came for a special event but they were on...", "This would be my 4th cooking class to take here. The entrance of the building is nicely decorated and has nice seats to wait for the class to start. The..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], [], []]}
{"id": "ahLVrVcBV1RHjUM9KCCBBw", "text": ["I loved finding this coffee shop when I was in Baton Rouge! We tried the iced coffee, mocha latte (which was my fav) & regular hot coffees! The WiFi code...", "I usually stop at a PJs in NOLA once a visit and the cold brew has always been very good. I would lie if I said I wasn't disappointed here at this Baton...", "Love the interior of this place, the service is great. They had some interesting options for coffee here. I went with the white chocolate amd lavender late,..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "JvEkPcYqoSY90W7FXoiLBQ", "text": ["La Morenita has become a place to cure my craving for good Latin American food.  Inside the grocery is a deli area where you can walk thru a hot plate line....", "Best tacos in the city. I used to get my tacos from La Tiendita on Siegen... that was, until I was turned on to this place. Their tacos are so indescribably...", "Came here today to get some ingredients for some dishes I was going to make this weekend. My husband is Puerto Rican and so we make a lot of typical PR..."], "rating": [5, 5, 5], "TBscore": [0.32, 1.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["american", "deli"], ["tacos"], []]}
{"id": "x3md3itmJKzXQYUHezoIYA", "text": ["Molly is so VERY nice! Great customer service! Excellent coffee! She greeted everyone with a warm genuine smile.", "I came here a bit while I was working in Gonzales. The service is great and the drinks are pretty good. I had a skinny latte and it was all I ordered the...", "Cool place. Nice interior. Spacious. Good food. Good drinks. Only reason why I gave it 4 stars was because they close at 3. I wish they would be open later...."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "JaMxH0vGuEBi4vgH03u01w", "text": ["Always find something amazing at Red Stick Spice Co. from unusual or hard to find items to things I didn't even know I couldn't live without. The staff is...", "This place is amazing for spices they also have olive oils, teas and accessories for them they also have some cooking classes for a fee you can schedule to...", "This place has every spice imaginable. Be prepared because the aroma is overpowering upon entering. Insane blends of teas, different oils, and any spice..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "uU3DLLWUcbYqfLebDsD7Qw", "text": ["I tried the Diego taco $9 (chile braised beef, caramelized onions, cilantro + sweet habanero creme) and Carlos $8 (slow roasted pork carnitas, caramelized...", "mediocre tacos and overpriced. Don't think I'd get again. My burrito was the size of a taco and had all the same ingredients. \n\nI'd rather go to any other...", "I wish there were half stars, because I'd give this 4.5 if I could.\n\nI had Taco de Paco for the first time in a few years this past Saturday night/Sunday..."], "rating": [3, 2, 4], "TBscore": [0.0, -0.21, 0.0], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [["beef"], ["tacos"], []]}
{"id": "n7Hczs9llZUREOzFLHb00w", "text": ["Eaten here multiple times with many of my friends at Tin Roof. I really love their innovative choice of tacos and the fact they have vegetarian options \n\nI...", "Pretty good food truck! There aren't many in Baton Rouge anymore, so I appreciate this one.\n\nThe tacos are good, and I like that it's located at Tin Roof,...", "I visited Rock Paper Taco for the first time this weekend and was super excited that there were not just one, but TWO vegetarian tacos on the menu. I came..."], "rating": [4, 4, 3], "TBscore": [0.38, 0.58, 0.32], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["tacos"], ["tacos"], ["tacos"]]}
{"id": "8uHwe858uwvCvXSduAkMyw", "text": ["\"Tasty tacos and pupusas\". I seriously don't remember the last time I had a pupusa. These were made fresh and served piping hot. I received 3 of them and...", "Yummo!! After a long day, we were hungry and decided to see if this taco truck was still open. We got there around 9 and they happily told us they could get...", "I'm giving it 5 starts for the quality of the food only. I've traveled all over Mexico and these are the best carne asada and grilled chicken tacos I have..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["tacos"], [], ["chicken", "tacos"]]}
{"id": "fP4NYNY7ChRkPT5Kt_hqCQ", "text": ["This place is delicious!!! It's super close to LSU and cheap so it's very convenient for my friends and I to eat at. Don't really expect service as a sit...", "The BEST carne asada I've ever had in my life.  I dream about it!", "I go to this place all of the time. The food is always delicious and the prices are even better. It doesn't get more authentic than La Salvadorena. The food..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "Xz6BaHUOH_T64C7B4aZ_-g", "text": ["Limes in the water instead of lemons. Some sections of the menu have no English translation. The authenticity is looking promising. \n\nThe salsa...I cannot...", "Love the fresh homemade food! Had the chicken plate which was a generous portion. Also the bean and cheese pupusas were delicious.", "Best soup my dad has had in his entire life!!!!\n\nThe Pupusas are delicious as well.\n\nWe will be back often :)"], "rating": [3, 5, 5], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "rt4nCFYt5ly9cf0W-QZa7g", "text": ["I frequent the Gonzales location since it's nearby my husband's work but yesterday was bogo for nurses and this location was a lot closer for me after work....", "This review IS biased because Chipotle was a main staple of my weekly diet when studied at the University of Florida. When I first moved to Baton Rouge, I...", "I greatly enjoyed my visit. The employees were so nice and helpful. The food was fantastic and the atmosphere was peaceful. I would recommend this place to..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "UtPN9fUNDsX0IxwP8b0ulg", "text": ["I've been to this location several times, just your average Taco Bell. But the hidden gem on the menu is the reason I came here tonight: to do a Taco Bell...", "My favorite Taco Bell in Baton Rouge! The staff is excellent and service is quick. Our family likes to go for Happy Hour (2-5pm)freezes! Taco Bell also has...", "Shit service. They rush you at night like every other Taco Bell in this city. I had high hopes for this one. Smh."], "rating": [3, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "uAdBHWTqKDDv-itw_ej4AA", "text": ["So, went to have lunch yesterday at Adrian's for the first time.  I have been super excited to eat here because I passed by it every day, finally.....a year...", "TAKE OUT REVIEW:\n\nI called in an order at 7:12. I was put on hold for a few minutes which I didn't mind. The associate said it would only be 30 minutes...", "It is a very nice modern restaurant with a bar area.  We came in for dinner during happy hour.  We were excited as there were a lot of items that looked..."], "rating": [4, 1, 3], "TBscore": [0.32, 0.0, 0.54], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["lunch"], [], ["dinner", "bar"]]}
{"id": "OjF3YRDrByfjAJeCISr0Vg", "text": ["Maison Lacour is a traditional French restaurant run by a French family presented in a tiny house. It's so cute and sweet. But don't let all this cuteness...", "Best restaurant in Baton Rouge and it's really not close, in my opinion. Just about everything I've ever ordered here, from the lamb to the duck to the...", "This place looks like something out of a romantic movie scene! The restaurant is a little cottage/house that was transformed into this quaint French..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "SfWbCpGWoJWi50KpBYiCnQ", "text": ["Albasha has soo easily become my new favorite mediterranean restaurant. They completely wowed me. We came in for lunch, and even with the lunch portions, I...", "Every time I come to Baton Rouge this is a must stop. Fried cheese, Gyro plate, Lebanese tea...\nFresh hummus.  Grape leaves   Need I say anymore ...", "Great place. Good ambience. I sat at the bar and had a chicken shawarma and gyro combo- which was plenty of food, and the lamb was excellent, so was the..."], "rating": [5, 5, 4], "TBscore": [0.29, 0.0, 0.47], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["lunch"], [], ["chicken", "bar"]]}
{"id": "qZr0uQ4nJNySUjFAFbjGKw", "text": ["Don't let this shop's size fool you - it's utterly packed with all the necessities you'd need for most Chinese, Japanese, Korean, Vietnamese, and Thai...", "This is one of my favorite places to go. I love trying new things and finding old favorites that I cant find other places. I have to be careful or else i...", "Great selection of Asian groceries that I cant get anywhere else. Wish there was a little bit more in the way of frozen and prepared food selections and..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chineese", "korean", "japanese"], [], []]}
{"id": "XNno1jlZ51LID7DkVOkJ3g", "text": ["Great place to grab middle eastern foods and staples.  Small but adequate freezer selection. Snack selection was good and spices were awesome. Will be...", "Really great international market. It's a small store but you'll find almost everything you need here. Large selection of spices for Indian and Paki dishes,...", "I LOVE traveling, but I hate driving. I don't know when it started, but I rather have someone else drive....while I become the utmost hated backseat driver...."], "rating": [5, 5, 4], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["snack"], ["indian"], []]}
{"id": "XQxsURDkF8LQuIcqhfarBA", "text": ["Possibly the best service I have had at a BR McDonalds to date!  In and out. Prompt and courteous. They even bring your food to your table now. I haven't...", "I always get asked to pull up and wait. One Sunday on the way to church, I ordered a number 1 with coffee. After I pay, they tell me they have to drop the...", "This McDonald's is completely ridiculous. I know I shouldn't expect much as it being a McDonald's but it takes 15 minutes to make a drink.  This has..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "xCK-Y0OoA78Fxhnq23yNkw", "text": ["Love this place. There are many snowball stands along my way home but I always found this one to be very flavorful, ice texture just right, very quick...", "Very diverse menu of snowballs not your average snowball stand. This is more of a gourmet style snowball presented in a mason jar or a plastic cup. They...", "Very nice snowball stand with great workers. They offer tones of flavors and other snacks. If you are near this stand stop by for a sweet treat. I will..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["snack"]]}
{"id": "m1RWfLUvYnBpsCZcs2GyWw", "text": ["This place is outstanding. Been here a few times and staff is always extremely pleasant. They sell a variety of things: smoothies, protein bars, nutrition...", "Place is legit good prices and the smoothies blow smoothie king outta the water! The lemon cheesecake is great", "I am such a huge fan of this this smoothie & supplements store! Karl, Miranda and any other employee I have met there has been super helpful. I have had..."], "rating": [5, 5, 5], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], [], []]}
{"id": "WbhXFNvkmhezJI4eAwZAVg", "text": ["So far this place is a hit! Good place to go when tired of cafeteria food. Haven't tried the coffee yet but nacho Thursday is a must. They also have salads...", "I love CC's Coffe, and this place does have some pretty good desserts and sandwiches. When it comes to their lattes, exc, the quality depends on the...", "Ok, I am the first to admit I am a coffee snob. I grew up here in Louisiana and so for me the ONLY coffees I drink are Community and my beloved Starbucks...."], "rating": [4, 3, 3], "TBscore": [0.0, 0.48, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["sandwich"], []]}
{"id": "sHsZnNgo1kBZtM6o00lpRw", "text": ["These are the best snoballs in Batkn Rouge. Perfectly shaved ice, tons of flavor options, and quick service (even when there is a line). They even have...", "amazing snoballs!! my friend and i are both from out of state, she's never had a snowball but i have (in New Orleans) this has to be one of the best...", "These snowballs are delicious. The ice is very soft! I would normally drive to Hansens in New Orleans because nothing local compared. However, once I..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "q1Hd3TXKRcvSNoVP1E1-kg", "text": ["Wow, wow, wow.......\nI was introduced to  boudin a few years ago, not really understanding the magnitude of what it really was (being that I'm from GA). My...", "*Please note that this review is MOSTLY about the AMAZING beef jerky.*\n\nOkay, so I've been going to this place since about 2011 when I was living in BR for...", "A must stop when rolling through Baton Rouge.  Bring an ice chest and load up.  Meats, sausages, boudin, and cracklin's.  I give it two Yum's up!  Great..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["beef"], []]}
{"id": "QEkG7-NjbUxQVjFIR_TT6A", "text": ["I think this is a prime example of your rating being dependent upon your expectation level. For me, I do not expect a full service nanny while at Java Mama....", "Mixed feelings about Java Mama mainly due to prices, but overall I am grateful to have this option for indoor play AND good coffee* (they switched to local...", "Great place to bring your toddler to play. Play area has doors/gates to keep kids in play area. Java mama has seating around the play area for parents to..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "5iXXrvePxSlj6TkZ0hD1Rg", "text": ["CC's was just what I needed on a chilly evening. Walked in to the rich aroma of coffee and heat! Stopped in after gassing up at the gas station next door. I...", "I enjoy the medium dark and always consistent rich coffee served by CCs. Im a CCs girl!\n\nNo burned char bucks coffee here. \n\nThe sitting area is comfortable...", "Fantastic customer service. Friendly and upbeat people, the right kind of people to work in a coffee house. Eager to help you even with the most tedious..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "0lg6sUT-gcrdxfGxHklbYA", "text": ["I went to this location this past Saturday. Not my first time drinking a Paradise Smoothie but first time getting one for myself. The customer service was...", "Really good smoothies and would come frequently if the prices were a bit lower. Ordered a coconut milk smoothie with tapioca. The girl seemed to not...", "1st time going here and I'm sold. I went with the owners suggestion based on what I wanted and it was one of the listed drinks. I believe it was called the..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "y9MI9bSpi0GdrZeChGOMpg", "text": ["Can summer just last forever?! The snowball stand is the best around. We are so thankful that they rebuilt after the flood!\nThe employees are friendly and...", "Great snowballs and friendly service. And a huge plus - they take credit cards. An even bigger bonus - their nice seating area. My husband loved his flavor....", "They have delicious sugar free snowballs at this location.  I especially enjoyed the sugar-free BlackBerry. Thanks for providing sugarfree choices."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "duXD-0XfYgIOO-oz-s_OUQ", "text": ["So glad I found Paradise Smoothie! They have lots of options of tea and smoothies. I highly recommend the piña colada smoothie. I asked for it without...", "This is my first time here! There was a lot of selections of bubble tea, smoothies, sweets, and ice cream! I picked the lychee tea with tapioca and bubbles!...", "Cute little establishment! I wanted ice cream but they informed me that it was no good and they were waiting for it to be replaced. We sat inside because of..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "Mb8ojuQVQQhFCrPvA-abow", "text": ["Went to the Mall of Louisiana to do some window shopping and this is the only thing we bought. Had the best service and attentiveness from the guy at the...", "So, this is popcorn heaven! Yup, any flavor of popcorn you have probably dreamed of is here. How about some candy nostalgia? Here are some, just to name...", "Received excellent service today! Made up for my last visit when I felt like I was disregarded. Today I was asked what I liked, received great suggestions,..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "Itpc9lG9f2a43mAsol3wYg", "text": ["Yogurtland is always there to make us feel less guilty of our sins, giving us a \"less calories\" option for our cravings for something cold and sweet as ice...", "I've been into frozen yogurt lately and yogurtland is always my go-to. They have enough flavors where I'm always a fan of one and I like the calories listed...", "Nice, friendly, and clean!  Can't go wrong here to kill the sweet tooth. Lots of flavors and toppings to choose from."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "XAiPSKxgxJRtHjNTdRKv2g", "text": ["DELISH \nI enjoyed an order of hot and creamy grits for only $1!  This location has the new kiosk where you have the option to order there, or at the...", "There are definitely worse places to eat. This McDonalds seems ok. My advice to others is to order and pay at the self checkout. Also, I'm just going to be...", "So it's an early morning before school and I want to get something to eat with some coffee. I have the little McDonald's app that offers deals and lo and..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "F09jGr603n5tA7Cuzjh4vg", "text": ["As far as McDonalds go I think this one is nice and friendly. People usually only go out of their way to review a fast food place if they had a bad...", "Worst ever place to go to, don't go there!!!!. The staff is rude, we went inside yesterday and he asked the lady if they had dipped cones and she named off...", "Very dissatisfied with this particular location. This morning two coworkers along with myself walked into this establishment.  We patiently waited at the..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "fksTnhl93_06VTaIsdF7Dw", "text": ["This is not my favorite Smoothie King location in Baton Rouge for a couple of reasons. First of all this place stays so busy, you'll almost always have to...", "I love this place! Everybody that comes in loves this place! The people that serve there are very friendly,professional, and talented in customer service....", "Can't really judge this location off of product, as they're part of a chain. Smoothie King in general is not at all my preferred smoothie spot, but BR has..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "mtaYL3ScQr_gZ4hZ-_fpEQ", "text": ["So- I am all about giving credit where credit is due.  It is so rare these days that people actually take pride in their jobs when you find it- especially...", "I've had great service here that was very quick and I've had poor service that was slow. It's near the zoo so it's convenient when you're headed there....", "Kids that want $15 an hour... I can't wait until McDonald's goes automated.  That will force these youngsters to stay in school and better themselves...."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "iVThYGkaBhUQNlWM6ajFOQ", "text": ["Anurag and I have been here once - fortunately when the weather was gorgeous and we were able to enjoy sitting outside while enjoying our drinks. The place...", "Great atmosphere. Doesn't smell disgusting like a lot of bars. It's clean, the decor is cool and retro, and it's overall a neat place to chill, listen to...", "This is one of my favorite spots in BR. I used to go weekly when it first opened, but I just don't go out as much in general anymore. When I do, I always..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["bar"], []]}
{"id": "4VMslsuxtT-6oUeVVaRlhg", "text": ["Hung out here on a Saturday night until closing, and it was a bit quiet, but we still had a good time just sitting outside chatting. \nThe bartender was...", "When you show up, order that elegant drink you've skipped out on at the skanky bars. You'll first be amazed that they know your favored drink more than you...", "Great place for relaxing. Excellent service and reasonable prices. Patio is partially covered so even in the rain it's fun"], "rating": [4, 4, 4], "TBscore": [0.0, 0.51, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["bar"], []]}
{"id": "aY715diF4U3Kj8jTw6uVUg", "text": ["I went here a few weeks ago with co-workers and immediately I knew this would be in heavy rotation for our happy hours. The drinks and seating were perfect...", "Apparently under new ownership and the cool bartender outlined some of the coming changes. As long as they keep the awesome vinyl collection and selections...", "This place is a gem.  Very cool local vibe with a nice selection of bourbon and scotch.  Though I didn't try any of the specialty drinks they looked..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "WVY9q4CxHgsjlqZGoIx4tg", "text": ["Hayride Scandal is next to Hooters on Corporate and College Dr. It is beautifully decorated with chandeliers, red velvet chairs, adding to it's rich...", "I love the theme of this bar it's made to be set back in the Prohibition Time era . \n\nIt was smaller than I expected but still a nice size to sit and have...", "Update: Much better the third time around! There was only a few other bar patrons so service was fast and efficient. Happy hour is daily from 4-7 so I got..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "PJb7s1ukmaHne9tXSz1uEA", "text": ["Wonderful staff, amazing selection on liquid, and a peaceful place to hide out to have a good time... you get a great deal for buck+ a wonderful time to...", "Such a hidden gem here. It has the feel of an old New Orleans bar with endless potential. The owner was tending bar and made everyone here feel like family....", "I almost hate to give this place 5 stars because I don't want you to go and spoil this ultimate hole in the wall.  The bartender makes drinks that'll put..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["bar"], []]}
{"id": "r2scb3cm_dFZQ0OlaiCglw", "text": ["Super place! Super people! Just stopped in on a whim....I have passed this building a billion times... it is right in my neighborhood! ... I was instantly...", "The bartender overcharged and had no respect when we asked for a receipt.", "This is the primary example of a neighborhood  bar! It's an everybody knows everybody kind of place. I come here every single Thursday and most weekends...."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "QJdqQOAowQCevyRT0xzY9w", "text": ["I've been to BS three times. The first time was midweek around 4ish. I had a good cocktail and a nice conversation with the owner, Danny. I had my toy...", "In my opinion this place is a real piece of crap. The owner acts like a real douche! There are many other places in the area to have a good time without...", "It's a dive bar, alright. It's located right under the Mississippi  I-10 bridge. \n\nWhen we pulled up, I was a little skeptical about the location, what I..."], "rating": [2, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.2], "keywords": [[], [], ["bar"]]}
{"id": "6AGNmDynahJV0yA2rv8F1A", "text": ["Band was good NTune, but paying $10 to stand up all night is not my idea of a good time.  Very small seating areas.   When they run out of seats they should...", "In the  of downtown Baton Rouge, laid back atmosphere. Several VIP/ Party rooms, very roomy.  Reasonable drink prices, there's comedy, karaoke, live bands...", "The band was great! Very very nice atmosphere. Drinks are on point, price is good.  I will go back when I return again."], "rating": [2, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "0M1ZwpZbEbP6vb-Pv2V5DQ", "text": ["The owner (I think his name is Joe) is hostile and rude. The bartenders don't know pour sizes or prices. The kitchen is in need of a serious health...", "GREAT music with Gregg Wright. Bartenders are a bit off key as in they suck....BIG TIME... we are leaving BC of their service ethics ... I never had worse...", "We went to Phil Bradys when they hosted a showing of The Yank for the Irish Film Festival.  The place was crowded, but the staff made sure everyone who..."], "rating": [1, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "QJJ6J-K7hUmMMr8_ec9yBw", "text": ["We love how cheap this place is. Plus they let u keep the cups. Filled with LSU kids - everyone in LSU knows freds", "Met this business at Fete Baton Rouge. They offered free entry with a sticker. I should have known better with this bar. Undergrad bar with a lot of...", "The music selection isn't the best, it's the same every week. The drinks are good and they always have great deals such as open bar from 8-10 every Friday..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.45, 0.42], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "SNv2MoSXjdm1BHMqNjOMdg", "text": ["I heart this place. it smells of lavender and chamomile. and french dip. mmm.... when I dip, you dip, we dip.", "Port Royal has been my home away from home for years. This little \"hole in the wall\" connected to Waffle House on College Dr. is far more than that....", "I've driven by this place many times and have not had the courage to venture in.  It is a  dark windowless bar attached to Waffle House with a Jolly Roger..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["waffle"], ["waffle", "bar"]]}
{"id": "108TLWcDP9iyIgCpxwal0Q", "text": ["On the list\nYou get the gist\nJust don't make me Canadian Mist\n\nHappy Hour is the bomb\nMight make me invite my mom\nAnd that dude that's cruisin Tom\n\nCraft a...", "Great place to hang out for happy hour after work. I love the ambiance of the sidebar and it's very comfortable for a group of 7-10. \nThe food is delicious...", "Perfect ambience, exquisitely crafted cocktails, and a quirky menu that includes a fantastic burger! And they make awesome sazerac cocktails!"], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.7], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["burger"]]}
{"id": "ZaCBfsyV3RN_eGd2mITvrQ", "text": ["I love this place! Maybe because it was a good night, but my friend bought me the best beer! I recently visited Ireland, too and they have the best beers in...", "Great Irish pub!!  This place is the definition of Irish - such a fun setting with a boisterous environment! While there wasn't much seating when I visited...", "Happy's is an uncomplicated, slightly rough-around-the-edges pub on 3rd street. However, some recent updates have made it a little more upscale and..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "KHxImrD_YRd3ErBHmXxzCQ", "text": ["I love bar Louis all over and really wanted to ove this one too...  but it was difficult. Our bartender/ the only server was super friendly... but they were...", "I hate giving bad reviews, and I don't give many. Most of mine are very high scoring reviews.  \n\nBut, when things get this bad the public must know. \n\nYes,...", "Went last night for an after work meal and night cap, and had the most horrible experience I have ever had in any restaurant. I HIGHLY wouldn't recommend..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["bar"], [], []]}
{"id": "uZK7hIviz-fbmn6H6jfHMA", "text": ["Small strip center bar.. With A good size full  bar. Smoking  shuffle board and jukebox little rougher crowd mixed ages leaning older But I had a good...", "I love a good hole in the wall, and this is one of the best Baton Rouge has to offer. A little off the beaten path down Florida Blvd., but its so much fun!...", "Good neighborhood bar. Great place to get away to watch the game. Great staff on hand."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.48], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "BwvqUTxmUFE3rKbH94xzcQ", "text": ["I came here to celebrate my birthday with my coworkers and it was just great. We all live in AP and didn't want to drive to BR, so we settled here. I'm glad...", "This place has ample parking with lots of light. The bar itself does not allow smoking on the inside, but there is a covered patio on the side. The men's...", "I almost never review a place that weighs heavily on service, but my experience at Nic's warrants a review.\n\nI went here to see some live music with a huge..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["bar"], []]}
{"id": "LfuZ3p9X5c9jQlOEerYZsw", "text": ["Vampires blood is the best! Black raspberry flavor. Tastes great and gets you a nice buzz!", "Had a blast here.... \nGood vibes, decent drinks, and the Bartender \"L\"  was cool af... \nAnytime I visit BR I'm coming back here...", "While not the best daiquiris in town they are a very close second but the service is absolutely number one. Always greeted with a smile and served in a fast..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "kLaO_uUTzy0W1khzSZRD7A", "text": ["This place was an all-around good time! It was so cold that we did not plan on going here but as soon as the Red Stick dropped on New Year's we decided to...", "Came for lunch, wished I coulda stayed for the atmosphere! First-timers, we walked in out of the hot noonday sun to find friendly staff eager to get us...", "Arrived around 10pm on a Saturday to the semi packed bar By 11 pm it was getting crowded. Love the mixed crowed and enjoyed the band that went on around..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.31, 0.33], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["lunch"], ["bar"]]}
{"id": "Q25K8NoG4eyDK0Lr7ACZAA", "text": ["My first time going here after passing it for many years. I saw R&B artist Tamia and had a wonderful time. The only negative would be parking. The parking...", "This is a great intimate venue.  I saw a show here last night which was pretty great.  There are three levels in the venue.  The highest one has a bar and...", "I have had two really good experiences at the Varsity Theatre. We drove into BR from NOLA to see the Revivalists both times and were able to get a spot..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.41, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["bar"], []]}
{"id": "LIxrfdrXEMyAcHqX_ulC3Q", "text": ["My favorite neighborhood bar, and I don't even live in the neighborhood. Awesome staff and regulars make you feel like family. Beer selection and drink...", "This is some good shit. When Natasha's workin she'll keep your ass in check but still hammer down when she needs too and serve that ass lol. But dont fuck...", "Too many times there are bars that either don't care or the owner is so separated that your never seen.   Natasha is amazing and thankfully I have an..."], "rating": [5, 5, 5], "TBscore": [0.55, 0.0, 0.55], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], [], ["bar"]]}
{"id": "8n2LFzXwMMw_5lGcSoTkhg", "text": ["I went here for the first time with a couple of my girls and it was amazing. The charcuterie was amazing the selection was great and the wine boards are a...", "Super awesome atmosphere. It's a great place for a date night. The service was fantastic and very responsive. The food was incredible too.  The menu is...", "Great highlight in downtown Baton Rouge. Perfect for small plate with a great wine, beer & cocktail selection. Scott, the General Manager, has an amazing..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "CukRrx_uL0Hi64UzMd2zgg", "text": ["Best martini menu. Try the burger you won't regret it. Brunch is on point. Service is always on point. Loving this smoke free BR!!", "Went for a late evening bite and after visiting three others places in the area, we settled with Duvic's. It's def got that dive feel with all the walls and...", "Always the best conversations \n\nAnd they serve food again \n\nAnd great bartenders. \n\nJust do it.\n\n......................................."], "rating": [5, 3, 5], "TBscore": [0.74, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["brunch", "burger"], [], []]}
{"id": "RaS4YImOOnAVK2SYjXxRoQ", "text": ["The hidden gem of Chinese food in Baton Rouge.\n\nI have ate at many of the Chinese food restaurants in Baton Rouge and very few have good food. Especially of...", "Great place to pick up lunch. The atmosphere isn't the most inviting, but the service is fast and the food is good! Very casual and quick place, and great...", "Great food and big portions! My family orders this and can eat it for dinner for easily two nights!"], "rating": [5, 4, 4], "TBscore": [0.0, 0.41, 0.45], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chineese"], ["lunch"], ["dinner"]]}
{"id": "GlDplkm9XF_xPyyhHNUb7g", "text": ["Kings Wok has been my go-to place for Chinese food for years. They have an insane lunch special where you can get an entree, fried rice, and soup for $5.50!...", "All things considered, pretty good !   Restroom filthy.  This concerns me.  Dirty restroom, dirty kitchen??", "My favorite Chinese in the whole world. Seriously I come here every time I come to baton rouge. I've eaten a lot of Chinese food in my life and this is the..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chineese", "lunch"], [], ["chineese"]]}
{"id": "n7RSeX7oVoGtbMooGbwT1g", "text": ["The food is great and the price is fair for what your buying. I've ordered from here several times and I have never been disappointed. The people who work...", "We went here for dinner.  It's not a fancy restaurant, but the food was fresh and prepared to order.  We got a General Tso's combination plate and Black...", "I love Chinese Food.  And I'm adventurous and always wanting to try a new place.   My wife is not.  She loves it too, but hates trying new places.  We tend..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["dinner"], ["chineese"]]}
{"id": "1RSXMm8jyFNfk9wsMyoHpg", "text": ["Super friendly people! Definitely higher quality take out than any other Chinese restaurant I've been too!! And portions are huge, or course.", "It's close to where I live, and it's better than China Express. Prices are decent, and the owner is friendly. Low key, I come here for the boneless chicken...", "Few weeks ago, We ordered take out for dinner. I got the garlic chicken and my fiancé ordered sesame chicken. Food was average. Taste was ok.. just enough..."], "rating": [5, 4, 2], "TBscore": [0.22, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["chineese"], ["chicken"], ["chicken", "dinner"]]}
{"id": "c7uVo_7aAR8yFDYvBJKn_w", "text": ["I've been here for lunch buffet many times but this was our first time where for dinner and it was FANTASTIC !\nWe were greeted by a sweet and smiling...", "Recently I came here to treat my kids to some (what I thought would be) yummy Chinese food. Well, I was wrong. The buffet has seriously declined. The food...", "I've been hearing so much about how good Hunan buffet is and how if you want chinese food, this buffet is the place to go. Walking in, I was a little..."], "rating": [5, 2, 3], "TBscore": [0.4, -0.21, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["dinner", "lunch"], ["chineese"], ["chineese"]]}
{"id": "a-UDLFSl5urr1AIFpUj6Fw", "text": ["This is my favorite Chinese place in BR. The food is made to order and it is always ready when you go to pick it up. My favorite dish is the Honey Chicken!...", "I've been looking for a regular Chinese place to go to and I believe this is it! Beef and broccoli was amazing!!! Also ordered the Honey Chicken kinda small...", "Really good fried rice! It's really soft so I know that they use good quality rice. \n\nThe owners are so nice and and sweet. They're also pretty quick to..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chicken", "chineese"], ["chicken", "chineese", "beef"], []]}
{"id": "kMxumyZK4zNi1sVLYYLnBQ", "text": ["I have tried this restaurant 3 times and 2 out of the 3 times that food was horrible and Very disappointing. I HIGHLY RECOMMEND to go to the China one off...", "My husband and I have been here a few times now (carry out only) and haven't been disappointed yet. Food is good and portions are huge for the price....", "Ordered the shrimp lo mien and expected it to take a few minutes. So I went to the door because my mom's was shopping in the grocery store next door, really..."], "rating": [2, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "e_26AFcDkdutymCKbp6jGg", "text": ["I recently moved to this area and since this is the closest Chinese joint, I decided to give it a try. The first time, I ordered shrimp and vegetables, and...", "Tried this new gem late in the evening. Food was great! Super hot, fresh, and tasty. Will be going back!", "I would consider this the standard Chinese food place in Prairieville. My go to place for good solid Classic Chinese food. They were really fast. Priced..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "RzLt8Ku2dzXRCQxk9I7XFg", "text": ["This is our family's absolute favorite place for Chinese food. We have been loyally coming here for 12 years, and kept coming when they moved a few stores...", "I used to eat here for lunch on a daily basis until the owner accused me of trying to steal a to go order from them. Wow. My coworker wanted a to go plate...", "Ehhh, got the general tso chicken: it was average for Chinese takeout. Ok price, ok taste, ok quickness. The rice was clearly not fresh. This is fine to use..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["chineese"], ["lunch"], ["chicken", "chineese"]]}
{"id": "7Qbpn64F-ALDh_9co2HERg", "text": ["Now they know how to fry dumplings! Apparently my \"review is on the short side\" according to Yelp but it's perfect for everyone tired of wet dumplings!\n( I...", "This place is great. The staff is friendly and the food is hot and awesome. I come here at least once a week, and have never been disappointed. I always...", "This is one of my go to places for Chinese food. Mostly just because it is crazy close to the house and they are always super nice and super fast. Food is..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], ["chineese"]]}
{"id": "BXwJOJP2DMVKjS5FKd6K0A", "text": ["The staff here love everybody!! The food is great! Always hot(or cold if the sushi is intended that way....)and SUPER HUGE portions! Every time we visit...", "I always enjoy going to a restaurant that serves great food!  I've always loved having Chinese food, but I prefer this restaurant because of the great...", "Fast and friendly service. The food is pretty good and the prices are affordable. The dinning area is clean and full of culture and art."], "rating": [5, 5, 4], "TBscore": [0.4, 0.58, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["sushi"], ["chineese"], []]}
{"id": "Al4HLnv49uRTIcKyYQ0EkA", "text": ["We  just moved to the neighborhood and wanted try try the local restaurants.  we love Chinese and picked this one specifically due to distance.\n\nThere were...", "I love Shrimp Fried Rice, and I also work a job that awards me a lengthy lunch break. So I'm always trying different restaurants for their Shrimp Fried...", "Good local Chinese fast food by my house!  I like this store for all my Chinese food craving at home.  I usually get the spicy garlic chicken with rice and..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [["chineese"], ["lunch"], ["chicken", "chineese"]]}
{"id": "lUFaUMsaZzC3ASky2f-wJA", "text": ["Hungry on a Sunday afternoon but not wanting to leave my apt, I grab the pamphlet my roommate left on top of the fridge, it says they deliver, it says it's...", "While delivery takes longer than usual (I recommend pick up), the food is consistently good and inexpensive. The orange chicken and fried rice are great. I...", "So, go in with your expectations set correctly. It's good and inexpensive food for what it is. I am a creature of habit, and I stick with shrimp lo..."], "rating": [1, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "jtvUdK0xCnCPr86FroSteg", "text": ["Good food and good people. I hardly get  to visit anymore because I don't live on this side anymore but when I want Chinese and I'm visiting family this is...", "This is a good Asian cuisine gor take out.  When u cant get to the fancy Asian restaurant heres the place to go good authentic oriental flavor im their...", "Ok ok, it's not the BEST thing ever as far as how the appearance goes and there isn't much room for dining in. BUT I get what I want, cooked exactly how I..."], "rating": [5, 3, 3], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["chineese"], [], []]}
{"id": "5Ve-pkNYcz1VY2GUOGkIbQ", "text": ["I have been going here for years and always love their personal service. As soon as my family and I walk in the restaurant they ask if we want cream cheese...", "Love love love. Buffet 7 days a week and always fresh. The owners will make my fav just for me and I love that. Always have been friendly and always never...", "I came here craving sesame chicken because I haven't eaten Chinese food in months and I'm new around here. When I got home and bit into my \"chicken\" it was..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, -0.27], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], ["chicken", "chineese"]]}
{"id": "8EihvDUmQ-4C77cSFZDkow", "text": ["This place has been a staple in my life since I was little. I even as a baby spoke Chinese to them bc I had come so many times and I picked up on it. I am...", "Not sure what to think. Stopped by today for lunch because I wanted to try something different. I've been looking for a decent sit-down Chinese restaurant...", "Whatever town we lived in, and we have lived in many, my mom always based the Chinese restaurant she would wind up frequenting on   .  egg rolls they..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["chineese"], ["chineese", "lunch"], ["chineese", "egg"]]}
{"id": "y4sruSvZz2Mnj83ib9_Oxg", "text": ["UPDATE:  Second visit was even better. This place seriously is the best. The chicken is not slimy or fatty. I've had other Chinese that the chicken is plain...", "Most restaurants give you the option of buying a drink, or you can get water, which you are not charged for.  Crouching dragon automatically charges you for...", "This is a great place for takeout or eat in. Always super friendly. Big pieces of meat (not fatty) and fresh veggies that aren't overdone.\nI've had their..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["chicken", "chineese"], [], []]}
{"id": "n9faY323rFh9G33Di6yQCA", "text": ["Do not let the outside fool you!! Go on through the doors. The outside kinda looks like a run down diner type joint but once through the doors you are...", "This used to be great Buffett. But the last 3 times I went I got sick off the food. Sad.", "Ok so my friend and I decided we wanted to eat at a chinese buffet place and this is the place we chose; this is our first time trying any place in baton..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["chineese"]]}
{"id": "LFfI3tnzDSMYavwjb4pLBw", "text": ["My wife and I have been searching and searching for good Asian restaurants since we migrated here from Los Angeles in early 2012. Most places are just meh,...", "I loved this place!! Little pricey but was really good! Not sure what I order but it's glass noodles with garlic and shrimp! Blown away! \nThe husband got...", "First Time here.  Very good.  We tried the Pad Thai Chicken and the Mongolian beef. Both were excellent, as was the soup."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.39], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["chicken", "beef"]]}
{"id": "fm8R9iFSr5ClF78kNVON7A", "text": ["I'd give Panda Express a 3.5 Stars on taste but 2 on the fact that nothing is customizable and it has very few options for vegetarians beyond steamed...", "I came here for the first time today.  The food was OK.  I found, for example, that the fried rice was not as flavorful as it was at other places I've gone...", "So disappointed. I've seen the cars and lines at these places and needed to see or taste what it was all about. I did see, and taste and I'm sorry - I don't..."], "rating": [3, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "LNQak0f_VwXKSiU94ClZ9Q", "text": ["I have to admit when it comes to Hong Kong Chef I'm a creature of one habit - Combination Fried Rice! Really Good! Every time I'm in the area I'm there.", "Was in BR for a camp and we stopped at a fast food place  next door. Well me not eating fast food decided to stop by this place. Looks sketch but usually...", "Pretty decent place not a huge fan of the fried rice very basic and bland BUTTTTT the Honey Shrimp is a very tasty dish. You get alot of food for your..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "FU1q-iXyzTb0WBm6hfrQNg", "text": ["NOW, I remember why I   N E V E R. go thru the drive thru window at Panda Express. Ive been waiting 15 min in line behind 3 other cars so far. Ain't nothing...", "Cashier was very friendly. I felt very welcomed at the restaurant. She did not rush me, and helped me to figure out what I wanted. Food was hot and fresh....", "The staff was super friendly and helpful! The food was great and super tasty! Great portions. Clean exterior and interior."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "-MXQv56dayK4-5SxzPqYew", "text": ["We were staying at a nearby motel and were looking for something other than fast food. We are so glad we found this restaurant the food was very...", "Trying to eat healthy can be a challenge, especially in the Port Allen area where everything around is fried and gravy covered.\n\nI found this place by...", "Was looking forward to eating some good Chinese food. Not all that. Tried a variety of items from the menu. Very dry with little to no taste. Total waste of..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], ["chineese"]]}
{"id": "Q3yoQwOWy5Kf2n72Gl2LWA", "text": ["Chicken was delish!! I love that I can choose jasmine rice as a side dish and not fries but it is an option. Chicken is juicy, moist, full of flavor, and...", "Wasn't impressed with this place at all. Two signs over separate doors for two different businesses but, when you walk in, it's all one dining area, one...", "Fried chicken is really good. A little spicy like Popeyes. Big pieces and piping hot. Cons: slower than they claim (but made to order and fresh!) Side salad..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "blJbmcUjsAyzkwU8MVPTcQ", "text": ["I went to Yamato for lunch while in the Plaquemine area. I didn't expect much from a sushi place outside the city. Boy was I wrong. The service was good,...", "If you're looking for Japanese food in the area this is your best bet. It's a good deal for the amount of food you get, especially if you opt for one of the...", "Great new Japanese restaurant on the west side. The staff was very friendly. Our food was fresh and delicious. Great prices too! \nOnly reason I gave it 4..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.42, 0.47], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["sushi", "lunch"], ["japanese"], ["japanese"]]}
{"id": "TCdRjGYwGGN4hNeq4fA5BQ", "text": ["I've been thrice. The AYCE menu is pretty limited, especially for lunch. They are also very strict with the food waste upcharge. But there is never a wait...", "Owners are great people, great service and they make sure you like the food. The Bento Box lunch rocks, great value for money. This place is amazing. Best...", "Well worth the price. Everything came out fresh and extremely hot! The oki sampler is ok. Waste of money. Either than that everything was good"], "rating": [4, 5, 4], "TBscore": [0.0, 0.75, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["lunch"], ["lunch"], []]}
{"id": "M-boCav7LlK3esQx89j1SQ", "text": ["Called in an order to pick up. Was told it would take 15 min. Took 30 min to get to the location only to wait another 25 min. Definitely call ahead even if...", "Decided to give this place a try. Should have kept on rolling past it. Steak had the Strangest flavor I've ever experienced. Fried rice had no flavor at...", "just got there to pick up my hibachi food，that was so good ！the price is reasonable， and the food is so good！"], "rating": [3, 1, 5], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [[], ["steak"], []]}
{"id": "ShPm6DZfEi6n0oHECSFNlA", "text": ["Stopped in on my way to Houston on a rainy day.  I grew up in La Place in the 80s,  but my, how it has grown.  I found this little gem of a cafe , which...", "Came here for the first time the other day with my mom. It's literally down the street from the house, super convenient. We came to get a quick bite. We...", "GET THE TACOS\n\nAwesome little hidden gem. Cool atmosphere. There's a large sectional with a coffee tables and games you could hang at. A gingerbread village..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "7abKmAfU9xvUSqIVTzw36w", "text": ["Good store for your basic oriental necessities. I came here looking for an Asian broom. Do you know what I'm talking about? The ones that make life so much...", "I so glad that I found this store in Baton Rouge.  I just moved here from Atlanta, where the Korean population is huge and I have plenty of Korean stores...", "Very clean and have lots of options here, Korean owned so a lot of Korean choices! Love the selection of sauces and snacks! Also having different frozen..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.45, 0.41], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["korean"], ["korean", "snack"]]}
{"id": "mRxABv-LwtmstvLvOlZ1Iw", "text": ["Very very good shrimp pho and shrimp spring rolls! Wish it wasn't so far from Prairieville!! \nThey are super nice! Will be going back!", "My first time here after craving some pho for a while. We had a group of 6 and had no trouble getting a table. Everyone raved about the hot tea which i did...", "I came here with very high expectations, a friend of mine highly recommended this place and told me this was the best in town. \n\nThe place has a cousy..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "oqzdTykkEPhhq9DMpqMErg", "text": ["Great beef bulgogi! Friend had really nice shrimp dish, too. Dimsum was delicious. We will definitely be back !", "Holy mackerel!! NEW FAVORITE PLACE! They've only been open for 3 months, and I haven't been back to the state for 10 months, so I was soooo happy to see a...", "Very pleased upon first impression. Le Saigon offers a menu unlike any before in Downtown Hammond. For my first visit I ordered Korean BBO stir fry lo mien,..."], "rating": [4, 5, 5], "TBscore": [0.65, 0.0, 0.31], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["beef"], [], ["korean"]]}
{"id": "C1fRcUMk9eqSKO6P1DPorg", "text": ["I ordered a ramen... the one with fish & other things. I was baffled when i got my bowl and noticed that the broth was made with coconut milk, not your...", "If I could give it no stars I would. Where to begin,,,, we walk in and there are only two seated tables out of maybe 15. It's a holiday weekend so...", "Samurai Ramen is located in Downtown Hammond in a convenient location on East Morris past the Iron Horse. Restaurants do not necessarily do well here, so I..."], "rating": [1, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "3CD_327GOd4HQjLOn4rlPQ", "text": ["I've been going to India's for many years. It has been in business on Essen Lane since at least the 1990s. It is an excellent place to try out and enjoy...", "I haven't been here in a while but I always come for the lunch buffet. The selection changes but it is always delicious. The goat biryani, tandoori chicken,...", "This is the best Indian food that I have ever eaten! I ordered through DoorDash, and I was a bit nervous since it was my first time trying this restaurant...."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.62], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["chicken", "lunch"], ["indian"]]}
{"id": "Bgm60HeTh7z8l8nCpJPlMQ", "text": ["Yea - they truly are inside of a gas station convenience food. I am not a fan of any desi place here in BR, so we drove all the way to Hammond for what...", "I was absolutely amazed by the food. Having eaten Indian food all over the US and Europe as well as in Indian-American homes I was very surprised. As we...", "Wow. Located inside of a gas station, Punjabi Dhaba is amazing. No need to travel to the south shore now for good quality Indian fare. It's right off the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.42], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["indian"], ["indian"]]}
{"id": "rdP8XHvBZvpwPykhd7r0Cw", "text": ["Stopped in for a quick lunch break. Service was ok and just remember that happy hour starts at 3pm. The chips were never ending and the queso is by far the...", "Nothing like good Mexican food and a strong drink! Staff is very nice, bathrooms are clean and food is delicious! My coworkers and I frequently this...", "Once we sat down and ordered we remembered why we had not been back to this location. \n\nService was pretty slow even though there were not but maybe six..."], "rating": [4, 5, 2], "TBscore": [0.43, 0.5, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [["lunch"], ["mexican"], []]}
{"id": "InJShjVfh9qQxueZo1ORMw", "text": ["I've been here many times. \n- Never had a problem getting order corrected\n- Never had to wait a long time to get seated\n- Never had a bad drink \n\nSome of...", "We ate here with a group of seven. Sat down at 5:30. The place was empty. Took 15 minutes to get our drinks. The waiter got our order wrong and didn't fix...", "Margaritas will give a buzz and the hamburgers are really good, service a little slow but to just relax outside with a drink  is ok"], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], ["hamburger"]]}
{"id": "LT1lqwySbAORtpHJlcUTrQ", "text": ["I love that they have an Izzo's at the mall because the food there is really good! My favorite for sure is being able to build my own bowl. Because I don't...", "Izzo's is good, but it is pricy! I always get the chicken nachos with beans, and cheese. They charge you extra for shredded cheese. They also charge you...", "First time ever coming to this establishment and I got the veggie burrito with a Coke Zero. The line was very short and the staff were quick to get your..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "57T7buxmJIvVpvGQPRqnwA", "text": ["We love this place and come often. The tacos are delicious especially the Cueritos and El Pastor... yum!!! the Salsa Roja and Verde come with all tacos if...", "The most authentic spot I've been to in Baton Rouge. Food is really flavorful with decent pricing. Very small place, not much on the decor but if you solely...", "I have no idea why any legit reviewer would complain about lack of authenticity.  El Limón was packed for Sunday lunch and Spanish was being spoken at every..."], "rating": [4, 4, 4], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["tacos"], [], ["lunch"]]}
{"id": "NTSoDjjZUwAI_xdxG0EYeg", "text": ["It took a little while, but I finally came around! This place is on par with Chipotle for me (my former holy grail of Tex Mex). \n\nLike Chipotle, you can...", "Service was fast and friendly over my recent lunch visit. There was a decently long line when we walked in but the employees were quick and we didn't wait...", "My family loves Izzo's! We have been frequenting this location once a week after my daughter's acting class. Its convenient with easy access from Jefferson..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "DVX-6GF3TOk9yKcVJwzZrw", "text": ["What I love most about all Las Palmas locations is the consistency. It seems no matter what location I am at the food taste the same as the last. Which for...", "I like this place because they're Tex Mex style and the food comes out fast and it tasted great every time I go. I get the cheese and onion enchilada dinner...", "Disappointed. Decent atmosphere & service yet all of the food was terrible. Everything was either out of a jar or a can (nothing freshly prepared). Salsa,..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], ["dinner"], []]}
{"id": "8u0tuM8aOJ-1bm21oT0EhA", "text": ["Okay Mexican restaurant on highland road!  The restaurant has many pictures painted on the wall - the pictures look pretty unique and it gives the...", "Not good anymore, the one in prairieville on 73 is good though, worth the drive. This one used to be good but something happened, prob won't go back", "My rule of thumb is the quality of chips at a Mexican restaurant determines the quality of food. If proved right tonight.\nEating the chips was like licking..."], "rating": [3, 2, 2], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.2], "keywords": [["mexican"], [], ["mexican"]]}
{"id": "TzgWpur64ZMSCE3ucxT-SQ", "text": ["I must admit I am never happy with service here. There is all but one person who seems like a chicken with their head cut off. I order the same thing...", "Spectacular stop for our family lunch today. We love a well stuffed burrito and left with stuffed tummies AND leftovers. If you are from TX then you might...", "I have never understood why a worker who deals with customers, makes a customer feel like they are an inconvenience. If we took a min to decide, she kept..."], "rating": [4, 5, 3], "TBscore": [-0.33, 0.37, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["chicken"], ["lunch"], []]}
{"id": "RF3bs1Ec3a68_8OUoEj7rg", "text": ["Shrimp buritto = 5 Stars\n\nChicken quesadillas = 5 Stars\n\nThe fact that they use Waitr to deliver = BONUS\n\nLove Izzo's but don't have the courage to try the...", "I don't normally rate anyone this poorly, but when I went to this Izzo's location tonight I was completely ignored by the staff. I waited several minutes in...", "Love the veggie anything and Izzo's has both great queso and salsas. The staff is always very friendly and the service is quick but if you've visited the..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "8K70ZUOMp6uGwZZ0NtpWIg", "text": ["Beer brewing is a craft that has really picked up, with many purchasing at-home brewery kits. The best thing about this location is that they give you a...", "Hidden gem of craft beers in Baton Rouge. It's located on Airline all the way in the back behind Mr. Taco and Ice House shopping center.\n\nThe tours are...", "This place is rad! The blood orange pompous pelican knocked our socks off. Lauren at the bar was such a sweetheart as we came in and engaged in a raucous..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "IDVXyeMLvrYJ5B6SXywaxg", "text": ["This is really a 4.5 Star review. With that being said, please be prepared to wait for your food. You're getting good quality, and it's prepared fresh but...", "Delicious and friendly place! I have tried many dishes and they are ALL superb. The cheese burger, onion rings, stuffed peers, Philly chicken, catfish...", "Delicious! The cheeseburgers and shrimp po boys are my favorites, always fresh and very tasty. The deserts are great as well.  The staff are friendly and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.47, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["chicken", "burger"], []]}
{"id": "i2kjwjquONKlmNL5FzI98w", "text": ["In town for a business meeting, and all parties involved (who individually enjoy cigar lounges and whiskeys here in the US) discovered this gem and...", "My friends and I are visiting from Tampa and WE chose this lounge because of the name. The customer service was horrible ( maybe I should say what customer...", "Searched all over BR for a speciality bottle of Jack Daniels (Winter Edition). Not one store in city had it, called Churchill's and not only did they have..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "3fkWobisYEfL2JsHoZnbpQ", "text": ["This is a decent sandwich shop in an area of limited good food options (thus 4 stars instead of 3). The inside is a little dusty and the outside looks run...", "Best chicken plates in br. The closest I'm going to get to a chicken plate from New Orleans lol", "Decent cheap Po Boy combos; drink and fries with a 7 inch for $7.99. But I do wish they'd have more hot sauce options instead of just the packets behind the..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["sandwich"], ["chicken"], []]}
{"id": "MRDP5BAbs5kZYMaWWePAjA", "text": ["I would first like to say how much I appreciate bonefish for their attention to detail on dietary needs. Our waiter Brennan was amazingly attentive without...", "Top tier service, decent and fresh food. Two thumbs up! \n\nI got the coconut shrimp and the wagyu beef/egg burger and they were delicious!", "I ordered a Caesar salad with grilled chicken and it was absolutely delicious. A little on the pricey side for $15 but tasty nonetheless. Live music on a..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.51, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["burger"], ["chicken"]]}
{"id": "TH40VBed2c1mxR72wf0lZQ", "text": ["This is a beautiful new addition to central!!!!wonderful food and a beautiful atmosphere courteous and friendly waitstaff and the food is amazing!!!!", "My friend and I have both been excited every since we heard that a fine dining Italian restaurant was opening up in Central so we decided to check it out...", "I really hate to give a bad review but sometimes you truly have too. With that being said this place is new and I think this is their first week being open..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], ["italian"], []]}
{"id": "RHwfQHiItUWUj0i0IHFIww", "text": ["Great place for salads, soups, and potato bar.  Frequent visitor at original location in Hammond.", "I'll start off by saying I am at Salad Station in Hammond at least 4 days out of the week and love everything every time. Tried Baton Rouge location, never...", "First and last time ordering from here. I ordered online for pick up. I ordered a wrap....I figured it would be a good size since it was $9.00. Not only was..."], "rating": [5, 1, 1], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["bar"], [], []]}
{"id": "FZSM5NXo3OnhaFM8MBZdTw", "text": ["I first encountered Rita's Italian Ice in NY and was pleasantly surprised at the yummy soft serve and different flavors of Italian Ice. This PA chain is now...", "Update: after a previous bad experience I must say management is very friendly and approachable. They seem to recognize customers and it gives the store a...", "Rita's Italian Ice was a summertime staple during the two years I lived in Central PA.  I'm excited Baton Rouge now has a Rita's.  They opened today! \n\nThe..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["italian"], [], ["italian"]]}
{"id": "NYmp6g427pzSAVY22fbOWg", "text": ["The hubby has always wanted to try shrimp fest, so when we saw it being advertised on TV we had to head over. We got there around 4pm on a Saturday and they...", "What can I say? Definitely a childhood favorite. But for those who have never been, probably close to the best biscuits I have ever had. They serve it...", "I'm not a huge fan of Red Lobster tbh but I enjoyed visiting this location. We visited during lunch and I tried the lunch size mini feast which includes..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], ["lunch"]]}
{"id": "N6i0V007vUHW-IR7alJR6g", "text": ["Was slated to attend a local bakeries Yelp event, but got inundated with grad school work and couldn't make it. The local bakery didn't offer delivery to my...", "I called on a Thursday and needed a small cake for a party on Saturday morning. The employees at Cake Goddess were incredibly helpful and willing to fulfill...", "I personally think Cake Goddess has the best cake and cupcakes in Baton Rouge. I mean, I have not had a bakery that comes close to the taste and quality of..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.3, 0.23], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["cake"], ["cake"]]}
{"id": "Po-IZ_ruuSCy3yVDd6prog", "text": ["Any suggestion that SweetTime products resemble Walmart is WAY OFF BASE. I note that the reviewer did not actually try anything from the shop . . . her...", "This place saved me. My step dad ordered cupcakes from ambrosia for my moms birthday. I was suppose to pick them up Sunday bc they are closed on Monday and...", "Ordered a dozen cupcakes of half vanilla and half chocolate. Was served cupcakes that looked like straight out of a Walmart's cheap package. Could be better!"], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "KS8-o9JqJDzg4LM3otKDSw", "text": ["Great little place to sit...especially when it starts to rain! Really good ice cream on the corner of Perkins Rowe and Jackson St. We got pops with added...", "Such a unique place!  Not only is the retro vintage theme adorable but I love the pops as well!!   Great atmosphere and location too!!\n\nThe first time we...", "This was my first time going to this place. It's definitely an interesting experience. I think it's a little on the expensive side. $4.50 is a bit much for..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "KkXclQl22PgxVr0_g09M-Q", "text": ["If Heaven had a taste, these cupcakes would be it! I think they recently downsized their delivery area on Waitr though which forces me to drive to pick up...", "Yes, they have the best cupcakes in Baton Rouge. What I didn't realize was that they also have the best ice cream! I was lucky enough to meet the owner on...", "This was my first visit to Smallcakes. I arrived at the end of the day therefore the selection was limited. The cupcakes were really moist. I was not a big..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "A-pLo5ZeIaMQ4WOB_6FtdQ", "text": ["Marian has done three cakes for me so far and they have been amazing! Her creativity in recipes and presentation is like no other\n\n1st cake was a naked...", "I got to work with Our Treats Design for a wedding shoot and her cakes are not only stunning, but taste so good too! I had to hire her for my daughters...", "I was surprised with a cake from Our Treats Designs for my birthday. I can say I wasn't disappointed whatsoever. The cake looked just as good as it tasted!..."], "rating": [5, 5, 5], "TBscore": [0.23, 0.46, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "nNSXhMyuYHnMVBXPeTkTDQ", "text": ["The moment I opened the door to this bakery I was surrounded by Sugar, Spice & everything Nice ! This place is so cute inside and outside they even have...", "We love everything that Dawn's makes but stopped in today and tried their King Cake cake and it's amazing!!! You can buy it in individually sliced pieces!...", "This is a cute little bakery right on the corner of Hooper and Sullivan road in Central. The shop is small but they offer a wide variety. My husband and I..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["cake"], []]}
{"id": "idFeYUTevgHmmrSoB5XnPg", "text": ["Cool spot! Went on a Sunday afternoon and had the sugar and peanut butter cookies. Both cookies were thick and very soft. The peanut butter was absolutely...", "First let me say these cookies are truly some of the best...however! The store itself is extremely plain and not really kept up well. I've been inside...", "Cookies are great if you get them in store but ordering them takes a ridiculous amount of time for delivery. The two times I've ordered through their app..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "R6x5o95EF2JqNGZrKSdYlA", "text": ["I ordered online and my cake was ready on time and was exactly what I ordered. It also turned out absolutely adorable so that's a plus!", "Very happy with my custom made cake. I went spur of the moment to take a gift to a client of mine and thought it'd be great to have a cake with the name of...", "Now who would not love a great cookie?  I really love cookies...especially chocolate chip cookies & double chocolate chunk cookies and I especially love..."], "rating": [5, 3, 4], "TBscore": [0.36, 0.9, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["cake"], ["cake"], []]}
{"id": "0Z_1twXCzL1KyySh7Rc9Xg", "text": ["I really love these snowballs! I haven't been here in a while but I don't remember their ice being so soft. How do they get their ice so soft? They are...", "Can I just say how much I love this place? \nFor starters being pregnant is like nothing else I've ever experienced. With the the cravings are the same way....", "They have the best snowballs ever!!!! The ice is the perfect consistency and they are juicy. Definitely recommend anyone looking for an awesome snowball to..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "lkZo-PiZvbGurmDT7loD8w", "text": ["I love Rouses Market stores. I used to shop at this Louisiana chain in Houma and really missed them when I moved to Baton Rouge 9 years ago. I'm happy to...", "Don't try getting waited on at the deli!\nNo apparent \"order spot\"\n10 employees behind the counter talking to each other ignoring the customers!\nI'll just...", "Went to get a T Bone steak they had on sale, but all they had out were packages with thin cuts. \nAsked Butcher to cut me a 2 in thick one, had a back and..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, -0.23], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], ["steak"]]}
{"id": "prCftVA1poVObKNGiakLOQ", "text": ["Good hearty B-B-Q here in Baton Rouge , \nChopped pork , baked beans , and Potato salad . Certainly not the fanciest of places but  \nNever  a let down ....", "Podnuh's catered an employee event at my job last week and I was pleasantly surprised. I enjoyed everything: chicken, pulled pork, potato salad and baked...", "Stopped by on the way out of town, the smell drew us in.  Good weekend buffet at a good price.  Friendly staff!"], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "SdASUcqx1OyHPUQQkXN_Hg", "text": ["First time trying the food and it was awesome. I am picky about the coleslaw and it was excellent. It had a sweetness to it. I enjoyed the pulled pork...", "I NEED more BBQ pork RIGHT NOW!!! Last night, my daughter's elementary school had a big event, and Pullin' Pork was the only food truck there. They were...", "This food truck has the best BBQ in Baton Rouge...hands down! The Pullin Pork food truck frequents the downtown area around lunchtime (I know they come..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "CyKewi8UsxmDrwmL4KEutA", "text": ["Very impressed with the brisket, fried chicken, and sides at Hannah Q's! \nMy lean brisket was cooked to tender perfection with mouthwatering smoky flavor....", "They get 1 stars because the food was good, until I noticed the flies. It was hard to give them a star at all with all the drain flies. I saw flies on most...", "Great choice for a quick meal!  Excellent BBQ and great service.  Also their banana pudding is probably the best banana pudding you can try.  \nDefinitely a..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chicken"], [], []]}
{"id": "Sh9DaeRjN2_2FaHwGb6IKQ", "text": ["This location is on Nicholson on the west side of the LSU campus.  We went for lunch on a weekday and there was easy and convenient parking.  Not sure how...", "3 stars for food + 1 star for great service (and consistently amazing cornbread!)\n\nI love the restaurant week deal ($15 y'all) because it's a great excuse...", "Had a hankering for some good 'ol bbq today and this hit the spot today! I wanted to try several things so I got the three meat platter. I had pulled pork,..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["lunch"], [], []]}
{"id": "3CsD7h6aunxtxWRksL7Ntg", "text": ["Jay's is my favorite place of all time! It is a small, family run business. The service is always fast and friendly. The hickory burger is the best burger,...", "Office relocated to Sherwood recently and was looking for a place for lunch. Saw Jay's and thought I'd give it a try. \n\nSuper friendly staff! Really, can't...", "Blecch. Worst sides I've ever had. The bbq is OK (only OK), but not worth returning for."], "rating": [5, 3, 1], "TBscore": [0.39, 0.25, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["burger"], ["lunch"], []]}
{"id": "I7pd1jfWenGALkFQCYYPKA", "text": ["The smell once you walk in the door is amazing! We where early so there wasn't many customers yet. We ordered the BBQ Sampler. I have to say I was so...", "Today was my first time going here. Actually got into a discussion on which is better, here or Couyon's. I say HERE! The meat is seasoned well, juicy, smoky...", "Podnuhs is good if your craving bbq but can't get to your favorite place at that moment. The pulled pork is a little different and not as soft as I prefer..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "1x5st-U1CGn7WQtFu9TgWA", "text": ["Something about the almost whimsical but modern atmosphere made me feel like I was back in Asia...in the best way possible. What a fun meal. Server made up...", "This was my first time having Pho in a very long time and I am so glad we ate here! \nThe selection was huge and the portions even bigger! The wait staff was...", "My server was super polite and friendly. Unfortunately, the pho was inedible. It was as salty as sea water with very little flavor otherwise. There were..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "w9icug3s3OKUwxkylaeT2w", "text": ["Update 2:  tried \"The Growler\" today. Basically, a roast beef po-boy. And a good one too. The only downside is this is a knife and fork sandwich, and I...", "Let me start out by saying this is not your ordinary review... I am biased because I am an occasional employee of this establishment/food truck. I am a...", "Saw this food truck at a food truck event in BR.  Could not resist boudin egg rolls and gouda stuffed boudin balls. Yes, I said boudin egg rolls. The gouda..."], "rating": [3, 5, 5], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["sandwich", "beef"], [], ["egg"]]}
{"id": "Uoc0H495FebAHsp5BEufPw", "text": ["Love this place! Good soul food! I've had the smothered pork chops with rice and gravy and the fried chicken with red beans and rice. Both excellent! Also...", "Friendly service. Fantastic food with no frills environment. Betty's Diner is definitely worth the visit. Don't forget to add a sweet potato pie.  Specials...", "Soul food at its best!! Betty's diner welcomes you in with a smell from the kitchen where food is prepared nothing but love. The selections and varieties of..."], "rating": [5, 4, 5], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chicken"], [], []]}
{"id": "yhv9pyBy4qa79RVwa_qilQ", "text": ["Old Hammond Cafe and Caneland Distillery teamed up for Boozie Brunch at the distillery. \nWe all really enjoyed that the proteins were well seasoned. The...", "On the road and found this dining spot on Yelp that had a great menu. And, they deliver. Ordered fried oysters and was informed they would be delivered to...", "Ordered online order didn't go through say in lobby more than 15 minutes before they said anyt hing guy pulls up goes in back makes food for their passenger..."], "rating": [4, 1, 1], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["brunch"], [], []]}
{"id": "5631SYpBbwBK5JpF_nkInw", "text": ["Updated review just went there were workers outside throughout the line and even at the window . Service was good except when I went leave thank goodness I...", "I've never come across a Chick Fil A that I haven't loved. Never. \nSeriously, everyone knows how awesome the customer service is but these ppl go above and...", "This location RULES! The employees are great and actually talk to you and make you feel like a valued guest. Its funny, i stopped eating all fast food..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "QwQ9ZME38mz058UFydWiWA", "text": ["Every single time I come through here for my kids I either get an attitude from the staff or extremely slow service through the drive through! It's...", "I had a craving for McDonald's french fries, actually HOT McDonald's french fries. I ordered with no problem but when I went to the window to get my food,...", "I worked here for 10 years. It's one of the better McDonalds. I do believe their double drive thru creates a problem since it took away many parking spots..."], "rating": [1, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "WMVL9EKKjyiIfBlXvACe-w", "text": ["The best Chick-fil-A of all time. Have been coming here since they're opening back when I was still in high school. Every visit is always pleasant and my...", "Went through the drive through to order medium fries and a large superfood salad. The fries were a little soggy and lukewarm but I really just wanted...", "It is hardly fast food. While the service is fairly quick the taste is the opposite. The spicy chicken sandwich is one of the best items. The salad is..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["chicken", "sandwich"]]}
{"id": "bfqg8BUFGFWM6Zku8zGOCQ", "text": ["Ordered takeout and they totally hooked us up here with an enormous amount of delicious food! We got 2 orders of lamb kebob's and an order of falafel. It...", "Yay Mediterranean food! I love me a good gyro wrap, especially for lunch. We went for lunch on a regular weekday, and it was moderately busy. Not too too...", "We have been patrons of Serops on Corporate Blvd and I'm unsure why they are listed as a Greek , not Lebanese, restaurant . It's primarily a Lebanese..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.26, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "TyHcL42WvwACAdjwL5H7Rg", "text": ["I pretty much stayed at this place when I was living on this side of town and before jambalaya shoppe was built right down the street from it. \n\nThey have a...", "I ordered take out from here for the first time due to recommendations at my job and all I can say is wow I will be back again. The food was amazing!\n\nI got...", "Made a road trip pit stop here in lieu of eating fast food. We ordered sampler #1 and sampler #2 and kids jambalaya with corn. \n\nThe crawfish pies and..."], "rating": [4, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [[], [], ["corn"]]}
{"id": "2f3BbJDkGlu5kMf6lLvp3g", "text": ["This jack in the box was great. Very clean and really friendly workers. I went with my mom and we orders lunch. We were greeted immediately. We were eating...", "This is the slowest drive- thru in town. Be prepared to wait at least 10-15 min. It'll make you late for work every time. What is wrong w management,...", "I've never had a problem at this location like I've had at other ones. I usually go in the evening and all the employees are really nice, they never mess up..."], "rating": [5, 2, 5], "TBscore": [0.55, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["lunch"], [], []]}
{"id": "GTbVdS3-aiq_FwITVPhQfA", "text": ["We went inside at 9:10 pm for a to go order. Ordered the 5pc with 2 sides dinner box. After waiting for about 20 mins, inquired about our order. And were...", "Rudest Popeye's ever! Also, it smelt like weed. They shut the doors before closing time. They were \"out\" of everything on the menu. Worst fucking place...", "Just a 20 min fast food drive thru.... that's all.  At 6:30pm you would think they would be well prepared for mild chicken orders but this Popeyes takes..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["dinner"], [], ["chicken"]]}
{"id": "EzyPKdoyE9qfLCgft0h8zA", "text": ["Well, I did not have it my way at Burger King. This BK is fit with a very big indoor play place. It is three levels tall and I am not ashamed in saying that...", "I went to Burger King on Jones Creek Road at Coursey Boulevard this evening August 23, 2018. I ordered two bacon cheeseburgers and when I got home both of...", "Every person working here-- should probably just be unemployed. And it would benefit the Burger King franchise to have zero employees then a handful of..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["burger"], ["burger"], ["burger"]]}
{"id": "uYM48LNPM5q32R0J4027Iw", "text": ["Pulled up to wendys at 10am which is the time they supposed to be open I had to wait 10mins for them to open plus the staff was very rude & they gave me...", "I like eating at Wendy's, however I find the staff at this location really rude. When you order in drive thru, they cut you off to ask if that's all. Then...", "This Wendy's is terrible. The customer service here is very poor and they take forever with your orders and don't even bother apologizing for the wait. I..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "wn6unORv0EhbrPpgSb3k7w", "text": ["Chicken Wrap is good, French fries and wings.  Dressings are homemade.   \nService is on the slow side but okay place.", "Review based on breakfast three times...  It's a hotel buffet.  You can't expect much. Maybe my expectations were just low. \n\nHigh points: fresh fruit,...", "I've eaten here twice, once for the lunch & once for a late dinner.  The service was OK, very collegiate.  Both of my meals were fine, but dinner especially..."], "rating": [3, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.2], "keywords": [["chicken", "wings"], ["breakfast"], ["dinner", "lunch"]]}
{"id": "SrQRCIvVPt_588DO8JaDTQ", "text": ["Don't let the bad reviews fool you, I've been here over 50 times! It's the simple definition of the best comfort food you can get at lunch for under $10...", "I did not know something as simple as a chicken tender could ever be so good! I ordered in Waitr so I can't say much about anything else but this is the...", "Went here on a recommendation from a client while I was in town on business. Place was relatively busy the whole time I was there. The food was slow to come..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["lunch"], ["chicken"], []]}
{"id": "dNBJasNdQ-KcrW9fs2t8VA", "text": ["Been here quite a few times over the years.... Always great service! The gumbo is always a treat to eat... They offer a buffet with a variety of foods......", "Really used to love this place ! Went there twice a week every week . Would often bring friends. One day had a very embarrassing encounter with a very rude...", "Wife and I stopped by for the lunch buffet on our way home to BR from Opelousas. Overall, it was very disappointing. Lots of mediocre, nondescript, \"meh\"..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, -0.43], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "2JjSKJ8cplXGaqBfx2ovkQ", "text": ["This place is a landmark restaurant here but I haven't been since I went as a teenager with my parents, I had forgot about it until my granddaughter said we...", "$33 for two salads for pick up. My husband got the super bowl and I got the spinach feta with grilled chicken. The got the dressing wrong and the amount of...", "Came here with a party of 4 on a Saturday at 7pm. There was a 15 minute wait so not bad. Ordered the blueberry coconut mojito and the red fish special. The..."], "rating": [4, 3, 4], "TBscore": [0.0, -0.26, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["chicken"], []]}
