{"id": "GeRh5XnPU8WukQHfE2URwg", "text": ["These guys are the unsung heroes of my life. Every time I go in, they're smiling, helpful, and fast. They have turned around some of my worst days with...", "If I could give this Jimmy John's a 2.5, I would... but I guess I'll round up out of generosity. \n\nI like the Jimmy John's chain, generally. Furthermore,...", "i intend to sue this company no information will be given till after the lawsuit"], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "J6MITPR20MrZjxQKHuIHIA", "text": ["All the reviews below are true. Wont give you water and the lady is not friendly. Its a regular subway so the foodnis good....", "I'll give zero star if I can. Unfriendly staff, which is fine, everyone get unhappy some time occasionally and have bad times in their life.\nBut keeping a...", "Ok it's subway so the food is automatically Meh,  But this place is a special kind of bad.  Always one way under qualified person there.  Ordered a meatball..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "8T5UAV7Z8uVSLOCZQ-DOHA", "text": ["This is one of the greatest places in not just Endwell, but in the entire state of New York. They have these awesome chicken wings with old bay seasoning on...", "I was hoping Endwell finally had a great sandwich shop but unfortunately not yet. I ordered takeout, \nPhilly Cheesesteak, Teriyaki Chicken subs, cheese...", "This is a new sandwich spot on Hooper Road next to Sweetest Things of Endwell. I have been there several times, and the food is amazing!\n\nThe cheeseburger..."], "rating": [5, 1, 5], "TBscore": [0.27, 0.0, 0.22], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chicken", "wings"], ["sandwich", "chicken"], ["sandwich", "burger"]]}
{"id": "ySpxTC0U4Z6f4ckUDWrpjw", "text": ["After eating out with a couple of friends, we decided to get dessert. I was pretty full but couldn't contain myself because you can never go wrong with ice...", "Great spot during the summer (any season actually) for some ice cream. Only problem is it's kinda hidden further down Vestal. I usually get the raspberry(?)...", "One of my favorites.  They are very allergy friendly which is one of the reasons we travel there for ice cream over the rest.  We never get the annoyed..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "RZeu4CwK_YI4jAKli7Rg_w", "text": ["Great wings, hamburgers, fries and spedies.  There are new owners and they are making improvements without changing the friendly feel of the place. The new...", "I go here about 1 -2 a week with my girlfriend because I love their wingz but as for the service bartenders r very rude nd make me feel they racially...", "The only redeeming thing about Wingz are the wings. I should have taken a picture, but alas, I was counting down the minutes until I could leave. \n\nThis is..."], "rating": [4, 2, 1], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["hamburger", "wings"], [], ["wings"]]}
{"id": "9pyUgofnI2bhtqu_lq4-OA", "text": ["Last time I went to this location, took 15 minute to get order and I was the second person in line. She even ignored me. Won't be going back any time soon.", "Stay away from this one. Waited 30 minutes for extra crispy chicken and this was dinner time. They got the order wrong, didn't have cake.   When we went...", "Last time I go here. Got half of my order and had to argue with the window clerk that I didn't order a Mountain Dew with attitude from her when I handed it..."], "rating": [1, 1, 1], "TBscore": [0.0, -0.37, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["dinner", "chicken", "cake"], []]}
{"id": "4iS9WlCamYz3Z9gk9w8flg", "text": ["Extremely dirty. I have watched them give away free food. They were basically begging people to give them good reviews while in the store, off the receipt,...", "They were so nice at this drive through which is something very rare at fast food places just thought i should point it out.", "Horrible customer service ... waited at counter without being acknowledged, workers were swearing when orders called out and not picked up immediately.  We..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "2dhbIrSZtEHCrvdQvUBxag", "text": ["Typical Subway layout. This is a clean location located in a strip plaza.  The staff was friendly and the eating booths are idea for younger kids.", "i intend to sue this company i will not disclose any information till after the law suit", "They don't participate in the rewards program. The staff was friendly however the sandwiches were poorly made. The girl preparing my sandwich put only a..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "BL8AE2hg8qNF6AdzA7ngkw", "text": ["Friendly staff and an amazing deli sandwich.  \n\nWith so many chains in the area it's nice to get a local spot that stands out.  They use Boar's Head meats...", "Until recently this was my favorite lunch place in town. Since new ownership took over, their ingredient availability has gone downhill, sometimes leaving...", "Expensive.   Food is just so-so.   Subway makes a better sub and much better value.   We had to drive back and return our soup.   It was saturated with..."], "rating": [5, 2, 1], "TBscore": [0.42, 0.21, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["sandwich", "deli"], ["lunch"], []]}
{"id": "Zwp4o0iDOzw_Duy2rvIn8Q", "text": ["The Otsiningo Park Farmers Market is amazing with about 30 vendors and 2 food trucks. It sells not only fresh, local vegetables, but also jewelry, pottery,...", "The farmers market is nice and ever changing. The park is large and has a nice walking trail, play area and field for sports.", "LOVE THIS PLACE! I get all my animal products from here...everything from free range eggs to goat meat. Fantastic."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["egg"]]}
{"id": "sB7RbWCvJJ74J0z1o0yTPg", "text": ["Actual stars: 3.5\nCute ice cream shop with so many flavor options!\nI ordered honey lavendar ice cream with waffle cone and I loved the flavor. Not every ice...", "Got a frozen treat for family meet up. \n\nLove the atmosphere and extensive selection. \n\nFirst time came here I got the chocolate soft serve with dip topping...", "I don't think I've ever seen such a wide variety of ice cream choices as I did here.  They sell their own self serve, and a huge selection of Perry's brand..."], "rating": [4, 3, 4], "TBscore": [0.46, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["waffle"], [], []]}
{"id": "CLu7le2_XSIbhXq8X9dFpA", "text": ["SO GOOD. Everyone who works here are super nice and you get ALOT of food. I got egg white w cheese, 2 huge pancakes , bacon, home fries, toast & tea for...", "My boyfriend got hired here and only worked there for 3 hours until he got sent home, he did everything they asked, he could barely understand the owner...", "Garbage!!  Another owner took ownership today July 4th 2018. She is as unprofessional as you can get. Do not waste your time.   You are better off eating..."], "rating": [5, 1, 1], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["egg"], [], []]}
{"id": "Lu9g7cmDJJ3VmwuBa6K7HQ", "text": ["This is a real Diner, with great food, 2 of us stopped in for breakfast and were greeted like we had been there a hundred times ( it was our first visit) ....", "My lady and myself went there 2 Sundays ago.  The place was packed.  The waitress brought us coffee,  my mug had dried droplets of coffee on it and her...", "Family of 6. Ignored at the door. No organization. Once seated no one came to take our order. We had to seek someone out after people who came in later were..."], "rating": [5, 2, 2], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["breakfast"], [], []]}
{"id": "vRo-_I7SwsZKL9LF8GbA7w", "text": ["Stopped in while I was in town one night and was impressed with the amount of flavors they have. I kept to my favorite and ordered the peanut butter...", "I want to start off by saying, this was probably the most family oriented place I ever been too. \n\nThere was families outside enjoying ice cream  with pets...", "This place was great.  Ice cream was delicious even in march.  But one thing I really liked was they take care of a group first before moving onto the next..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "KO_J_azBaySfZwzF1KOtYA", "text": ["I grew up in Conklin and currently live in endicott. My fiancé and I make the 20 minute drive just to come here! I love the lemon garlic marinated chicken....", "My coworkers and I would frequent Reliable once a week for their sub specials. We've always been very pleased as the subs have always been great. All of us...", "a nice little market that's a great place to grab lunch! their subs are pretty good, not the best i've had but still good. the lettuce is a little dry and..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.42], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken"], [], ["lunch"]]}
{"id": "XbIPFuJJ4Fo_2uRwUIFCFg", "text": ["Slowest Dunkin in the area, even with many people working at a time. I usually come in with a mobile order, and every time I need an UNSWEETENED coffee,...", "This is the absolute worst dunkin i have ever been in. They took 10 minutes to make 2 coffees and they were both wrong. The service was terrible and the...", "Typical Dunkin' Donuts menu and layout.  The drive thru is odd at this location because they turned an old bank into a Dunkin' Donuts.  Parking is onsite..."], "rating": [2, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.6], "keywords": [[], [], ["donut"]]}
{"id": "Cd52DLqT_4fALVPSiqG3ow", "text": ["Only 2 stars for this Dunkin'\n\nThis is a busy minimart/dunkin donuts/ gulf gas station.\n\nNote the word \"busy\" above.  Yes, it is.  However, its also...", "Once again, like most Dunkin' Donuts, it is plagued with slow service, employees who seem to not care or have selective hearing, and, for whatever rhyme or...", "Just like alot of the other DD. Very friendly staff but service is a little slow. Im sure they dont get paid what they deserve so I guess I dont blame them..."], "rating": [2, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [["donut"], ["donut"], []]}
{"id": "m_E1LZij7AeUUU05PWLLkw", "text": ["This Tim Horton's is just off the freeway, and if it wasn't for the construction they have going on on the roads outside it would've been easy to get...", "Good coffee but not better than what you taste in Michigan. Busy place for a lazy Sunday afternoon. Nice view though! Staff was too busy to be friendly, I...", "A buddy and I recently visited here on our way to the coalmine in scranton we weren't impressed we asked why all the fuss the coffee isn't that great and by..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "-tUenVZgL3c1WyqfHPJNWw", "text": ["4 times ordered large cold brew w cream and two pink sweeteners wrong every time last one assured was right got to car toasted coconut! Irritated with SUGAR...", "By far the best Dunkin Donuts in the area. I have never had bad service here, everytime I've gone the products were fresh, and the place is clean.", "We were traveling through on our way home to NH.  Everything was good. Went through the drive thru. They were quick and friendly enough. Order was correct..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], ["donut"], []]}
{"id": "jEz9zjgBur2gz7Evk7RYog", "text": ["Seriously disappointed. There was one woman working both the drive thru and the in-store line, and she wasn't even making an effort to seem efficient. I...", "I waited 30 minutes in the drive thru line.   Typically I would not but I wasn't in a hurry and it became my \"mission\" to see just how long it took to make...", "I'm not really sure if there is much to say here. I think if you've been to one Dunkin' Donuts you've been to them all. Drive through on the way to work to..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], ["donut"]]}
{"id": "pazVIrnNR8rSGuCf4zUsjw", "text": ["DD and I are best friends. When my best friend treats me badly, I am sorely disappointed. \n\nToday was one of those days. The drive through line was so far...", "Don't waste your time here. We ordered two large ice coffees, one mocha one f vanilla. The girl making them didn't even attempt to stir them. We both had...", "OMG you have to try their iced Macchiato its literally Everything.I added a Shot of hazelnut and a swirl of Carmel.Its The Perfect Amount Sweetness and..."], "rating": [1, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "ZKr25zf_67rvImUGV8IeMg", "text": ["I really like Russell's and its pretty much a must go during summer and fall. I'll visit the vestal parkway location and the Jimays flea market stand in the...", "i love this place, it's become my favorite apple orchard in the greater binghamton area. it's 10 minutes up the road from lone maple, and well worth the...", "Russell Farms is like a one-stop fall activity festival. They have apple-picking (only spot I know in the area), a really big vegetable stand (plus all..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "oK0IgFyocdiybPRsnijZvg", "text": ["This Dunkin messed up my order multiple times. I have never been to a Dunkin' Donuts that has continuously messed up my order and was rude about it.", "Have gotten my order wrong time after time. Always busy in the morning, if you go there expect to wait at least 10 minutes for your order. Service is...", "Stay away from this Dunkin' Donuts. The service is horrible, the machines are constantly down and you'll get shorted an item at the drive through, always...."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, -0.58], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["donut"], [], ["donut"]]}
{"id": "GXcbXDnHFCVrdhxTamQ9nw", "text": ["There is literally one worker that works here that knows what she's doing and is also polite & considerate to the customers. I inhabit this place of...", "What has happened to this place????    Different people working and orders are NEVER right.  The wait times are ridiculous.   The excuse is always \"we have...", "You better be pretty desperate for coffee and have a lot of time to kill if you go to this Dunkin. Slowest service I've ever seen. And even after waiting..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "fo3LN4t0Xfwt67Jsh71iiA", "text": ["This is my favorite place in the world.  Many a night has been spent at Walmart, for so many different, wonderful reasons.\n\nNeed an impromptu Halloween...", "This place has gone down hill! We went on a normal Monday night (not after a holiday or college move in)  and all the carts were in parking lot, and half...", "THIS PLACE HAS EVERYTHING, PERIOD! Walmart is, by far, my most visited store in Binghamton. I always come here to do my weekly grocery shopping, sometimes I..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "PfdRvsFXe4dRkiRxNWmnQA", "text": ["This is the best!! I remember when i went to JC High school.we would go in for slice of pizza..and then right along someone would be in Wilson Hosp\nand went...", "I think Brozetti's is like cilantro; you either love it or hate it. Or maybe it's like pixie stix; you have to be below a certain age to tolerate the insane...", "Gotten pizza from this place twice when visiting Binghamton, courtesy of my hosts. What a unique pizza! The creamy American cheese paired with a flavorful..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.23], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["american", "pizza"]]}
{"id": "Spqj9wzj7FZXwTq5XuohFQ", "text": ["Blaze pizza has amazing food AND amazing service. It's a casual pizza restaurant where you can build your own pizza on the spot from a wide variety of...", "Love this place.   They are face and efficient with excellent choices.   The place is always clean and is a great addition to the vestal parkway.   Went in...", "This was my first trip to Blaze.  I hear it's a chain.  My kids went here once before and loved it so they wanted to bring us.  \n\nSpicy sauce was much..."], "rating": [5, 3, 3], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["pizza"], [], []]}
{"id": "Erozt2A_f10rbOkYKCsvyw", "text": ["Sauce:    \nToppings(bacon, pepperoni):     \nCrust: \n\nOverall wasn't bad, I'm from New York City, so I have had way better pizza, however compared to the...", "I swear on my life that this is the worst, most disgusting pizza I have ever eaten in my entire life. Granted, I am from Manhattan originally, and somehow...", "Ordered a sheet pizza during the holidays and it was pretty bad. I chalked it up to the holiday rush. \nOrdered a half sheet and wings tonight and got: Cold..."], "rating": [4, 1, 1], "TBscore": [0.0, -0.23, -0.3], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza", "wings"]]}
{"id": "LXL6Hx-cHfTLiE0igWr-Cg", "text": ["Only ordered from here a few times because of the absurd prices for medium quality food ! This place over prices everything! If you're gonna act like you're...", "The pizza is gross now and def cold . I use to get mushroom pizza cause the mushrooms are fresh n not out of a can but even that has not made me want to get...", "This is a recurring situation. Cracking open a cold one with the boys. We decide to order some za at about 11:45pm. Flash forward to 3am, the pizza hasn't..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, -0.3], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "IqfQbErjNaBmMfhZhMIojg", "text": ["I wish it was because the food was any worse then most dominos but seriously it is customer service! As a frequent customer, we are talking at least once a...", "My friend and I ordered the large 5-topping carry out deal from the dominos app. Italian sausage, bacon, onions, mushrooms and roasted red peppers. We do...", "So tired of ordering from here. I always ask for pie cut, they always square cut the pizza. Why even ask if you're not going to bother to read the ticket?..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, -0.4], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["italian"], ["pizza"]]}
{"id": "D-d-rnMHcET1qFE6Ud63kQ", "text": ["I love everything I have tried from this awesome family owned deli! Fantastic food and super friendly staff. I can't wait to try more!", "Great people, great food, good prices. What more could you ask for? They have a great selection of deli meats. Their daily dishes are great. The sausage is...", "I went there for the very first time on Saturday 3/26. ABSOLUTELY FANTASTIC! \n\nLets just make a list.\n\n The food: Inexpensive and AMAZING! I could rave..."], "rating": [5, 5, 5], "TBscore": [0.54, 0.63, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["deli"], ["deli"], []]}
{"id": "k9H6Vpo1hvxw95idaMhZTA", "text": ["Pretty sure it is closed permanently. Grass is grown up around the building and haven't seen a car parked there in the two days we have been here.", "Terrible service.  They were 'just out of our delivery radius' and yet they are only 1.3 miles from us.  I hope they lose more than there fair share of...", "Why is it that every Pizza Hut refuses to make their premises anything but presentable. They need to spend money on their parking lots..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], ["pizza"]]}
{"id": "4t6JmlIBEaZIgYglx-cOfg", "text": ["Excellent!!! The best restaurant in the Southern Tier! Food is prepared by a chef. Cocktails are amazing as well. A superb dining experience.", "This restaurant has some real winners. Their French inspired dishes are excellent.\n\nTheir Thai inspired dishes are less successful, but the rest of the menu...", "Came in for a New Year's Eve dinner with my wife's parents. Despite getting in late at a 9pm reservation everything was on point. The staff was super..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["dinner"]]}
{"id": "FZJZH17PVerRXewUoEzbAA", "text": ["This place use to have the best food , now it's run by a bunch of young idiots who are rude and don't know what the hell they're doing ...especially the...", "I used to love this place but this is my final straw. Barely any cheese on our pizza.  it has just gone downhill. Don't waste your time order from somewhere...", "I have been coming here since I was 18. Back in the day at high school we would get half and half chocolate cookies pizza soda now that i live far far away..."], "rating": [1, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "4orAFza5Vi82dEjA7BdTjw", "text": ["First, love Starbucks so this is a review specifically to this location. \n\nThey were out of their gf menu options and I was starving. Worst part? She said...", "Unfriendly customer service. Tables and seating area dirty.\n\nNot the Starbucks they used to be.", "Im a frequent customer! \nIt's a great Starbucks location. \nSometimes. \nThey have a habit of hiring staff of severely limited intellect.\n Whenever there is a..."], "rating": [2, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "K6BUcHV2eryIum5hWfZDjA", "text": ["Country Wagon is a charming store with wonderful produce and even better baked goods. I recommend the oatmeal cookies and the chocolate macaroons, though...", "Loved this place until today, I went with my sister, and husband, we waited 55 minutes, and watched as other were served whom came in 20 mintues after we...", "Love this little place in my town, they have awesome gifts, fresh local products and produce, amazing baked goods and a friendly atmosphere! Would highly..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "XaTJokQAtwJbbQUbgnrbaw", "text": ["Our waitress Mrs Jessica was great.  Very friendly and helpful.  On our quick day trip down we decided to try something new and we decided on Enfields.  The...", "Really great bar food! The service was fast and friendly, and our waitress was very attentive. Even the cook came out as and asked how everything was. The...", "Date visited: 8/24/2018: Not sure how the kitchen works. Came in. Ordered food. People came in after. Ordered similar items. They've been served.  Waited an..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.52, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["bar"], []]}
{"id": "OnVsGcYoMD0wrPpWM6iloA", "text": ["Great place. Awesome beer. We stop here occasionally mostly in the winter. Only things that would make it better would be food and a radio.", "Revenge of the Stouts event today - 5 stouts all amazing!  Always interesting folks here and diverse in terms of age.  A longer bar than the last time I've...", "Very very nice spot with a knowledgeable and helpful bartender who helped educate me.  I had the barley wine and I have to tell you it was the best barley..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["bar"], []]}
{"id": "QkHTl-p0jh2CF0xZ_kcDqA", "text": ["Stay away.   Small portions,  high prices,  half cooked food.  On top of that, they NEVER participate in deals that you see advertised on tv.... They will...", "GROSS!! OVER PRICED!! \n\nBoth restaurants!! \n\nWAYYY too salty as well. \nPlates too small. \n\nFlies...everywhere!!!! Never seen so many in a fast food place!!...", "I actually enjoyed the cheeseburger and fries I had from A & W. I cannot say the same for the battered and deep fried \"fish\" fillet I had from Long John..."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [[], [], ["burger"]]}
{"id": "vxjNd2DodmPExvscHVT5cA", "text": ["I remember this when it was a Friendly's Ice cream parlor.  Now it's a pretty nice local bar.  I frequent this place when I'm home visiting the 'rents....", "In particular, the pizza. I always give two chances before a negative review, but without question the worst I've experienced anywhere. Limp, despite my...", "So I'm not from around here. I'm from the south. I am used to over-the-top friendliness. But I've been to a lot of bars and restaurants around here having..."], "rating": [4, 2, 1], "TBscore": [0.27, 0.0, -0.5], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["bar"], ["pizza"], ["bar"]]}
{"id": "WiDq0lrqB06SdIhqI2Lw_A", "text": ["Nice cozy coffee shop over on Clinton. A hidden gem in the first ward. Worth trying if you're adventuring out of downtown", "A lovely place to sit yourself down to study or people watch. The staff are warm, attentive and friendly to each customer. I also had their daily soup and...", "Very friendly and fast service. The breakfast sandwich I had was excellent. Look forward to trying the lunch offerings!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.56], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["sandwich", "breakfast", "lunch"]]}
{"id": "TK5Y8knUCG-PRyzPUNUAeQ", "text": ["There's a lot that I really like about Kickstart! I love their creativity, they have new specials every day and I think that's what keeps me coming back,...", "Being retired means we can now go places at off times and enjoy our little adventures. Today's adventure was a 15 minute trip down Route 26S to the Kick...", "This amazing breakfast?  Available all the time at @kickstartcafemy with the seriously talented @millercreativegarage manning the griddle!  This would be,..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.62], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "5a-G9Yn_NS3-63LNh-13dQ", "text": ["a 2 star rating for these guys may be a little harsh, but i have my reasons. first i'll start off with the good.\n\nthis is a pretty solid spot for breakfast....", "Good, simply tasty fare at  below - average prices, served in a historic diner with excellent staff. Orders aren't  filled really fast, but quality takes...", "The taste is good, especially price is very cheap. My first choice to have a casual diner."], "rating": [2, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 1.0], "keywords": [["breakfast"], [], []]}
{"id": "UdKQcwk0kLf4AXtKGDvw4w", "text": ["First time here.  Breakfast was excellent.  Nice clean place.  Reasonable hearty portions. Very impressed. Highly recommend.", "Pretty decent little diner. Good service and cool vibe, classic counter top seating along with tables and some cool old pictures of Binghamton on the walls,...", "Nothing bad to say about this place.  Nice ambience, I like some of the historic local photos inside and the food is good.  Worth checking out."], "rating": [4, 3, 3], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["breakfast"], [], []]}
{"id": "Rm-yHT7zzoLwINOmwWhdFg", "text": ["The jelly was fantastic, as were the hashbrowns. Liked that they let me order one slice of French toast. Our waitress was a sweetheart. #itslit", "Good sized local, friendly diner.  Fries are crispy and delicious.  Chili is full of flavor.  Coleslaw is probably the best I've had.  Highly recommend....", "Have had a lot of good meals here. But just had the worst prime rib I've ever had in my life. I don't know how you get prime rib so tough. Seems like..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "YF8Tu-ylY6PP5FiIGijSBw", "text": ["This is a typical deli such as in NYC. It's nice since it's clean, organized, and has an assortment of certain Asian products, snacks, drinks, quick foods...", "Straight up rude and inconsiderate. On the phone.... RUDE. Acted as if they can be as rude as they want since they were \"the only place open right now\"....", "All I can say is I've never encountered someone less suited for customer service than the man that answered the phone at Northside deli. Their menu said..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["snack", "deli"], [], ["deli"]]}
{"id": "P5M7xQgxhcTjH3LSs6reBA", "text": ["I love this place! We stop in whenever we are in the area. My daughter just moved south and had to stop before she left to load up! The owner Liz is so...", "My mom gets me chocolate covered strawberries from here every year. They're always so fresh and delicious!", "You really need to check this place out! \n\nFantastic homemade chocolates, candies, outrageous goodies of all kinds, gift baskets and gift ware. Keep an eye..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "QXRfuaNvhWPFUmcY6QEiuA", "text": ["Really enjoyed the atmosphere in this coffee shop! It is a perfect spot to pick up a mocha frap and study. There were multiple places to sit and enjoy. The...", "Quiet open space with places to sit and enjoy a coffee, a soda, a snack. No pressure or affectations.", "Good ambience whether it's for studying or just a coffee with some board games to play with your friends and/or family!! Free coffee for students with valid ID."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["snack"], []]}
{"id": "fU3OqfGC3cYWEPu_rD62Iw", "text": ["Believe all the reviews you read. When you're here you'll be dazzled. Tom's is an amazing store with coffee in the front-end, cards throughout the store,...", "Toms is a bit o this and a bit o that. New coffee? They got it. Handmade pottery? Check. Useless knickknack s? You got it! \n\nThe colorful exterior should be...", "I came here with my daughter in search of the perfect prom dress..... Everyone was extremely helpful. The service at Tom's is FANTASTIC! The amazing staff..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "ata6u0bAjCZazMDdEm43_A", "text": ["My food is always good here. The staff are polite and friendly if there's a wait time or if there's any other problem. I've never really had to wait longer...", "This is the slowest Mcds I have ever been too. Not sure why but cars are sitting for many minutes just waiting to pay! They rush you when ordering too which...", "If u go through the drive thru this is a great mcdonalds. The food is always on point.\n\nBut when u go inside it's a different story....\n\nI went in the..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "AiHlG0FS9ZOvOLsxWkPi0A", "text": ["Fast food wasnt so fast. No one was smiling and it seemed like everyone was miserable.  Where's the Wendy's when you need one.", "I stop at this McDonald's on to or back from Syracuse.  Location is great off of I81.  That's all I can say that's good.  Service is excruciatingly slow.  I...", "The women's bathroom was absolutely disgusting. It wasn't just toilet paper on the ground (which was also there), there was dirt in the corners and trash..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "SO-brcBqmr8yjzaSGTNWZQ", "text": ["Really accessible location if you're a Binghamton student. This is a go-to place and the space is super comfortable, so I would recommend going with a small...", "Came here because a local college student suggested the spot when we visited her.  This is where kids go to study and have bubble tea since it is open late...", "I went here multiple times a week/month during school and I love this place. My favorite is the Original Black Milk Tea and Thai Milk tea. I don't have any..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "rMGEbPPCTDCdFYICyzyvsw", "text": ["This is the cutest McDonald's I have ever seen!  I am assuming it was once a \"Mickey D's\" based on all of the retro items with in.  They have an old record...", "This is the most racist McDonald's I have ever been to. The woman behind the counter was giving me an attitude when I walked up to give her my order. My...", "This is the best burger joint in America. Great service, epic old fashioned theme, and the food is high quality. When you hear all the bad health effects..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], ["burger"]]}
{"id": "67OzJA7qUocXzzZaV6UniA", "text": ["Two stars is even pushing it. The workers are often very rude and don't even get me started of the shake and frappe machines. They NEVER work. and I'm...", "Disgusting flies landing all over our food.\nThought they clean up by now but they obviously don't care about the health of others.", "Absolutely filthy! Trash cans were overflowing. Every table was dirty in the play area. The restaurant smelled bad when we walked in. Ordering a drink and a..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "1QLK3KeBbaWhdB3r0UAHXg", "text": ["This McDonalds has difficulty every time getting our order right.   They are frequently missing something and management does not do much to help.  Food is...", "This McDonalds never can get a drive thru order correct.  Today I placed my order and when I got home, I found that I was shorted 2 hamburgers.  Thank you...", "Typical McDonalds restaurant. Clean updated modern interior decor. Maintained bathroom facilities. Customer service was friendly. Location was nothing special."], "rating": [2, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [[], ["hamburger"], []]}
{"id": "bMN7Kg5ORm_BCXujShCKxA", "text": ["For the last for 5 years we have a consistent problem with multiple McDonald's in our area always having problems with their ice cream machine being broken...", "The absolute worst McDonalds I have ever been to. Horrible service, wrong orders, long waits, etc...There is at least a 10 minute wait whether you are the...", "Very possibly the worst McDonalds in existence.  Always the longest wait and often wrong."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "BljwfGAQkiHhL1l3dgui_w", "text": ["I stop at Squiggy's every time I'm in Binghamton. Here's why:\n\nWith the closure of Merlin's a few years back, there is a dearth of LGBTQ spaces in the...", "My husband and I stopped by Squiggy's for a drink on our last night in Binghamton after our visit to the LUMA art festival. We wanted to end the evening...", "Well at first I was going to give this place a chance due to it being slow. It seemed to have alot of charm until the drunk owner came up to tell us the bar..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], ["bar"]]}
{"id": "TJlwVy2sGhBNU3yfrdSKaw", "text": ["I've never had hookah, (or beer for that matter), but I did come here with friends to hang out for a night.  It has a very mellow, relaxing atmosphere, and...", "A good place to go to with a large group of friends. The hookah and drink prices are pretty good and easy to share. If you're in a group, you can seat...", "I only go because they're the only game in town for hookah. They have physically pulled the hookah out of my hand 3 minutes before closing. FIFTEEN minutes..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "S4iThSArsbrbhGiXSv3gaw", "text": ["We stopped in for a quick drink as Dillinger's was right across from our hotel.  A long and narrow Irish pub that must get packed on weekends.  My clue was...", "A local business that also contained apartments was destroyed in a fire recently.  Within hours of the loss of that business this business took the time to...", "Avoid Dillengers.\n\nDills is one of the premiere locations for getting shoved and punched in the back of the head by SUNYs who want to look tough...."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "G5V1nApgx37RNjetsAHWmA", "text": ["Former Binghamton student. Here are my two cents.\n\nPros:\n\nSocial - A lot of Tom & Marty's aspects encourage you to have a good time with a group of friends....", "Great bar, fun music, awesome service. Bathroom is quite small and dirty, but prices are awesome, deals are frequent, and it's always a fun time!", "Tom & Marty's serves as the neighborhood bar for a majority of the Binghamton University students and has an incredible family feeling about it.  Come down..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.34, 0.37], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "Z5bV_y0GomfnZBrPns8aGA", "text": ["You'll probably be surprised by how good it is. The Ale house has an AMAZING beer selection and great service. It isn't fancy but is a totally legit little...", "Beer is amazing and the pizza is weirdly great. Unlimited supply of different beers for all beer lovers. Definitely a place to visit if passing through.", "We wanted to go there for dinner tonight, but they were closed because of the weather. Their loss, we went to Galaxy Brewery instead and it was awesome."], "rating": [5, 5, 1], "TBscore": [0.0, 0.35, 0.45], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["pizza"], ["dinner"]]}
{"id": "ywUzc8o9EGlYTtS2WG0ScA", "text": ["Surprised I didn't write one of these before, seeing as this is my favorite pub. \n\nI love pub food, and Irish Kevin's does genuinely have the best Reuben...", "First time here at this establishment. My significant and I came in on a Saturday for a quick bite and a drink. I seldom give bad reviews but I hope this...", "I visit Irish Kevin's at least 2 times a month. Always provided service with a smile and the staff is very friendly.  I have even seen the staff using sign..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "yApjKk8FMHOyve5dXZBz6Q", "text": ["Great food and prices. Calzones are awesome and love how many choices they have.  Reminds me of the calzones that used to be at DP dough when they were...", "Ordered a mushroom and onion pizza. Was very good, had a couple beers and watched some people play pool. Would come back! One word of advise, make sure to...", "Tons of space to hang out, Great food and drink deals ALL THE TIME, 4 pool tables, very clean, nice employees, large parking lot, occasional live music, the..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.47, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["pizza"], []]}
{"id": "KVJmLChyOS16vf2VGypoUQ", "text": ["I had a great wedding at the Binghamton Club. All of my guests had a great time. The food and drinks were great and the staff really went out of their way...", "Best food in town. Great food options, nice to be able to eat casual and fine dining.", "The Binghamton Club is the top venue in downtown Binghamton's historic homes district for a elegant wedding reception. This club serves great food so you..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "IxP7eX0f7RdNYGlq1o4ypA", "text": ["This was one of my favorite places to grab a drink. He girls working behind the bar were attractive and friendly and made the visits enjoyable. The inside...", "I used to go to this place all the time but lately it's gone down hill a lot. The music is all over the place and the one bar tender can't make drinks for...", "Food is good but whoever the ass clown is who sits behind the bar and plays YouTube music videos of shitty music needs to stop."], "rating": [3, 2, 2], "TBscore": [0.35, -0.23, 0.0], "normalisedRating": [0.2, -0.2, -0.2], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "IK9FAw06KrH4SXGjryYZjw", "text": ["I went there for a Pad Thai takeout totally by coincidence as my friend drove by and casually mentioned she's been there. I ordered a chicken pad Thai and...", "Delicious Thai food and amazing staff! Came here after finding out that Thai on main had an hour wait for lunch. Here I ordered the tofu pad Thai which was...", "This place has delicious drunken noodles and huge portion sizes! However, I made the mistake of coming here craving pho. My group came here after we found..."], "rating": [5, 5, 3], "TBscore": [-0.37, 0.64, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["chicken"], ["lunch"], []]}
{"id": "x_0xedP9K2HBQCdhU10-4w", "text": ["Very good, we had the fried dough,  a chicken and vermicelli dish and as well as a wide noodle dish with the soy sauce dressing ...both very good . A little...", "Owner which is also the server was very rude. Portions are smaller than the other vietnamese restaurant in the area. My nephew ordered rice with pork chop...", "This is my 5 year old's favorite place to eat. I didn't give 5 stars because of the awkward service. The gentleman taking care of us was very sweet but..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["chicken"], [], []]}
{"id": "Neqm-YNEamZ-zLRlW5KOtQ", "text": ["This is my favorite Chinese restaurant in Binghamton. The food is delicious and different from all the other Chinese restaurants. \n\nThere's a secret menu...", "Best Chinese food in the area with a moon star a close second.  Many inexpensive lunch specials. I love their ginger sauce.  For dinner try the shrimp w...", "My family's favorite restaurant. Whenever my parents visit or it's a special occasion, you'll find us here. Shrimp and green beans in black bean sauce is my..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chineese"], ["lunch", "dinner", "chineese"], []]}
{"id": "VsrxRBanSljzkaIYtiTrxA", "text": ["again came to the Good Taste Chinese restaurant, where the General tso chicken is delicious.，", "I was eager to try the new Chinese place in town and to be fair I gave them 3 weeks to work out the kinks of the operation. I ordered Orange Beef, and...", "This is my first time checking into this Chinese restaurant my boyfriend and I liked how very clean and tidy everything is, the customer service was was..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.28, 0.39], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chicken", "chineese"], ["beef", "chineese"], ["chineese"]]}
{"id": "h_RE87pPLSQtFHbVMLaEsA", "text": ["Very friendly, helpful and inviting.\nReasonably price with lots of variations of choices on their menu.\nThey tend to close early, 11:00pm, for my taste and...", "The best Chinese food in Vestal! Everything is quick and delicious and the staff are super friendly and helpful. We've been eating there for years. Our...", "The Staff had attitudes. Very pushy. The young Asian lady had an attitude off the bat when I walked in. I'm standing there placing my order and you know how..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.51, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["chineese"], []]}
{"id": "xqalsIPOiMlMiHUQgbZjpg", "text": ["pretty good, not the best but you'll get a good meal here. i realized earlier that i had never eaten at any of the chinese restaurants in endicott, so i...", "Very good. Not a ton of flavor but nothing a little soy sauce didn't fix. The cream cheese crab things with sweet and sour were really good. Fried rice and...", "Used to love this place, until I got sick from eating the General Tso's Chicken."], "rating": [4, 4, 1], "TBscore": [0.44, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["chineese"], [], ["chicken"]]}
{"id": "b7oC24SInrApg7y2YC1k0w", "text": ["If this place wasn't so conveniently located on Main St, they'd have gone out of business long ago.  They get all the business from the County building next...", "I don't understand why every time I order sweet and sour shrimp I get chicken instead.  I don't eat chicken and I'm sick of wasting my money. Also the guy...", "I have been ordering delivery from them for many years and have never had an issue. The delivery guy is very nice and courteous and if we haven't ordered in..."], "rating": [1, 1, 4], "TBscore": [0.0, -0.34, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "j_9MWt0n2DHqawiQEuX5kQ", "text": ["Not bad! Make sure you have someone in your group who can speak Chinese well enough to order food. This place has delicious milky broth  and pretty decent...", "This is a hidden gem in Bing. \nI spent around $88 (split among four people, so ~$22 per person) for ~3 plates of meat, ~2 plates of fish, noodles, and...", "For having the name of Hotpot Restaurant, the hotpot was quite...disappointing.\n\nThis review is only for the hotpot they offered.\n\nThe price for each person..."], "rating": [4, 4, 2], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["chineese"], [], []]}
{"id": "anQbuRk_4-GeNUfb6H1vyA", "text": ["I've been living in the area for the past two years and I come from a place close enough to the city that I know what authentic Chinese food tastes like....", "My favorite takeout place.  We get takeout about twice a month and it's always from Empire.  Great food and fast and friendly service.  I also like that...", "i went here a few times about 10 years ago and i remember it being pretty good. a couple recent visits still confirmed that. the fried wontons were a bit..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chineese"], [], []]}
{"id": "AkQ3A9GX9z3a8fLQfwcQkQ", "text": ["Located in the West Corners Plaza, China Chef is a casual Chinese takeout restaurant serving up Cantonese, Hunan, and Szechuan cuisine at reasonable prices,...", "I tried China Chef for the first time for dinner tonight and had a great experience! I ordered General Tso's takeout and the chicken STAYED CRISPY! I can't...", "not a bad place, definitely a little better than a lot of places i've been to, but nothing amazing. like another reviewer i went during lunch and it was a..."], "rating": [3, 4, 3], "TBscore": [0.0, 0.0, 0.32], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [["chineese"], ["dinner", "chicken"], ["lunch"]]}
{"id": "gwCFZ_81jWwi2epjKZm6Qg", "text": ["A piece of advice - if someone orders a tofu dish for takeout, they probably do not want to get home and find out that the rice included in the container is...", "Mushy shrimp!  Two orders of shrimp dishes tonight and the shrimp was mushy. I called and politely told them they should check their supply. They seemed...", "Came here during a visit to see my girlfriend's family over Thanksgiving. The gf clamored over their fried chicken wings and boy were they good. Crispy,..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], [], ["chicken", "wings"]]}
{"id": "1vTRveW2_Z9Mi0gRuJq9dw", "text": ["Fail.\n\nI'd heard mixed reviews about this place before finally checking it out on July 4th. I walked in expecting a mix of Asian fare - Chinese, Thai,...", "I'll leave this review here because it seems that they delete comments from their Facebook page...\n\nMy husband and I USED TO love love love Made in Asia....", "I had eaten here once before, shortly after the restaurant opened. It was decent. I tried it again today after their reopening. It was vile. I ordered take..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [["chineese"], [], []]}
{"id": "XJfCTnV3W9SUkTh_3ddxkQ", "text": ["Happily surprised by the service and quality. There's are lots of lunch special options in the $10 range, and they come with miso and banchan. \n\nBanchan:...", "I made it very clear that I have celiac and cannot eat gluten which is found in wheat barely oats and rye for serious medical reasons. After checking back...", "I love Korean food and my base of a good and great restaurant is by their soups. Yook Gae Jang is my benchmark for a good restaurant. Let me say, it was..."], "rating": [4, 1, 4], "TBscore": [0.23, 0.0, 0.38], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["lunch"], ["gluten"], ["korean"]]}
{"id": "kH_1temJhPpwIKs8tjapVA", "text": ["I'll be the first to admit I'm not an expert in Korean food, though I like to think I'm an expert in food and eateries. I came upon SoPoong completely by...", "Coming from Portland, OR, the one thing I can say is the price is definitely reasonable. My review is really only applicable to what I ordered - being the...", "Who would've thought to find a kimbap roll place in Ithaca? Not me, and neither could I have guessed the college in Ithaca is frigging Cornell! \n\nWe stopped..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["korean"], [], []]}
{"id": "6z325jAQeDbHMWNYWblslg", "text": ["-Food\nDepends on what you order. My personal favorites are je yook bok um and squid fried rice. Those never went wrong. When you are sick, get sam ge tang...", "If I was rating the food it would be at a 4. Personally I like this place a lot more than Kokos.\n\nHowever, this is getting a 1 because of the wait staff. I...", "Meh.  Not great.  As others have said the food is about as Korean as any Chinese restaurant is Chinese or any Italian restaurant in the area is Italian...."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], ["italian", "korean", "chineese"]]}
{"id": "BRgMPd46utKLTAnPznnKhA", "text": ["Chicken soup was fine. Similar dishes with those in east Asia. Fair atmosphere. Good service.", "A little better than Four Seasons (hence the 2 stars), but still very underwhelming food. I'm not sure what is up with the Korean restaurants in...", "The service there is rude, and the ingredient is not fresh. I would recommend other Korean/Chinese in Collegetown."], "rating": [4, 2, 2], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [["chicken"], ["korean"], []]}
{"id": "QSGSWUCRzhoQa-v5dGoD6g", "text": ["If you are looking for your typical American Chinese restaurant, this is not the place.  If you are looking for authentic Chinese, this is not the place....", "This place looks better on the inside than it does outside. Just looks like a normal cheap takeout place but on the inside it's very compact and has wooden...", "Stay away, the food here is awful!! It was so bad that we ended up throwing everything we ordered away. What a waste of money!!\n\nHere's what we..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["american", "chineese"], [], []]}
{"id": "coFTwjMoXxczcjGZuPl-Nw", "text": ["I ordered from this place using GrubHub, and I regret having done so. I'll admit that as a Korean food fanatic, I may be more well-traveled than the average...", "I ordered from Bibim Bap using Grubhub and the food was pretty good that I decided to give it a visit. The problem is that the place is impossible to find!...", "First of all, I NEVER write a restaurant review on Yelp because I'm too lazy.\nBut I just had an incredibly disappointing experience here.\nI ordered their..."], "rating": [1, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [["korean"], [], []]}
{"id": "oixyh5Fl30m_TIypp6WHyg", "text": ["Pork pork pork and more pork! This place has a list of 10 or so pork sandwiches, plus a veggie burger for those who don't want meat. I've only tried the...", "I wanted to like this place, I can tell that for the most part they use quality ingredients and I appreciate their creativity, but I was a little...", "This is the perfect spot to enjoy a summer day--good food and a casual outdoor setting make for a relaxing lunch.  The menu consists of creative pork..."], "rating": [4, 3, 4], "TBscore": [0.31, 0.0, 0.35], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["sandwich", "burger"], [], ["lunch"]]}
{"id": "fPdL6xygZuG0m_DQWG6VGA", "text": ["Always packed and for good reason. Food is excellent and moderately priced. Always fresh and tasty. The chili is delicious and so is the smokehouse sandwich.", "I have a thing for the Bananas Foster Iced coffee, it's bananas! I don't even drink coffee much but I HAVE to when it comes to this coffee. Also, the Rachel...", "Delicious salads and sandwiches. Lots of selections of breakfast and lunch items, cold brew coffee and ice teas. Cozy, cute interior decor. The desserts..."], "rating": [5, 5, 5], "TBscore": [0.6, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sandwich"], [], ["sandwich", "breakfast", "lunch"]]}
{"id": "4wirGhIcs50jKMB6aLUe9Q", "text": ["This place is the coolest when my friends come to town. The bartenders are really nice and they have a huge selection of music. The decor is amazing and I...", "It's always a wonderful time when you go to k house. Every time I've come here it's been with a group of friends and we have never had an issue grabbing a...", "K-House is the most incredible karaoke place I've been to, and that includes the ones I've visited in NYC, Hong Kong and South Korea. Who knew I'd find such..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "o7vyvdS7CytNq8kGZ5sU7g", "text": ["My new favorite restaurant!  They have enhanced the Tantanmen soup (more greens/+ 1 more egg split + more meat.)\n\nWhat a great experience eating here. The...", "Great ramen place in an area where asian food is really lacking/limited (besides those 2 star pretty bad AYCE sushi places). \n\nTake note, this is a Korean...", "Easily the best ramen option in Ithaca. Granted, there aren't a ton of options in Ithaca to begin with... but Maru Ramen is a solid ramen experience...."], "rating": [5, 4, 4], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["egg"], ["sushi", "korean"], []]}
{"id": "dFfQWqHyH_lqCpFhNgAhlQ", "text": ["The staff here is really friendly and make you feel welcome. It is a nice sit down restaurant. It's a great place to go to regularly if you live in...", "At beginning, the lady will provide the green tea and snacks. Very sweet. The service is very nice, sukiyaki is very good. Fair price. I will come back again.", "1000% service! Food was perfect and the service was incredibly kind! The lady that owns the place is the kindest soul in this town, she is so sweet and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.44, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["snack"], []]}
{"id": "52y5EzOOtYhX-AGK5sNGnA", "text": ["Found this spot as we waited for a NYSPHSAA State Semi Final game to begin at the high school. The food was phenomenal as was the hospitality. Best wings we...", "Tony and the the crew are number one. He is always asking how the food is and what else he can do for you.   Julie the bartender is super nice and friendly....", "Super friendly staff!! Absolutely great service. For whatever reason the kitchen was slow. I had bone-in wings. Flavor was pretty good but in order to make..."], "rating": [5, 5, 3], "TBscore": [0.25, 0.0, 0.39], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["wings"], [], ["wings"]]}
{"id": "KPSqZ737VWG5J2NRRLJZuw", "text": ["It's insane to me that anyone would leave less than 5 stars ... The hot truck is an institution ..,.", "Pros: God this place is effing dope. The pizza subs are possibly the best drunk food I've ever had, let alone in Ithaca. The portion sizes are huge and...", "She was Hot like a truck, truck, truck\nSandwich like what, what, what\nIfs, ands or buts, buts, buts\nI think I'll order again\n\nThat was from \"Truck Song\" by..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["pizza"], []]}
{"id": "UPMjT5GXoaODJYpmqe9Rxw", "text": ["The salad bar made the recent mistake of harshly limiting the number of topping choices allowed. The salad bar has always been highly dependent on which...", "This is where you can find the best take out salads in Ithaca. The salad bar has a huge number of topping choices, and you can have as many of them as you...", "I visit the Ivy Room quite often. It's the next biggest non-dining hall campus eatery after Trillium. \n\nOptions include:\nBuild your own salads - The variety..."], "rating": [1, 4, 4], "TBscore": [0.0, 0.63, 0.0], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "JlCzPAtL7rA5GdCmyUEPow", "text": ["This is one of those, next to the train station, run-down, shady, and absolutely don't-give-a-f' about healthy ingredients type of place you would find in...", "Where: totally unassuming, slightly run down Collegetown basement location next to Level B.\n\nWhat: the best Chinese food in Ithaca.\n\nHow: Get all your...", "I love the spicy beef with tofu, it's a typical Sichuan flavored cuisine and is definitely satisfying . \n\nThe dumplings, however, are good but not homemade,..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["chineese"], ["beef"]]}
{"id": "ooSc1BXZhZgc5iw7EKt6cg", "text": ["Let me start this by saying that Ithaca's definitely not the best place for high-quality sushi options. Having said that, Plum Tree is as good as it gets...", "Overpriced\nUnknowledgeable staff taking orders\nWarm raw fish\nOnly positive is takeout order processed quickly.\nMy california roll actually tasted the best...", "I came here right after they reopened for the summer, since I figured I'd have the best chance of getting fresh (safe) fish, a real concern in Ithaca. The..."], "rating": [4, 2, 2], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [["sushi"], [], []]}
{"id": "XuMZd7Css7GFPySbs-3DWw", "text": ["Best Thai in Ithaca. Definitely worth walking down a bit further from the Taste of Thai in the Commons. Ordered Crispy Duck Red Curry and Beef Pad Kee Mao....", "The service was great and the food was meh. Not super flavorful and actually kind of bland. But the place is clean and they sing happy birthday with...", "Probably best and reasonable restaurant for lunch in college town.  I ordered drunken noddles , lot of veggies which are nicely cooked and vegetable soup..."], "rating": [5, 2, 4], "TBscore": [0.23, 0.0, 0.6], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["beef"], [], ["lunch"]]}
{"id": "ZzA6l46CKDrHp7tQwV30GA", "text": ["The sushi is delicious and Mae, the host is extremely helpful with helping navigate the menu if you have allergies. I highly recommend eating here!", "I went to this place for five times now. And I have to say how disappointed I am.\n\nThe first time I went there, the sushi in bento box I order taste...", "I went to Sushi Osaka today with two friends, hearing good things about the sushi here. The food itself was pretty good for the most part. We ordered two..."], "rating": [5, 1, 2], "TBscore": [0.36, -0.25, 0.54], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["sushi"], ["sushi"], ["sushi"]]}
{"id": "XBuj07BYkcLa3W2kHilKtg", "text": ["Sammy's is my go-to pizzeria! Me and my friends go every night and they deliver quick service and delicious pizza. Definitely good for any college student...", "If you're on the Commons, starving and this is the only place still open, you have planned poorly. \n\nOn the surface, it looks like a NYC style pizza joint-...", "To be honest, I went in because \"everyone in Ithaca has been to Sammy's\" and I walk by everyday. The atmosphere could be really sketchy at night, but it was..."], "rating": [5, 2, 4], "TBscore": [0.68, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["pizza"], ["pizza"], []]}
{"id": "nBjBk1QprpgALbp6kCn2Og", "text": ["As a vegetarian starving late into night, I didn't have many options available. I've had Moghul at Binghamton University Marketplace before and wanted to...", "DO NOT USE YOUR DEBIT CARD HERE. We went for our first time a few days ago and left a tip in cash... and when I checked my bank account statements today,...", "It's the best Indian classy place in broome county with great taste. I stopped in many times before but decided to write today. Buffet is  good for..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.62], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], ["indian"]]}
{"id": "VZNKj35pKzs-fR8_CMPrgA", "text": ["We stopped by for a quick dinner late in the night. Loved the fact that this place is open till 11 pm unlike most other places in Downtown Ithaca. While the...", "I did enjoy my dining experience here, however a few things happened that made it less than desirable. I didn't have too bad of a wait, they warned us of a...", "My friend and I had lunch there during our day trip to Ithaca. With tax it was about 10 bucks for one person. According to my memory, the items were: rice,..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["dinner"], [], ["lunch"]]}
{"id": "oidBvZouxEal1NWe5ARrVw", "text": ["Description: As good as it can possibly get for Collegetown. \n\nAtmosphere: No fluff, great place to eat with friends.\n\nBuffet: A great deal with enough...", "Roundly beats Delhi Diamonds on taste, which I wasn't expecting. The lunch buffet is a steal, and features a good variety of choices for vegetarians and...", "On our recent trip to Watkins Glen State Park, post our trek we were craving Indian food and ended up at this restaurant. Much to our surprise, this place..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["lunch"], ["indian"]]}
{"id": "0ZIaDoyJNEMQHyjOoI1OYQ", "text": ["Friendly service. We arrived at 2:15pm for a lunch buffet that ends at 3pm, expecting to get the dregs of the day. There was plenty and they also brought...", "They have a downtown location in center Ithaca. Food quality not so good. Today was my first time going to this location and do not plan on going back.", "Criminally underrated restaurant -- it's almost never busy, which is a shame for how good it is. The samosas and the bengan Bartha are absolutely delicious,..."], "rating": [5, 1, 5], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["lunch"], [], []]}
{"id": "Vguu5RgT7gWlB37FUFAwPw", "text": ["I really enjoyed my dinner takeout from Shahi Pakwan. It was ready by the time they promised and parking at the Gateway building isn't bad.\n\nTheir chutneys...", "Stopped in for the buffet today and was a little surprised to see how spartan the options were. Went for it anyways because I was already there.\n\nEvery...", "Finally there is an Indian restaurant in my hometown that I can recommend to everyone. There are lots of average Indian restaurants where you can get..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["dinner"], [], ["indian"]]}
{"id": "vkNUDE08H4fakJfXC6RW6g", "text": ["Great service and fresh food, friendly atmosphere with the employees, we arrived 15 mins before closing and were encouraged to stay and eat!", "I come here at least once a week, and up till this point i didnt have anything but praise for Moes, but as of recently Moes quality been slowly going down...", "The service was less than sub-par. I understand the need for quickness, but I wasn't even able to ask a question about my order before I was shoved down the..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "gNI66pTKrR_W0b1J9zq9Zg", "text": ["I love black and white cookies, so when I heard about The Black and White Cookie Company, I had to try them!  Needless to say, they're the best black and...", "On behalf of the \"Human Affect\" Ad Hoc Unit: Human Rights Learning through Arts and Athletics would like to thank The Black and White Cookie Company for...", "I was never really crazy about Black & White cookies before...only because I had never tried cookies from The Black & White Cookie Company.  These are..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "vg6mVJamGnR72HEE0GKKrg", "text": ["Always a nice experience when visiting Sweetest Thing.   I've only ever had their bubble tea which is not authentic but does the trick when you're fixing...", "Decent service , decent food , but absolutely ridiculous prices ! Over $6 dollars for a mediocre smoothie ? I think not. If it wasn't for their good service...", "Good selection and fairly priced. Great local place. \n\n\nThe guy behind the counter (owner?) made us feel at home and the place is kitschy in its decor...."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "2XsPcomMyK8EPNgeJFTeJg", "text": ["The marinade. The marinade. It is tangy and nice and deep in the chicken. It is by far my favorite chicken in the area. The mac salad had a little to much...", "Tried it for the first time this weekend. I only tried the half chicken and soft serve twist but both were very good!\n\nThe chicken was deeply marinated and...", "Big Dipper BBQ 2 is a roadside stand on Route 7 in Conklin serving up BBQ and ice cream. This food stand branched off from Big Dipper BBQ in Apalachin and..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["chicken"], ["chicken"], []]}
{"id": "QoojEw6y6_OjwiVLeIzrXw", "text": ["I love smokey legends bbq! I don't think you could be disappointed by anything on their menu, it's always delicious. There is no indoor seating however they...", "Yeeee Hawwww!  Quality BBQ has come from the heavens! We stopped in on Saturday and got the Beef Brisket and Chicken.  Wow it was worth the trip.  The...", "Went out to their new place in Glen Aubrey.  NY.  I've had Mikes BBQ before and I think he smokes Dinosaur BBQ. A lot better flavor. And I got all 4 meats,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["chicken", "beef"], []]}
{"id": "af8fIe7SJelsv32b9azVlQ", "text": ["Stopped in on a rainy Saturday afternoon, thinking it was a BBQ place and I could get some brisket or pulled pork.  Didn't get that, but was pleasantly...", "When I visited Binghamtom in upstate New York, I was interested in eating something local. I learned that Lupo's offers food that is unique to...", "I have finally found a spiedie that I enjoyed eating! For years I just thought of them as boring sandwiches with a bit of sauce. But I know people go crazy..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.0, -0.24], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "SwBqY3wogYCXc7aYsbafrA", "text": ["The staff is AMAZING! New ownership! Had the omelette- absolutely delicious! The coffee here is incredible- and I LOVE COFFEE!!!! \nGreat job Christy! This...", "I love this place such tasty and amazing food the prices are awesome the best service the service is always great  and the atmosphere is awesome the best...", "Great Pizza and wings. My daughter brought over the first one to share and now I'm hooked. I prefer Christy's Rt12 diner pizza and wings over any others."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.53], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["pizza", "wings"]]}
{"id": "YOEoH86FvWSaTZ2hnL4CkQ", "text": ["We had a wonderful experience here. The rooms were very clean, large, well appointed and up to date. Two Queen beds and a pull out couch in our room for...", "No stars. They were supposed to charge me $320.32 for my stay but instead kept charging me totaling $991.83\n\nSpoke to the manager during my lunch and he...", "Horrible stay there for 2 nights. The jacuzzi didn't work the first night, so they said they would have their maintenance guy fix it and only charge us for..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], ["lunch"], []]}
{"id": "3SqxYymt5mygu9nMqqYogw", "text": ["Not the best pizza I've ever had, but ok for a fast slice or two. My son loves it and we take him every time we're at the mall.", "They got a new owner or something and the quantity and quality of food has highly decreased. Portions have been less and less, and I just found a hair in my...", "By far the worst pizza in the greater Binghamton area. Extremely over priced and disappointing to say the least. Any other pizza place in the area will give..."], "rating": [4, 1, 1], "TBscore": [0.57, 0.0, -0.22], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["pizza"], [], ["pizza"]]}
