{"id": "usTXW1aEUiYSx2aVBSquyA", "text": ["I have been to Kool Korner many times and I will be going back many more.  This is a great Cuban sandwich shop owned by a man who immigrated from Cuba who...", "Cuban sandwich is good n keep it simple with just Jalapeño but NO tomato, lettuce. Bread is super crispy. Empanadas dough is thin which I liked. Guava...", "So I am glad that I listened to my friend and to the other Yelpers who LOVE this place!\n\nToday was a hectic day at the office, so I wanted to do something..."], "rating": [5, 4, 5], "TBscore": [0.46, 0.25, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sandwich"], ["sandwich"], []]}
{"id": "Dk65y6Xwd5MdzuxbxkapEA", "text": ["This is my teen son's favorite restaurant. He has eaten at Highland's (5th best restaurant in the world)yet he prefers Which Wich. Specifically, he loves...", "Yes, this place is absolutely amazing. The taste was great and the atmosphere was welcoming. The best thing is, you can get all your sandwiches as an...", "For a sandwich place, there are a surprising number of gluten free choices here. You can turn any sandwich into a salad or a lettuce wrap and I think that's..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.8, 0.55], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["sandwich"], ["sandwich", "gluten"]]}
{"id": "XXLQMv7JzIdUSsLJs3_6Kw", "text": ["As with all restaurants in this area, parking can be a challenge.\n\nI had the Gyro Sandwich and order of fresh Pita Chips. The gyro was better than average....", "The burgers are immense and full of flavor. The service is both swift and friendly; the staff are always very welcoming. Exceptional value and great taste!", "Randomly happened to find this place.  Ordering area is kinda small but there's a ton of outside seating(with shaded areas). The people are really nice!..."], "rating": [4, 5, 4], "TBscore": [0.22, 0.43, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["sandwich"], ["burger"], []]}
{"id": "1HZKCD39QZRl8TrHHYXl9A", "text": ["I've eaten here several times just not this location decided to have lunch delivered today from here. \n\nNever had the soups before so I called to get...", "I recommend the whole sandwich. I only ordered half thinking 6in would be enough, but it is a wrap so you do not fill up on bread. Definitely should have...", "I love, love, love Roly Poly wrapped sandwiches. I had their chicken, ranch hot wrap it was very delicious for lunch. And I didn't have any breakfast. This..."], "rating": [1, 4, 4], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [["lunch"], ["sandwich"], ["sandwich", "chicken", "breakfast", "lunch"]]}
{"id": "EA5_aYfEJo5flYiWMT_XIA", "text": ["I've had the pleasure of dining at the original Mamma G's in Auburn for many years and owe my first full cup set to them. I used to try different menu items...", "We were the only couple in line. \n\nStaff was not courteous. \n\nMeet in sandwiches is skimpy and tough. Turkey Rueben and Pastrama Momma. \n\nMany empty tables...", "The past 4 times in a row we have been to this location, the service has been absolutely terrible. Sure, the food is fine, which is why I gave a second..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [[], ["turkey", "sandwich"], []]}
{"id": "m-14W3HgY0Ra15d5JCfxuQ", "text": ["Stopped in here because I was hangry!\nService was great .There was 2 other people in there so they weren't that busy and the employee came to our table 2...", "A great sandwich spot started in the \"The Loviest Village on the Plains!\"  I usually get the Momma's Love all the way.  All sandwiches can be steamed but be...", "I ordered delivery because I'm staying in a hotel with no restaurants near and no car. Delivery took about 20 minutes longer than expected. The au jus had..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], ["sandwich"], []]}
{"id": "6oX89PxjOZehVL_3ZRhqqQ", "text": ["One thing I find difficult is finding a fried pie in lemon flavor that doesn't taste like lemon Pledge. Milo's has succeeded where others have always...", "No matter how new the location, the retro feel is still in place (no, no q-bert machine to be found).  More importantly the sauce is abundant.  Their unique...", "Who doesnt like milos? Great tea... great burgers.  Clean place. Fast service."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.54], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["burger"]]}
{"id": "aPkgWP9yPjyRX2JclPK34w", "text": ["I can't believe I've never written about a Milo's experience.  I've been going to Milo's since I was in college when my wife (then girlfriend) introduced me...", "**update**\nStopped by this morning for breakfast (typically only lunch or dinner) and had to wait almost 15 minutes for my biscuits. While I appreciate them...", "Milo's is a Birmingham institution that people either love or hate. I love everything about Milo's. The classic patty and a half hamburger comes with only..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["lunch", "breakfast", "dinner"], ["hamburger"]]}
{"id": "nzzysXI4iQGhDM4f1V0mHQ", "text": ["One of the best hamburgers I have ever had and, no, it was not eaten after leaving one of the bars in the area. It is in a gas station, but it is sooo good.", "Been hearing about Becky's which is located inside a Chevron gas station in Avondale for a very longtime .  I must let you all know, I love white table...", "This is one of my favorite places to pick up breakfast. I usually get the ham and cheese omelette with tomatoes and onions, grits and toast. Sometimes it..."], "rating": [5, 3, 3], "TBscore": [0.85, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["hamburger", "bar"], [], ["breakfast"]]}
{"id": "LrOhpjaZrzX_LWkGoq6qyA", "text": ["What a great lunch we had! Burgers are freshly made, cheese was melted and the fresh cut fries were delicious! The owner was super kind, and staff was not...", "I've seen excellent reviews, but personally I was somewhat unimpressed. The look of the restaurant is nice, although the music didn't necessarily match the...", "Where to start... we have been coming here for the past 3 years and I have yet to write a review.. well I have dropped the ball. This is one of those places..."], "rating": [5, 4, 4], "TBscore": [0.59, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["lunch", "burger"], [], []]}
{"id": "V-6S-vDwEeRHK8hp6EFi5g", "text": ["We dine at The Front Porch at least once a week, I always find the service & food to be top notch! This is a nice little community restaurant located in the...", "We've been here a couple of times and the food was never really great. It is good in a pinch, but not somewhere I'd go on a date night. It's the closest...", "We came here for the first time after reading it reviews. It's in a really cute area and has a nice little outdoor patio. \n\nI order the pimento cheese..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "xeJgEeBq14hADfqtE2AN-A", "text": ["Delicious wings and poboys. I LOVE that they give you the option of blackened shrimp instead of fried. My husband got the buffalo chicken poboy, and it came...", "This is the second iteration of Chubb I'm aware of. They had Chubb's in old strip center in Alabaster several years ago where the original Papa Sais used to...", "This place was so good that my work crew wanted to come back on back to back nights and get the exact same thing. I obliged because I thought it was pretty..."], "rating": [5, 4, 5], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["wings", "chicken"], [], []]}
{"id": "y7h1xW1AUMLZ0CgO6QRerw", "text": ["A Sneaky Pete's food truck was in Ross Bridge today. It was absolutely a godsend because I really was not feeling the idea of cooking dinner tonight because...", "Friendly cashier. She endured my confusing ordering tactics seeing as how I haven't been inside a sneaky petes in years. My crazy butt was still trying to...", "I don't even know where to start about this place.  I decided to try this place out for lunch. It was super busy!! Usually when a place is busy the customer..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner"], [], ["lunch"]]}
{"id": "3QWt_m-aqUW1flhGSM36UQ", "text": ["Average price I had high expectations when coming to this place and found mediocre food. Nothing to tell your friends about the slaw dog wasn't very good...", "If you work in the UAB area you are probably familiar with the group of restaurants on 18th Street S between 5th & 4th Ave. You also know that the space...", "A co-worker and I had heard that the burger place next China Master had closed and that G-Dog's was now in it's spot. So, we decided to head over there for..."], "rating": [2, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 0.6], "keywords": [[], [], ["burger"]]}
{"id": "8VKixqhyBG_jeIqn-lDuKQ", "text": ["Don't waist your time. This place does not exist! The address is a church. No-one answers the phone and the voicemail says the number belongs to David, not...", "These hot dogs are excellent. Very tasty and some unique. \nI recommend the laura Lee. Pimento cheese, smoked mayo, salsa and corn chips. \nBasic utensils...", "This guy knows how to serve a hot dog. Picture this, bacon wrapped hot dog with carmelized onions, peppers, jalapeno mustard. This is super delicious!! You..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.36, 0.0], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], ["corn"], []]}
{"id": "zZ75BFgm-SXU9v2BYgH0Pw", "text": ["Paul's is my go to for hot dogs in Birmingham. The \"all the way\" with special sauce, kraut, onions, and mustard is the closest I can find in the area to my...", "We had a craving for a hot dog so here we are! Paul's had a very good variety on their menu. Not just a hot dog joint. I had a cheeseburger all the way with...", "The husband and I really enjoy Paul's! It's a tiny shop in a shopping center in Trussville. If you don't know where it's at you would probably miss it...."], "rating": [4, 4, 5], "TBscore": [0.0, 0.49, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["burger"], []]}
{"id": "62wiFJcUqG1BrobEniTo8w", "text": ["Disclaimer: I have a habit of going to hot dog joints but not actually getting a hot dog.  Case in point.  Went to Gus' for lunch & got a turkey burger. And...", "This is my 3rd visit to Gus'. Each time I've gone I've been greeted by the friendly staff, the tables were clean and no unusual smells. I've had the Regular...", "I would not come back here again. The hot dogs are mediocre and there is nothing special about their ingredients or how they are cooked. The french fries..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["turkey", "lunch", "burger"], [], []]}
{"id": "4L5fGOfzNDdPCmnaNTXaMQ", "text": ["I really like how this particular chain of Sneaky Pete's is localized.  The staff know many of the customers by name and additionally the staff is very...", "I love SP because it's a family tradition between my mother and I. As a child she'd always get 2 dogs all the way and now I get the same thing in her honor,...", "I used to work about 2 blocks away from this store, and usually ate there 4 days a week. The guys here cooked and prepared the food 10x better than most..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "KOJIdXm4TiQgbOKSEe0nFA", "text": ["Really good burgers and fries.  Everyone is super friendly.  My wife and I love going there at least once a week.  And the prices are equivalent to...", "I stopped in today for breakfast for the first time. The staff was very gracious and explained to me the different breakfast options available. They have a...", "Excellent little hot dog joint....will be back...great food....great service. Always looking for a good hot dog place...looks like I found it."], "rating": [5, 4, 5], "TBscore": [0.32, 0.21, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["burger"], ["breakfast"], []]}
{"id": "B3seZujzMXz5qZfxziEkVQ", "text": ["I usually go here for a quick breakfast. My go to is a bologna all the way on wheat and basically, they know it. Service is good and familiar! I also like...", "This sneaky Pete on Pk Pl is a city staple!  It's small and quaint but great service and friendly staff.  I ordered pancakes and sausage and boy was I...", "Love this place for a quick, delicious hot dog.  Very friendly with a crew of regulars they greet by name. Always happy when I happen to be nearby and can..."], "rating": [3, 5, 4], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [["breakfast"], [], []]}
{"id": "0Q-vnFyo6_Xdv3lZ4MgnkA", "text": ["The Depot never lets me down.  My favorite are the burgers and cheesy chicken with fries.  I love to sit out on the porch and watch the falls.  Service is...", "Best place to go in Helena. The view itself should make you want to visit this place. For me, it doesn't get better than dining with a view of the water....", "This is one of those hole in the wall type of places but is so good. It is right in the heart of downtown Helena. I highly suggest the cheese burger and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken", "burger"], [], ["burger"]]}
{"id": "15FEb7U7kC58F7SO9P9dEA", "text": ["Road tripped up to Birmingham to try this place out.  A former gas station converted into a restaurant, the concept is really cool!  Although seating (and...", "Maybe I'm biased because I call Bluff Park home, but this local hole in the wall is worth the trip up to the top of the bluff! The restaurant is built...", "Tip top is the best place for a gorgeous view.  The food is good for quick lunch.  They serve hot dogs, hamburgers, chicken fingers and sandwich at a..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.41], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], ["lunch", "hamburger", "sandwich", "chicken"]]}
{"id": "9KDN-qj6B2g4Jb2ABHUhtA", "text": ["Since I've been in Birmingham, I've been told I need to try a Travis Burger and/or Polish dog. Well, I've finally had the chance to taste both and I was...", "Always good when I come. The wings are really good with  the loaded fries. Polish sausages and hamburgers are worth trying as well.", "This guy is super nice and working it every weekend outside of Saturn. Stop by and have a polish sausage or a hamburger. He will grill it right in front of you!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.57, 0.32], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["burger"], ["wings", "hamburger"], ["hamburger"]]}
{"id": "IyRUiSZCgnwfUPky6bX_lw", "text": ["One of my favorite parts of springtime is going to Avondale Brewery to have beers and crawfish. The crawfish at Red Mountain Crawfish is the best I've had...", "Red Mountain Crawfish has been my go-to location to get some great crawfish.  I never had anything there that wasn't fantastic from the crawfish to the...", "Never a bad experience! Our crawfish were delicious today! They were out of shrimp but I will be back this week for some! I fell in love with these guys..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "SRMfm5HXIrnHgbRqqbrUVQ", "text": ["I know it is just hot dogs but the staff helps this place with the high rating.  They get you on and out quickly with a smile and a nice hello.", "I haven't eaten at any other locations but this one unapologetically messes up your order. I ordered 2 chili cheese dogs and the display reads out as a...", "I love the hotdogs,I had them first in birmingham in the late 60's. I now live in washington state, I ordered some sauce and 5 days later have not recieved..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "WRALwdIn1tPcSNtOGLhnhQ", "text": ["Great little neighborhood spot to eat.  Ruben is my favorite thing on the menu.  Good local beer selection and friendly service. Parking can be a nightmare...", "Out of towners. Based on the 4 star rating and price that is why we selected it. I would say it's on par for the area. Not amazing and not horrible. The...", "Flew into town, Uber'd in/out, good thing, next to no parking/cute neighborhood. Tried my hand foolishly at the Italian next door (packed), ended up at..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], ["italian"]]}
{"id": "IdEYCu7l1B8ek1NwSaarRQ", "text": ["Fast friendly service. Hot dogs are great so are the burgers, chicken/tuna salad plates and chicken sandwiches. If you are in a rush don't worry you can get...", "The food was tasty and a great deal.  The breakfast biscuits with eggs, cheese and/or meat are awesome!  However, not being allowed to touch the cup was a...", "When I moved to Birmingham in the mid-90's Sneaky Pete's was one of the first places a local took me. He called it a \"Birmingham institution\" at the time...."], "rating": [4, 3, 3], "TBscore": [0.0, 0.9, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["sandwich", "chicken", "burger"], ["breakfast", "egg"], []]}
{"id": "CCHSGMDG8GkPOMrhCKA56g", "text": ["Service has always been quick and food is hot. The philly wrap is amazing as well as the street tacos.", "The service was decent for B-dubs. Definitely better here than some I've had. \n\n Their burgers are terrible. A pre-formed frozen patty. No thanks. Thought...", "I never ever complain about a bww. My favorite restaurant even after becoming vegetarian. The black bean burger . So good. However yesterday our service was..."], "rating": [4, 1, 3], "TBscore": [0.39, 0.0, 0.37], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["tacos"], ["burger"], ["burger"]]}
{"id": "Ak3YuIwQzv9EFyxMVAzw_A", "text": ["Wings were great, and the delivery was roughly on time. But...how are you gonna forget the dipping sauces, the napkins, the silverware, AND the celery?!!?...", "Wow the service was amazing! The new owner Fez was extremely helpful and cheerful. I did not know there was a new ownership but it shows, my tenders came...", "Great wings and even better service! I order from this place weekly. My favorite is lemon pepper with a side of mild sauce :)"], "rating": [3, 5, 5], "TBscore": [0.32, 0.0, 0.55], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["wings"], [], ["wings"]]}
{"id": "xeMUVZ3LBKD_90pcgopt_A", "text": ["Not my favorite Hooters.  The bartender had a horrible bar presence.  I had to call her over for everything instead of her checking on me.   She got my...", "I've been to this Hooters a few times and never had a bad experience. My most recent visit was after a UAB football game when I was starving and wanted to...", "I'd give it less but I wouldn't be able to leave a review.  Went in at 8:30 and was seated.  Now 8:43 and I'm walking out.   No one came to ask what I..."], "rating": [3, 4, 1], "TBscore": [-0.25, 0.0, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [["bar"], [], []]}
{"id": "GM9syyJuiDo8WYuXU-90rQ", "text": ["I have a bone to pick with Baumhower's. Please sauce your wings properly. We used to go here every Friday. The XX hot sauce is why. When the wings weren't...", "Restaurant week brought us in here to try them out. A little later in the evening and they really weren't that busy. Upon check in they indicated it would...", "Came here during Yelp Restaurant Week to try finally try out Baumhower's. What's more exciting than a 30% discount. People have always told me Baumhower's..."], "rating": [2, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, 0.6], "keywords": [["wings"], [], []]}
{"id": "1sPlnKUJ96AEvd9WrWTgkg", "text": ["Went to Leeds for Atrox got there kinda early and decided to grab food everything was typical so we stopped here at this little dinner it wasn't busy at all...", "Great little place with excellent service! The wings are cooked up hot and fresh with tons of sauce choices. Prices are really good. Nice menu variety....", "After reading reviews on here we decided to stop in after a great day at Barber Motorsports Park.   We were greeted by a very nice young man, Shaun (hope..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.49, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["dinner"], ["wings"], []]}
{"id": "Y119KF3G2wknvgQfeE4xnQ", "text": ["Although they had some kitchen issues our server made the experience 10000%  Mislissa aka Melissa lol maybe they'll order her new corrected name tag after...", "Sweet Home Alabama Hooters was just below An average experience.  \n\nThe environment was not the normal festive as one would expect of a Hooters.  \n\nThe...", "We waited 30+ minutes to get seated.  There were  9 open tables when we put our name in with one group ahead of us. I stood by two open tables just to watch..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "sfEyXYGNp6NJ3CBQ0aP3Sg", "text": ["THE BEST WINGS IN B'HAM!!\n\nWe go here at least 1 or 2 Thursdays a month. BUT if you want wings at a discounted price go on a Wednesday- .75 cent boneless OR...", "5 star on wings!  Some of the best wngs in town by far. \nTheir wings have a nice crispy outer but juicy and full of flavor inside.   Perfect!  Double dip...", "I have eaten here several times and it was good at first.  Their customer service has always been bad, they act if they could care less if you ate there or..."], "rating": [5, 5, 1], "TBscore": [0.35, 0.51, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["wings"], ["wings"], []]}
{"id": "ePbcnfJTK3u2Yv6k01Prmw", "text": ["Normally when coming  to Zaxby's I eat their wings & texas toast, but this Cobb Zalad is fulfilling. Mistakenly went during lunch so there was a slight...", "I don't know why food always tends to taste better especially if you haven't eaten at a particular restaurant in a while and Zaxby's is no different on the...", "I usually drive thru for visits to this location on the way home from work.\n\nNo wait to order.\n\nFood prepared quickly and accurately.\n\nPretty typical for..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["wings", "lunch"], [], []]}
{"id": "lt6YIp84JCbmQxyqOk8zpQ", "text": ["So let me preface this by saying Billy's has amazing food. The wings are the best in town literally. Crispy, just enough sauce and nice sized. The original...", "I stopped into Billy's today before the Iron Bowl to pick up some apps to take to a friend's party. I sat at the bar for 13 minutes without anyone asking me...", "Just waited over an hour for our food. It wasn't even crowded. The waitress disappeared after taking our order and never came back. We had to flag down..."], "rating": [4, 1, 1], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["wings"], ["bar"], []]}
{"id": "I6qW07n5nT7Xt6huRYsPwA", "text": ["Had a small party and wanted some pizza fast. They came pretty quickly and the pizza was hot and delicious. In the directions for the driver I put high five...", "Very rude on the phone not friendly at all need to learn customer service I can teach I'm a manager over a store and the lady was very rude", "Will Charge for things they say they will not charge for! This has happened multiple times, they make many mistakes, leave out sauces deliver the wrong..."], "rating": [5, 1, 1], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["pizza"], [], []]}
{"id": "ZBVbcNZWwmvibv7QRIufFg", "text": ["We decided to come here since it was near where my car was getting fixed. I saw several yelp friends had reviewed, and I knew I could trust their opinions...", "Stopped by here on a wing-filled weekend to try sampling some place we had never been before. We saw several reviews from people we knew from Yelp, and...", "Tried the lemon pepper wings and regular chicken tenders on this occasion. The side of hot was flavorful and wings were freshly fried. Another decent spot..."], "rating": [3, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.6], "keywords": [[], [], ["wings", "chicken"]]}
{"id": "J3YNuaqApIpnEP4T7cvpIA", "text": ["My favorite wings in bham, and I've tried em all from Ensley to center point. Hot lemon pepper, all flats, with Cajun ranch fries are impossible to beat.", "This restaurant has 4 stars I'm not sure how when I ate here the only thing that was good was the kool aid. Fries were cold And the wings are from bottom...", "Wings were only ok. Gizzards had no seasoning and the fries weren't even salted. Flavorless food. Restaurant was dirty. Won't be back."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["wings"], ["wings"], ["wings"]]}
{"id": "luRk3OIY5H9wRfH6GjzAtQ", "text": ["Incredible wings and amazing flavors.\nThis location is right by UAB Medical West, and has some of the best wings that I've had in the area.\n\nLemon pepper on...", "I really enjoy the wings, hamburgers, fish, philly steak sandwiches and cheese fries. I still have many items on the menu to try. The combos all include a...", "So disappointed. The first time we went here the wings and fries were delicious.  This time however, the wings had way too much sauce and the fries tasted..."], "rating": [5, 4, 2], "TBscore": [0.56, 0.45, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["wings"], ["wings", "hamburger", "sandwich", "steak"], ["wings"]]}
{"id": "Xzd0viU9yMT3DZ_XaK-6Cg", "text": ["Stopped in here for a couple of drinks after work with my new co workers! The waiter/bartender was awesome! He's a looker with a nice beard too!!!", "Honestly this place was really disappointing. I saw it was only 3 stars but my dad had recommended it and I thought \"hey the rating doesn't always equal...", "I have never had an experience like this at a restaurant for brunch on a Saturday with few customers.  After sitting down and ordering drinks, it took about..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], ["brunch"]]}
{"id": "zG0ZPNClGbtJzAK6Kf6XFg", "text": ["My girlfriend and I wandered into this place one Saturday lunchtime. It's a very minimalist place in a residential neighborhood. Downside is a pretty long...", "Food was made fresh to order.  It was very flavorful.  Not much meat on the bones but it was cooked thoroughly.   Fries were a bit soggy and under seasoned....", "Very long line. The prices are very low which may explain the line, but the food is poor. Chicken wings taste OK but have little meat, the fries are not..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], ["wings", "chicken"]]}
{"id": "p-DNnfTxmbLJzeytZthx1A", "text": ["Omg!!!!! Is all I can say this food was so bomb!!!! I find myself telling people about how good the Load Shrimp Fries was and waiting for another chance to...", "Wait...I haven't reviewed this place yet?!?? Well, let me get right to it! This food truck is heaven sent! Do y'all hear me??? It's heavenly. Let me go...", "Caught them on the shrimp and grits day! Usually I get the bayou burger which has lobster and shrimp but today I got lucky and they were serving this trip..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["burger"]]}
{"id": "7NYBLDmTiCM4U8nhx7tHWg", "text": ["Came here for lunch and it wasn't busy so we were immediately seated. \nI got a ginger beer based cocktail and it was very refreshing! \nI ordered the Black...", "We went on Sunday afternoon not knowing there was no burgers or sandwiches just breakfast items.  Ugh, not a fan of breakfast.  Luckily there was a wing...", "Great place for a craft beer and a good feed!"], "rating": [4, 3, 5], "TBscore": [0.25, 0.33, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["lunch"], ["sandwich", "breakfast", "burger", "wings"], []]}
{"id": "gVaV2ZErBdy06lpwgLhroQ", "text": ["My fault. I'm the one who chose to eat there. First thing. Right off the bat. There was a 10 minute waiting period with lots of tables open. That's my first...", "This Red Robin has really gone down in the past few years. \nWe used to go here a lot but it got to where every time we went it would take over an hour to...", "I would have gone lower than one star but that isn't allowed. Service is slow, food was disappointing as well as over priced. It may have been over priced..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "2Y5m4EtB_A-LEVdY55ALLA", "text": ["I get drive through at this location about once a week.  Service is usually pretty good, the long lines are just because the food is so good!\n\nThe chicken...", "This is definitely one of the better fast food chains, and I have seen improvement since my first visit here when it first opened. I remember it as being...", "Terrible service at this one! They got my order wrong twice and failed to even apologize or be kind about it. My order cake not to go when I ordered it to..."], "rating": [5, 4, 1], "TBscore": [0.23, 0.0, -0.35], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["chicken"], [], ["cake"]]}
{"id": "rCg4HKuyDd7RWjYr7DsUJQ", "text": ["For tonight's dinner, I decided to eat at an oldie but goodie, KFC. I hadn't been to this location in awhile, so I decided to change that. \n\nI was greeted...", "Could barely understand the woman in drive through. She was rude and short. Once I got to the window she asked me if crispy was okay instead of original bc...", "Sticky... Its the first thing that comes to mind when I think of my experience here. Sad, because the food was fine, but this place could use a deep..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["dinner"], [], []]}
{"id": "TrGBsHrLb_K5Mu2_Vn3Gvg", "text": ["I blame my fellow co worker for hyping this place up. She told me that I should try it on my lunch break and therefore I did. Haha\n\nI had walked downstairs...", "Love, love, love this place! \nYou really can't go wrong with their side options or anything for that matter. \nOne of my staple places for lunch when...", "Had to run an errand at the Galleria. Went ahead and grabbed lunch while I was there. The food court at the galleria now comprises a few fast food staples..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["lunch"], ["lunch"], ["lunch"]]}
{"id": "wzDsk0PIID4wtq1Qnj_OkA", "text": ["This place has been on my list for a while. I'd forgotten about it and then it came up on my Newsfeed as a 'Food Network presents...' That definitely...", "This may be a little bias because I have been eating off this truck for the VERY BEGINNING! They can do NO wrong!! I got the Combo bowl which featured...", "I've visited this food truck multiple times. Normally, I get the shrimp and grits or the fried chicken. I've had the fried fish below as well. I've always..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["chicken"]]}
{"id": "mrqNM-aoc56Ewc6P4K9XuQ", "text": ["Out of several of the items I wanted the three times I've been here, however the food and price compensates. The fried shrimp, fried green tomatoes, shrimp...", "My first time here. Very clean, nice restrooms, & our server was super nice. We ordered the award winning jambalaya and red beans & rice as appetizers. My...", "Look for the words 'hidden gem' and you will find a picture of Boateng's Cajun Creation. If you are looking for the short version of the review I'll give it..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "PVrbW-9T-wPAyVFJU36QKA", "text": ["I had a half rack of ribs and they were pretty dry and had very little meat on the bones relative to their size.  The BBQ sauce is great and the server was...", "Well, I waited 6 months and against my better judgement, l gave Dreamland 280 another shot. They should rename it Nightmare 280. Way more appropriate!...", "Went here after reading a blog post while driving from Orange beach to Birmingham about how great this place was. We were Very disappointed.  \n\nWe were..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "TLZuxoazP_kjjmkfLEv_pQ", "text": ["I don't see why this place has just 1.5 stars. Everytime I've been here I've had good service from a friendly staff, the restaurant is clean, & good food...", "Grabbing lunch at work and decided to to check out the Panda Express location. It was very clean on the inside and the staff provided excellent service....", "Many items empty or old during peak dinner time and only one person working in the kitchen."], "rating": [4, 3, 1], "TBscore": [0.0, 0.74, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], ["lunch"], ["dinner"]]}
{"id": "hCgHP53PL9MyLJMICZTx5w", "text": ["The place to go if you are wanting to clog he arteries with a fried meal. Everything is fried. I go with combo 2 and usually pick the wings, catfish, and...", "I ordered the 3-way combo with jumbo shrimp, oysters and 3 whole wings. I also ordered the 1/2 & 1/2 gizzards and livers. I asked the cook to undercook the...", "Comparing the taste and quality to the price makes this place awesome. Get the 4 Piece Whole Wing with Honey Gold. My hips are so in awe they've expanded a..."], "rating": [3, 2, 4], "TBscore": [-0.25, 0.0, 0.6], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [["wings"], ["wings"], ["wings"]]}
{"id": "hBuAMdCK4zDi9lnxBD7zXg", "text": ["I came in around 2:30 today so there wasn't many people there. The food came out really fast. I was happy with my meal. I typically get the Olivia's south...", "A simple menu: chicken salad, but in a plethora of styles! \nEasy, friendly, quick and tasty. \nWarm soups for the cold days, fresh salads for the warmer days...", "We got there just before the lunch rush. Very very clean restaurant! They have a healthy menu to select from. Food was served to our table. Everything we..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.55], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["chicken"], ["lunch"]]}
{"id": "GY7jk3FB_z0BvMkIT6MJOg", "text": ["Love love love chicken salad chik! The employees are so helpful when trying to figure out which chicken salad I want to go with. They even will let you...", "P...Bread, you've got some competition! Okay, maybe not in terms of options, but quality of national chain vs. local chain, CSC is the REAL!\n\nAs we entered,...", "I've been watching these places pop up throughout Bham and wanted to check it out. Today I got my chance. If you enjoy chicken salad, look no further...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "0aLUc9WnJLf-c44SWtGQ3A", "text": ["This location is located in the heart of Homewood. I love its convenience, but be prepared to search for a parking spot. It is within walking distance of...", "I called in an order for a Chicken Salad trio (Olivia's Old South, Kickin Kay Lynne, & Jalapeno Holly). This was the Homewood location. \n\nThe service was...", "Great little lunch place. Never heard of them but apparently it's a chain. The chicken salad was very popular with the Homewood area and now me too...."], "rating": [4, 3, 4], "TBscore": [0.0, -0.25, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["chicken"], ["lunch", "chicken"]]}
{"id": "U0M9xXbzf2px0PZG2XV8sg", "text": ["This place is a hole in the wall, but very good. We were driving thru on our way to Mobile and picked up a family member at the airport. We stopped to get...", "This chicken joint is just your average run of the mill hot wings place.  No razzle dazzle, no bells and whistles, what you see is what you get.  \n\nThe...", "VERY GOOD wings! And koolaid! Try the Cajun ranch all flats! Red koolaid for sure! Call it in because the line WILL be long. Everything is really fresh!"], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.39], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["wings", "chicken"], ["wings"]]}
{"id": "c8JR5mgSvwgTT8gCvibYVQ", "text": ["This play is great what can I say? I had the vegetarian Thai plate and Thai tea and they were both bomb. Prices and reasonable for what you get. The owner...", "The Yellow curry had a very strong odd flavor, resulting in a dish I would not call curry. It was not to my liking. The basil fried rice was reported as...", "Im a huge fan of Thai food so I was anxious to try this newly opened restaurant. The fresh rolls were great with the spicy peanut sauce. The only..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "dCfBpl_tsNKEIfutTgSLPg", "text": ["Great chicken casserole. Took half of it home and my husband devoured it.", "Decent meat and 3 style place. Staff is friendly and is located inside the harbert center downtown. Priced reasonably and service is quick. Portions are large.", "Tried Avery's cafe in the harbert centre for the first time the other day. Overall I found the food to be mediocre. I got the fried pork loin which I found..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["chicken"], [], []]}
{"id": "XZCsGXFcfC-FXvm1T1KtZw", "text": ["I'm not a big sushi guy, and didn't know what to expect here. We had edamame and mango slaw to start. The mango slaw is now one of my favorite things -...", "I hardly ever get to visit the Hoover location even though it's down the street from me but this new location is perfect for putting it in lunch rotation!...", "So excited this is finally open on 280!!! I finally got to go the other night. The ambiance is the same as the downtown Juan (see what I did there). They..."], "rating": [5, 4, 4], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["sushi"], ["lunch"], []]}
{"id": "JCeuWvwI7kj2NUO2mWDFCQ", "text": ["Stopped by for sushi today and it was a great experience. We ordered the crab wontons, which came with a side of spicy mayo. They were perfect. For sushi,...", "Great miso soup and their vegetarian sushi is great! Nice to have a place that sells veggie roll!", "This is definitely my new favorite lunch stop! The service was fast and friendly, and I had a delicious and very well made tempura roll. I was able to eat..."], "rating": [5, 4, 5], "TBscore": [0.9, 0.85, 0.43], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sushi"], ["sushi"], ["lunch"]]}
{"id": "aTfa1b5lu-P0Pd87-hVetA", "text": ["Wonderful experience! I had never been before and the guys were super helpful and friendly.  I'm not adventurous at all, so I pretty much got shrimp and...", "Downgrading review because of inattentive staff.\nRestaurant had a long line because staff had trouble explaining menu, had miscommunication about how to use...", "Yum! I just LOVE poke bowls. Okay, I have only ever had poke bowls at this Ono Poke and their Homewood location. They are just so light and refreshing. You..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "PKhORDUggBxDSkybHHnzwg", "text": ["Just a review on the bubble tea! Stopped in cause I was thirsty and wanted something sweet, so bubble tea! Did the Thai bubble tea and it sure did hit the...", "I got so excited when I saw a place like has finally come to Birmingham in the mall. The staff was super friendly. We ordered a chicken pho and kids fried...", "Not sure why this place isn't getting more traffic. I got the shrimp spring rolls and they were pretty tasty...nice texture of the wrap that has rice,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "dh6zpJaIUPZcE2ze5Hsx0A", "text": ["I surprised my wife for her birthday by coming here. Neither of us had ever been, and we were very happy to have that situation rectified! We started with...", "My only serious complaint is that they had run out of Chablis. That's a seafood restaurant after all! Luckily, we have found another good wine (Sancerre...", "I've been here twice now and was disappointed both times. Here's why I was disappointed. The first time I ordered the boullibaise. It was good, just not..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "U2712qYtUmBJfBCyKmNcDA", "text": ["One of my favorite sushi restaurants in Hoover! Their miso soup and ginger salad is out of this world. They prepare high quality food so if you're planning...", "The food here is always good because it's consistently fresh. The people that serve here are friendly, warm, and accommodating. The best time to come is...", "One of my favorite sushi restaurants in Birmingham. The lunch specials are great, two sushi rolls and soup for $9.95, I always substitute a salad for the..."], "rating": [5, 5, 5], "TBscore": [0.39, 0.0, 0.65], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sushi"], [], ["sushi", "lunch"]]}
{"id": "c98YaFT9N4iincAdfj9Y7Q", "text": ["So I ran in for a quick lunch - I had a half hour to burn, and Yelp was pretty positive about these guys. I told them I was in a bit of a hurry and ordered...", "This is a great place for decently priced sushi. If they put a bit more money into the atmosphere, I would probably have given 5 stars. The food was fresh...", "I really like this place for lunch. They have great prices and great food. I get the hibachi steak most of the time and it comes with a lot of food and the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.44, 0.57], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["lunch"], ["sushi"], ["lunch", "steak"]]}
{"id": "4xnz5jeqvvd34XgeIKsIbQ", "text": ["First I will say that the employees at the Subway are always very friendly, work hard to get you through and get your sandwich made.\n\nHowever, I will not...", "GREAT Subway! Everyone was super friendly, the place was very clean, and they were still cleaning  and they made my fav chopped veggie salad to perfection!...", "This Subway was one of the best I have been too. This Subway had the Veggie Patty, which in my opinion is one of Subway's best meats, even though it is not..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["sandwich"], [], []]}
{"id": "20u2G4wZpDuMIO08JdTa6A", "text": ["After attempting to purchase a Ham from another location (Vestavia), I came here hoping the lines were shorter and service was faster. And I was in luck! 3...", "Until recently I didn't even realize that Honeybaked served lunch.  I'm sorry that I was missing out for so long!  Their sandwiches are very good and fresh....", "I came in here today to pick up a quick lunch before work. I've always had great experiences with this store and franchise overall. Years ago, I would have..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["lunch", "sandwich"], ["lunch"]]}
{"id": "4dBj83oCicfDu1Op7L2EDg", "text": ["I went to this location for the 1st time,just moved here, the customer service was outstanding. The food was hot and sandwich fixed correctly. Will...", "The service at this Birmingham Arby's is always excellent. In the past 5-6 years during our drive through Birmingham, Alabama we always stop at this...", "Usually good service.  The new turkey club is Great!"], "rating": [5, 5, 4], "TBscore": [0.28, 0.0, 0.61], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["sandwich"], [], ["turkey"]]}
{"id": "Yd3reIuZC1VbMn8IqqAjbw", "text": ["Nice place and good location but the parking is a big downfall. I ran inside to pick up an order and got a parking ticket within a minute.\n\nBirmingham...", "Zoe's in my mind is an instant hit for lunch. This location recently overhauled their menu and looks great. \n\nThe menu is packed full of delicious...", "This was one of my favorite places to eat ... haven't been in several months, until today.  The menu has changed and favorites gone and replaced.  I ordered..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], ["lunch"], []]}
{"id": "hVqiUFlY3Y6AU4Z1TseRCQ", "text": ["This review is based on breakfast only. I was pleasantly greeted by the staff with a big smile and a chipper attitude which is exactly what you need in the...", "Friendly service and the breakfast wrap is insanely good. Only knock against this place is lunch items are a tad pricy.", "Wall Street Deli is in the second floor food court of one of the bank buildings downtown. There are a few other places here, but this seems to be the only..."], "rating": [5, 4, 4], "TBscore": [0.26, 0.36, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["breakfast"], ["lunch", "breakfast"], ["deli"]]}
{"id": "HDvo_dvhBDR82hVbnTgu0A", "text": ["Paula made my day. She was literally dancing and singing to Michael Jackson while making mine and another customers lunch. I'm not big on leaving reviews...", "This used to be one of the best Subways in Birmingham. However, over the years, the customer service has really gone downhill. I must have a sign on my back...", "This is the best Subway I've ever been to.  There's plenty of parking, never a wait and the sandwiches are carefully and generously made! I go here every..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.44], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["lunch"], [], ["sandwich"]]}
{"id": "jZtieV_N7M9rzDkADwFf4Q", "text": ["This is continuously the best subway in Birmingham to visit. Everything appears to be very clean and the restaurant is well taken care of. The staff is...", "This is my favorite Subway in the city. Each server really puts pride in their sandwiches. I really appreciate not just a good sandwich, but one that is...", "Sandwiches are great but people behind counter are too busy giving away free food to their friends and leave you standing around waiting to pay...."], "rating": [5, 4, 3], "TBscore": [0.0, 0.4, 0.23], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["sandwich"], ["sandwich"]]}
{"id": "pLqzF_RVaGwK6d3n47XZSw", "text": ["I stop by here occasionally after karate and get a good meal on the way home. Since Arby's switched to the better quality meats, I've liked it a lot more....", "I have definitely eaten at cleaner and newer Arby's, but the food was tasty. The dining room was a bit messy. The bathroom was fair. They guy behind the...", "Out of beef how is that possible? Then had to pull up and wait 10 + mins on the chicken it's like they just didn't expect to be open or have customers idk..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], ["beef", "chicken"]]}
{"id": "DNsMpj16--GmYXrZvr2KXA", "text": ["Momma Goldbergs is a good place to grab a casual sandwich or salad. It is a pretty standard sandwich place, with a couple of unique menu offerings. They...", "Great place! The sandwiches are steamed here. Not soggy warm and melt in your mouth.\n\nThey serve alcohol and have specials and happy hour from 5-9. \n\nThey...", "We stopped at this pleasant little deli on our road trip from NY to Louisiana. I'm so glad we stopped here instead of some fast food chain. Our sandwich was..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.8, 0.31], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["sandwich"], ["sandwich"], ["sandwich", "deli"]]}
{"id": "8OLGRKbE_n7joKTSlvmwlA", "text": ["I am trying to be more aware of what I eat ( trying to avoid junk). I've always enjoyed Zoës and felt that I am eating sensibly when I eat there. \nI noticed...", "Short version: Don't go to this location if you plan to eat what you actually wanted from the menu. \n\nI love Zoes - a great light meal stop. Their rice is...", "I have had Zoes many times & have always had a great experience. This was my first time at this location & I would say, it met my expectations as always. I..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "akjIYTDYNKf3zRyScDXLAQ", "text": ["Perfect for a quick lunch or dinner. I'm pretty simple when it comes to my sandwiches so I usually go for the Turkey Tom sandwich. I also love the Country...", "This Jimmy John's is great for lunch. The staff is always friendly. I come here often if I don't bring a lunch to work. Occasionally some of the homeless...", "Normally fast, extremely slow today. Normally prepared for peak lunch time but not today. Food was great, staff was still nice."], "rating": [5, 5, 4], "TBscore": [0.31, 0.39, 0.29], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["turkey", "lunch", "sandwich", "dinner"], ["lunch"], ["lunch"]]}
{"id": "cNJ1WE8eSB5DvBNyOiSuxA", "text": ["I was looking for somewhere to go on my lunch break and i noticed this Subway I felt like service should have went quicker because they were not busy at all...", "I visit this location often as it is close to home. The restaurant is always clean. I did experience one visit where the restroom wasn't up to par and...", "One of the best lunchtime eatery's. Good fresh food and pleasant staff.\nI eat the cold cut combo and the spices Italian and it is always good."], "rating": [2, 4, 4], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [-0.2, 0.6, 0.6], "keywords": [["lunch"], [], ["italian"]]}
{"id": "-oKOmwq2mfClx1tv1XNJmg", "text": ["This place is great, I have been coming here for years. I have never had a bad experience there. Nick, the owner is very friendly and personal. They have...", "Very cool little shop. Great prices, and meat turned out good. They also have an decent selection of beer. I will definitely be back for my butcher needs", "We ordered a smoked turkey dinner to feed our family and it was delish! This was our first time eating anything from this place so we were a bit nervous..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["turkey", "dinner"]]}
{"id": "beKoEohZkIfeFz_qH-JOEQ", "text": ["The food is good but service is bad. My husband went there on 10/14 @ 12:30. He was getting a take out order to bring home. He went inside because drive...", "I normally go through the drive-thru every Saturday for some reason the last couple times I have not gotten my full order today was mozzarella sticks, last...", "My food is always made efficiently, it's hot when I get it, and the customer service has always been amazing. Definitely a great place to stop if you're..."], "rating": [2, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "xbnNKrc46QUj1z5uzd2Hvg", "text": ["What a great group of folks that operate this place!\n\nI came in for a bite eat before I had to hit the highway around 3:30ish. The place surprisingly had a...", "These sandwiches \n\nLeslie and Veneca took care of us and they were sooo helpful with my soy intolerance. The online menu is not accurate unfortunately, but...", "I got there around 11:30. It was a new lady on the register training. Food was good but the service is always slow."], "rating": [5, 4, 3], "TBscore": [0.0, -0.35, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["sandwich"], []]}
{"id": "Wsn8I24iVsWyw9XKAc9gWQ", "text": ["I like Momma G's, but this one doesn't live up to the rest. The sandwich isn't steamed very long, so the bread is slightly warm and the meat is still cold....", "Great steamed sandwiches and nachos. Love the momma's sauce (tastes like Italian dressing)", "Awe. Its a great one. From the quickness your food is prepared to the first bite you toss or cram in your mouth, it is oh so delightful. It is like a party..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["sandwich"], ["sandwich", "italian"], []]}
{"id": "DZ7MzIehXcTw-n7_aqkj_A", "text": ["Ok, so full disclosure, this place is just a little to convenient especially if you are in the mood for something sweet to top off a lunch or dinner you...", "Chicken salad sandwich was excellent.\nPasta salad side even better.\n\nGreat gooey desserts.", "This is one of my favorite lunch spots. The staff is always friendly and takes care of their regulars. The turkey Reuben is made with sautéed cabbage and..."], "rating": [4, 4, 4], "TBscore": [0.25, 0.43, 0.44], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["lunch", "dinner"], ["sandwich", "chicken"], ["turkey", "lunch"]]}
{"id": "AunTyVG8y213u2nGvCij6A", "text": ["A little after lunch crowd is because they are veryyyyy busy at this location. \n\nYoung ladies are always friendly and helpful. They're bread is always soft...", "Clueless, and zero customer appreciation. I ordered the footlong daily special $6 sub. When they handed me the bag it was small and light. They gave me a...", "I've only been to this Subway once. The one time I did go which was about two weeks ago, the workers were nice and professional even when the line was very..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["lunch"], [], []]}
{"id": "1rOKbjJUxd0w4LtwBv6h3w", "text": ["I think this place may practice false advertising without realizing it. Why would you put a sign advertising a foot long sub for $6 and it doesn't start...", "Gtrat staff and very friendly.  Fresh bread and veggies make your sub great. Very clean location and safe.", "Great Subway. Very nice staff and it's clean inside. I ate in for the first time today and my coworker didn't get napkins so an employee that was eating..."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "ga3TtiHHZUYwiT6edy1YmQ", "text": ["We have mixed experiences here. Sometimes they are better than others. Our meal was slow to arrive. We ordered pancakes and French toast. Brinner is our...", "Came here yesterday mid morning to grab some breakfast, didn't seem to busy but there was a 25-30 minute wait for 2 people. No big deal, so we waited....and...", "I think everyone knows what to expect with Cracker Barrel. I love that it is a family friendly and casual atmosphere. We typically go during dinner hours..."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [[], ["breakfast"], ["dinner"]]}
{"id": "xGREFhlW94iEfamVxCCCpw", "text": ["I am surprised there aren't more reviews on here, but I am happy to give this place five stars. I came here for a work lunch a little over a week ago and...", "Excellent ambience, best shrimp and grits I've ever eaten. \n\nIf you are the impatient kind, you might find the service slow. The great food will make up for it", "I used the Gardens Cafe for my wedding reception venue along with Kathy G catering.\n\nThey set up the cafe for my reception. Set up the food and kept it..."], "rating": [5, 5, 4], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["lunch"], [], []]}
{"id": "sxVW44Yyx-nHnZ57C6NuBA", "text": ["We had grilled cheese, salad, grits, bacon, waffle, scrambled eggs (allstar breakfast) and icetea. I was trepidatious initially, having frightening memories...", "This place exist in the space-time continuum of late night party goers and Southside street walkers. The wait staff (all black) manages the rush with a cool...", "I had managed to live half a century without going to a Waffle House. I'm officially good for another half century. \nI am in Alabama with a friend who grew..."], "rating": [4, 5, 1], "TBscore": [-0.25, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["waffle", "breakfast", "egg"], [], ["waffle"]]}
{"id": "5Lg9oFAB8_WLOUFpgOjbBg", "text": ["Um. Wow. \nI was a little hesitant, because I ordered from a delivery app, but I was totally surprised my ice cream arrived, still cold & rolled like in the...", "Lucky Cat is all about providing a memorable experience. Eager to try rolled ice cream for the first time, I came here around 4 PM on a weekday, where I was...", "Great first experience!! Staff were awesome and ice cream really great as well. We chose 5 different flavors and all were to die for. I've posted menu pics..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "Z442qSLXqFTPcmUxZEvp5g", "text": ["Had been hearing wonderful things about The Pantry for a while but having a guest in town finally got me there.\nIt. was. incredible. \n\nWe sat at the outdoor...", "I could have sworn I wrote a review a year ago...But here it goes!\n\nFood: 3/5\nAtmosphere: 4/5\nService: 4/5\n\n---\n\nI ordered 2 toasts (avocado and something...", "I loved everything about this place. I was disappointed that they don't have the waffle bar anymore and I'm not sure how much food they do serve anymore. I..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["waffle", "bar"]]}
{"id": "ndL4SDVQrr-vErVYWyJvhA", "text": ["Four stars are only given due to Rosalyn the chef who salvaged the night our server took everyone's order and only God knows what she went and called out...", "Waffle House on the hill.... what can I say?? Gotta love them.. this location. The hospitality was amazing! Rosalyn made up for any mistake that any server...", "First off, 60°F is not a comfortable temperature. Why they chose to have the air so high just amazes me. \n\nOur waitress....just terrible. She seemed like a..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.62, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], ["waffle"], []]}
{"id": "X9zSQ53zxqBHQ38xKTnrlQ", "text": ["Stopped here to eat breakfast with my father. He complained of being sick from a previous visit. We ventured to a different location, and this one was it....", "If I could give this location negative stars, I would.\nThis place is a complete CLUSTER!!!  My last visit (which will probably be my very last visit to this...", "I went in starving. Now I am a server myself so I know how it is. But this was the worst experience I've ever had at a restaurant period. I went in sat at..."], "rating": [4, 1, 1], "TBscore": [-0.3, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["breakfast"], [], []]}
{"id": "JaaijxP_cFoPvGKoecUz_A", "text": ["This is the best Waffle House I've ever been to. What makes this one so special and unique? The people!\n\nAs is problematic with most chain restaurants,...", "I had the Pork Chop breakfast with a Waffle. The pork chop was really tender and seasoned to perfection. Quick service and friendly staff.", "Ms. Debbie is a great server and we love her and the food here.  It is fairly consistently good.  Always a crowd after Church on Sundays, Saturdays are very..."], "rating": [5, 4, 4], "TBscore": [0.58, 0.29, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["waffle"], ["waffle", "breakfast"], []]}
{"id": "K-12M_3qiZm_hqt02GLPFA", "text": ["Love this place! Used to go here all the time in Texas. Too bad this place is only in the south. My go to is the fiesta omelette, hash browns well done and...", "I have NEVER in allllll my damn days had service like this. We waited 20-30 minutes before an order was taken. Two servers. The original one took so long to...", "FLUKE - PATTERN - PROBLEM !!!\n\nA little about me... I think it's important to know that, on average, I travel weekly across the southeastern U.S..  Waffle..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["waffle"]]}
{"id": "CaxbI2GOu3iKoyLUl7rsEg", "text": ["My godson wanted ice cream so I checked Yelp and came across Edgewood Creamery. I'm glad we found it! It's a cute, little ice cream shop beside Taco Mama...", "Call me crazy but im giving a dessert place only 3 stars. I have been to several ice cream places around Birmingham and Edgewood was a disappointment to me....", "I love ice cream, so I have visited a plethora of ice cream shops in my 27 years of life. However, my last visit to Edgewood Creamery today has proven what..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "iL7gos-eQoegCfSx7GmW0Q", "text": ["This is a great location as far as easy to get to from our home. When they first opened this location the staff was on top of everything and they had great...", "Standard American bresfast/lunch/dinner diner style food \n\nStaff always helpful and quick", "This is the absolute best Waffle House in Birmingham. The staff is amazing and friendly. Clean and good food!!"], "rating": [2, 5, 5], "TBscore": [0.0, 0.0, 0.59], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [[], ["american"], ["waffle"]]}
{"id": "r9lzTzFDFLTOigxU5-Kq_Q", "text": ["Went here on valentines day, even though they were busy we still got good food and service", "It's gross. Service is terrible. No teamwork. Roaches are present. Coworker also ate there a few days ago and saw several bugs/roaches.  It is gross.", "It was okay. It is your typical Waffle House. It's kinda my \"go to\" place when I am having a bad day or just need to talk to someone. I typically ask my..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], ["waffle"]]}
{"id": "6esV90-C3-tMJFlYOmqcBw", "text": ["We were greeted happily as soon as we entered. Food was prepared amazingly. Server had a lot to be desired; the only reason for a 4-star instead of a...", "Best bacon I've had in a while...thin and crispy. Perfect! Moe was an excellent waitress too! Great service!", "Very upset with my visit today. As I've worked in the restaurant industry for a very long time, I know that restaurants can get hectic; however, they burnt..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "AdbT4qJnUnGK7DS18FdVOA", "text": ["Beware this is a ALL smoke restaurant, food was decent, but everybody inside is a heavy smoker. Guest, employees everyone is smoking so heavy, it's hard to...", "I love this place. The staff is friendly. You can smoke inside. However some of the food tends to be bland and a few times I've had over seasoned food. I...", "If you like smoky, loud environments with Meh food, then this is your place!"], "rating": [1, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "wK-2f_pGbyzuVyLCNEwnxg", "text": ["This place is your run-of-the-mill waffle house. A little bit on the cleaner side than most waffle houses. Good late night food. Always a favorite after a...", "Come on.......WAFFLE HOUSE!!!!! What more can I say? An experience I'll never forget. Wish I had one near my house.", "The staff is a delight! They are so nice! They all speak when customers walk in! The true meaning of service with a smile! And the food being good is a..."], "rating": [4, 5, 5], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["waffle"], [], []]}
{"id": "23XqMr9XYlpUifVGURv0Dg", "text": ["Fantastic dumplins. Very good vegetable selection. Phenomenal sweet tea and great, sweet rolls. Definitely a good lunch spot in downtown Bham for a solid...", "This review is for the downtown Niki's restaurant.  When visiting B'Ham the last 10 years or so I have eaten here on several occasions but not in the last 3...", "Another soul food spot I just had to try. Good food but I don't think it's the best in Birmingham.\n\nI will say if I'm looking for extensive options for a..."], "rating": [5, 2, 4], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["lunch"], [], []]}
{"id": "rsEvs8xW4r8pBAT8P_mNVw", "text": ["This is such a quaint and family oriented place!  I typically  stop here for breakfast but at times I go for lunch and it's never disappointed!", "Best home cooking around. Seasoned well, not greasy. It's ALL good. Save room for the Pecan Pie!", "Best of the best in local home cooking in this neck of the woods period. Out of the way but worth it for breakfast, especially the biscuits and gracy. Best..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.55], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["lunch", "breakfast"], [], ["breakfast"]]}
{"id": "TYjy-1FQOvV95FMac-vcIg", "text": ["This place is the best crab in Birmingham area.\nI checked the menu and pictures of foods before I went, and did not expect too much on the quality of the...", "This place was so amazing I went back 2 weekends in a row!! Don't allow the area to deter you! The food is definitely worth the drive!!! It's in a Plaza...", "Fast service,  good visit, great food! Located in a unique location,  they stay busy. You can tell they have repeat customers and I will also become one,..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "SAhC5dNaaQ-1Jq8zcwD3IQ", "text": ["Visited new Cahaba Heights location because it is HERE...we finally have Wentzell's in Birmingham!  On this Monday afternoon/early evening we sat...", "Glad to see we have a new Wintzell's location in Cahaba Heights! The food is great and it's the perfect pace for families, too.", "We went there tonight for dinner around 8 pm. There was a very short wait; however once we were seated we learned the restaurant does not have a license to..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], ["dinner"]]}
{"id": "ITtB6Gh6Zk7MHQd4fNQFNA", "text": ["Laid back environment.\nAll you can eat popcorn shrimp on Sundays.\nAnd they have fritters (sweet corn nuggets)\nTasty oysters and perfect size shrimp. Service...", "A quick stop before heading home. The food was decent but I've certainly had better.", "I was not impressed as this place didn't live up to the hype. Had popcorn shrimp with fries and hush puppies. It all had the same fishy and greasy taste..."], "rating": [4, 3, 2], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["corn"], [], []]}
{"id": "jsd7CgkfKLpoyy0EOFc4Wg", "text": ["Stopped here with my kids after a zoo trip. I got peanut butter fudge, and my kids got C is for Cookie (cookies and cream/chocolate chip cookie dough...", "One of my favorite spots for dessert!\nHand packed real ice cream in a couple dozen flavors with easily 8 different chocolate-containing choices. It is fun...", "Great place to visit after going to the zoo or having lunch/dinner in the area! Delicious ice cream, good service, and really great environment! Love..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "wVvQku-wshzfeXrwcyxvoA", "text": ["What a great new addition to the shops at Crestwood. I really like the old-timey feel of the name and idea behind this shop. This pharmacy has a modern...", "Super awesome place! I love that I can get that old fashioned flair of going to a soda fountain and getting ice cream or floats. Totally worth going and my...", "I love getting my prescriptions filled here. I was so tired of going to places like CVS. Taylor is very knowledgeable, helpful, and contacts you as soon as..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "oc-GleWsXGtiIqBeQ9eq4A", "text": ["Went here tonight for the first time, while visiting my parents here in Hoover, from out of town. \nAs someone that used to own a place that had Hand-dipped...", "My friend Kimia M., a future Yelp Elite, and I came in here after seeing a Yelp offer for a free ice cream sandwich once you check in here as a token of...", "We went there because we heard they have good ice cream... and they delivered just that a really good ice cream. It was many flavors and different cones and..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["sandwich"], []]}
{"id": "2ZM2v-t4SBfTllWP8yZc4g", "text": ["One of mountain brooks hidden gems this place has been open since 1928. Known for their sandwiches and chicken salad  it's a down home old school drug...", "We came for the fresh squeezed limeade and we were not disappointed. I'm not sure about the food but the limeade 100% yes. Next time we will grab a bite to...", "Birmingham staple that is right in the heart of Mountain Brook Village. It is a classic drug store lunch counter. It has all the usual suspects - BLT,..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["sandwich", "chicken"], [], ["lunch"]]}
{"id": "aQ-kPHVgGpi0HawHOTf5mw", "text": ["Listen to me. Seriously, I need you to really pay attention. The Peach Milkshake cupcake I ate from this place today was phenomenal! This was one of the...", "I came over to the summit to pick up a couple of things and have an after-work  popsicle. The Dreamcakes truck was parked there, the window was open, and I...", "I looked up cupcakes on yelp and found this... Being a fan of dreamcakes I headed towards it, and I was totally let down to find that it did not exist, it's..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["milk shake"], [], []]}
{"id": "1hzLHFOXkvD_4lXn4VSc3A", "text": ["So, I always love the food. But this location is a little iffy. The girl who works mornings at the drive thru (I think her name is Kwanza), is so...", "We are visiting from out of town, it's raining so we decided to use the drive-thru. This was a bad decision. The young lady was rude and rushed us. This was...", "I was pleased by the customer service. I went through the drive through and we all know that drive thoughts can be iffy. Well not here at Whataburger. I was..."], "rating": [3, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "8wXO04VELxAi5G-y07r-GA", "text": ["If I could give no stars I would. The customer service at this location is absolutely awful. I used the drive thru this morning. I was rushed with my order...", "There are 4 Sonics Drive-Ins in the Birmingham area and I have never been to this one until now.  I must confess that it has been a long time since I've...", "Ughhhhh. Food was cold as ice. The extra mayo wasn't nor mayo period was on the burger. The burger was way past dead. The onion rings were still practically..."], "rating": [1, 4, 2], "TBscore": [0.0, 0.0, -0.26], "normalisedRating": [-0.6, 0.6, -0.2], "keywords": [[], [], ["burger"]]}
{"id": "x6OhMILWj0dplc00o0tsIw", "text": ["This review is straight up for the drive through only. Plus, this really only related to the breakfast menu. Primarily a plain buttered biscuit or a bacon...", "This Jacks is so unorganized, unfriendly, and not helpful at all. We have been to this location 2 separate times and both times we were not greeted when we...", "It is quite obvious that Jack's Corporation owners never had a grandma who could cook! The fried chicken they serve is the most awful nasty simulation of..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, -0.42], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["breakfast"], [], ["chicken"]]}
{"id": "LyC7st0MwEa_Sgd3tyUSew", "text": ["Five Guys is a burger place that keeps it simple and that sticks to the thing that they do best, which is burgers and fries. As far as places go where you...", "I'm not changing my rating, but today the fries were not fried enough. They were soggy and limp. The three times before at this location, fries were super....", "I love the team at the 280/greystone location! They know my order and make it great nearly every time (98%). Crystal, James, and Damon are amazing. They are..."], "rating": [5, 4, 5], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["burger"], [], []]}
{"id": "4yDfJpgIMlWegS6edqq12A", "text": ["I stopped by this place to eat dinner one night and was very dissatisfied. Our server was super sweet, but she just couldn't do anything right. We had to...", "After sitting in the drive through line for 15-20 minutes for 3 milkshakes, the lady at the drive through window tells us that their milkshake machines is...", "The shakes are absolutely delish! Friendly employees. Most of the time I'm going through the drive threw and I always get so scared that it's going to take..."], "rating": [2, 1, 4], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.6], "keywords": [["dinner"], ["milk shake"], []]}
{"id": "MmozAsVr_UgcU550cL5A7w", "text": ["One of my kids was playing in a baseball tournament in Moody and some friendly folks from HWY 55 Burgers and Shakes were passing out some free burger...", "This is the best place to eat in the entire city! I really love the aesthetic of the restaurant and the music, and the entire staff is very helpful and...", "So this is under new management as of early 2018. Went there and it was clean and a great staff! We got custard- which was delicious!"], "rating": [5, 5, 5], "TBscore": [0.39, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["burger"], [], []]}
{"id": "lN5a6iONZ_XoDWe-G93RYg", "text": ["Fast convenient and always Erving your food with a smile. Clearly the most popular store in brookwood mall this chick fil a has a solid fan base of regulars...", "Looooooooooove chic fil a. They are the best at being the best! They are more like family at chic fil a. Even though the sad days are Sunday's cause their...", "This is not the best chick fil a to go to. I work less than a mile from here and it's not worth stopping in for lunch because they take so long to so long..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "1X84PGEkRnAuVYVOlnK8Sw", "text": ["When healthy eating is not my greatest concern, I come here. Don't get me wrong, they offer some healthy options but my preference is the hamburger with...", "Great burgers, horrible service. If they were even basically respectful would have five stars. When you find out it's the manager that is being rude to the...", "Ate here for the first time last week, and it was alright. In fact that's the only word I can really describe it as: alright. The fries and chicken were..."], "rating": [3, 2, 2], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.2], "keywords": [["hamburger"], ["burger"], ["chicken"]]}
{"id": "KGgpDY0M-RtNWGAZfJ1V5g", "text": ["The service is great and friendly, the food is delicious and the place is a cute little hole in the wall. \n\nI had a salad and soup and my colleague had a...", "A great lunch spot with friendly customer service. Got a tuna sandwich which was delish (don't be alarmed but they put apples in it). Strange but still...", "This is an awesome local neighborhood joint to get sandwiches, soups and salad, and a great dessert with ice cream. Even Santa's coming to visit for..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.38, 0.6], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["lunch", "sandwich"], ["sandwich"]]}
{"id": "aCLcJLOtEuimvcyNGlWvjg", "text": ["Chick-fil-a is probably my favorite of the fast food chains. They always have my favorites like the chicken tenders, chicken sandwiches, and waffle fries as...", "My husband and I absolutely love CFA. All things CFA. Especially the impeccably hospitable service. Well, we can say that for the very first time ever, we...", "This is the rudest chick-fil- I have ever been to. They never get your order right and and always have an attitude towards the customer."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["sandwich", "chicken", "waffle"], [], []]}
{"id": "BkvGECD-5fUbaAOiNFw7Yw", "text": ["If you aren't starting one weekend morning with a box of sausage and cheese kolaches, you aren't living your best life. Imagine a giant Sister Schubert roll...", "Wow we had a great experience at Shipley donuts this morning! The workers were all very friendly and happy to help (although they were all Auburn...", "Stopped this morning for breakfast since traffic already had me beyond late. I had never been here before so it took me a minute to order. They had tons of..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.6, -0.3], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["donut"], ["breakfast"]]}
{"id": "7ord2hjOgOQPfjTKcZZFaQ", "text": ["Came here once along time ago (before Yelp) and found myself in the area and thought I would give them a try.\n\nFirst and foremost I'm really a fan of their...", "I woke up wanting a donut and Babi said she has a place that she wants me to try. As soon as she opened the door I knew heaven was near. It smells divine....", "Donut Joe's is so tasty! Located between Pelham and Helena next to a railroad crossing, this little gem has been producing delicious donuts for years. The..."], "rating": [2, 5, 5], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [[], ["donut"], ["donut"]]}
{"id": "VrDqbofC47DbmvnelEI6pQ", "text": ["I've come here multiple times. Most recently for National Donut Day. Who can resist the hot sign or free donuts? Out of the many times I've been here, I've...", "This Krispy Kreme gets 2 stars, but only because I love donuts. If it weren't for the donuts it would be 1 star. \nThey seem perpetually understaffed, the...", "I'm so saddened by this KK location. Really, I wish I could give a 2.5. They really aren't \"A OK\" but they are KK and it's kind of hard to mess up KK. So,..."], "rating": [4, 2, 3], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["donut"], ["donut"], []]}
{"id": "SJL-nsOzYC2AEGBKiR_PyQ", "text": ["New owners are awesome! Very friendly and truly cares about customer satisfaction. \nI took my nephew, to the drive through to pick up some donuts. Before...", "If you're on the north side of Birmingham and looking for some great doughnuts to take to the office, home or customer this is a great place. They have...", "A vendor dropped off two dozen of these donuts today. I tried one with what looked to be a butterfinger topping on it, one topped with fruity pebbles, and..."], "rating": [5, 5, 5], "TBscore": [0.54, 0.8, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "9FdLjNb3Jq-X5b4sjnrvPQ", "text": ["Customer service at this Krispy Kreme is spot on!  My husband and I swung by this location for a quick breakfast sweet on our way out to the movie theater...", "Krispy Kreme is always a must-stop, especially when the hot sign is on. There's nothing quite like the sweet smell when you walk in, and the awesome taste...", "I'm surprised that the drive thru wasn't pack since I went during the rush hour traffic coming home. Didn't realize how much one filled donut can cost a..."], "rating": [5, 5, 3], "TBscore": [0.34, 0.0, 0.23], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["breakfast"], [], ["donut"]]}
{"id": "6_-zrh5iuAXJc28EO21dAQ", "text": ["The staff here is awesome! My co-worker and I go here often for coffee and occasionally breakfast. They now know us and always say hello and ask how we are...", "I love the employees at the location. Whenever I go through the drive thru they are so kind and always make me laugh. I think the food and drinks are as...", "It's a Dunkin' so the food is the same at all locations. The service wasn't up to par today. The cashier had trouble  parking the cash register, and kept..."], "rating": [5, 5, 3], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["breakfast"], [], []]}
{"id": "EDltnNjYorHp4X_6MR9hDQ", "text": ["As a \"treat\" for working out 3 days in a row, I decided to \"reward\" myself with a doughnut from Krispy Kreme. But I feel gypped: money and calorie wise!!...", "Donuts Donuts... GET CHA DONUTS HERE!!!! Hands down the best donuts in town! Every kind of donut you can imagine is here. The store is very clean and neat....", "Donuts are great and fresh. Service is awful. The last venture I stopped by I had an employee tell me promptly upon entering that a staff member would be..."], "rating": [2, 5, 1], "TBscore": [1.0, 0.48, 0.0], "normalisedRating": [-0.2, 1.0, -0.6], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "PZO8_dfovogS7nMZORixBg", "text": ["Love this place. I stop here almost every day. While I'm also a fan of other coffeshops, I think for the utilitarian, that Dunkin has the best dollar to...", "It'd be nice if they would ever get my order right and stop charging me for stuff I don't want.", "Great service and a very good donut. I'm a coffee guy- and I do honestly have a sweet tooth. I went in this afternoon wanting a donut and coffee. The donut..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.67], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], ["donut"]]}
{"id": "CE-x3wbvuD7IkahsjMhypg", "text": ["A trip to Pepper Place is something one should definitely do while visiting Birmingham along with a trip to Vulcan Park, The Civil Right's Institute,...", "My humans took me to Pupper Place on Saturday morning. It's a great place to dog watch. I recommend getting there early, it gets nose-to-tail crowded by...", "This is my favorite Saturday tradition, and a must-see if you are in the Birmingham area. Parking can be a bit tricky, but the key is to get there early to..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "vh2wR1Q_EWEs0W8hict8Og", "text": ["This place would be a lot nicer if the metal chairs legs didn't squeal when moved, like fingernails on a blackboard. The door slams loudly whenever anyone...", "Poor service and cold donuts. Coffee is the bright spot. I confess that I have not been here in a long time so things might have changed but I doubt it. It...", "One of the best Dunkin's I have been to. The employees at this location are always polite and professional. It's easy to get in and out. They have a drive..."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [[], ["donut"], []]}
{"id": "4txFJhlSLNlANr6purdD5w", "text": ["Yum , I have loved dunkin for years. I can remember the first one I ever had, Andre South Carolina, and I was hooked. \nI can't eat here now , I am celiac....", "How is it possible for a DONUT shop to be completely out of DONUTS at 730 on a Saturday morning?\n\nWhat sort of incompetent bonehead allowed that to happen?...", "Great place to enjoy some delicious donuts  \nExcellent people work here, they will make it a priority to make your experience great!"], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.84], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["donut"], ["donut"]]}
{"id": "Y3VjSDms3-lIWwTiijzYqA", "text": ["Soooooo happy this donut shop is in Pinson!!!! Stopped by today with my daughters and got a variety of donuts. The strawberry donut is absolutely...", "These donuts are pretty good. No, they're not the fancy type of donuts you see popping up all over the place these days but they are good. My favorite are...", "I think they have the best donuts I have ever eaten.  Better than the ones we grew up thinking were the best.  Try 'em, you'll love 'em!"], "rating": [5, 4, 5], "TBscore": [0.6, 0.54, 0.78], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "9owNC2Tg7FZooY5_1lxSIQ", "text": ["I love this place and have been eating there since I was a kid. Amazing donuts, pastries, and cakes. Only reason for 4 stars is the lack of accepting credit...", "The Fultondale Bakery is a cute little \"always been there\" sort of shop sitting on US 31 just below the Walker Chapel Road intersection. The first time I...", "We discovered this local bakery soon after moving here two years ago and have loved every experience we've had here.  The donuts are delicious--so much..."], "rating": [4, 4, 4], "TBscore": [0.37, 0.0, 0.3], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["donut", "cake"], [], ["donut"]]}
{"id": "l4qjkFEPuGtVZAEsRAlqHw", "text": ["Who doesn't like fresh donuts and coffee????\nLove DD! I have never had an issue with this location. They have always been fast, friendly and prompt either...", "I had a $2 coupon to use at Dunkin Donuts, and this location was the closest to me.  The store was easy to find, staff was nice, quick transaction, and best...", "I have been to this location before and had decent (not awesome) service but today was a disaster. I had a $2 coupon and knew what i wanted for breakfast..."], "rating": [4, 4, 1], "TBscore": [0.38, 0.59, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["donut"], ["donut"], ["breakfast"]]}
{"id": "Nnfyd3EZfQlhUi6n2vUfTw", "text": ["Food is good, TVs are great, service is okay but needs work. Great place to come and watch the game. Coming in is free, to play you need to check in and a...", "The sheer size and spectacle of this place are mind-boggling.  It's so huge and such a sensory experience...walking in it felt as if I were at Buffalo Wild...", "Bartenders should be taught proper bar service.\n\nWent in tonight for the first time. I went in to greet a friend, who was still in training for a waiter..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], ["bar"]]}
{"id": "FiU22uJO4YLQ6eMNUBq01g", "text": ["Whole Foods serves as a lunch source for me about once per week.  The salad bar is very solid, as are the hot bar and soups, which change daily.  You can't...", "I wish this location offered a better variety at the hot bar. I've been traveling back and forth to Birmingham from Atlanta for work and eat here...", "I went to eat at the counter. Excited because I've heard the food is really good, been wanting to try for years. So disappointed. Really poor service, badly..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["lunch", "bar"], ["bar"], []]}
{"id": "TN3OBvibq8Y5uWBdFK_Cag", "text": ["Typical dunkin. Only thing bad was the drive through speaker wasn't very good so had a bit of trouble understanding the drive through employee.", "It's ok. Good for a quick drive thru run for coffee or doughnuts. One thing that sucks is that they don't have their doughnut options on the drive thru...", "This has got to be the worst Dunkin' Donuts in Birmingham and surrounding areas. It's crazy because it's not the worst due to the food it's because of..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.31, -0.68], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], ["donut"], ["donut"]]}
{"id": "KRRoaVSgh5wQva2wflq4uA", "text": ["Stopped at this location on our way from southern Alabama back to Kentucky to grab a coffee and some donuts for the kids. The s'mores donut was awesome!  We...", "Not to bad of place store was clean as was bathrooms. Service was on the slow side even through they had a lot of staff working. No coffee made but was...", "Do the math no Customers, means no business.\n\nMy order was $11.54, multiple that by 10 people, equals $115.40, times 1 week (7 days), equals $807.80, times..."], "rating": [3, 3, 1], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [["donut"], [], []]}
{"id": "ZbS6G05xzGl-HSUjK1Y9Ww", "text": ["Came out for an early dinner with the family. We had a little girl who didn't didn't want to eat here. However, after entering and greeted by the host, her...", "I went to J. Alexander's for the first time with a group of my co-workers on yesterday and I was not overly impressed to be honest. There were several...", "What an awesome place!  Service is amazing here!  Shout out to two servers we have had because THEY make the experience GREAT... Thanks to Sara and Toni!!!..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["dinner"], [], []]}
{"id": "J_c3wyEe8O-7EVDtqzC8pg", "text": ["The service was excellent for my friends birthday dinner. They provided complementary champagne  flutes and appetizers.  \n\nI ordered the Vegan Tasting meal...", "I'd like to start by saying I have eaten at several Seasons 52 restaurants across the country. I recommend avoiding this one when possible. I ordered to go...", "I went for happy hour on Thursday. I didn't love anything I ordered. I really hate that but I just didn't.  I ordered the avacado toast. The toast was very,..."], "rating": [5, 2, 3], "TBscore": [1.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["dinner"], [], []]}
{"id": "ATsbXLuD8ycbZ-gMhwUhiw", "text": ["Hands down best country cooking I've had in a long time!  The staff was warm and welcoming.  They walked me through the specials and they are good hearted...", "Great food! Fabulous people!\nPrices are reasonable and the portions are large. \nI'll be back!!", "Y'all!!!!!   We were greeted by so many smiling faces, Markeesha was delightful. My fiancé had two ribs off the hot bar (which everything looked so yummy)...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.58], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "5BzRg-qU_N_CjapMWeLmcg", "text": ["I couldn't wait to write this review, first because I don't eat a lot of pizza these days, second because when I do eat pizza, it's not usually great. This...", "Omgggggggggggg\n\nA build your own that doesn't charge you $1000 for the amazing toppings. They have such an array of toppings that you'd pay so much for any...", "I have been here twice and have a good and bad points. I always start with the positive. First, there is never a line, so if your lunch break is short then..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["pizza"], [], ["lunch"]]}
{"id": "1aDA_D0aBikojZwx73m5pQ", "text": ["I had a few minutes before my shift started and wanted to grab some pizza from a place I had never tried. Daves's open patio catches your eye from the...", "I'm skipping the anecdote and diving right into the breakdown:\n\nTHE STAFF:\nfriendly, attentive, and professional\n\nTHE ATMOSPHERE:\nInteresting. But not in a...", "Get the wings! They are different and sometimes a little spicy. Their pizza's are really good. Great venue!   My only complaint is that their service has..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["pizza"], [], ["wings", "pizza"]]}
{"id": "YQTT4-DwhgxOf5X-ovYiRQ", "text": ["We went for my cousins birthday. Nice area close to the college, awesome food and excellent service.", "Originally came to this part of town to eat at the taco shop next door but there were people hanging out the door and spilling into the street. We were all...", "A decent, casual pizza place located up at the Summit near the movie theater. Think of this one like a Subway concept-they build your pie based on the..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["pizza"]]}
{"id": "kxTVSS0dCQqQO2oA34NUtw", "text": ["Let me start off saying....amazing employees! We have been here three times and haven't encountered an unfriendly face yet.  Everyone has such a great...", "I've noticed more places like this popping up all over the place. I hope these \"build your own pizza or salad\" restaurants are here to stay and aren't just...", "I really like pizza and really want to like this place given the proximity to my house but have been underwhelmed by both visits. The decor, staff, and..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.55, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "0iXY0X4EVkznQ2T93iWzbw", "text": ["Just when I thought there were too many pizza places in Bham a new champ in its weight class emerges!  This is hands down my favorite of the pizza places...", "I really enjoyed trying Blaze Pizza for the first time. The staff was friendly, service was fast, and the food was good. There is a decent size menu of...", "I've been super excited since before this place opened up. I heard Lebron James had a pizza franchise, but of course it was in the bigger cities so it was..."], "rating": [5, 4, 5], "TBscore": [0.25, 0.37, 0.24], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "0I5WxR6tscGOvI10FSor2g", "text": ["Good pizza. I do recommend. Clean business and friendly staff. My pizza was yummy. I had the Outlaw and the Ham. I am a pizza nut so my reviews maybe harsh.", "We are moving from Birmingham in a month and this is one of the few establishments we will miss. The pizza is consistently delicious and the delivery time...", "This is my favorite pizza place, the staff is friendly, and the facility is always clean. I would recommend the outlaw pizza it is defiantly my favorite..."], "rating": [3, 5, 4], "TBscore": [0.31, 0.4, 0.44], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "rBNZxxGxJ6KFjrpLZJ7f7Q", "text": ["I was staying one night in Birmingham, and I was looking for some good pizza. I asked the gals down at the desk where to go, and they chimed off with the...", "We love Reyes! Every time we go, out food is delicious and tastes so fresh. The service is hard to beat, especially if you ask my daughter. I usually get...", "Had pepperoni and sausage calzone. Best calzone ever and they are super friendly! Great value as well"], "rating": [5, 5, 5], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], [], []]}
{"id": "RTgqRDhcoRq6zyYj_eEENQ", "text": ["Good Papa Johns location. I live over in Southside so I stop by/get deliveries a good bit. Everyone at this location has always been really nice in the...", "The employees are great and the pizza is always good. They are consistent and reliable.", "we placed an order online and apparently the online system went down for about 20 min so there were some unexpected delays. however, brooke handled the..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.58, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], ["pizza"], []]}
{"id": "yGrhJR-NLlZIpKNjqM-qbw", "text": ["Update: Marco's has unfortunately made my order incorrectly for the last 3 visits and are extremely unapologetic when confronted about it. I, regretfully,...", "Guess I can't really complain too much since the large two topping pizza we got was free since I just moved to the area and Marco's gives it away to new...", "Under no circumstances should it take over 1.5 hours to deliver two pizzas and a salad for 4. Order placed at 10:49 am, well in advance of lunch rush...."], "rating": [1, 3, 2], "TBscore": [0.0, 0.23, 0.0], "normalisedRating": [-0.6, 0.2, -0.2], "keywords": [[], ["pizza"], ["lunch", "pizza"]]}
{"id": "Ai4PmxGjtsLa8q1tIK4erg", "text": ["Bare Bones Pizza are a streetfood van that can now be found at many of Birmingham's prominent street eat events. The van is awesome! All the pizzas are wood...", "Brilliant pizza, cooked in a wood burning oven, and all done in a van. What more can you ask for?\n\nIf you see this van and want something to eat, go try it.", "Your pizzas are amazing. Keep up the good work, guys!\n\nCrunchy base, hot, full of flavour and easy to pick up and eat - what more could you want?"], "rating": [5, 5, 5], "TBscore": [0.51, 0.7, 0.32], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "V43H1C0yXSj9XmqESOg3dQ", "text": ["Pretty authentic New York style slices (big and thin). I love that they have pizza by the slice and ordered 2 different slices,  the Veggie deluxe and Greek...", "I showed up ten min after 6pm.\nI ordered two slices,  there are three tables with people sitting waiting for their good as im doing the same. \nI enjoy the...", "I'm not sure how so many people love this place! The chicken dip is very good, but the pizza is horrible!!! Hardly any sauce, hardly any cheese.  And the..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["pizza"], [], ["chicken", "pizza"]]}
{"id": "a7_sOKn46X2yfsB2GfkqWg", "text": ["4 years been driving by and finally stopped. One of the best pizzas I have had. Friendly service and very fast. Clean. Not much else to say. Not a nice...", "We've ordered from Sanpeggios many times.   We love it! Don't expect pizza in the same bracket as Pizza Hut and Domino's... It's not. It's not uber greasy...", "I stop by here or order delivery at least once a week. I am in love with the Greek salad, maybe it's the feta cheese and dressing lol but it is so yummy!"], "rating": [4, 4, 5], "TBscore": [0.23, 0.38, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["pizza"], ["pizza"], []]}
{"id": "0CCB-eNJtQLK3HVbO0Ml8A", "text": ["Okay, I'm not saying this is like eating Frank Stitt's food, but this is probably the best delivery pizza you can get in Birmingham. In fact, I think it's...", "We had an end of the year celebration for the kids at my school and had pizza delivered. We opened the first box and this is what the pizza looked like. I...", "This dominos has a ridiculous habit of getting your order wrong. You can check your receipt and sticker on the box but yet somehow the wrong pizza ends up..."], "rating": [5, 1, 2], "TBscore": [0.75, 0.25, -0.44], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "XEjwH4ljYLrNdSdP8cDrvQ", "text": ["So I've never officially been to Pazzo! But their food truck came to First Friday June 2017. \nThe guy taking orders was funny and had good rapport with the...", "Sunday night, long day, craving Italian; does this sound familiar. Over the past year I have passed Pazzo almost daily without stopping. Today was my day to...", "Somewhat disappointed. Went in at 815pm. Ordered the slice special, which Is advertised as being available until 9pm. Got the pasta combo, spaghetti with..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], ["italian"], ["pasta"]]}
{"id": "PnqDTOzUcc7dllXZ7VCIPw", "text": ["We have been loyal customers to Marco's Pizza since we been living in Hoover area. We ordered the large Meat Supremo and a large Cheesy Pizza. The...", "By far the rudest Marcos pizza in Birmingham! I ordered a pizza tonight and it was sub par. Called the restaurant and asked for the manager and the guy on...", "We order pizza from Marco's frequently. The pizza is always delivered quickly. They make a great pizza and they are reasonably priced. Last night we ordered..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "e545Z75Q5IIFsFTLG4VhUw", "text": ["A great, new addition for skyline views of Birmingham. This rooftop bar in the Elyton Hotel is trendy and modern, with two different viewing areas of the...", "Moonshine has a great view, but it definitely does not take advantage of it like it could.  There is really only one side of the bar where the view is nice,...", "This bar is all hype. when going with family and friends late one Saturday night I was excited that I was going to see something great. On arrival It looked..."], "rating": [4, 3, 2], "TBscore": [0.35, 0.35, 0.29], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "JFh9xIMS1TGm2uKAtpq3cQ", "text": ["The manager was fantastic, he grilled a piece of Salmon with no seasoning for me, and went out of his way to make sure it perfect for me....Thank you for...", "The food is very rich and full of so much oil. Read the pizza menus carefully. Pizzas do not come with a marinara sauce they are mostly pesto sauce.  The...", "Newks has a variety of soups, salads, sandwiches and pizza dishes. It is a franchise establishment that has a pretty heavy following. From the other reviews..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["pizza"], ["sandwich", "pizza"]]}
{"id": "0jem3U3vgmTKV-OJcZmBLQ", "text": ["Allowed me to place online order for carry out but was closed when I went to pick. Why do you allow online orders when closed?\nThey take 2 hours to deliver...", "This place is so awesome! Food is always hot and fresh and delivered with a smile in 30 mins !", "We drove up to this Pizza Hut at 10:45 pm on a Saturday. They close at midnight. When we were parking, there were two employees at the register area and at..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [[], [], ["pizza"]]}
{"id": "YPOy59AlgRpc6hckekFwDg", "text": ["Years have passed since I was first introduced to this chain after I first arrived in Birmingham. There are a few tweaks in how the restaurant looks, but it...", "It was a bustling hump day when I ate here for lunch.  This franchised Newk's Eatery is located in the strip of shops and eateries adjacent to the popular...", "I have been to Newk's a good bit and several times to this location. I'll start out with...the PROS:\n-the layout of the restaurant is spacious and..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.6, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "2_L7qcgan47rItiRX2MLqw", "text": ["I declare the best calzone in town! \n\nThe fresh, hand-tossed dough was formed into a perfect half-moon. The dough was thin, and cooked to the perfect shade...", "Salvatore's Pizza has been at this location for as long as I can remember.  This wasn't my first time dining here.  I have always enjoyed the italian...", "I was told by many people the deep dish pizza here was excellent. If you've been to Chicago, deep dish pizza there is amazing and you'll spend lots of time..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.42], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], ["pizza", "italian"], ["pizza"]]}
{"id": "0X2BJCrqDfPMZZQWE3-Uag", "text": ["I absolutely love Cicis. Great price for great food. \n\nTheir garlic sticks are amazing and always disappear so fast once they're served! They have a good...", "I was able to see the Cici's pizza 2.0 the other day, and was shocked at several features and changes they have made since being opened a few years ago in...", "Party of 8 for a birthday party dinner. We left Surge and seems like everyone else did too and came here for dinner. The line was crazy long but we all got..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, -0.22], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], ["pizza"], ["dinner"]]}
{"id": "JpDpEzQxvsCZBvlp6gq6CA", "text": ["The Abbey is a business with a servant's heart. It is affiliated with the nearby Episcopal church but you won't encounter any brow-beating about religion...", "Why 4 stars? Because comfortable seating and wifi is all I need.\n\n   ---   ---   ---\n\nWhen I'm planning on co-working at a coffee shop, my number one...", "This place is a rad little coffee spot outside of the city Birmingham Alabama. Super cool vibe with amazing coffee. If your in the area def stop on in and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "50iCx0c6OSer0P_GinvGkg", "text": ["This is my new favorite coffee house in Bham!  I have introduced several people to this place and every one, from my Mom to my buddies, whether it be...", "Sweet little coffee shop in Homewood! We've come here a few times and have really enjoyed the welcoming atmosphere that makes you want to get some work done...", "Don't get me wrong - this place has the best coffee in Homewood downtown right now. I have actually never heard about a coffee being roasted in PA, but the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "lzcnloyZAu2XWePHjY-2Iw", "text": ["This place is awesome. Spacious, quiet, (at least very early in the mornings when I've been here), friendly people and great coffee as well as some really...", "I kinda miss Octane, but I'm loving this new concept. They still serve octane coffee which is THE BEST. Their food is the same and just as good as it has...", "If you want to live your life right, plant it. \n\nI used to go to this coffee shop when it was Octane, but I definitely prefer this one! The coffee menu is..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "8VUUPVC-EQxzGdWeHkZqfQ", "text": ["Everyone raves about Steel City Pops which by all means is great but for those of us who live in Hoover, Urban Pops has won our hearts over.\n\nIt is similar...", "Urban pops has the best homemade popsicle around.  My favorite is the coffee and cookies and cream.  They truly put a whole Oreo in the popsicle and use...", "If you like popsicles, you've come to the right place but these aren't just any old popsicles. These are gourmet treats. \n\nOn a recent visit, we all got..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "IsoFWN7nr3soJQ9AXjrODg", "text": ["Yet another awesome coffee spot in Birmingham to meet, work, or just hang out.  The space is small but inviting, with clean decor and a great flow.  Easy to...", "Seeds Lakeview is a great, convenient place for your morning cup of coffee and a pastry or quick breakfast. Their coffee is delicious and the staff is...", "This happens to be my favorite coffee spot downtown. I didn't know quite how good espresso could be until I tried the espresso here. \n\nMy coffee friends in..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.71, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["breakfast"], []]}
{"id": "yiVd8e7ktlbE6VK1Oa4jrg", "text": ["Good Morning folks,,\n\nSo, working at and for UAB has its perks and one of them is Au Bon Pain. We are able to get free water(best water in the whole...", "Stopped for a quick breakfast sandwich.  Pretty standard at all of the locations alone they fit the bill here.  \n\nHad the egg, cheese and sausage sandwich...", "Last night's chicken caesar asiago salad was just as delicious if not more than the chicken cobb I had my first time here. She forgot to give me croutons..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], ["sandwich", "breakfast", "egg"], ["chicken"]]}
{"id": "TE1pmuA9ES4JPXG8_Rf-uA", "text": ["This is a really cute coffee shop with great coffee and food.  The location seems a bit in flux right now, with construction going on around it, but it's...", "Convenient coffee in Mountain Brook with a beautiful interior. I love how clean and bright the aesthetic is here-- it's the perfect place to study, read, or...", "I really enjoy going to Revelator Coffee downtown so when I saw that they have a 2nd location in Mountain Brook by the Grand Bohemian Hotel, I just had to..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "dFuK5aam84qM4i8Ib4fAlQ", "text": ["Ahhh.. Starbucks. Why must you take all my money!?!? I love you more in the summer when the lines are shorter, but the staff does a good job of moving...", "Came to Birmingham on a Sunday..  this was one of the closer coffee shops that was said to be open.. after our 10 minute walk at 7:45am... it was closed!...", "Ist time going to this location in a different city. I tried out a different drink, which was called  Strawberry Acai Refresher and it was actually pretty..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "NpYVNhNF8SgrLnP6Co3_uw", "text": ["I love this place! Such a gem in Vestavia.\n\nWe placed an order to go on a Thursday evening. The workers are very friendly and will speak Spanish to you if...", "This little taqueria is such a gem. I was in search of some good lengua tacos and they more than exceeded any expectations I could have possibly had....", "I never imagined enjoying an authentic, Mexican, street-style taco on the street in Vestavia, Alabama. This place is popular, and the tacos are the real..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["tacos"], ["mexican", "tacos"]]}
{"id": "bK6zniGwQc77g_LEZ1aHjA", "text": ["A top choice for me in Birmingham whether is grabbing something easy going with a friend or having a laid back date night it's always an option to choose...", "Ok, not bad, not great. Love the options, but the flavor just wasn't there on the flounder and veggie tacos. Chips were just oily and lumpy, corn tortillas...", "Enjoyed our first visit to Taco Mama! Tacos were great! Quest was awesome too! I tried the chorizo taco and the Alabama Redneck. The chorizo was definitely..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.24, 0.56], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["tacos", "corn"], ["tacos"]]}
{"id": "7VjiIHiWOBiex5cd7u65ag", "text": ["This place kept popping up as a hot new business, so once I got back in town, we decided to stop by since it's around a lot of the places we shop. Located...", "Finally made it by to try this place and I'm so glad it exceeded my expectations.  I thought I'd try a little sampler of items to get a lay of the land, so...", "One of the newer restaurants in Trussville - it caught our eye and we wanted to try it as a change of pace. We found it without too much trouble, but the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "OPmKiES3VpbWDhXcXlLwgw", "text": ["Similar to their chain of other Taco Mama restaurants, we had a GREAT experience!\n\nThe food comes out fast. The staff is friendly. Tables inside and out....", "It's our first visit to Taco Mama and we were pleasantly surprised. \n\nIts an order at the counter, so grab a menu at the door or read the large menu board....", "Taco Mama has for a long time been one of my absolute favorites, but now that there is a 119 location I anticipate it truly becoming something akin to home...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "mk5AHt0y_WWX8sY4Z8WnGg", "text": ["Chronic Taco is such a lil gem to me. I've gone in for brunch and had the breakfast tacos both times, w/bacon and chorizo. They also have non-pork options...", "This was our first time in. Randy was very nice in greeting us as we entered and helped us in how to order and what to order. I liked the fact that you can...", "Slow service. There was one employee working the food line and one working the register. Things would have moved more smoothly if there were at least two..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["brunch", "breakfast", "tacos"], [], []]}
{"id": "vyFKmgSRUWiGyhSGnHhaiQ", "text": ["Last week, I came here for dinner for the first time with 12 colleagues. Moss Rock Tacos & Tequila is located right next to Vecchia's Pizza in Hoover. \n\nThe...", "If you go here, stick to the tacos and queso! They were both pretty good and we tried a number of different tacos. \n\nI would not recommend the soup as it...", "So its been awhile since I have been here.  I thought I would give it a try.\n\nThe bartender was very nice.  She made a regular margarita which needed more..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["dinner", "pizza", "tacos"], ["tacos"], []]}
{"id": "Mx57XARF98JeBnNaCUSzjw", "text": ["Excellent & authentic Mexican street tacos & sodas at a great price. The seating area is very convenient because I wouldn't want to eat these tacos inside...", "the asada corn tacos are my favorite.\nFast food, cheap price, and convenient location. \nA must stop to check it out.", "Typical taco truck. Owner is friendly. I checked the health rating before I ate here and it was 96 on the day I went. That is always a good sign, although..."], "rating": [5, 4, 3], "TBscore": [0.5, 0.37, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["mexican", "tacos"], ["tacos", "corn"], []]}
{"id": "va99oCtFiSztEPTe6RmGpw", "text": ["This is one of the best \"autentico\" tacos in town. Kind of a ma & pop type place in a good way. They have a big Latino clientele which goes to show they are...", "Finally decided to give this place a try and I'm glad we did. Inside it's very tiny with some barstool seats and one long dinner table but there is more...", "I knew we were in for a treat when I saw them making their own tortillas - tortilla press and all! Sat down and they brought three different kinds of salsas..."], "rating": [5, 4, 5], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["tacos"], ["dinner"], []]}
{"id": "iXevblBLPDEOiWJ5CEQ22g", "text": ["We discovered Gordo's in Pelham, today. They have good tacos at good prices. My wife, my son, and I all enjoyed our meals very much. The staff are friendly...", "After reading sooo many good reviews on YELP, let's just say that our expectations were really high. They offer great service! They have nice employees but...", "Real authentic Mexican!!! $2 tacos are really good!!! Taco salad and quesadilla are both really goodTaco salad and quesadilla are both really good too. In..."], "rating": [4, 1, 5], "TBscore": [0.51, 0.0, 0.53], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["tacos"], [], ["mexican", "tacos"]]}
{"id": "clMNJ_uPa9xoKLnwqgNdWA", "text": ["The best soul food in Birmingham in my opinion! The spaghetti is a must try on Thursday. I always enjoy the Sunday chicken dinner. All of the sides are...", "I like to come every Friday for my beef tips and rice. I like to sit in the restaurant and eat and enjoy the atmosphere. And I always get some extra to take...", "Ruth's café is a small, quaint, down-home restaurant.  After driving an hour & a half, from Atlanta, we decided to go with Ruth's Cafe because of its high..."], "rating": [5, 5, 3], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["dinner", "chicken"], ["beef"], []]}
{"id": "7hj8IqF9_IbropItV9F3-g", "text": ["If you've noticed I've been stalking Meat & 3's. Found one that comes close to my Wife's, Mother's and Grandmothers cooking. I will try again on another day...", "I went to Bogues with a group of coworkers for lunch. I wasnt expecting too much as I had never heard of the restaurant. Its your normal meat & 3 with a...", "Bogue's never disappoints in the seasoning, quality, portion, and/or overall yum factor. This is a classic meat and three restaurant --Comfort food. This..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["lunch"], []]}
{"id": "fqjvyG1AYOVwTwk6Fs_5Xg", "text": ["Don't break any eggs! Go here instead!\nThis is how you do breakfast! Little something for all breakfast lovers and some options for those who want to have...", "Efficient seating!\nYou can use their \"wait time\" feature online for obvious reasons & place your name on the wait list.\n\nFlawless service!\nWhen seated, as...", "This place is clean, hearty and good. But it's not amazing. It gets the job done and you don't go home feeling like you wrecked your caloric intake for the..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["breakfast", "egg"], [], []]}
{"id": "FOBUyqs4MDi9FvNa3A26Yw", "text": ["This is the perfect example of a great Starbucks. I come regularly and really enjoy the professional service and tasty coffee. Dante and the other baristas...", "Nice location with a drive thru. There's street parking and a garage nearby too.\n\nI was there in the late afternoon and most of the seating was taken. Lots...", "So glad they brought a drive-through Starbucks to downtown!  Most of the employees that run the drive-through legitimately sound like voice actors.  It's..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "B0h0ZAyDZjxdhq3mhCqr5g", "text": ["I'm wondering how we have lived in Birmingham so long and not been here until this past weekend! It was only by chance that we went - we were getting sorbet...", "One of my favorite places, avoiding the Summit. We haven't been here in awhile and I had a hankering for something different and good. Family owned & run....", "Five stars for this type of restaurant. I like Mediterranean food but I'm not crazy about it like a lot of people are. This place does it right and tonight..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "eSkcxPo304jOEB318Fqx6g", "text": ["We sampled The Preservery at the Harvest Brunch and their blue corn grits with blackened shrimp was amazing!\n\nThe grits were flavorful and hearty, had...", "This place is currently in the Pizitz Food Hall Reveal Kitchen. The Reveal Kitchen is a restaurant accelerator space for up and coming restaurateurs as they...", "Really flavorful gumbo and friendly staff! Definitely one of the better selections in the food hall."], "rating": [5, 4, 5], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["brunch", "corn"], [], []]}
{"id": "98Sh60KOzci6j4oTZG6tXg", "text": ["Fabulous post-church lunch here with my husband, three kiddos and my mother in law. Our server was accommodating, the arrival time of our various courses...", "It took awhile for our food to come out like about 30 min. But once it came it was fairly good. \n\nI had the fried chicken. It was pretty good. My friend had...", "Fantastic food , service, and atmosphere!\nBeautiful area and very nice shops \nThe meal was phenomenal \nFresh soft shell crabs \nRefreshing drinks \nWonderful..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.26, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["lunch"], ["chicken"], []]}
{"id": "0kbZ48LrWk07CBaEfPK4aw", "text": ["Ate here for the first time yesterday for lunch and then went back for dinner. Yes, two times in one day. We are tired of the same places in the area and we...", "Soul Heaven! The food and service was A1. They even had live music,  which was a plus. I ordered the app platter (pick 3) with fried green tomatoes,  wings...", "Sunday afternoon dinner was great! Home style cooking that takes you back. The live music was great and the restaurant's atmosphere is upscale but dinner..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.48], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["lunch", "dinner"], ["wings"], ["dinner"]]}
{"id": "TXiuFot0pIpGnj9ULoFRsA", "text": ["When I first saw a City Bowl, I had no idea what I was in for.  My first experience came from the truck, and since then I've tried their storefront multiple...", "Tried their food truck on UAB's campus and will definitely be coming back! They had quite a crowd and still managed to get the bowls out pretty fast. \n\nI...", "We finally got a store front for one of the cities favorite food trucks.\n\nSmoothing bowls or AÇAÍ bows (Pitaya also available).  You can get a variety of..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "yP9El4DxOX5JQsb_v3zQVA", "text": ["They have a treat for everyone here! I don't usually have dairy and was so excited to try their non dairy popsicles.  They also have creamy popsicles and...", "Delicious and ice cream in fun, authentic flavors.\n\nReminds me of the wonderful Lichita's in the Pizitz food court, maybe a touch sweeter. \n\nFun experience,...", "This place has delicious authentic snacks and desserts.  Best Esquites (Mexican Street Corn) I have found in metro area."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.62], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["mexican", "snack", "corn"]]}
{"id": "wE8YUZpV1tCTV3grQD7qlA", "text": ["We had a great experience at this locally owned snow cone stand. First of all, they offer the delicious, truly NOLA-style ice that melts in your mouth. This...", "My favorite place to cool down. They have a variety of flavors and the prices aren't bad. You can get condensed milk or whipped cream added to any cup. I...", "THIS IS THE BEST SHAVED ICE EVER!!!!! if there is a line you still need to stop.  The owners are so sweet and very nice. They always greet you with a smile...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "SOMeqGyqTWMZPiWHVVlh1g", "text": ["How have I not written a review for this location? \n\nLocated right over the mountain in downtown Homewood, this is the best location I've visited. The...", "My favorite go to coffee shop when I'm visiting Birmingham! Not only is the coffee warm but the space and conversations are as well! \n\nIf you can get a...", "A very good coffee joint in Birmingham in the Homewood area off of Shades Creek/Lakeshore Drive. The location is right by Brookwood Mall, so it is..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "e46yGOhvDcVa-TueSjJE8Q", "text": ["What a true hidden Gem.\n\nThis place was introduced to me by a manager of mine, and I was very skeptical when he brought me some peanuts.  I mean, it's in an...", "For those that don't know, the original owner and location moved to the address on 3009 5th Ave. N. The place downtown now called \"Peanut Place\" (which...", "Went to get some delicious hot roasted nuts but they are still closed for remodeling. .....maybe next time I am in the area"], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "aSzJa52LZJxc0u8C_KCSQg", "text": ["Sold me some old and stale cookies with no expiration dates on them. They also tell you no refund AFTER you make a purchase and does not list it on their...", "luv there vanilla wafer and chocolate pecan cookies... i get them at my local dollar tree store... freaking delicious and for a $1, forget about it", "Bud's is a local cookie maker that has a production facility in the Riverchase office park in Hoover.   This is a review about the cookie \"factory\" not the..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "5bd8Hu6AbnbmsNmhf0BaOg", "text": ["This is my favorite place to get bubble tea in all of Birmingham. Their boba is always the best and the staff are also nice. \n\nI usually go with a large...", "I'm a huge boba fan, especially having tried places like Kung Fu Tea, Lollicup, Vivi, and Coco, in other cities. The one thing that is somewhat promising...", "After a long drive home from work- it literally took me two hours to drive 7.4 miles (that's hwy 280 for you), I decided I wanted a hot cup of tea. Then I..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "ntIYC240v-1QqEKP1BkQ9g", "text": ["This has the potential to be a really good McDonald's but some of the managers are a little rude when it comes to getting my food right or when it comes to...", "This store is open 24 hours which is a plus, however they desperately need a makeover. It reminded me of walking back into the 90s when I went inside.\n\nThe...", "I've never been more insulted by a drive-through employee. First of all, their ordering system was down, so the woman at the menu was writing everything we..."], "rating": [3, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "ZwgC-gyME_v-z2A8HW7WOA", "text": ["My 400th review!! And if you're my friend (in real life or on yelp), you know I'm at Target a LOT. And since I've already reviewed this Target a while back,...", "If I could give this a zero rating or even a negative rating I think I would be doing a more honest review. This is the most pathetic Starbucks I have ever...", "This place is consistently bad, service is bad, they run out of products regularly, and some of the employees are rude (not all of them but a few). If you..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "P1phVIVI8rci5RkXR6AJ6g", "text": ["I really love this company. I have done their juice cleanses in the past and the quality of their juice is superb. They make their juices in house so you...", "I was looking for a juice spot here in Birmingham and this is the first place that popped up. I was under the impression that Whole Foods made juices and...", "Since Juice Bar has closed down, I've been trying to find a juicery that could replace them. Sprout & Pour is a great alternative, however, I do feel that..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "FSSuQCNF4NYIK51NPVKq_w", "text": ["What is not to like? I love the selection of daily specials and vegetables! The service and staff are so welcoming and kind.  They always make certain...", "I don't know what to say other than I had such high expectations for this place given the name.\n\nThe fried green tomatoes I've had in the past at Bright...", "Surprising little gem @ the Hoover Commons Shopping Center. Parking can be a little tricky since there is a Mexican, Pizza, and Burger place all in the..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["mexican", "pizza", "burger"]]}
{"id": "XHj2jj30I_lr3qHYIZi59w", "text": ["Decided to treat myself to some macarons today since it's my birthday. I decided to try a variety of 6 flavors. Rose, Earl Grey, Salted Caramel, Red Velvet,...", "This place is cute and really bright inside which obviously helps with the presentation of the product!  The product in this case are macarons!!  A lot of...", "Cute spot! I saw them on Instagram and knew I wanted to try. Their designs are so pretty! These aren't made in store though but shipped in.  I have no idea..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "_crLo-u2gzLyeFEh1a2bqg", "text": ["So disappointed.\n\nI visited on my cheat meal to enjoy a little dessert. Strawberry cream pop, dipped in white chocolate, drizzled in caramel and sprinkled...", "Sometimes when you take something simple and try to jazz it up, you're left disappointed. This was not one of those times. Steel City took popsicles and...", "Steel city pops are great and local! Loved them since the beginning but NOW! Dipping station to make tuxedo pop, coconut cream pie, chocolate covered..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "oT0NIC-dEXoakdja3RMSbQ", "text": ["I love Tropical Smoothie. I always order a Thai chicken salad and an island green detox smoothie. It's a great meal and not a bad deal at all when you order...", "I bumped into this place as it was near my hotel. It's perfect for a quick bite and a great selection of smoothies. The staff is very knowledgeable on menu...", "Love the smoothies, but the food is overpriced and average quality.  The drive through is awkwardly arranged (no room for really more than two cars) and..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["chicken"], [], []]}
{"id": "XPSJ5-gMMQK9RWu3xrYpkA", "text": ["I am from Pelham was so excited to see a unique ice cream shop open up in my hometown! \n\nNot only does Cream and Cones offer rolled ice cream and regular...", "I'm rating this ice cream parlor w/ 3 stars for a few reasons:\n\nUpon approach, you realize the LOCATION is on a frontage road. You know, those side roads...", "Cotton candy burrito! That is the headline here. This place is known for their take on the new rolled ice cream trend, and they do that well. They have a..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "S2GODoiovlLdPgHTIJTQpA", "text": ["I've lived in the area for about a month and have stopped by the Sno Shack at least 5 times. If those numbers don't tell, I can promise you, I will be by...", "Great place that has variety that is pleasing to the taste buds. Customer service is always great and they have the knowledge to give you something that you...", "Awesome customer service. Soft ice, great value, large selection. Let's support to keep this place open!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "jRxbp1M932i4NvilDWDJfg", "text": ["Always a great experience at Sweet Frog.  You are always greeted as you enter, which is a plus.  They have vegan/plantbased options, which is only two at a...", "Great place to chill literally with frozen yogurt!! Staff always so nice and ready to please! Sign up for rewards program and try everything lol. Also...", "The two times I've been here the staff has been very nice and the yogurt was really good. The toppings bar was tidy and well stocked even at 8:00 on a..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.69], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "pMckHuhXA8VQvX8ymU2HwA", "text": ["I know the whole Starbucks thing can be polarizing. I have friends that are complete coffee snobs that will absolutely never go to one. But for me who just...", "You can't order basic coffee drinks like cortado, breve and others, because the staff don't know what they are. The app, while great for managing gift cards...", "This Starbucks is walking distance from my house, so super convenient, but it's always struggling. I don't know if they are understaffed or if the manager..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "79818eHtcCDGOqJOEmEoSw", "text": ["Great location for a cafe/grocery store.  This store caters to the vegan crowd (mostly), and the food other than the price is reasonable.  \n\nParking is...", "Golden Temple is the only vegan restaurant in Birmingham. Besides offering great wholesome food the atmosphere and employees are awesome! Connected to the...", "Located in downtown Birmingham just off of the five points square. \n\nThis place is not only a good vegetarian cafe, but there's a awesome health food store..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "CecMN3YXsi2PG1Aje5R0pg", "text": ["If you're looking for a not too pricey lunch, their pizza bagels are always my go to pick! Their cookie bite cups also make an amazing afternoon snack if...", "I'm embarrassed to say how many times I stop here for a caffeine pick up or a quick lunch. Sure, the prices are inflated, but you're paying for convenience....", "Convenient location inside the LRC if you're attending a workshop or class at UAB. I came around 11:45am- right before the lunch rush- and ordered lunch...."], "rating": [3, 5, 4], "TBscore": [0.6, 0.44, 0.29], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [["lunch", "pizza", "snack"], ["lunch"], ["lunch"]]}
{"id": "PBT72nYyO30myRFh8Xz6eA", "text": ["This is the second time I have used this drive through. Both times the line moved quickly, the service was friendly, and my order was correct. The food was...", "Long long delays in service this Sunday morning. Some kind of major problem, I guess. 2nd time here and it was slow that time. Am I going to drive off? Yes...", "Wow, this McDonald's is just horrible - service was slow and disjointed with no one knowing what to do.  Kitchen area is a mess-health department needs to..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "cm6kUbgPT9FAZ4ZtHxkhlw", "text": ["Yeah it is McDonald's but it still deserves a review and there are definitely some fast food locations you just don't go to because they are ran so poorly....", "I would give this location a negative 5 if I could. It's always something. Employees are incredibly rude and incompetent. They never have advertised food....", "Okay so for starters the frappe machine is always down but I could forgive that if they didn't say they were 24 hours they're never open 24 hours ever!!!"], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "NJgebj3LLheEQsJPz0SMcA", "text": ["Yogurt Mountain has always been so good to me! I already love frozen yogurt, but there's just seems to be so delicious. Something about making it yourself...", "This is a great location to get your frozen yogurt from! My favorite flavors at yogurt mountain are the original tart as well as the olde fashioned vanilla....", "I used to visit YOMO regularly when they first opened. I feel like the novelty of self serve yogurt has passed but glad to see they are still around. I met..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "ENWIEqw4XQNIiM6z3tNHwQ", "text": ["Let's see, how can I describe this eclectic bar: 1950 & '60's vintage decor meet Rainforest, cozy, retro,  interesting, board games galore, Pulp Fiction,...", "I absolutely love this place. I could have stayed there for hours.\n\nThe arrangement is like a cozy maze. The lighting is nuanced. There's tons of attention...", "Atomic Lounge is a must visit bar if you're visiting bars in Birmingham. It's the kind of place that every place needs. Too many bars seem so dull and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], [], ["bar"]]}
{"id": "bQ7UqXtlAfphIFr0hA5Q5g", "text": ["The first time I came here, I had one of the worse experiences ever. I told my bf to order me a very dirty martini with vodka. He said exactly that and I...", "We were staying at the Redmont and looking for a nightcap. The downstairs bar looked ok but we had heard about the Roof and wanted to check it out. \nPlace...", "Located on \"the penthouse\" level of the historic Redmont Hotel, \"The Roof\" is a nice, romantic place to enjoy the views of downtown Birmingham & to relax &..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["bar"], []]}
{"id": "c6S4MM2ul2So2JLFVMwi_A", "text": ["My absolute favorite bar in Birmingham. Although street parking is kind of a pain in the butt to find on the weekends because this area has some great...", "This is THE bar of Birmingham. I moved several months ago and everyone here has been nothing but nice and welcoming! I finally decided to write a review...", "This past evening was the first time I ever went to this place. One thing I like is that there is a parking lot where you can park that is right across the..."], "rating": [5, 5, 5], "TBscore": [0.52, 0.25, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "Hf2PZSoQyjj3SrQRstT3Dg", "text": ["I stopped in here with some family over the holidays. Below is a sampling of comments made throughout the night that may help you get a feel for the place....", "Mom's Basement is my new go-to when I don't feel like dealing with many people.  It's so retro and definitely feels like something out of That 70s Show....", "This is the coolest concept; JUST LIKE you are 14 again in your friend's mom's basement, hanging out waiting for your friends to finish their \"7 mins in..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "u_XXEXRuTK3WykVFzKoj4w", "text": ["I had never heard of this place before, and that is definitely my mistake. A group of us came here on a weekday night. A few other patrons stopped in, but...", "This is a fantastic cocktail bar that is located on 1st Ave., North in downtown Birmingham. We visited one evening when some of the other popular cocktail...", "Last night we had a rare opportunity to go downtown. This was our second stop. We were greeted immediately upon entering at 9:30 to the bartender saying we..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["bar"], []]}
{"id": "Ur8sKF7z3BTwodpb-4CP8Q", "text": ["Finally made it to Pilcrow after walking by many times and seeing the line out the door.  It makes me so happy to see Birmingham getting more and more...", "The first time I visited Pilcrow, I wasn't impressed.  Music was too loud, some of the seating was unpleasant, etc.  I'm glad I came back in, though,...", "Nice addition to the night life scene in Birmingham. We visited on a Friday evening around 7:00 to have a drink prior to dinner at a nearby restaurant. It..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.3], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["dinner"]]}
{"id": "6NSlbdNQnppHh9yrPCLZhw", "text": ["There's so much room for activities!!!\n\nI was visiting the Ham for Sloss Fest and we wanted to check out some breweries in town. This place kept catching...", "Having lived in Birmingham before good people had a brewery and seeing the changes they have made I have to say I am not a fan of the lay out they currently...", "Not my favorite brewery but one that hits most of the right notes. Great open space setup with plenty -- and I mean plenty -- of seating, both inside and..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "bkOjfCGNpRZBI_nR31DLiw", "text": ["We had this catered at lunch today and it was fantastic!  They served breaded fried pork chops, garlic lemon chicken, homemade fried okra, Mac and cheese,...", "Great lunch spot for meat and veggies (plus sandwiches and salads) but a little on the slow side so make sure you aren't in a hurry. They have various...", "I came to Oak Hill one night for trivia and had a blast! It's a dive bar in downtown Homewood that is walking distance from O'Henry's, Urban Cookhouse, and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch", "chicken"], ["lunch", "sandwich"], ["bar"]]}
{"id": "u_mAwtBWzJok4urJJqQchA", "text": ["While waiting for my hotel service to return my call regarding a last minute room change, I located the first place to find a drink in this damn town that...", "This is an awesome bar with an awesome atmosphere. Very accepting Bear and leather community. Lots of hot men everywhere! Pretty crowded on the weekends....", "So happy to have another option for the gay community. The owners did an amazing job renovating the place. Great vibe and the staff is friendly. Short wait..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.55, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["bar"], []]}
{"id": "WNEVxSgvhkNp_7gVJ6-KvA", "text": ["I have only been to the Blue Monkey twice but I truly enjoyed it. I especially love how you can cut away from others if you're in a group and have 'hidden'...", "The Blue Monkey is one of my favorite places in Birmingham. It is a Martini bar in Five Points South next to Delta Blues, a Tamale restaurant. They have an...", "Blue Monkey is one of the most famous \"hole-in-wall\" bars in birmingham!!  Outlined with a great patio for day and night outside drinking; inside has..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.34], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "mnFatadFHFobCrQ42kWOTQ", "text": ["I enjoy going to dance here.  The band... Razzmatazz is great.  This is an older crowd so if you are looking for something young and hip go somewhere else....", "This review is all about the lunch. I love this place for lunch!  My favorites are the fried green tomatoes and the mac and cheese but I have been here four...", "Loud music is the key here. If that is your \"thing\" then by all means go here as often as you would like. Can get packed with people the later it gets, a..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "4HMHtEt6ZYydRgJeqch6yw", "text": ["If you have ever wanted to drink who knows what liquor out of a pickle jar while you watch a guy who thinks he's a country star embarrass himself, than this...", "Well after living in this area of town for 3 years, I finally did it. What did I finally do? I went to an old Pizza Hut turned karaoke bar that serves...", "A friend and I wanted to have a quick drink after a long day traveling. We were met at the door by Wayne, who then questioned us about our backpack. I..."], "rating": [2, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, -0.6], "keywords": [[], ["bar", "pizza"], []]}
{"id": "6cH_VOgL6c1qVEUtHLfdNg", "text": ["Great selection of cigars, wine, Bourbon and Scotch.\nStaff were friendly and knowledgeable, make you feel at home. \nI recommend anyone to visit.", "The best cigar lounge in Birmingham, Alabama. The owner and the bartender provide great service. They have a nice selection of cigars in their humidor. The...", "Very nice spot me and my wife visited on a Sunday night it was very nice. We visited another place down the road that doesn't even compare. The bar tender..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "hWLAdt2dZiMApIJjI7z7Iw", "text": ["Great little place to have drinks and enjoy some good food.. bartenders are great and know how to take care of you. If you haven't checked it out you should.", "A great staple to the Avondale neighborhood in Birmingham. Parkside offers a quirky spirit and good hipster vibe experience that has always been a fun...", "The Avondale area is great and has a lot to offer including this little gem. Located across the street from Avondale Park is Parkside. I believe the front..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "CfzFfzzo_BuMp0iAoASEVg", "text": ["02SEP2018.\n\nCover charge - $2 per person on the Sunday of Labor Day weekend.\n\nBasic dive bar with super cheap drinks and shots. One jack and coke and one...", "TLDR: I almost died here. Not literally, but certainly in some ways. I got super sick (cold), I saw mythical creatures I didn't know existed (or maybe I was...", "I like the concept, however overall, it's really not a place I find enjoyable. It's a nice spot for the night owls to come by for drinks and a little greasy..."], "rating": [4, 5, 3], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["bar"], [], []]}
{"id": "pqniDK16x2Opv-_Sms2Vvg", "text": ["My friend and I went here after work to unwind.  The bartender was not very helpful as she acted like she didn't want to be there.  It took her a while to...", "If you like to hop from one bar to another, this one should be on your list if you're passing though this side of Homewood. Its part of the Aloft hotel, and...", "Meh... Not really a huge fan. This bar is convenient if you happen to be in Homewood and need to wet ur whistle, but if you don't mind a quick drive to the..."], "rating": [2, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 0.2], "keywords": [[], ["bar"], ["bar"]]}
{"id": "i1xWRF8Huhu_WNzlEDGASA", "text": ["A boy, a boy, a boy! My bf and I attempted to go to another restaurant that we were so underdressed for that we decided to go elsewhere. I've been wanting...", "Freddy's is such a wonderful addition to the Highland Park area.... a bummer since I no longer live there! \n\nAs others have said, parking can be hit or miss...", "I have been to Freddy's a couple of times since they opened and I have always had a wonderful experience here. They have an extensive wine selection, as..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "5SjePdbqCP12xacbvPYj-w", "text": ["Cheers, where everybody knows your name! Even if you feel out-of-place, no one treats you as such.This place is exactly what you expect. Smokers, 1970-80s...", "Can't believe I have never reviewed this place! Sundays is our favorite day with Jyl the bartender. Red Lion is one of the oldest bars in Birmingham ,and...", "I thought this place was going to be a golden gem from the outside when I found this place on July 4th. My friend I was with highly recommended this place..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["bar"], []]}
{"id": "VDwpyx_Ujy_-bK35tB6ESQ", "text": ["Honestly I'm not a fan of the pitziz, but The Louis is such a great additive to this place. Fairly large seating area, with a great cocktail menu that...", "My husband and aunt both ordered pizzas from here. The wait time is long but that's understandable for pizza. Pizza is thin, new york style...foldable. They...", "The Louis is a good spot to have a drink either with or without food from the Pizitz.  Full bar with signature cocktails, beer, and wine.  The Louis just..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.52], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["pizza"], ["bar"]]}
{"id": "1eeTpdMpADhAHo4Q3kW80g", "text": ["This is my first time coming into the Plum Bar. I like the spot. Real cozy like. I'm always down for a some music and drinks. You have to come early if you...", "I generally enjoyed the Plum bar and could see myself going back just to chill with friends. I came for a poetry event to see one of my favorite poets so I...", "Hummmmmm.. got here at 9:30pm. There was a $5 cover... luckily we got here early as the majority of the tables were reserved. Seating is limited if you..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.33, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["bar"], ["bar"], []]}
{"id": "OfV78STjHQWv5nLs1dsyYg", "text": ["This place is a true dive bar. If you're looking for a place just to have drinks and maybe grab some bar food then this is your place. Nothing fancy about...", "As others have said, Crestwood Tavern is a friendly, neighborhood bar. Nothing fancy, but it's a good place to hang out and catch up with friends. I...", "The reason I give Crestwood Tavern four stars is because it doesn't try to be anything it isn't. It is a dive bar through and through. And not even one of..."], "rating": [4, 4, 4], "TBscore": [0.35, 0.54, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "7TMQuj1PuOXdXuBArqU6yg", "text": ["All I can say is karaoke on Saturday.\n\nJust go.", "Came here with some friends after the Magic City Brewfest. First time here. Saturday night dive bar and there weren't many people in here (8;30ish). \n\nWe...", "The Brown Derby is your one-stop shop for a rowdy, late-night good time.\n\nThe drink selections are no-frills and super cheap.  On weekends, there's always..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["bar"], []]}
{"id": "XZe71cTXrR_Sknw2x61ALg", "text": ["Best Moscow Mule in all of Birmingham. Hand down! They also have a trophy for the best pint of Guinness poured in Birmingham. A bar of many talents. Also...", "Nice and spacious bar with plenty of large open seats and space. The interior was decently kept and wooden. Service was good. It was not busy on a Friday...", "I had been in 41st Street Pub a couple of times over the past couple of years but hadn't felt moved enough to write a review until last night's visit, which..."], "rating": [5, 4, 4], "TBscore": [0.58, 0.23, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "APXtt_r6Ttbm2ByA32oMnw", "text": ["Great spot for pool.. drinks are a little pricey for the size but great for pool and music.", "I'm drinking with my buddies in our own bubble. A stranger comes up to me recording and saying something about my ass. Being a burlesque dancer from LA, I...", "My first time at this place I had a good time for a person from the city of Chicago I will tell many of my friends about this place ladies are very elegant"], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "5Nx1mZWH9smkzgr4plVeZQ", "text": ["One of my favorite spots in Birmingham!  I love the karaoke here. It's not night at the Apollo here so even if you can't sing well or at all, you're still...", "Came here after a horrible experience at the Vault. Pretty crowded. Nice mixed crowd. Sat in the pool table area because that was the only thing available....", "Karaoke joint. Not that appealing on the inside. They do have a great selection of music. They have adequate tables to sit at. You can play pool.They serve..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "zpcxPU6OGBZB-aQIIoJhIw", "text": ["I've been coming to Pub for years and it's a great place. There's a pretty impressive selection of craft beers on tap. The food is good, we really like the...", "I was in the area scouting out real estate and decided to stop in for lunch. There is smoking allowed inside here, so anyone sensitive to smoke should steer...", "For what this place is, a dive bar with surprisingly very good wings, plenty of tv's, and lots of draft beer - you can't beat it. It's a true dive and I..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.63], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["lunch"], ["wings", "bar"]]}
{"id": "Hk04pfNv8a6aCR89NqLc2A", "text": ["After reading Paul and Linh's review of The Seafood King, I had to try it.  Glad I did.\n\nAs Paul mentioned, this is the old Black Pearl (going to miss their...", "It's great to see that this trend is hitting the Birmingham area!  I've eaten at Hot and Juicy in Orlando, and wished we had something similar here.\n\nMy...", "It was a bit sad dining in this restaurant because the building was formally the Black Pearl Chinese restaurant. That was one of my favorite restaurants,..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["chineese"]]}
{"id": "s27GWWCUPKTQNCDUeqfJLw", "text": ["I love the food here. I always get my food \"to go\".\nEach time I have ordered, the service has been great, the orders have been correct and the food...", "Really just awful food. The chicken tastes like it came from a can and the delivery came with a slick liquid all over the bag and egg rolls. \"Sweet and sour...", "When a close friend of mine went vegan, I came here a lot with him. I typically get the Mongolian beef, but enjoy most of their lunch dishes. The food isn't..."], "rating": [5, 1, 4], "TBscore": [0.0, -0.24, 0.24], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["chicken", "egg"], ["lunch", "beef"]]}
{"id": "WGeGTF7mdQsuBYIQs4WphA", "text": ["Stepping in here was like stepping back in time. Even the music played was retro. This was such a family friendly environment with amazing service and...", "Honestly this is the worst restaurant I have ever been to. The food is fantastic, the service is god awful. My boyfriend and I called to order food to go at...", "I loved all the food I tasted.  Eggroll, some type of coconut butter chicken that was to die for!  Delicious fried rice and great service.  I ordered the..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.44], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "vyjSeoAZcshWSa1be81amg", "text": ["Anyone for 10minute? \nLove it here. \nPerfect little neighborhood joint! \nI run up there in my PJ's to grab food all the time.", "This place is a staple in the Bluff Park area of Hoover. It's a take out place with some indoor seating. They specialize in standard American Chinese fare....", "I'm almost eight and think this place is great! I came up with that rhyme ;) \n\nOur fridge was broken so we ordered food from here. I was so glad our fridge..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["american", "chineese"], []]}
{"id": "auQis_CmDjc17paruECjsQ", "text": ["Easily my favorite Chinese take-out. Now the menu is pretty much what we Americans demand. But, the food is always well-prepared. It is always ready to pick...", "Um capital NO!!! Visit was a disaster. First the place was small with no authentic feel to it. In fact they had a local Top-40 music player behind the...", "Hands down the best chinese I've had in bham. Great food, lunch specials, and friendly staff. The fried rice and lomein are really good but the mongolian..."], "rating": [5, 1, 5], "TBscore": [0.23, 0.0, 0.45], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chineese"], [], ["lunch", "chineese"]]}
{"id": "Y4UmZ3YiuS-Y5QTOZ7v6qQ", "text": ["Chen Express has the best American Chinese cuisine in the area.  I can't comment on take-out or delivery, but I've eaten in for lunch a few times, and it's...", "It's a little more pricey than other Chinese restaurants. The first time I had it I had the sesame chicken and fried rice which I remember being really...", "Chinese food isn't my first choice for dinner but after a long day out, we needed a delivery option. This was my first time eating Chen Express and I was..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["lunch", "american", "chineese"], ["chicken", "chineese"], ["dinner", "chineese"]]}
{"id": "GH3vxmqBLD88l3VdnAfPvA", "text": ["This place has the best customer service along with the best Chinese food on HWY 280.  I can not wait to go back and try something new.", "Ordered the Appetizer Platter to get an idea of what I may like to order in the future. Certainly a waste of my money! The food was horrible. Shrimp toast...", "For Chinese food on this end of Hwy 280 I haven't found anyone that beats it.  \n\nAmbience: Clean Americanised restaurant setting.\n\nFood:  This is where this..."], "rating": [5, 1, 5], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "C4KdIgyi_18WTbfQ9QCYSA", "text": ["It's actually very good and worth the money I had the Garlic Shrimp and Chinese Donuts. It came out fresh the rice was a little dry. But other then that...", "Magic Wok was okay. I ordered the General Tso's chicken for lunch and was not disappointed with the portion size. They give massive amounts of food for the...", "Greeted with a smile and quick, great service. You could tell the ingredients were fresh. I was a little disappointed with my order. The garlic chicken..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["donut", "chineese"], ["lunch", "chicken"], ["chicken"]]}
{"id": "tsO18HocTCjt4YXLRCqKQQ", "text": ["We've been going there almost 20 years.  Excellent.  We especially love egg rolls and hot and sour soup.  Regularly order general tso's chicken and love...", "This place is always jammed packed! I typically only come for the egg rolls, which are some of the best I've ever had!!!!  I mean, they really are! \n\nOn my...", "Giving this place a four star.  The food is your typical fast food Chinese restaurant, however during busy times, the quality sometimes quickly..."], "rating": [5, 4, 4], "TBscore": [0.26, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken", "egg"], ["egg"], ["chineese"]]}
{"id": "w0VXsaFR2H9BnRpry0lTmg", "text": ["I ordered Honey Chicken and House special fried rice. The order came out quickly, but was piping hot! That alone deserves 5 stars. The Honey Chicken was...", "Well, it's just takeout Chinese food, so expect that. My boyfriend and I went about 30 mins before closing and immediately let the guy at the register know...", "Always good. Love the shrimp LoMein  always lots of food ready quick and inexpensive \nService is good take out always ready on time"], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["chicken"], ["chineese"], []]}
{"id": "Xn4CmFR2YtCFDBoJKOgBiQ", "text": ["The food, as written in a previous review was so so- nothing rare about the food- service was definitely missing- the young lady attending to our party of 6...", "The menu has changed since this users' last visit. The prices have gone up, but I guess that is to be expected with inflation. They still have mouth...", "This is the second year in a row we've gone to the Birmingham Bowl. And our second time to the small, family run restaurant. The food was great both times...."], "rating": [2, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "PP39ZIAEzQgPRiIt0R32Pg", "text": ["Fresh food, fast service and super friendly owners. Guarantee that each time I'm in this area, I'm planning on eating here. \nYou just can't beat fresh,...", "Average Chinese food from frozen vegetable stock; freshly prepared after order. Prices for lunch specials are lower than any I have seen. Egg rolls seem to...", "Great service and great food!  The honey chicken is amazing and so is the hot and sour soup! Would recommend for take out or dine in.  Clean facilities and..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.32], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["egg", "lunch", "chineese"], ["chicken"]]}
{"id": "2jRWYePbkp3WPTfIY73lOg", "text": ["Hidden jewel\nYes it is behind a car wash, yes the parking lot is dark...neither of which detail your food/dining experience. This is hands down one of my...", "First observation- the parking lot is dark. Very dark. Then you enter Ming's and are transported back to the 70's. You expect to see Austin Powers seated in...", "How does a restaurant that's been open for 29 years only have 25 (now 26) reviews on Yelp?!?  I'm not sure.  Could it be because it's hidden in the corner..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "r9G1P4ZbWn5ysiGujYYIag", "text": ["My sister and I could not eat inside because my dogs were with us.  We were disappointed because we were hungry, the dining room was cool, inviting and...", "Yummmy!! Cute little place with great food! \nTheir food is a healthier \"fancier\" version than the little 10 minute places we use to go too. \nThe pineapple...", "Best food in the world.  Love the chicken soup and the house specials.  Can't wait to go back again."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.23], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "5tfbCaga7BHbDTwR6bskDg", "text": ["As always, this restaurant never disappoint in having good Chinese food. I come in all the time that they even know what I want to order before I say...", "If there was any way to rank zero stars for this place. The service is horrible. The food tastes like it's been cooked and reheated. Their drink machine had...", "Ehhh... unfortunately I'm not impressed. \n\nWe ordered large orders of General Tso's Chicken and Orange Chicken, and literally could not tell them apart...."], "rating": [5, 1, 2], "TBscore": [0.35, 0.0, -0.29], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["chineese"], [], ["chicken"]]}
{"id": "6KafwweE_2_Pr_9ghp1COg", "text": ["This is my go-to Chinese restaurant. I normally call ahead and can pick it up within 10 minutes. Their hot and sour soup is great and if you haven't tried...", "Typical fast-food like Chinese. You can order, eat, and pay within 30 min. The food ALWAYS comes out quick... this explains the cold egg roll. Of course...", "Horrible, horrible service. Just moved to the area and was hopeful that it would be good. The waitress forget to put my order in and upon recognizing it, no..."], "rating": [5, 3, 1], "TBscore": [0.21, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["chineese"], ["egg", "chineese"], []]}
{"id": "Cq8qaF_weEDEdDV_xzWsjg", "text": ["We have been coming here for 15+ years. The service and quality of food are what we have always admired. However, there was a time or two that the quality...", "I am giving this a 2 star rating for customer service; the rating would've been much higher because the food is really good. I visited the restaurant almost...", "I must say I cannot understand the positive reviews. I ordered the pork hunan, what I received was not pork hunan. It was more like a sweet and sour pork..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "bYYDtbUDd53MfnuJxX0txA", "text": ["Lunch with my coworkers are always fun. We can never decide so we just walk and pick. China Master won. I went with Lo Mein w/ 2 Meats. I chose Beef and...", "One of my favorite restaurants to go to on lunch. Their food is always hot every time I go. I love their lo mein noodles. What I love the most about this...", "You really get bang for your buck with this place: they pile on the food. The chicken was delicious,  as was the rice and noodles. Three bucks for a drink,..."], "rating": [5, 4, 4], "TBscore": [0.3, 0.45, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["lunch", "beef"], ["lunch"], ["chicken"]]}
{"id": "D1c4kMAJbf4fqefyOwi1pg", "text": ["I'm not sure what the hype is about this place however,  I'm not overly impressed, in the least bit! I walked in at 11:15am. The lady at the counter watched...", "The food taste good, but I have a problem with the deception. The fried scallops aren't scallops at all. Their scallops are rolled, breaded tofu. Knowing...", "Nothing very exceptional about this place. I always order take out here because it's the closest to my home. The service is always minimal and the food is..."], "rating": [2, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "QFCHGIDJ5gFsCDMWNTCzwA", "text": ["I placed an order for delivery and when the guy arrived, part of the order was missing. I called the restaurant and told them was missing and the lady on...", "I normally get the three delicacies (which is sooo good!) but I felt adventurous and tried to the Mongolian beef. It was delicious! I went and picked it up...", "We've ordered from this restaurant quite a few times.  Sometimes for pickup, sometimes for delivery.  Usually the delivery is fairly quick and the food is..."], "rating": [1, 5, 3], "TBscore": [0.0, 0.63, 0.0], "normalisedRating": [-0.6, 1.0, 0.2], "keywords": [[], ["beef"], []]}
{"id": "5OYpNATf6bl_Rmas87Waxw", "text": ["Excellent Cheap Chinese! Crazy fast service - they have this down to a science. The egg roll was only so-so (but no egg roll will ever match the memory of...", "This is a lunch place with average quality Chinese food. It has a pretty big menu with a good variety of dishes. Although they tend to be very busy at...", "This is probably birmingham best Value Chinese restaurant. Within the foodcourt in the harvest centre you can find everything your looking for when it comes..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["egg", "chineese"], ["lunch", "chineese"], ["chineese"]]}
{"id": "GcJH_WwtGbxrXliynBGw2A", "text": ["The China Doll 2 is a great little neighborhood, strip-mall Chinese restaurant near the corner of Valleydale Road and Caldwell Mill.  Tucked away in the...", "Frankly I'm not sure how this place keeps its doors open aside from no competition nearby. Ordered carry out, Kung Pao beef and Mongolian beef. I've...", "Good little buffet. It's not the biggest, but the food is very good. Hot and sour soup is very good.only cost $6.99 for lunch."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [["chineese"], ["beef"], ["lunch"]]}
{"id": "ywn1go8B1fWD29MmtNrOAg", "text": ["Good lord.  I really should have checked Yelp before stopping in here for lunch today.  Not good.\n\nThe sauce on the Kung Pao beef was more of a syrup.  One...", "A solid three stars is what Yoe Express earns. My Mongolian beef was pretty good, with the fried rice being full of flavor and taste. The egg roll was good....", "I have ordered from Yoe Xpress several times. Quick delivery and great good. My go to items are the teriyaki chicken appetizer, sesame chicken, fried rice,..."], "rating": [1, 3, 5], "TBscore": [0.26, 0.4, 0.0], "normalisedRating": [-0.6, 0.2, 1.0], "keywords": [["lunch", "beef"], ["beef", "egg"], ["chicken"]]}
{"id": "vvVoIdy8XhRGdaOR7YP64A", "text": ["I frequent this restaurant on average once a week, and I have never received the level of service I've received today. Let's start from the beginning.\nI...", "Great service, really nice. But bugs in the food! I had eaten there a couple of times before and was pretty happy with the food and the service, but today I...", "Decided to come here despite the not so stellar reviews. I was pleasantly surprised! \n\nWe ordered the crab angels. They were so good. Hot and fresh! \n\nI got..."], "rating": [1, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "0nTYI0zY5djZzgNB_4biaw", "text": ["Food and service was great, especially the beef pot stickers. Good soup but have had much better around trussville. Also, could use a bit off sprucing up!", "Service was ok. Chicken was dry and when I said something about it the manager argued with me. Very unprofessional. Won't be going back.", "The quality of food is declining. Kung pao beef was not spicy it was bland. The sesame beef was prepared in fryer and left a bad after taste in your mouth...."], "rating": [4, 2, 1], "TBscore": [0.53, 0.0, -0.29], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["beef"], ["chicken"], ["beef"]]}
{"id": "ZYyVfiGmqVlmzVeGBXxAmw", "text": ["My husband and I saw the sign for $5.49 lunch buffet on weekdays and decided to try this (and lunch goes until 4pm!). Our first experience was really good....", "I almost feel dirty writing or admitting this, but I have a soft spot for Chinese buffets done well.  \n\nNCBIII does a great job with what it is:  All things...", "So I realize this is a Chinese buffet in Irondale, AL, so I wasn't expecting much. But it was even a little worse than expected. The decor is like a fancy..."], "rating": [4, 4, 2], "TBscore": [0.47, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["lunch"], ["chineese"], ["chineese"]]}
{"id": "QQJNMWb7Wb-_tpmeSpdEpw", "text": ["This is the best Asian restaurant we have had in this area (Moody, Trussville, Leeds, Pell City)!!! They have the best hot and sour soup ever, fantastic...", "Finally! A great place to get Chinese food in Moody! We've gotten food three times & each time has been better than the last. We've tried the egg drop soup...", "They have great Hot and Sour soup.    The Dragon and Phoenix dish is also a favorite.  The service is friendly and polite."], "rating": [5, 5, 4], "TBscore": [0.0, 0.33, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["egg", "chineese"], []]}
{"id": "8_I9qBqVI3j-J3VHdSKyug", "text": ["We went in on a Sunday at 12:30 to place an order to go. They were very busy, but we got our order in and 20 minutes later we were on our way with our food....", "This is such a cool and retro looking place with tons of aquariums and old school Chinese decorations. The food however, is a bit too sweet, greasy and...", "It's difficult to beat Chinese food when it comes to comfort-food. And no one does it better than Mandarin House. I recommend the Mongolian Beef, for..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["chineese"], ["beef", "chineese"]]}
{"id": "Rg0wKAoN5DT_LrrA4sfCzg", "text": ["Shrimp Pad Thai was delicious. Was full of tender Shrimp that had a light crispy batter. The peanut pieces were sprinkled on the top and I tasted it with...", "Pros: Very large menu and more spicy than most fast food type Chinese places. Egg rolls are awesome.\n\nCons: Won Ton soup was so hot it melted through the...", "Your standard take out Chinese cuisine. You can dine in, it is small but clean and kept up well. They have fast service and pack everything to go very well...."], "rating": [4, 4, 3], "TBscore": [0.0, 0.39, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], ["egg", "chineese"], ["chineese"]]}
{"id": "yhFTVNEYcbJ3lJJuro2Trg", "text": ["Look I'm from California and I can say hands down they have the best Chinese food. I promise you this place is disgusting. The fried rice didn't taste like...", "Absolutely horrible. I ordered sesame chicken and it was very dry no sauce and had  texture like it was microwaved.  The steamed rice was  Cold and dry. I...", "Good people here making great food! My favorite is the sesame shrimp and egg drop soup. They will customize your order and deliver after 4:30pm."], "rating": [1, 1, 5], "TBscore": [0.0, -0.47, 0.73], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [["chineese"], ["chicken"], ["egg"]]}
{"id": "jBTB1ERIcy2mejeC-h_96A", "text": ["This is good, well priced, Chinese food. Nothing fancy. It's great on the fly when you don't feel like cooking. Folks are nice too!", "Lady at the front is extremely rude and no accommodating.  She is kind of like the soup Natzi on Seinfeld.  What do you want and hurry up.  Food is not very...", "Horrible service or attitude of lady who asked me why I needed another hot mustard packet when she had already given me two! Not to mention the food is..."], "rating": [4, 3, 1], "TBscore": [0.61, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["chineese"], [], []]}
{"id": "EYATjK0iSqbyhH2otpcygQ", "text": ["First time here and I would say it's pretty good to be \"fast food\".  It reminded me of Chipotle ‍ I ordered orange chicken, fried rice, cream cheese...", "I finally had panda express and I'm pretty disappointed.  I always hear people hype it up but this is what I get for 10$. Kinda weird I get 20% main meat...", "HORRIBLE. Service, portion,price and taste. Old lukewarm food. Never again. The portion sizes are a freaking joke. Everything tasted stale. I will not return."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["chicken"], [], []]}
{"id": "yyeBHe9fB_0_sqjjmra8dA", "text": ["I literally live 2 minutes away and I am so happy that this place is here!  When I lived in Atlanta,  one of my favorite places to for grocery shopping etc...", "This place has almost everything you could need Asian grocery. For Birmingham, it is impressive.. truly. I just moved here in the summer and first visited...", "Whenever I'm in need of Asian groceries, I always make sure to stop by here! They have a vast selection of items, which is much appreciated, especially..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "ReaHYP2AcGDfQ-zh_6OkTw", "text": ["Before anyone who knows me says it, yes I know I should not go to any kind of Buffet.  OK, so keep your chunk old guy jokes to yourself.  On to my...", "I came in on the Saturday after Thanksgiving. The beef and broccoli and Mongolian beef we're very salty. I had other dishes. Those weren't as salty. I left...", "Holy crap I haven't been back here since college days but I'm so glad I rediscovered my love for this place!! This hands down is the best Chinese buffet in..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], ["beef"], ["chineese"]]}
{"id": "aOFHThCQ1G10u_kONvjxcQ", "text": ["Now this is an amazing ramen  spot in the B'ham area‼ it's truly worth every bite. I got the Shoyu ramen with the chicken substitute. It was a delicious...", "This is an updated review. I visited Ichicoro today for the first time since my original visit, which was quite disappointing. I was blown away with how...", "This ain't your microwave ramen. This is GOOODDDD. So good in fact that my husband who initially scrunched his nose at my choice ended up finishing my bowl..."], "rating": [5, 5, 5], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken"], [], []]}
{"id": "McVeuTUp0Vv0jlqtE9iwfA", "text": ["My family and I are here about once a month so I really don't know why I don't check into this place more often. Also, how have I not reviewed this place...", "Didn't really look like much when we arrived, but the food was really good and the service was \"so-so\", but not at all worth the mandatory tip that they...", "Always delicious! Don't understand why not more stars. Hibachi steak and shrimp always cooked how my husband orders it, and my hibachi vegetables are some..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], ["steak"]]}
{"id": "sEsiSa4DCH43YF371Tqvyw", "text": ["Good Lord is the pho good here.\nNot to mention the spring rolls keeping popping up in my dreams.\n\nOkay, maybe a little extreme, but the pho here is...", "In my search for good pho in Alabama this place is on top of my list so far. The building was ok and the staff was extremely nice. I ordered the beef pho....", "Food here is phenomenal!! Best pho Pho sure!! So if you are wanting great flavor, aromatic bowl of pho with brisket, tripe or shrimp or fried rice with..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.48, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["beef"], []]}
{"id": "NKr94WfTtPBDwEODGByPTA", "text": ["Birmingham has a pretty decent Asian restaurant scene but I'm not aware of too many Korean restaurants. Not like montgomery at least. \n\nI do really enjoy...", "Yes, yes, yes, I agree with ALL of you other reviewers...it is expensive. Probably more expensive than it needs to be. What I DISAGREE with is whether it is...", "One thing that is definitely lacking in Birmingham is really good Korean food. After having been disappointed with Ginza, we decided to check this place out..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["korean"], [], ["korean"]]}
{"id": "bc_KxbktwYodnZq7pPUerQ", "text": ["If you love Indian food then this is a must , Bayleaf is my one and only favorite place to get it . The food here is awesome and for the price you just...", "Bayleaf is a great little ethnic addition to Birmingham's Food scene. They're conveniently located on 280 and trust me, it is hard to find good Indian food...", "Picked up takeout from here the other night. My first time here so I didn't know what to expect. I ordered the vegetable samosas which I don't normally..."], "rating": [5, 4, 4], "TBscore": [0.5, 0.26, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["indian"], ["indian"], []]}
{"id": "CicQds_sU8ooqN04EVu5XA", "text": ["I haven't eaten here in a long time but I'm glad to find that their food and service are still excellent!\n\nMy daughter and I had their lunch buffet on a...", "The paper masala dosa is the best thing on their menu. However, they don't do well with their biryani and grilled meats. If you are looking for good...", "Ordering Indian food is not exactly my forte, so I went with my oldest son who is a pro. Letting him order for me was the smartest thing! We had garlic naan..."], "rating": [4, 4, 4], "TBscore": [0.48, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["lunch"], [], ["indian"]]}
{"id": "xqOr7zpxcU9pJOYXrorl1g", "text": ["This place is a Birmingham staple, and I'm sad it's taken this long to come here and review it. We came at night, so no buffet for us. The staff were...", "10.99 for lunch buffet (tax incl). I couldn't find the price before I came in or on Yelp so wanted to add that here. The sauces were pretty tasty but the...", "Great place for lunch if your looking for something new and quick. Their buffet offers just that! Many authentic options to choose from. Even if you've..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.25, 0.4], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["lunch"], ["lunch"]]}
{"id": "9pv_r0w3aSY8tHpCeD-R-g", "text": ["Bawarchi is newest Indian restaurant in town. It is located in the strip mall between Academy and Stein  Mart. The renovated space is clean and...", "Yesss an Indian restaurant contender in the area!! I'm all about spreading the love to my ethnic cuisine restaurants so this addition to our food scene was...", "Finally a decent Indian place in Birmingham! Food is fresh, flavorful and of good quality. It's on the expensive side when it comes to Indian food but I..."], "rating": [5, 4, 4], "TBscore": [0.37, 0.5, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["indian"], ["indian"], ["indian"]]}
{"id": "ZwtQgKpNQ94qlWUTNjxwvw", "text": ["After coming here a few times. We cannot say enough good things about it. Their lunch buffet very delicious. Everyone that we have recommended this place to...", "I absolutely love the food here. Their hearty recipes warm your body and soul. I am from Houston and this place beats the food back home. It is absolutely...", "Wait, what?  One of the very best Indian restaurants we've been to in the U.S. located in the shadow of 'Bama's big porcelain god??  (Ok, full..."], "rating": [5, 5, 5], "TBscore": [0.38, 0.0, 0.46], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], [], ["indian"]]}
{"id": "6UShQOtoUJF_lU-fqhqyhA", "text": ["Had an awesome experience at El Cazador this afternoon. Husband and I went at around 3:30pm and it was such a lovely day we sat outside. \n\nThe waiter was...", "This place is super hit or miss with me. My husband and I just moved to Mountain Brook and discovered it our first. While we waited over 10min (on a fairly...", "This place is AMAZING!! It's located near my apartments. I was looking for a basic Mexican restaurant that was cheap and not Tex Mex and I came across this...."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["mexican"]]}
{"id": "I7Xzub10gjEestPazISQKA", "text": ["TLDR; Good Mexican Food. Great staff. Amazing Decor. \n\nThis is just a great little Mexican restaurant. The carved pictures in the tables are a sight to see,...", "Not a bad place to visit for lunch.  Not sure about the even, as the area in general at night might be desert giving it a feeling as not very warm.  The...", "Excellent food, very authentic Mexican! Great service-like being at home!!! Plus they have tv's with Monday Night Football on."], "rating": [5, 4, 5], "TBscore": [0.39, 0.0, 0.66], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["mexican"], ["lunch"], ["mexican"]]}
{"id": "AHBedM-akRQBKttxt1wquw", "text": ["We had take\nOut last\nWeek from\nCasa fiesta, and it was amazing!! I had the steak nachos, and let me tell u that guacamole is amazing!!! So is the cheese dip...", "If you're near the Pinnacle in Trussville, you know there are a plethora of restaurants and options to choose from. Mostly chain; this place is not (or at...", "If they're trying to serve authentic Mexican food, they definitely have lots of work to do. I came here a year ago and I thought the food was off and maybe..."], "rating": [5, 3, 1], "TBscore": [0.65, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["steak"], [], ["mexican"]]}
{"id": "pnuzLueOSSQuo3MxP7GvHw", "text": ["Ain't no Asian food in the restaurant. Ain't no black food in the restaurant. Ducking awesome!", "New Mexican restaurant! Large variety and very authentic. Owner has horse ranches in Mexico. Trojas means Barn. Guacamole prepared at our table. Needed salt...", "GREAT bar area and food is very good. Margaritas are very good too. We go every couple weeks"], "rating": [5, 4, 4], "TBscore": [0.0, 0.25, 0.87], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["mexican"], ["bar"]]}
{"id": "xOUunlzLnuNI0n2Alg96_g", "text": ["This is my favorite mexican resturant in Birmingham. The food is great and ranges from plain jane staples like tacos, to the more complicated dishes that I...", "Chips almost stale\nSalsa was ok\nHost is great\nService is good\nChicken fajitas - chicken is excellent and tender and clean\nI'll probably come back because...", "This was an awful experience! The service was terrible. They charged my credit card $66 (someone else's ticket) my bill was $28. They never apologized nor..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["mexican", "tacos"], ["chicken"], []]}
{"id": "vYdq727UKg2xCtj0GXldRQ", "text": ["Great service and atmosphere. I have been here before and I will be back. I loved my taco salad.", "Came here for lunch. Really brought and colorful interior. The menu is extensive. It was tough to decide what to get. I ordered the spicy burrito. It was...", "I've gone to a lot of mexican restaurants in Birmingham but never to one that made me feel like I was out of place. It wasnt crowded AT ALL which made since..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["lunch"], ["mexican"]]}
{"id": "Oww_u-7kBRcjYgB5tyxZ8g", "text": ["THIS REVIEW IS FOR THE HUEYTOWN LOCATION. \n\nMy hub and I went to Machette's last night; he got a Gordita with ground beef, and I got the (?) long quesidilla...", "Fantastic meal.  Food tasted very fresh. Best tortilla in town.  Must visit restaurant.", "Real authentic food. Great tortillas. Sweet people. Margaritas are really delicious. Close to town."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["beef"], [], []]}
{"id": "w7sttSmveVnx2bPQztoKSg", "text": ["My and family and I have been going to Tecate for years! It was always on the top on the list when my kids got to pick the restaurant spot. To this day,...", "I enjoy eating Mexican food at restaurants like this. There tends to be consistency between each place, from the free chips and salsa to the quick service...", "Been going to tecate since I was a kid. The atmosphere and service are always great. My go to order is the enchiladas tectate and it never fails to satisfy...."], "rating": [5, 3, 5], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["mexican"], []]}
{"id": "a4KYfXWiA8EjjkLOKzvTWw", "text": ["They have one of the best Happy Hours I know of around here. (If there's better, please message me and fill me in! Lol!). Their Happy Hour is everyday from...", "This was my first visit here. I went during happy hour. The Food was pretty good. $2 tacos during happy hour and $3 margaritas. I loved the magaritas!! The...", "TL;DR, \nFood: ?/5\nRestaurant Rules: wow they are dumb/5\n\nThey say that one should never judge a book by its cover, but unfortunately I cannot follow that..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.63, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], ["tacos"], []]}
{"id": "kYoZLw153Hf7KrnbWeWnHg", "text": ["Not far from the hotel I am staying at. Close walk and only place that's serving beer. Pretty dated inside The service is good - They take your order and...", "I CAN NOT believe this place has the stars that it has. The waitress is awful. The food is bad. Ordered a pitcher of margs and when tasted the lime rocks...", "I came here today for lunch before work. I had always been curious about this place and have probably driven past it hundreds of times. I saw a lot of..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], ["lunch"]]}
{"id": "N_yq0Z3iTCBS5ComgdrkKQ", "text": ["The best Mexican food EVER!! My absolute favorite place! I love the grilled chicken fajita quesadilla with bell peppers and onions with rice and beans. This...", "I think I've said this before, but I'm always game to try a new restaurant, especially if it's Mexican (by new I will clarify, in this case just new to me...", "First time at Zapatas for lunch. I got the chicken soup, pretty good. I also got the chicken nachos. Very spicy but flavorful. The staff is nice. Def will..."], "rating": [5, 3, 4], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["mexican", "chicken"], ["mexican"], ["lunch", "chicken"]]}
{"id": "juh9js1tufzzBiSKOBDOHQ", "text": ["I was happy to find this spot! I was born and raised in Lima, Peru until I moved here at age 26 so I know peruvian food. First of all I was happy to find...", "The food was pretty average, but I would recommend going to this place on Wednesday's for $1 margs! Do note that you have to spend at least $5 for your...", "I went here for the first time in about 8 months this week, and was taken aback by the changes. Inside has been remodeled some, new menus, etc. Usually good..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "5uq1n5ypHBEhlbahOzf-Aw", "text": ["Absolutely perfect !! From the server to drinks and food. Waitress was very timely, manager shared conversation, and the bus boy even made sure we were...", "Every third Saturday is Cuban night. They have a special menu and live Cuban music. A friend invited us and I am so glad he did! For starters, I had a...", "My new favorite Mexican restaurant. The quesadilla is delicious and the cheese dip is the best I've had so far. My husband is a salsa fanatic and says that..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["mexican"]]}
{"id": "hI1lqAPzdPzrrQ1TAeubFg", "text": ["This place holds a special spot in my heart. I've been coming here since 1998 when it was at its old location. Maybe it's nostalgia but this is my go to...", "Gave it a 2 because the service was great but the food wasn't. The beans almost looked gray and were extremely watery and wasn't up to par to most Mexican...", "Still two years later, no changes. I have to disclose that I went on Cinco de Mayo, but still it was as bad. \nServer looked like a sixteen year old. He in..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], ["mexican"], []]}
{"id": "NPBBzbEHtDI6j8_kufFAFQ", "text": ["Chips fresh and crisp but not under or over cooked. Salsa fresh and flavorful with nice pieces of onions and tomatoes and not puréed like most...", "I would like to give 2.5 stars. \n\nMy husband and I went on a Sunday after church (12:30) they were not as busy as we expected. \n\nThe service was just ok....", "I recently swung by Hacienda for a quick late lunch on Saturday afternoon.\n\nFor starters, a Dos Equis Amber, chips, salsa, and queso.  All standard..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], ["lunch"]]}
{"id": "7ZUiSdXG_ylZS8fXcydK9w", "text": ["I knew I was in the right place when my co-worker and I walked in and were the only 2 non-Spanish speaking individuals in the restaurant! Jack pot this...", "I tried Taqueria Los Primos for lunch on Friday. The restaurant was busy and almost all of the customers were of Mexican decent. I love finding ethnic...", "Very friendly service. Buffet of sauces, limes, onions, and cilantro against the wall. Great variety of quesadillas, tortas, tacos, dessert..... I had the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.64], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["mexican", "lunch"], ["tacos"]]}
{"id": "mATttQzCH8Xy8s1fxxd89A", "text": ["I visited Tin roof quite a few times. Usually on Thursday nights or on Saturday's. It's usually hit or miss on what type of crowd there will be, depending...", "Recently came here for a Bachelorette Party. I don't recommend it. We went on a Saturday night, it was packed, no place to sit, hardly room to get around,...", "Stellar place, Stellar food. Service was quick and orders were served hot. There is a full bar if the situation presents itself. \nThe menu was great full of..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.37], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], [], ["bar"]]}
{"id": "AxSb7SrzYyIp0_ZTLHW9ug", "text": ["My idea of a solid meat and 3 and the other reviewers apparently differ. I don't think I've ever seen a 5 from one of the reviewers that gave this spot  a...", "Absolutely a great place to eat! I wish their hours were a bit more flexible though. Friendly service, great food and a good ole' \"home\" country atmosphere....", "This is one of the greatest little places in bluff park. It's in the old part of commercial bluff park that was built many years ago.\nThe food is always..."], "rating": [2, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "0iuNhvXcQ3VP30N2hIDHiA", "text": ["I just have three words - yum, yum, YUM!\n\nI was out and decided to grab a meal to go from Snapper Grabber's. I have been to the food truck twice before and...", "I previously reviewed this place about a year ago. My review was removed, no idea why. The previous review included the review of the gumbo, which in my...", "As usual, a great place for a quick lunch. One word of caution, however/ if you come here the week of Thanksgiving or Christmas, you will run into horrific..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "XYqdZxmewluZ5qclL7l5SA", "text": ["This is a nice welcome addition to the Birmingham brewery scene.  It is located in the old BEBCO building.   The renovation was nicely done.   They have...", "It's a pretty solid brewing company located in downtown Birmingham on Southside. It's fairly small but opens up to a large outdoor space which is great for...", "Opened in November 2018, this is one of Birmingham's newest breweries. It is located in the newly renovated Birmingham Electric Battery building at 2201 2nd..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "aXKvkn4C6l8p6RNK-Swcag", "text": ["Nabeel's never disappoints..We ordered the baked Feta Theologus and also the Bruschetta for appetizers. Both fantastic..the bruschetta came with some...", "Bruschetta and Tabbouleh are my favorite appetizers here, so good! Chicken kabob with lemon rice (better than the potatoes IMO) and small Greek salad. They...", "I had not been in a awhile and was really looking forward to the return.\n\nI decided to go with the Camel Rider Sandwich (one of the 100 dishes to eat in..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["chicken"], ["sandwich"]]}
{"id": "HUWIFkhLU3EN3DDfSB-y2g", "text": ["Not a lot of businesses offer vegan options but this bakery did just that.  \nWe drove form Sylacauga to experience this is place. \nWe ordered 4 vegan...", "I love their cupcakes! Not much seating but is always clean and cheery inside. They often have seasonal specials. I had my wedding cake done by one of their...", "Nikese was having sugar fit and wanted cake immediately. We scooted over from BarTaco to Dreamcakes. We ordered an Over the Moon jumbo cupcake and a Lemon..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.4, 0.4], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["cake"], ["cake"]]}
{"id": "NQ_azSZ8kwlKx_7X9b9ptw", "text": ["I tried the strawberry cupcake\nAnd hubby had the red velvet \n(Omg) so moist and delicious  \nThis is by far hands down the best\nCake place I've had here \nI...", "Went to pick up a tasting box for wedding cake samples. While there also ended up purchasing banana puddling and a key lime mousse. The banana puddling was...", "Who doesn't like cake is a wonderful little bakery located in Chalkville, near Trussville. I have bought multiple cakes, cupcakes, and cookies from them..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.23], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["cake"], ["cake"]]}
{"id": "v806_XbqJwykv5cTU-X41g", "text": ["I love supporting black owned businesses so I've been meaning to try JaWanda's for a while and i am glad i went in today! I was greeted so warmly upon...", "There are no words. So delicious!! Husband got the sweet potato parfait (with whipped cream of course on top) and I got the S Prise (surprise) which is an...", "We stopped by after lunch on a Friday because we'd seen the signs but never been in. I wasn't wanting to buy an entire pie and was happy that they had mini..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "0C_NQhXmE_7ICd4avyH4YA", "text": ["This is one of the best cakes I have ever eaten. Please run to the nearest location and indulge in a Bundt Cake. I say run because you will not be able to...", "I was so very pleased with my (first, but definitely not last) order from Nothing Bundt Cakes!  I ordered the 10\" White Chocolate Raspberry for a birthday,...", "First time here but would certainly go back,people were very friendly and the cake I got was carrot it was delicious and so moist,can't wait to try..."], "rating": [5, 5, 5], "TBscore": [0.75, 0.23, 0.49], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "q3JeAJnrHVabwapiRheikw", "text": ["They did an amazing job on the cake that I ordered. It looked great and tasted even better. Would definitely us them for future orders.", "This Bakery is horrible. I tried on 2 different occasions to get 30 cookies done for a birthday and they can't even respond to your question. This place...", "I hate Louise's cakes and things and probably will never use them again I ordered a cake and they sent me the confirmation and I called them the day I was..."], "rating": [5, 1, 1], "TBscore": [0.38, 0.0, -0.8], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["cake"], [], ["cake"]]}
{"id": "71g7435RPw8hLwCTPvbCOg", "text": ["I didn't like the cake. I expected better.\nThe cake was dry textured. They soaked it in a syrup and called it \"moist\". The icing was whipped. The customer...", "What can I say? The cakes here seem like they're dropped from the heavens. They have a choice of Chocolate, Strawberry, and Vanilla with some variation of...", "Delicious cake, great customer service. I live in Texas but had to order a birthday cake for an event in Pelham, Alabama. I called and described what I..."], "rating": [3, 4, 5], "TBscore": [0.0, 0.0, 0.65], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "zLU4wB8tzdZ0AmvVfkbTCA", "text": ["I have been a fan of Edgar's from my first visit.  I would run to grab a cheese ball anytime I was hosting.  My last two visits have been disappointing and...", "We stopped here for lunch as soon as we arrived in Birmingham because RJ said he knew I would like it. RJ had the Marilyn Monroe with turkey, pepperoni, and...", "First off, this place is beautiful and there's so much to choose from that it was hard to decide. I chose 3 cupcakes and the ladies were kind enough to tell..."], "rating": [2, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 1.0], "keywords": [[], ["turkey", "lunch"], []]}
{"id": "QVxuka3S9-XxB6KnOfGKNg", "text": ["Let's talk about the fact that Alabama is the anchor for real southern cuisine! When I moved to Atlanta I thought there were gonna be these superb southern...", "just left Ashley Mac's after repeatly greeted at 7.30 with \"we close at 8\" if they are timely with their preparations i can finish my my meal in 30 minutes....", "This place is awesome! Ask them about the Gluten Free items. My fiancé and I will return soon."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.7], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["gluten"]]}
{"id": "H9wRgYy149WMz8ZiiWt-vQ", "text": ["The cake was delicious and they did exactly what I wanted decorated on it. The reason I did not give them more stars, I had to call at least 7 times before...", "This review is solely of their service, since the item I wanted was unavailable. I was wanting a slice of cookie cake... this IS a company for crying out...", "I would have given this more stars if the lady helping me had WORN GLOVES. It's a FOOD service! The people gave off very haggard attitudes as well. The..."], "rating": [3, 2, 3], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 0.2], "keywords": [["cake"], ["cake"], []]}
{"id": "51SIZSvGmDyTh65FKtoljA", "text": ["I've always had good experiences at this Starbucks location. On this visit, I tried the oatmeal because my sister-in-law, who's a dietitian, highly...", "Just had the best experience ever! Such helpful staff. I wasn't sure what to order but they were so helpful.  When she asked me how my day was going and I...", "When I need to meet a friend for a meeting, I immediately think \n\"Starbucks\".  The reason is that they are typically consistent, offer good service, and the..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "ptLBW4-qkITtsMh-6NCCsw", "text": ["280 store appears to be closed...anyone know why? stars only because you have to pick some to,post....answer please..hope closure is temporary.\nBest BBQ on 280", "Robert Horrible Manager. Rude curt and treated a customer like crap. \n\nWhen food is made wrong you dont punish the customer. I received old ribs old...", "I went there for lunch based on the recommendation of a friend. I ordered the brisket and baby back ribs which were recommended by one of employees. I don't..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], ["lunch"]]}
{"id": "VmAO1kcEq6seGD9J2YDOvQ", "text": ["I was down from Huntsville to do some shopping in Birmingham and after walking the once-magnificent Galleria Mall, I was searching for quality Birmingham...", "On our way thru town and found this to be a nice stop.  The wings were the best things I had and I'd like the recipe for the baked beans.  Service was quick...", "Maybe should have eaten elsewhere. Screaming kids running around, their Dad blowing nose at table, server only 1 for whole place so not eager in serving...."], "rating": [5, 4, 3], "TBscore": [0.0, 0.64, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["wings"], []]}
{"id": "c9jQoTHN2mRWHY4NsI2zBQ", "text": ["As with any Moe's location, you really can't go wrong. It's a Southern BBQ staple that any Alabaman will admit is tried and true to its quality and flavor....", "Had a great brisket special with augratin  potatoes last time. They post their daily specials on The Facebook.\n\nI've gotten the nachos and the sauces sound...", "They have the best smoked chicken wings that I don't make myself.  I honestly never had bad service here. Slow? Questionable. Bad? Never.  I normally go..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, -0.27], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], ["wings", "chicken"]]}
{"id": "VKeCpo7R4sxOXNky_2kPeA", "text": ["Gotta love those cheese biscuits. Those things are addictive. Don't get me wrong, I love their BBQ. But when you go to J&N, you crave those cheese biscuits....", "I love to eat here , most of the time a wait but that just means it's a great place to eat. We always ask for Libby to be our waitress , she always goes far...", "Oh my goodness... You talking about delicious. I had pulled pork sandwich, mac n cheese, 2 drumsticks, & baked beans during lunch (don't judge me)...."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 1.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], ["sandwich", "lunch"]]}
{"id": "A0CLB-Apdpr5EFirouaYSw", "text": ["I'm embarrassed to say this, but this is the first time I've been to Carlile's--why am I embarrassed??  My relatives own this place!!!!  I've had food...", "The smell here honestly is a little funky. It smells like the backside of a dumpster. Not appetizing at all. Coming in the restaurant and even sitting...", "The smell in the place is odd, a mixture of sour rags and onion.  Me and my wife had lunch here and we will not go back, too many other bbq places in town..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "2DZHPsfyIWsTlc08hQh65Q", "text": ["I live out of state now but I used to go to the Costa's in Centerpoint back in the day. I was pleasantly surprised to see this Costa's location and I had a...", "Everything was very good, beans, fries & bbq plate. The quality of meat was great!  No surprises !  I like a zestiest sauce but would go here again!", "Great food Great service I will come back often food was Hot & Fresh. Beef Brisket melts in your mouth"], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.43], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["beef"]]}
{"id": "h3NdHagMbecyoeLEDJ5tWw", "text": ["I came here for the white sauce, stayed for the rest of it!\n\nI got the 1/2 white chicken platter with collard greens, baked beans and a roll and I was NOT...", "If you want some mediocre BBQ this is the place to get it. Not bad, but not great either. The banana pudding is off the chain though. Its better than a fast...", "Came here on a bbq road trip from Atlanta to Dallas. We purposely picked this place because of the history and the happy people that spoke loudly about it...."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["chicken"], [], []]}
{"id": "SCpseeyv1yQczOhJpOdw4Q", "text": ["My friend and I took a road trip to Barber Motorsports Museum in Leeds, AL last week (an amazing museum and motorcycle heaven for enthusiasts) and I...", "I will be returning to Rusty's Bar-B-Q. On this day I only got 2 pound of their pulled pork to go. I did ask if this was available sliced and I got the...", "When I wrote that earlier review, I was thinking of going for lunch that day about nine months ago.  Can't remember if I did or not, but I'm very seriously..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, -0.22], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "WYtWP2w32nNbQYOqe2aI8A", "text": ["Went at about 11:30 this morning.  Typically pretty crowded at this time, however plenty of seats available today.  I ordered the pig on a salad with a few...", "This place is so great .\nWe come here a lot and there food is amazing.  \nI always get the love me chicken tenders grilled. So greasy and good. It you want...", "This used to be my favorite BBQ in town, but my last 3 visits have now taken them off my list. Full Moon at Patton Chapel in Hoover service has gone down..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["chicken"], []]}
{"id": "6yu4-xwE6Ob6d87NuQsc2A", "text": ["The place was hyped byMr. Barry for their cheese biscuits, pork pulled BBQ and their pies.  While I bypassed the 31 cheese biscuit challenge, I did very...", "I'm very picky when it comes to Southern cuisine and BBQ....but I must say this place blew my mind. The place had a very southern country kitchen feel. Very...", "I was in Birmingham for one day and had to choose one BBQ place to eat.  There were many options, but this is the one I selected.  I got there around 8 pm..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "yvNnzAD4WqQTpEUDcM9aOA", "text": ["I like the rib sandwich. And the cookies! Those cookies are so good they could be the only thing on the menu and I'd still keep coming back.", "I had Full Moon BBQ that was catered for a work lunch. As much as people said how good it was, I thought otherwise. Perhaps having it catered didn't do Full...", "Mmmmm mmmmm good. Hometown favorite for some good food!!!! We went during peak lunch time and got our food less than 10 minutes. The staff is was awesome..."], "rating": [4, 2, 5], "TBscore": [0.23, 0.4, 0.61], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [["sandwich"], ["lunch"], ["lunch"]]}
{"id": "Sr4w6EPm-KO5UcHl596UIQ", "text": ["I love the causal atmosphere of the Moe's restaurants, and I especially enjoy this location. It has such a comfortable local feel. The picnic tables both...", "We were heading to try one of my bookmarked establishments when my guest saw the sign for Moe's.  They recognized it from a previous lunch and exclaimed it...", "I've lived in the Birmingham area for a few years now and have been very impressed with the lake view and hoover locations, however this location has let me..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "fqkobLKwCtHEr_aGKtBsZw", "text": ["Yes, yes, yes, if you feel ahankerin' to chow down southern barbecue do stop in. What i liked (in no particular order): 2 corn muffins, butter beans and...", "Me and the family eat  here 3 times a month   good fresh ribs and catfish Food is always hot and  every one is super nice best bbq in town clean bathrooms....", "My family and I stopped here for dinner while heading back from Memphis. The people here at Deerman's Hickory Pit BBQ seemed to be quite friendly and the..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["corn"], [], ["dinner"]]}
{"id": "7SODcy7Mf7chkstEwoLByw", "text": ["This is one of the best kept secrets in Birmingham. We have been at this location for 28 going on 29 years cafeteria line barbecue pork,ribs,chicken,&...", "Friendly family southern soul food place. Was that enough adjectives?\n\nTuesday Fried Chicken 5 stars \nWednesday Country Fried Steak \n\nThe staff is excited...", "Staff was ridiculously kind and helpful. Only ping I'd give is the location could use some scrubbing. Lots of sticky surfaces. Other than that good food,..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["chicken", "steak"], []]}
{"id": "YpYU7YIoY1P-sOYv6laq0Q", "text": ["We love Kens breakfast!  Biscuits are first rate and the service is amazing!!!  They are fast and efficient.", "This place has great food, no doubt about that. And their breakfasts are great also. The only downfalls for me was that it seemed more like I was there to...", "I've been going to Ken's for an occasional breakfast since childhood. I've never been a huge fan of their barbecue, but their breakfast is a great..."], "rating": [5, 4, 5], "TBscore": [0.52, 0.0, 0.4], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["breakfast"], [], ["breakfast"]]}
{"id": "803dy2aKXfIdS0jfc1k4JQ", "text": ["Truly one of the ones at the top of my list! This place is absolutely some of the best food available in Birmingham, AL // ESPECIALLY FOR VEGANS !!!!! //...", "Ordered a vegetable plate + lamb plate which ended up costing ~$25 for 2 people. Portions were a good size and there was plenty of options.\n\nWe had lamb...", "Hubs and I were tickled to find this place just a short way from the train station after a weekend getaway and it was a Great little find.   \n\nWe enjoy love..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "SE_XcXDUDr88YyGvi3yUPA", "text": ["Love this place great food every time. The breakfast is the best part of the day. Try the iced vanilla coffee", "We had a breakfast at work and a group of us decided to go in on a large tray of chicken minis. I placed my order online and was given a time frame to edit...", "The difference between the outstanding customer service at the 280 location and this disappointing 5 Points location is pretty remarkable. \n\nHere again..."], "rating": [5, 3, 2], "TBscore": [0.77, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["breakfast"], ["breakfast", "chicken"], []]}
{"id": "EOrml39M2sb9G2SbieWnVg", "text": ["Chick fil has the best food! Wait time isn't long on good days, and its always a pleasure to see a smiling face.", "Chick-fil-A is my favorite fast food chain, and usually my go to place for quick food in the Brookwood Village food court. I really like how they renovated...", "This is a four star review because my cookie I ordered was hard and old. This location is in the Brookwood mall. Sometimes it is a bit crowded and the lines..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "ECSZix28HGB8hChR8kCjnQ", "text": ["This location is a place I have eaten before. You could say its in the hood. This is the first time I've visited here after about 8 yrs and they are still...", "First of all, be careful backing your car to avoid getting hit by incoming cars since there parking area as well as the building isn't wide spread. First...", "So I read some of the review on here and decided to give his place a try today. \n\nI called in my order (20 Wing Combo, half mild, half honey barbecue).\n\nI..."], "rating": [3, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [[], [], ["wings"]]}
{"id": "AlmU6qB8slBx4kxmw6oBwQ", "text": ["Having lived in Highland Park for a couple of years, this McDonald's was the most convenient to my condo. I frequented this location for their $1 drinks,...", "Taking advantage of their $1 any sized drink deal, we stopped by to get some caffeine on our way out for weekend adventures. It took a long time to get our...", "I'm generously giving 2 stars here. We arrived to a new menu and placed our order. Apparantly there have been a rash of robberies here and so they wanted us..."], "rating": [2, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "ra0gRR-C1bksydSRw-fkYg", "text": ["I never get a bad meal from here.  The staff may change from time to time but it's always consistent service.\n\nThe food is closer to street Greek than...", "I've passed this place a couple of times and read the reviews on Yelp, but this place is awesome! I came here on a Saturday afternoon and the place wasn't...", "Good food. Service was only OK. Babaganoush was very good."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "rM5RyQuJZXxm9nfkQ0HKfQ", "text": ["By far my favourite Chickfila. The staff is amazing. They are always hosting special events for the kids that really make this location special! Kudos to a...", "Terrible customer service. Rude and non-\n helpful for no reason. I will NEVER go to this Chick fil a again!", "What can you say, it's Chick-fil-A and it's a fast food. \nStill, the food has never really disappointed me. \nThey have gotten my order wrong a couple of..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "f_GYYYqjhbGF29OnH_63DQ", "text": ["The service was horrible. Supposed to be fast food but it takes 15 minutes for our food to come out and part of that 15 minutes was an older woman standing...", "This has to be the worst drive thru I've ever been in. Sat in the line for 20 minutes before ordering and another 30 just to get food. Ridiculous... I've...", "Staff was friendly and food was good.  Not in a good area.  Not much else to say about a chain chicken store.  We only stopped because we where starving.  I..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], ["chicken"]]}
{"id": "qbs6vWXobXBAhI8FUQJHwQ", "text": ["Not normally out this way for breakfast but had to do a few job's early this morning!  Chick Fil A was calling my name.... This morning I opt for the egg...", "The food was good but the service was not good the cash register had a nasty attitude @Destiny I will be calling and making a complaint to the manger about...", "I don't think I've written a review of this particular CFA, but now it is my favorite. It's just a few minutes from my house, which is great... but they..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["breakfast", "egg"], [], []]}
{"id": "3vLHQQ0cR8_yA2t2QGGxVA", "text": ["Stopped here for dinner before a flight. The reviews almost scared me off, but I didn't have many other options. This location has a more limited menu, but...", "Small airport location that us one of the few food options available at the Birmingham airport. Keep in mind this isn't like the other store front...", "I just got the worst chicken sandwich I have ever received. It must have been sitting for hrs.  The bread was hard and the chicken was cold.\nVery disappointed"], "rating": [3, 3, 1], "TBscore": [0.0, 0.0, -0.68], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [["dinner"], [], ["sandwich", "chicken"]]}
{"id": "q_Kr7WMYQte25PijgHkqOg", "text": ["This is my second favorite Chick Fil A. The best one is the one in the Grove in Hoover near Target.\n\nThe service here is good like all other Chick Fil As...", "Chick fil A is pretty awesome but just be forewarned that this is probably the worst location. They consistently have longer than usual waits in the drive...", "Chick-fil-a is by far one of my favorite fast food chains. This location has always been really nice and chill. Never too crowded like some others. My..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "JCgg-t2keRGqEy7oz0d-Eg", "text": ["What can I say about Chick-fil-a? I am a restaurant manager and I need to know what boot camp they send their employees to. 99% of the time all of the...", "I can count on one hand how many times I've had to complain about Chic Fil A. I will always be a lifelong fan/supporter and will continue to eat at any of...", "Love to eat at chick-fil-A but this time not so much. The food was just ok and to pay 30$ for 4 and one was a kids meal and a coupon for a free fry it..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "50EbUNEdKTNZCtDfwutDMA", "text": ["Asked for takeout to fill a chicken and waffles craving and it was great! Still crunchy after I got it home.\n\nI don't usually eat waffles out since I make...", "Love the food, and staff is great. Eat lunch here a few times a week and they knock it out of the park with their daily specials. Philly is full of flavor...", "First time here. First thing we noticed was the Peaceful atmosphere and Christian music playing. Things like that stick out and make an impression..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["waffle", "chicken"], ["lunch"], []]}
{"id": "_RjWAfCCNckrEyZy1R6t9w", "text": ["My daughter, grandson and I went here for dinner. We had visited the restaurant a week prior to this and the food was very good and this was our reason for...", "Golden Corral is a chain and I have gone to my fair share of them all over. This has to be the priciest weigh your own meal I have seen. Typically it is...", "Making plans for Christmas,  I called on Friday to verify their schedule. Closed on Christmas day. Asked about the Christmas eve, they told me that they..."], "rating": [3, 2, 1], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["dinner"], [], []]}
{"id": "Jhgk1NaqjmaABiROfTBdBg", "text": ["So it feels funny giving 5 stars to a chain, but I rate on expectations.\n\nI have been going to Outback for quite sometime because they genuinely have some...", "I came here with my friend Kimia M., a new Yelp Elite, for lunch. The place wasn't too busy, and had a good steakhouse vibe. Our waitress was super sweet,...", "This place was nice. I was The staff was excellent. The host was very nice and they sat us down. the waitress was very sweet and clear about everything...."], "rating": [5, 4, 3], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "5q0NWptLl1HcfaM2ax27IQ", "text": ["This is a nationwide chain that thrives on the idea that it is an Aussie restaurant which it is not. I have eaten at several units and have never really...", "Well , big fan of Out Back ..before they moved from down the street to the Galleria Mall location.  Service is slow, kitchen is even SLOWER. Food was warm...", "This is the first time that we visited the Riverchase Galleria Outback location. In fact it has been years since we visited Outback at all. Read below to..."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "iYrXgX08DcHIDKudGvjkoA", "text": ["Strawberry pecan salad. Make sure they include your oranges and extra dressing.\n\nAlso ask what lettuce is used. It should be romaine but I have had other...", "I've been here on several occasions and the service and food is usually a hit or miss and never consistent. My daughter and I decided to stop in today for...", "Logan's Roadhouse\nwell they they got my boyfriend's drinks but they had to be told to get mine 6 time no joke 6 freaking times and after all that my food..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "CX10_f9pMF3NsYm5e5TMQA", "text": ["Went in on a Friday night around 5:45 and it was packed. We only waited 5 minutes for our table. \n\nMy husband opted to choose his steak from the cooler...", "LOVE ME SOME TxsRdhs!!!!  \nAnytime we want to go out for steak, this is where we come, even though it's a 20 minute drive. The staff is so friendly and the...", "Dinner was good...service was great!\nAs we walked in, the host was welcoming. The host that walked us to our table kept asking questions which we couldn't..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.69, 1.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["steak"], ["steak"], ["dinner"]]}
{"id": "GhoJQorjKNpyk_dEO-bvxQ", "text": ["The cook is great...\nThat is the only positive thing I can really say. This is a regular chain restaurant so there should be no high expectations, however...", "Came in with a group of 5 at 9:20pm The 3 servers literally argued about who was going to serve us. They made us stand around while arguing about who was...", "My experience is much of an improvement than my previous visit here. Even though they were occupied as we walked in, each employees acknowledge our presence..."], "rating": [2, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "GLYhbrlWf_l8QMCvSiHttQ", "text": ["I love going here with my heather the last couple of times we been heather has been our server my husband is a very picky eater and she remember us for last...", "This is the third Long Horn in three weeks. The first two were five stars. The quantity was issue hear. I ordered T bone and it was great. My asparagus was...", "Service was so slow it almost became comical. Our waitress probably had too many tables but there's a way to handle the situation. Acting annoyed every time..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "z8y1Eqf_qoay9YKpwCtioQ", "text": ["I stopped in hear cause it was near my motel. Typical hole in wall Buffet, nothing great nothing terrible. Until I cut into the salmon. I was first to cut...", "As soon as we walked in we were served and they had our drinks out quickly. The food was good temperature but the rice we got was hard. The sushi was pretty...", "I tried this place when I had a particularly strong craving for ethnic food and my experience overall was just meh. I ordered the lunch buffet, which was..."], "rating": [3, 4, 2], "TBscore": [0.0, 0.25, 0.22], "normalisedRating": [0.2, 0.6, -0.2], "keywords": [[], ["sushi"], ["lunch"]]}
