{"id": "yqxX51sgliikqJ8qkcFjzA", "text": ["I am very impressed with Jimmy John's. They were fast, I wasn't expecting my order til 1:45ish and was a little over 6 minutes early. Sandwich was also...", "So disappointed! We called for delivery today, Saturday afternoon only to be told they were out of all cheeses! What kind of a restaurant is this who runs...", "I ordered the #10 with a pickle and had it delivered.  It was awesome!"], "rating": [5, 1, 4], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["sandwich"], [], []]}
{"id": "vBt3iQgBA-mLluc1wmge4w", "text": ["Bingo, black jack, darts etc...  It's been 20 years since I've been here. That said, the Hall of Foam is no longer applicable and has been discontinued.  As...", "Cheap drinks and close to the highway. Friendly staff and they had free sloppy joes on Sunday for the Vikings game. They have a lot of tvs for watching...", "Great bar, nice peeps, clean bathrooms and most importantly Fargo brew.  Nathan poured an excellent pint!  Pride of North Dakota hospitality ."], "rating": [3, 5, 4], "TBscore": [0.0, 0.0, 0.61], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "QmiecAsR-Xc3AmzGGGpn8g", "text": ["The food is great here. Best knoephla soup in ND. Prices are very reasonable. Everything I've ordered from the burgers to the salads are great!", "My friends and i went there for a lunch.  The atmosphere is awesome 50 theme (hense the name of the restraunt).  I  had the burger lunch special and my...", "This place has the worst service, food and prices for said terrible food of anywhere I've ever been. My daughter had the free meal for kids. She had the..."], "rating": [5, 3, 1], "TBscore": [0.77, 0.68, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["burger"], ["burger", "lunch"], []]}
{"id": "L_UkbAedo6-JUdZrTrkLDg", "text": ["I have been to this location twice in the last month. The first time I ordered my meal & looked for a clean place to sit. There weren't any! The beverage...", "This place sucks donkey butt. There's never any clean tables, one time some guy was pooping all over one table in the back. Every time I order a beef and...", "I dont go to this arbys often and everytime I do I am reminded why I dont. The last two times I have gone through the drive thru the person taking my order..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [[], ["beef"], []]}
{"id": "6ZnQlLhVn44GeYuaf8gZcg", "text": ["Nice store it was late when I got into town and I was able to get some decent sushi from their sushi bar and get a drink.  looks like a newer store nice and...", "Samantha the cashier is great. She is kind loud sometimes but she is also very helpful with the avocados.  Thank you samantha for your help!!!", "Nice store and a good alternative to walmart . They were a little high on some stuff but like I said it wasn't wall mart . The employees were helpful and..."], "rating": [4, 4, 3], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["sushi", "bar"], [], []]}
{"id": "Oz1ARfCo_5L4RsSGV0JOIA", "text": ["I've gone here on lunch breaks. Sandwiches are fine, but the staff here always makes it feel like it's some huge chore to make my sandwich. Like I'm a huge...", "Ordered catering services a day ahead. Went to pick up and the order was not ready for an hour after requested. Took the order home and realized only half...", "No complaints about this location. They're a typical Subway. They do always manage to get my order together quickly at this location which is nice since I..."], "rating": [1, 1, 3], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [["lunch", "sandwich"], [], []]}
{"id": "tsEJBAIP03W1axJe8IT2xA", "text": ["It's foyo, so it's hard to mess up. Customer service was totally lacking and the workers seemed to hate their jobs. Way to bring down the joy of a fun...", "Service here was quick and friendly. My husband and I got the psychedelic sorbet which is raspberry, lemon, & orange. VERY YUMMY!!! We're from Texas and...", "Frozen yogurt! Need I say more? TCBY does it right"], "rating": [2, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "V63c3WNLiyb0InD4YpTT-A", "text": ["super fab, wow !\nthe kuchen was light, delicate, lucious\ncheese buttons!\nplachinta!", "We were on our family road trip in July 2017 exploring the Dakotas driving north from Pierre when we learned the state dessert of SD was Kuchen....", "The best bakery around. Homemade German Kuchen!! Fresh made doughnuts. Excellent selection of breads, buns, and pastries."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.57], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["donut"]]}
{"id": "JNLsSUe9ttzBUWImBt_ivA", "text": ["I have never had a worse experience at a hotel.\n\nStayed there along with many other friends over the weekend for a friend's wedding in town.\n\nCheck-in was...", "There's nothing necessarily wrong with Seven Seas, but it's not my favorite hotel in the city. We went there for a wedding recently and the hall actually...", "One of the worst hotels I've ever been too!! Way overpriced, dirty,  and a bed that is harder then a rock. Came here for a wedding and what they served for..."], "rating": [1, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "ehjfnvL1jDrBk3X_yws4zw", "text": ["Had a great time recently at StoneHome here in Bismarck.  The atmosphere is very hip and upscale with modern high end finishes.  The staff was friendly and...", "This the newest hottest gig in Bismarck/Mandan!  The pizza and beer were excellent! Service was excellent!", "Four of us stopped for a beer and appetizers and a first look at the new building.  The building is great, but their microbrews not so much.  They just..."], "rating": [4, 5, 2], "TBscore": [0.0, 1.0, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [[], ["pizza"], []]}
{"id": "hxpD4_Hv0Gy8UOFAVlVPyw", "text": ["Came by again on our way out of town for another Maple Latte. Still delicious  We also had black coffee and s'mores and yes still great. Owners are very...", "Been there many times, primarily because I care about good, freshly roasted coffee! Bitty Bean cares about good coffee, from high-quality ingredients (monin...", "Great coffee and great service. I appreciate good coffee with homemade flavors and this place delivers. If you like the coffee at Fireflour and Terra Nomad..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "W1CKrYQ5ArYbH-w0DDiiMw", "text": ["I recently moved to Bismarck and was so glad to hear that there is a place I can go to buy loose leaf tea in town. I purchased a can of the Earl Grey...", "I was pleased to see a tea shop open in Bismarck, especially one that serves bubble tea. They don't have true tapioca balls, only popping bobas. To add...", "I found this hidden Bismarck gem by accident while traveling for business. Immediately upon entering I was greeted by the owner, Jerry,  and his wife, who..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "p7UGJEij4QGEuLGubDHLTw", "text": ["We are visiting from NC, me and my husband found and married each other in this beautiful town, and always feel nostalgia when we come back to visit. Rockin...", "Worst bacon cheeseburger I ever had! One bite and I just about got sick.\n\nThe soup that came with it sucked as well. \n\nThe best parts were the music and...", "Waitress/hostess is very friendly. The place is very nice decorated. Rock'n 50's, not so rock'n with the food though...could be a lot better!! This is a..."], "rating": [5, 1, 2], "TBscore": [0.0, -0.24, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], ["burger"], []]}
{"id": "XhW-zxa4Svi021EMcefOsw", "text": ["Came by here to grab a drink during our night in Bismarck and was greeted by the beautiful space. The bar area is gorgeous and overlooks the city. Really...", "Very cool area. Just off main street, you take the stairs or elevator to the roof. Granted, downtown Bismarck doesn't have a great rooftop view as the city...", "You have to go here if you're visiting Bismarck! We went later to closing time and it was kind of busy, but we got a small table. It is beautiful inside and..."], "rating": [4, 4, 5], "TBscore": [0.58, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["bar"], [], []]}
{"id": "mrnBgAbGVR7j0EXDqhuoQg", "text": ["Back in the day (circa 1991-94), this was THE place to be!  It's was Army's back then and spent most of my paycheck here.  They still have the boxing ring,...", "Just like any other sports bar. Fully stocked bar, blackjack & pull tabs.\n\nThey have a 'boxing ring' in the middle with tables, a full bar & quite a few...", "This was one of the bars that we had gone to for a bachelorette party.  Now, I am not a huge bar star.  I had my fair share of bad-life choices at Michigan..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], ["bar"], ["bar"]]}
{"id": "8fsZcLADFrPTbGrFqMACpg", "text": ["Having recently moved here and had a friend visiting, we came to this establishment.  Never again!  Drinks literally ripped out of our hands at closing from...", "I used to really like this place, but the service is horrible!  We were there last night with a large group because they had a band we wanted to listen to,...", "Good drinks, awesome patio area in the summer, and decent live music some nights of the week. Service can be hit or miss."], "rating": [1, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "nydz7aLVOQqbRPxKbeyTaw", "text": ["Five stars may give some the impression I am a homer or a friend of the owner; rest assured neither is the case. As I understand it, this is a pretty new...", "So a new hipster type cocktail bar.  Very nice place, Michael the owner is very friendly and is pretty skilled at making craft cocktails. The charcuterie...", "One bartender, waited nearly 30 minutes for a drink. Gentleman that served us had no clue what he was doing...probably had no business being in a bar. If i..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "mrbD3FLhbl5xG-Sl7uRw6w", "text": ["Unfortunately this is not a save dive bar to go to.  Look at other reviews.  Police were here.  Too bad. Could be nice.", "If getting in the middle of a gang turf war is your idea of fun then this is the best place in town. Nothing beats the excitement and gets the adrenaline...", "Honestly, I have given this place a few chances but It's just not worth it. Subpar service in a dirty bar.... No thanks. If I'm going to go to a dive bar I..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "iW0pSGd5sRsh36vnBeNvZg", "text": ["Cool niche shop, nice staff, has live music events.  Cafe with records in it?  Can't beat that.\nSelection isn't large if you are used to going to standalone...", "Rhythm Records is a great place to hang out, listen to and browse through a pretty rad and diverse music collection.", "If you don't count all of the countless rummage sales where you can find every polka album ever released, there are two record stores in Bismarck right now...."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "2gHzomllAqN-c43V4qfRZQ", "text": ["Okay. Nothing too fancy to write here. This pancheros hits all the marks for an average dinning experience. Nothing too crazy. When I say average, I mean,...", "Being from out of town, I'm always interested in trying new and different places. I was told Pancheros is like Chipotle...but imagine Chipotle being the...", "Employees were extremely unprofessional. The managing employee was rude and disparaging. Online order was somehow \"lost\" and was not ready. In addition, one..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "UO-4X0HjR3otZBtN_C9NkQ", "text": ["Dairy Queen is one of those places that no matter where you are across the country, it still tastes amazing and brings back childhood memories. \n\nWe went to...", "Usually I only Yelp places \"off the beaten path\" or that are non-chains but I thought this Dairy Queen needed a review due to a certain quirk...\n\nThis...", "I love yogurts and ice creams. And Dairy Queen made me love it more! Wherever i go, Dairy Queen always made my day. It stops my cravings for..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "Tqd_FgI5iCDv2yfV0LR0fw", "text": ["Had an awesome time at the Pinch and Pour! Balsamic cocktails and tasty oils to brighten up any moment!  Cheese selections for every palate from hot to...", "As you enter, you'll immediately notice how expansive and inviting the space is.  The owner was there the day I visited, and you could tell how excited he...", "You have heard of bankers hours? Well this place combines barber days with the stereotypical Greek/Italian work ethic (and way worse than bankers hours) as..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "j8z1iC4q8wamR24lPCJ6ng", "text": ["This is my favorite place to get cake supplies!! Stella is very nice! She always gives me pointers on how to do whatever cake I am making!!!", "This review is for a custom birthday cake.\n\nThe birthday cake I ordered looked beautiful. The frosting job was perfect, the prairie roses were a lovely...", "I ordered two cakes for my daughter's Medical School graduation parties.  We requested a chocolate marble with raspberry and lemon filling.  They were..."], "rating": [5, 3, 5], "TBscore": [0.89, 0.78, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "7KC1tMDoG7PSr-kDlNNooQ", "text": ["Stopped in on a busy Saturday in May to make sure I had a birthday (cup)cake for the next day. \n\nWe purchased three cupcakes, along with two bars/brownies....", "Annie's cheesecake is to die for! Beautiful presentation and sooo flavorful. Order her cheesecake for a special occasion, and you'll have a standout dessert...", "This is a very nicely done bakery. I ordered some Crimson velvet cupcakes today with cream cheese frosting and they were made fresh. They were so good I..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "AXrLxC7KkxNY9ARlpFyTdw", "text": ["If you are at Gateway Mall, you are probably a \"mall walker\" trying to get some exercise in while it's literally freezing outside. Or maybe you are going to...", "Some of the best coffee I have ever had! Very impressed at selection of fun flavors. I tried Reese's  peanut butter cup and it was delicious!", "This is probably one of the best locally owned coffee places in Bismarck if not the best! Back in the very early 2000s my mom used to take my brother and I..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
