{"id": "jPqftT6V8XZ3zBSXGlhgqg", "text": ["\"A man's social rank is determined by the amount of bread he eats in a sandwich.\"  ― F. Scott Fitzgerald\n\nIf the quote above were true, I'd be a poor...", "I was invited to join some of the gang at Cobby's for lunch. Having learned that they make their own meatballs and dress up a marinara, I went with a small...", "I've been to Cobby's on a few occasions now. Most recently, we stopped by Cobby's for a celebratory lunch. The shop is set up so that you order at the..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["sandwich"], ["lunch"], ["lunch"]]}
{"id": "7mpYEpANF7Yw5lBdqiz9hQ", "text": ["This place is like no other sandwich shop. In fact it's a place that makes you feel like the series (cheers).\nThey know you when you are a return customer,...", "I was looking for a deli to replace the one I left behind when I moved back home and WOW did Fat Guy's deliver! I got a ham and cheese on sourdough with...", "Fat Guy's Fresh Deli has become a weekly staple for lunch in our office.  We order at least once a week and they are our favorite deli in the valley.  Our..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sandwich"], ["deli"], ["lunch", "deli"]]}
{"id": "Qm5pxXQYR4f3PkjTkANNBg", "text": ["This place is awesome. Nothing fancy for decor but who cares when the staff is super friendly and the quality of the food is second to none. The bread is...", "Possibly the best sandwich I've had in the valley! #6 combo). I ordered the whole and was almost in over my head. Delicious! The bread was homemade. I'm...", "I finally was in the area decided to grab a grinder on the way home. The guy at the counter was very nice and friendly. They offer a wide selection of beer..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.55, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["sandwich"], []]}
{"id": "ciLlt0ZLSN1fNqwB5NjUmA", "text": ["I am from Georgia and I used to go to J.Mike's regularly. I was so happy when they started building one so close to where I live. I ordered subs there...", "I would have given this place three stars, but when I ran my card to pay, the \"DO YOU WANT TO TIP\" question really irritated me. The employee actually said,...", "Wow!  Stop in for a Chipotle Steak Sub....and was told that they were out of steak. \n\n\"Would like you chicken?\"\n\n\"Ummmm, no, no I would not. I thought this..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, -0.24], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], ["steak"]]}
{"id": "YrYAi_9T7Uqx1JyB49rFDA", "text": ["This is hands down my favorite sandwich shop! I ordered the French Dip and my Husband ordered the turkey avocado. Great food and staff was friendly. High...", "I cannot give Cobby's more than 3 stars here. \n\nThey remain in the top 2 local sandwich shops in my opinion. However, I have had one-too-many experiences...", "Boise institution. Great sandwiches, back in time atmosphere, and don't forget to grab your free chips out of the wall bin !!\nYeah, you are going to pay a..."], "rating": [5, 3, 5], "TBscore": [0.3, 0.33, 0.48], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["turkey", "sandwich"], ["sandwich"], ["sandwich"]]}
{"id": "u6Hc587ybh4bE8j0hUlYJQ", "text": ["Good sandwiches at a reasonable price, and prepared post haste.  The service was friendly and competent.  The direct competition needs to take a page out...", "This location is a joke. My boyfriend tried to order a normal sandwich and add other things on and they told him that that's not the way the sandwich comes...", "Since my first review, 5/11/2015, not much has changed, other than to say, \"Yes,\" this place continues to be just great. After that amount of time had..."], "rating": [4, 1, 5], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["sandwich"], ["sandwich"], []]}
{"id": "xuNYICZzaITewSf-b1zN8w", "text": ["* Agave Vanilla Cream Soda at the fountain. Well I'm not a \"Stubborn\" man, but I could get used to this. They also offer bottled drinks in a cooler and...", "My husband wanted to compare their sandwiches to Jimmy John's. \n\nHe ordered the big kahuna hot steak, onion and jalapeno pepper sandwich--it was okay, not...", "Good subs, but it takes 20 minutes to get your order with 4 employees working and barely any customers"], "rating": [3, 4, 3], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [[], ["sandwich", "steak"], []]}
{"id": "34sfjPk297c7RVM67pU4tg", "text": ["Their food is usually prepared well. The restaurant is usually clean. But too often i come in and they are out of stuff. I like to use the kiosk when I come...", "I guess I don't really get it. The food is fine, but it's basic sandwiches, salads, and soups. I ordered the pick 2 combo and a drink, and it was $15 before...", "I called the Myrtle location and tried ordering lunch today for pickup  around 11am and I was told I couldn't order through he phone from noon until 2..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], ["sandwich"], ["lunch"]]}
{"id": "iHR7QZrDFqsSYfajA2r_7g", "text": ["What makes this BK so special?  It is apparently the only place open for dinner after 10pm in Boise!  During my epic cross country trip,...", "This place messes up your order and does not take responsibility. I called back and asked if I could get a refund for the stuff that was missing. He tried...", "The chicken sandwich I had was terrible. There was too much mayonnaise and the chicken strip was burnt. My fries had way too much salt on them, and there is..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, -0.36], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["dinner"], [], ["sandwich", "chicken"]]}
{"id": "BE3ZBTVTvM0-Y12i-pk2WA", "text": ["I'm surprised this place has such low ratings. I've had only 5 star experiences here. The employees are kind and friendly and work hard to provide a good...", "I don't know how you can mess up a slushie but they did, I received a watered down and melted slushie. Bad service overall. Will not be coming here again.", "It was clear that whoever was taking orders at 7am on 1/24, did not want to be there or take our order. Every time I ordered something, I was cut off with..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "nptxS2jTf6nOQCEcXNL_HA", "text": ["I was just at your Ustick and five mile location and when I stopped by to get my large recess milkshake I was charged full price after 8 pm, I waited a few...", "Y'all got some good food, but dumb people working at the store like they don't understand English or something, I'll order a god damn cheese burger and get...", "We asked 3 times for no cheese. Asked again at the window to double check.  Checked the receipt.  Thought about opening up the burger at the window, because..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [["milk shake"], ["burger"], ["burger"]]}
{"id": "FUxK5FA8EzFfwj9_bbrBGg", "text": ["Not sure what people expect.. it's a BK there always some what fast and friendly and food is always about what I expect from a fast food place and the fact...", "I am from California, and I was here training for a new job and stumbled across the best Burger King in America! (At least the best so far) I wouldn't write...", "Hands down the greatest fast food experience I've had. Rolled through town on my way back from Portland to Denver. I usually stop at the Pendleton outlet at..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.39, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["burger"], []]}
{"id": "3USrcUnm0xoFQuW7LPAIeg", "text": ["Great for late night cravings in Boise. Ordered the buttermilk pancakes combo with crispy bacon and eggs over medium, and that's what I was served. Tbh...", "I have never been a huge fan because literally the I receive the same service at any Ihop I've ever been to. Small portions of over cooked food. Took 40...", "Well after 30 minutes - they finally checked on our order.  The kitchen lost the order.  \n\nThey need process improvements.  Not sure if they use their..."], "rating": [3, 2, 1], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["egg"], [], []]}
{"id": "3X7zlEM1clH_PLuqZaGm5g", "text": ["LOST MY ORDER BUT COMPED MY MEAL AFTER I ASKED DUE TO CONSIDERATION OF THE LENGTHY DELAY. \n\nI arrived at 635 pm. I was the second person in line and was...", "It gets two stars because Smashburger has decent food.   But service?   Not this one.  I walked in because I have gift cards to use.   The long hallway...", "* This whole business complex sprang up rather suddenly to capitalize on the new residents of a new major apartment complex. There are presently 5..."], "rating": [3, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "PIky5ets4Icr48U0Ba-rOw", "text": ["Girl working took my order efficiently, she asked if I wanted ketchup or fry sauce which I then stated fry sauce over the speaker. When I pulled up to the...", "As my wife and were driving away from Sonic, we both simultaneously said, \"What were we thinking?\".  It was late, we were tired, we hadn't had dinner yet,...", "This has to be the worst Sonic in Boise Idaho. Great at taking your order but terrible at filling it. Drinks are always wrong, no sauce with cheese sticks,..."], "rating": [2, 1, 1], "TBscore": [0.0, -0.35, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], ["dinner"], []]}
{"id": "O4ADuFI2PX73HUZWvcapdg", "text": ["Great brewery that has partnered with a skilled food truck. I really enjoyed the Citra Pale and the Irish Stout. The truck had an amazing burger, poutine,...", "The bartender was great and the space is large and really comfortable. The beers were solid, but not outstanding. \n\nAmber Ale (very good)\nBlackberry Sour...", "What a great place for a bite, a drink and get recommendations to the cities hot spots! We loved the atmosphere and how comfortable they made us feel...."], "rating": [5, 4, 5], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["burger"], [], []]}
{"id": "53VbEK23N-l-gEW7hKsH-Q", "text": ["This place is the best the food is amazing and the service is very good. The staff are very friendly and the food is a good price. The finger steaks are...", "* I see a spacious parking lot with most spots taken. Maybe there's something worth eating here tonight? Inside, most of the dining room tables are empty,...", "Not much good to say other than our waiter was ok. Out of wings on a football Sunday??? French fries that were almost inedible. Dry bland sandwiches, thin..."], "rating": [5, 3, 1], "TBscore": [0.74, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["steak"], [], ["wings", "sandwich"]]}
{"id": "-kIJmSUZiBygYu6KYWHGQg", "text": ["Scotty's dogs are absolutely the greatest.  I will drive from Caldwell just to get one.", "It has alot of flavor,service is good,and the homemade sauce is the best sauce ever. -kyler", "Today for lunch I'm enjoying a delicious Scotty's Dog with all the fixings (except onions).  This is the 2nd time I've tried them and the first time I did..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.44], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "nqjBWVNPcGObHyVeY7hzmg", "text": ["Another after golf lunch! For some reason was desirous of a hot dog and remembered seeing a sign at the corner of Meridian and Fairview - one of these strip...", "A real Chicago dog! The hotdog itself was great and the toppings were spot on. I used to serve these and loved them. I have to go back for the beef sandwich...", "Steve Dimaria runs Taste of Chicago and is a US Veteran.  He's also a veteran of great Chicago Dog craftsmanship.  Please go check out the place!  The food..."], "rating": [5, 5, 5], "TBscore": [0.25, 0.44, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], ["sandwich", "beef", "hotdog"], []]}
{"id": "XbtpZj429gvoyYKexUej5Q", "text": ["Unlike the drive thru where you're often handed a sticky mess of a dessert, inside the restaurant is a quality experience. It's fast food burgers, but the...", "The only thing I really hate about this particular Freddy's is the parking lot or getting to the parking lot. It's right next to an Arby's and car wash so...", "First time there. Just ordered the Chicago Dog. Best hot dog I've ever had! Quality thru out. Bun nicely toasted, quality meat and all condiments fresh...."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["burger"], [], []]}
{"id": "8vZNr9K5tD4x2URAsZLuoA", "text": ["I was worried after reading some of the reviews but it actually was a great experience. We met a friend for lunch. My husband and our friend had beers. The...", "Every person I have spoken to who has been here has nothing but good things to say about this place. So my wife and I were in the area so we finally decided...", "My wife and I decided to eat at this establishment and were not too impressed.  We shared a small pizza and some chicken tacos.  The pizza was not as good..."], "rating": [4, 2, 3], "TBscore": [0.4, 0.0, 0.21], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["lunch"], [], ["pizza", "tacos", "chicken"]]}
{"id": "9p2FDdVHRscS9HrK_qRatw", "text": ["Don't underestimate this place. It's out of the way but the food is incredible here. It's always packed and the seating  options are nice. You won't have to...", "Pretty bland food. The servers are very welcoming and friendly. Dont really think the buffet was worth the $15 spent.", "No daily military discount but Veteran day they give free meals to past and present military. \n\nDrinks were always full. Food wasn't too bad considering it..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "RBE3AHyrCi9qi4Z2cBr4iw", "text": ["Nice place to find higher end used furniture. They didn't have what I was looking for (dining chairs), but they have a nice selection and it is well set up....", "GONE! Cannot contact this Company- they've vanished. With all our high end furniture !! \nPlease if you've consigned with them FILE COMPLAINTS - the more the...", "I, along with many others, have lost furniture and/or money with Renaissance Consignment. It appears Dale Corson has closed up shop and is not answering..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "Tojvtx2B5aSTnWcMdXQ7rw", "text": ["I am upset with the TV selections and lack of flexibility (NFL) but 5 stars.  Great food, better service.  The knock it out of the park all the time....", "Reviewer No. 57\n\n\"The adult Chuck-E-Cheese\"\n\nThis place, to me, is A-OK. The food was average, the service was average, the prices were somewhat high, and...", "Honestly worst service I've had here. We waited for somebody to SEAT us at our table and when we finally got a table it took our waitress 10 minutes to even..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "EZuIzN2oAdZt-dkbdwH0pw", "text": ["You know this place is awesome when your kids ask.... \"Can we go to Sockeye?\" The menu has so much to offer from appetizers to great beers. My kids love the...", "What a beautiful brewery! The atmosphere was great and our server was a happy bubbly person that made our visit even better. \nThe food selection was good...", "We frequent here for Sunday $10 pitchers and sports games. \n\nThe last event we attended was with some friend to catch the series finals of basketball. We..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "ucPc6Vs4py-6AdsHYEXbpQ", "text": ["I used to go to Applebee's all the time, & I've never been disappointed in the food when I have gone. The only thing that I will never give them 5 stars for...", "Great place to eat two for 20 awesome deal specially since they added sirloin to the menu. Add Long Island Ice-T's for a dollar and you got a party", "Came on a slow Wednesday evening for the Dollarita promotion and it was served in a plastic cup because they were \"out of the other glasses\". Got slow..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "WemZBcPArg_PXF-oXWFijA", "text": ["The service was great.  The server was very friendly.  She had family from McCall.  Immediately connected with us.  The food was ok.  Not overwhelmingly...", "The food is ehhh, the place is sliding downhill. Just spent 20 bucks on the TouchTunes jute box and they turned it off on my first song. They said other...", "Typical bar food but done well, I can't complain. I had a burger and fries and they were very good. It's basically a sports bar and if you like that sort of..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.37], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], ["bar", "burger"]]}
{"id": "0dHYqZ4O5FRwYWEteahfAw", "text": ["It is an ordinary Jack in the box. But a lady named Kira who served me had an A+++ service.", "This place is obviously a training store for would-be employees to finish the last of their training.\nUnfortunately most of them are NOT ready.\n\nI would...", "Went there for lunch today and I waited at the window after ordering for literally 3 mins. I was able to put my car in park, call my optometrist to have..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], ["lunch"]]}
{"id": "gp2KzWfKG3fbuttUEbtDKQ", "text": ["I come here sometimes when I have a salt craving and order large fries with extra Zesty Sauce. \n\nNo matter how I word it or how many times I say that I want...", "I have to admit I'm sad to see the customer service levels at most fast food restaurants dropping to the lowest level I've ever seen.\n\nTo start off, drive...", "* I think this was the last sausage biscuit I'll ever buy from anybody. I bit into a bone fragment, and broke my front tooth.\n* Stick with Whoppers or Big Fish."], "rating": [2, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "y5fT2Nx49cWtmQTJzkphmg", "text": ["Seriously, what is happening at this location? I've lived in the area for a while and have frequently been a customer. I have always enjoyed their salads....", "I don't really know what's been going on at this location, whether it be a change in management or just the general incompetence associated with hiring...", "Just a simple order of fries took 5 minutes. Ketchup dispenser was empty and after asking them to refill it twice, they basically refused to. It was not..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "Yx0JhWt7aeF1PZlRiOptqw", "text": ["This place is damn good! From the service and atmosphere to the food. My husband had the Nashville hot chicken sandwich, and I did the salmon tacos. We were...", "I've been wanting to try the Grit and today happened to be the day. This place reminds me of visiting my mother in law, primarly because my husband was...", "The Hot Nashville Chicken is good\n\n1st time eating there...ordered the Fried Chicken hot.  It is very spicy but with a hint of brown sugar.  It was juicy &..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["sandwich", "chicken", "tacos"], [], ["chicken"]]}
{"id": "ZRt958yOwhl8vFVO56vMxg", "text": ["Let me start by saying I love love love KFC and have since I was a kid. Their coleslaw is so good that sometimes that's all I want for days. I could eat...", "Ordered the hot wings $10 SHARE deal. As evident in the picture, only one I could share those with was myself. NOT AT ALL like the ad picture indicates!...", "...the extra crispy colonel...had to beat...George Hamilton brought me in,so thank you George..."], "rating": [2, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.6], "keywords": [[], ["wings"], []]}
{"id": "-nkHF-cspbXazYeg4wIGhA", "text": ["Their pork fajitas are amazing. The price is about nine bucks. You get four tortilla with your meal.  They also have all the usual tacos, burritos, salad...", "They got both of our orders wrong, but we decided to just eat it anyway and it wasn't worth complaining about. When I was almost done eating, I found this...", "There we ready to give the lady our order when the phone rang. She answered it and took an order with us standing there in front of her.  So I decided that..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["tacos"], [], []]}
{"id": "b0hSNSvD2evs_DEl8RSiCw", "text": ["This Jack in the box deserves 0 stars! This is the worst in Boise! I've been here a few times and every time I'm more disappointed than the last. Breakfast...", "Crappy service, girl didn't know how to enter the food into the system and messed up our order... girls are yelling at each other. Horrible!!", "Really unprofessional manager managing the store this morning. The employees running the drive-thru window very uneducated. left me frustrated ended up..."], "rating": [1, 1, 1], "TBscore": [-0.29, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["breakfast"], [], []]}
{"id": "ChGPDq1tQBgJCLYNUj-PBg", "text": ["The service was fine. It is a repetitive boring job. They got my order correct which is good enough for me.\n\nThe prime rib food truck sandwich was not...", "Portions okay for the cost service was passible... could have been better our order taker was like an automaton  appeared to be put out by having to take my...", "Without a doubt, the WORST fast food restaurant I have ever been to. The staff don't listen when you are placing an order, but don't bother trying to get..."], "rating": [1, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [["sandwich"], [], []]}
{"id": "AUu9t9yMMkXmu0cLxOCUEA", "text": ["Baja fresh has some really good burritos! Went here the first time the other day and was very happy with the food. Hubby and I both got burritos, he got a...", "I love  this place. The food is fresh and delicious! The salsa bar is great although to be fair, I always get the hot and never vary. I go here alot.\nThe...", "Not a good experience, not only was the lady behind the counter snotty, but the store wasn't up to par either, with dirty tables, and splashes all over the..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.59, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["bar"], []]}
{"id": "tP9Sn0KzL2GzImUGchXYMQ", "text": ["Yes! This is a great little Haven away from burgers and fries (ok not fries, they serve them here) in Boise. There are five or six booths in the restaurant...", "Great food, indifferent service.  Typically get the Babaganoush, hummus and shwarma.  Had the fallafel recently - it was great too.\n\nThe homemade pita bread...", "We are so glad we found this hidden gem! The hummus and fresh bread was so good and our combo plate w the lamb shish kabob, chicken shawarma & falafel was..."], "rating": [5, 4, 5], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["burger"], [], ["chicken"]]}
{"id": "p4Nqswm8MH08WeuEhBdFCA", "text": ["In a sea of chain restaurants selling salt and bacon-wrapped whatever, this was a nice find during a road trip. I only got a smoothie but wanted to try...", "I'm in town for work and looked up local spots for breakfast and this place came up. Normally I'd go straight for a smoothie but since I had a coffee I...", "This spot is conveniently located right next to my gym, and has been a lifesaver several times during this hot summer. I've only used the drive thru..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["breakfast"], []]}
{"id": "IBhBYsj1Ps145N_34Fh3zw", "text": ["I have been to their Boise location 3-4 times and discovered they have a new another store in Meridian. That's a fantastic news! \nBoth stores serve super...", "This is our visit to the new Meridian location and it proved as tasty as the Boise one. The chef/employee was great, and helped us decide what we wanted...", "I'm on a work trip so I'm always looking for a good local place for some reasonably healthy food. This was my first visit. I got a $12.99 bowl. For the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "FI3YHJWl7ZvBsC5OdcnJVA", "text": ["As a vegan, this place is badass! I loved the techno-savvy way of ordering, it makes things so simple.\n\nI recommend an order of the vegan tots, for $4 they...", "It would probably be more apt if it were called dharma \"sushi\" and \"thai.\" The sushi roll I ordered looked and tasted as though the ingredients had been...", "Great vegan sushi option right in walking distance from where I work in downtown Boise! I ordered the thai roll - i forget the exact name but it was yummy...."], "rating": [5, 3, 5], "TBscore": [0.0, 0.55, 0.47], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["sushi"], ["sushi"]]}
{"id": "5mTACjbnv4MCiZ_z3b4x9A", "text": ["Love this truck! They came to my work often- they were speedy, affordable & delicious. They have a non- sushi option of teriyaki chicken- it's a good size...", "I was a third of the way through this roll when I realized a had not taken a picture. I may or may not have been a little tipsy. Whoops. I went with the...", "Best sushi I have had since moving from California. Sushi was super fresh. I had them make me a roll off the menu because I am pretty open. Had perfect..."], "rating": [5, 4, 5], "TBscore": [0.43, 0.0, 0.48], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sushi", "chicken"], [], ["sushi"]]}
{"id": "aU-nwFX8F3Iw9r5DfwhCcg", "text": ["Think of this as a deconstructed sushi roll in a bowl. It's kinda like going to Subway, in that you go down a line and pick your \"bed\" from several rice...", "Amazing!  My husband and I got a large to share and after add ons it was 18$. Pricing is a bit high but the quality is superb and we were both full. With a...", "The husband approved! **guess he needs to listen to my food choices more often haha!** \n\nI've been to this Poké place a few times now and it never..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sushi"], [], []]}
{"id": "aL5o2BTmPPP08OJ4I8Zlww", "text": ["Went to enjoy an evening with my family on a Monday night. Monday night is pretty slow, in fact, there was no one in front of us to order and there was only...", "The @#$% Amazing roll... well, it's amazing! Also the spicy tuna is good as well... \nPlus, if you want Pizza, Lulu's is attached.  Good beer!", "I love the sushi here, but it is wildly overpriced.\nThis is more of a self serve location where you are in charge of getting your own drinks etc. Take that..."], "rating": [1, 4, 3], "TBscore": [0.0, 0.73, 0.43], "normalisedRating": [-0.6, 0.6, 0.2], "keywords": [[], ["pizza"], ["sushi"]]}
{"id": "ifMu8oaLD0_Roi7r8G4x9w", "text": ["Enjoyed our second visit to Lucky Fins with extended family.  We had a variety of items from a burger to the all you can eat crab.  The entrees were...", "First time visit after hankering for some fresh Halibut. \n\nThe place is set back from Eagle Road and is easy to miss because there are other business in...", "I'm embaressed to say that I'm barely trying this place after 8 years of living in Boise!! This place is phenomenal!!! I literally wanted to lick the plate..."], "rating": [4, 4, 5], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["burger"], [], []]}
{"id": "NUe39dKrCF8M6jGmP5manA", "text": ["I'm from Wyoming so I never even tried Sushi prior to moving to Idaho. That being said I can't pretend I know anything about \"authentic\". Which I'm starting...", "I would like to note that they are open about an hour longer than Paddles Up. I never realized how many poke places are on Eagle road and I am happy that I...", "okay guys, I am so glad I found this place because we haven't had any decent sushi in months since we got here and I was starting to think boise just wasn't..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sushi"], [], ["sushi"]]}
{"id": "yPfw8ck-ZHXBV51xjJbHkg", "text": ["I hadn't been to Smoky Davis in a long time. Maybe 30 years or more. Most of that was due to moving to Western Oregon for most of that time, but I hadn't...", "I loved beef Jerky (I ended up buying a pound), and could not be happier. They have a nice, tough jerky, which I really appreciate. I also got some...", "We are back in CA, and our bag of their extra hot beef jerky is long gone. Called them about ordering over the telephone and response was Yes. I ordered..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["beef"], ["beef"]]}
{"id": "qJsbhljm1ccXy5H826o6Og", "text": ["Friendly and super efficient. The staff seemed to work well together and the sweet onion chicken teriyaki is as good as ever.\nWhile it was clean inside, I...", "The only reason I even went to Subway was because my son saw the Star Wars commercial and wanted to go there to get a turkey sandwich and the Star Wars bag....", "Very nice, honest and friendly staff. The food is standard Subway fare, pretty fresh most of the time but maybe not always food that stuns. Subway is one of..."], "rating": [5, 2, 4], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["chicken"], ["turkey", "sandwich"], []]}
{"id": "eInDAn9-Yy9yLY6GaTzCcA", "text": ["I've never been to a blimpie and had such exceptional service! Usually I write bad reviews if it happens but your manager Tyler and I can't remember the...", "$15 for a small blimpies best, a small soup and a small soda? I could have easily went to a full service restaurant during lunch, including a tip, having...", "I love their sandwiches. They're the best. The bread is so soft and the turkey is sliced right in front of you. I love that they have their own style! You..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.52], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["lunch"], ["turkey", "sandwich"]]}
{"id": "6ABon6uRYt9Ji_W4ehn9lg", "text": ["Stopped in for a quick sandwich order. Ladies were very friendly and the store seemed clean. They made my sandwich to order. When I ordered my flatbread...", "Subway might not be a fancy joint or serve high-quality food, but I don't go there for that. I go to get a better meal than I could get somewhere like...", "Just came in because I was on this side of town to pick up a Craigslist find and didn't know there was a subway here. \n\nThe people are very friendly and the..."], "rating": [3, 4, 4], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["sandwich"], [], []]}
{"id": "qCojkwO9wJX7alM-x-DJcA", "text": ["We stopped on the way to a concert in nampa for a quick light bite and drink. \n$1 appetizers. We had wings and some Meatballs served with Fritos. They were...", "Great local bar with open Mic.  I only had drinks and I enjoyed the huckleberry berry vodka.  Pool tables are located on the side and the stage is in the...", "Go to  Willi Bs Boise, good food drinks, hosts, mgr, granny troubadour approves, this is a real open mic and i got to.play..."], "rating": [3, 4, 5], "TBscore": [0.37, 0.26, 0.0], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [["wings"], ["bar"], []]}
{"id": "yAcvEoMj064CYIXGF6FS0w", "text": ["Went in Sunday afternoon and there was 7 people in line including myself and it almost took 25 mins to get out. Unfortunately it appears that they are...", "I'll preface this review by letting you know that while I do enjoy sandwiches, I'm typically a Subway salad person. Subway might not be a fancy joint or...", "The expansion was a brilliant idea. I'm addicted to your FLatizza! Veggie white sauce and bring back the add sausage option PLEASE. #extracheese"], "rating": [2, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 0.2], "keywords": [[], ["sandwich"], []]}
{"id": "bDh5cimtW4lOzb2mZQX1Bw", "text": ["We had a free sub coupon from T-Mobile Tuesdays.   When we went to order, the clerk said they weren't participating in that.  Disappointing...no wonder...", "I'm having a hard time deciding on a rating for this quiznos. The customer service was good. The employees were friendly, informative and never rushed us to...", "Terrible experience at this Quiznos.  The staff their were very nice, but the manager was NOT.  He hovered over the workers making sure they correctly..."], "rating": [2, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "zIsFjZgJYxGAz5-y0XTGDg", "text": ["Love this place! It's perfect for lunch and breakfast time. The owner is a sweet heart and very generous! Even though I won't be in the same building...", "This is my favorite place to eat lunch in all of downtown Boise. There are a lot of places to choose from but I keep going back because it feels like a...", "Tried the breakfast burrito and it was nasty and overpriced. Somehow the eggs were burned and the peppers undercooked. For the quality of the food it should..."], "rating": [5, 5, 2], "TBscore": [0.45, 0.25, -1.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["lunch", "breakfast"], ["lunch"], ["breakfast", "egg"]]}
{"id": "hwRGsA-nW5Hi9LTApwA5RA", "text": ["How is it that it is 1130 so lunch time and there is ONLY one person to work! Hire people!", "Having a single person on during lunch hour is not acceptable. Coming from a service management position, I would never do this. This ideal neither boosts...", "Excellent service! Staff acts like they really enjoy their jobs, which is very refreshing in \"fast food\"."], "rating": [1, 1, 4], "TBscore": [0.0, 0.41, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [["lunch"], ["lunch"], []]}
{"id": "6E2i2zDl407WnFy7AgtRsQ", "text": ["HORRIBLE! Don't ever order over the phone or online from this FRANKLIN location. I wanted pepperoni I was charged extra for and there's none on my sandwich...", "The subs were ok, so I gave them 2 stars. But the customer service was not so great. Complaining non-stop to the customers about how she's low on olives and...", "This is nothing against the one guy that was staffed today. This is for the managers. You really should schedule more then one employee for your Subway and..."], "rating": [1, 2, 2], "TBscore": [-0.5, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.2], "keywords": [["sandwich"], [], []]}
{"id": "geE947c4ZKDZmeNRV4bVPQ", "text": ["I received a discount coupon as a new resident in Meridian. Visited and purchased 2 lbs of Italian sausage. The price was different on the package and when...", "This is a great place to get a variety of terrific meats. I was making a \"Team Dinner\" for my coworkers in December and decided I wanted to really wow them....", "These people have up't their game, streaks, chops, bacon, ribs, sausages, chickens, rubs, bbq sauces anything you can think of within reason check it out,..."], "rating": [1, 4, 4], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [["italian"], ["dinner"], []]}
{"id": "lmE2NHtXGI1NbnLV3wYSZg", "text": ["Nothing pains me more than having to say unflattering things about a locally-owned and operated establishment, but to do otherwise in the case of \"Boise...", "Visiting here from California, had so much fun dancing until 2:30am to salsa, merengue Cumbia and bachata. Dj was good. This is a place where you just want...", "I watched these guys open shop, just across the street from my office and have watched their business grow in popularity. Eventually I hopped across the..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "8WpXM7rJA43C0CXvzx6fBw", "text": ["Worst thing about Jimmy John's is never having any other cheese choice besides provolone, which I despise. It's the only reason I won't eat here anymore....", "9th person to review Jimmy John's next to Dutch Bros. on Overland between Cole and Maple Grove, near the Walmart Supercenter. This is my 406th Yelp review....", "So...it took me a while to eat here because hubby doesn't like it. Why doesn't he like it? Because he prefers places that sell HOT subs as well as cold...."], "rating": [1, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "TonuxwX_Xg2zQ7lTK4o1-A", "text": ["I love the trolley house! I only gave 5 stars so that you will see that some of their employees like to go into other restaurants and walk out on the bill...", "Service was slow and it was after the rush so there were literally two tables in the establishment. It took five minutes to get a cup of water. The excuse...", "If we could give it ZERO stars we would...\nThis was THE WORST BREAKFAST and experience that my family has EVER had here in Boise.\nThe Manger / Owner..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, -1.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["breakfast"]]}
{"id": "rx0MXs2W9qbPHIOf0aWAug", "text": ["We've been to the other location, but since it's always super busy, we have started visiting this location. Seating is always pretty fast. Staff are...", "Terrible and I won't be back. This is the second time I have gotten awful food in 2 visits. Eggs are overcooked, hash browns cold and chewy and toast is...", "We have been eating at this Egg Factory location since they opened. We love the food and the service has always been great...until recently. We had an issue..."], "rating": [4, 2, 1], "TBscore": [0.0, -0.52, 0.25], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], ["egg"], ["egg"]]}
{"id": "v-QzzKuz3LF5XtG6F8ePxg", "text": ["Typical Denny's, we ate breakfast at the counter and the server Bryan was attentive and entertaining. He joked with us every time he came by. \n\nFood was...", "Waited over 40 minutes to get food and only cause I asked 2 waiters is our food ready and their response idk.  So I asked the manager and she said idk I'm...", "Well this is a first! This particular location impressed me all around the board. From the execution of the food, to the amiable staff, as well as the..."], "rating": [4, 1, 5], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["breakfast"], [], []]}
{"id": "ZgmxyyWoWZhpE2YxufsEDQ", "text": ["First of all, I walked in and noticed the glass window globes were very aesthetically displeasing. The continents are disproportionate to the size of the...", "This place was dirty! My spinach in my omelet was soggy and black! Very unsatisfied with my meal! Never again.", "I totally get that I shouldn't expect much due to the fact that this is IHOP & not a fine dining restaurant- HOWEVER, we were in there earlier this week &..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "NMcKC_0n7nNDkhi_mgopzw", "text": ["My husband and I tried this place after seeing a post about it on Instagram. So glad we did !! It is fantastic. I had the tri tip steak and pepper jack...", "Inside was nice and clean but the food experience wasn't great.\n\nBought the basket of wings and fries. 5 wings and fries. Wings were under sauced. Barely...", "What a unique, little lunch spot! These waffle pressed sandwiches are so original and flaky. They have pastrami, jalapeño baked chicken, tri tip, smoked..."], "rating": [5, 1, 5], "TBscore": [0.59, 0.45, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["steak"], ["wings"], ["lunch", "waffle", "sandwich", "chicken"]]}
{"id": "GYECX01Nck1G97iLfIWSAA", "text": ["10th & Grove site - produce, other foods, and specialty beverages\n\n-What's important to me is that a number of certifed organic produce vendors sell here. I...", "This farmers' market was amazing! Not only were there so many fresh options but also options for every eater: gluten free, organic, non GMO, etc. the fresh...", "Love. This. Market. \n\nWe've only been to the winter market since moving here but I'm totally looking forward to the outdoor market in late spring...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["gluten"], []]}
{"id": "HFy_fwbV1Ze97a7QZkUsZQ", "text": ["I am obsessed with BR! I go grab two cartoons of their ice cream every week it seems at this point. They have the best mint chip ice cream and sherbet. I...", "Don't come here if it's within the last 2 hours before closing, they are not very friendly and they start shutting everything down you will be lucky to get...", "Don't eat the milkshakes. I bought two Oreo cookie shakes. They were watery and tasted sour. The clerk had no interest in listening or making it right...."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], ["milk shake"]]}
{"id": "9Ql_2vn5Mn17gKBiUi00WA", "text": ["If we were here for ice cream or desserts, I would give it a 5-star rating.  \n\nWe were here for a special treat from my boys piano teacher.  Since we...", "My wife and I stopped by to cure a late night sweet craving. We live right around the corner so this location is dangerously convenient.\n\nWe ended up going...", "I have a hangover so mama needs some grease. I have always liked a DQ burger but the one on Franklin has kind of turned me off because it's not that great...."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.67], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], [], ["burger"]]}
{"id": "V8fjFgjdr75zTTmVcEMMpQ", "text": ["What a treat!!!  The ice cream is phenomenal and there are SO MANY flavors. My kids keep recommending they make a bacon flavored ice cream so maybe one day...", "This is our go to spot when we need some ice cream!! Good selection of flavors and the portion size is better than most creamery spots we have been too....", "On the way to Meridian, just out side Boise since the mid 1970's we stopped at the dairy to get cheese, and the largest bowl of ice cream I every saw!!! And..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "CPk6ozrDMy0ohC4-z0kGbA", "text": ["Friends brought us here... from out of town... cute little shop... great atmosphere, nice people. Kids enjoyed it.", "It's warm outside and It's a good time to get a treat! \nHowever, if want a sample you have to ask and monitor every little last move I felt so uncomfortable...", "Really love their frozen yogurt here.  I am not a big frozen yogurt fan but I can eat a lot here. There are about 12 flavor selections here.  the toppings..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "LqbDCUao2NUlTuq_GIyyWg", "text": ["Loving this location and the dine-in option! The restaurant is clean and charming, and the service friendly. Unlike previous reviewers, we received our food...", "This is the second time I've visited this location, and it will also be the last. \nAll we ordered was a burger, a grilled cheese, regular tots, and a...", "Was super stoked to have a more \"hometown \" burger and shake shop added to the neighborhood (Vs. the national chain around the corner) but have now been..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.42], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], ["burger"], ["burger"]]}
{"id": "LJNMN_5QY-lJYaEZVBdTdg", "text": ["Decent \"fast food.\" The grilled chicken was good and the multi-grain bun was fresh. \n\nI wish they had drained the chicken before putting it on the sand...", "Horrible. Super greasy tots, again. I thought it was a mistake months ago when I came. But no. \nTerrible service. I had to point out that my order was ready...", "30min wait for ONE mediocre burger!!!\nThe milkshake was very bad and the attitude is not acceptable. People were trying to cancel orders but they are always..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, -0.94], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chicken"], [], ["milk shake"]]}
{"id": "sj9o5Vgl8dBm0RnwjhqCcA", "text": ["If I could give this place zero stars I would.  This place STINKS!  As in Smells.  Really bad.  Like rotten milky dishcloths.  The employees don't seem to...", "I walked in this evening and there was a sizable line but it was moving along. Didn't actually buy anything. The entire store reeked of spoiled milk. I...", "First, the place is filthy. The floors are sticky, and the tables, chairs and even the entry way need attention. The bathroom was gross, and for some reason..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "GDxT_ZD8hv35RB1CNBlR9w", "text": ["My friend and I with a total of 8 kids in tow went to the Meridian location for dinner last night. We have kids with dietary restrictions and one with...", "Greasy. Really greasy. I got a to go order and by the time I got back to my hotel room the bottom of the bag Kraft a grease spot in my car seat. I'm glad I...", "Great burgers and fries.  Clean dining area. During warmer days you can sit outside. The staff is always friendly and makes sure you leave happy. Don't pass..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["dinner"], [], ["burger"]]}
{"id": "ttmO7eejS-ZkDMSnuVn4HA", "text": ["Reviewer no. 23 \n\nI visit this location often as it's right by my ids high school. I've written three reviews on Dutch Bros tonight as they all came up in...", "So I'm from Alaska and I had never heard of such a thing as \"Dutch Brothers...\" I thought it was a furniture store when my coworker said we HAD to visit on...", "Love everything dutch from Italian sodas to mochas to muffin tops and more, delicious and satisfying"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["italian"]]}
{"id": "BxveKq0rKp52EWooIDK54w", "text": ["We came as a group of 7 for kids eat free last Saturday at dinner time. The food was good, service prompt, and we had a great time! Just a regular, familiar...", "-the waitress asked kids to get sodas instead, so she didn't have to spend the time to make milkshakes.\n\n-the waitress took so long, that another waitress...", "We tried the carry out services they offer and it was a pleasant experience. Ordering online was painless. Detailed options. Food was ready upon arrival...."], "rating": [4, 1, 4], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["dinner"], [], []]}
{"id": "TmMpQxgtbmi0HZSV0VnGUg", "text": ["I'd read about this place on Yelp and decided I had to try it. Not much to look at---very simple, a few booths and tables and a big access to the gas...", "You get what you expect at the Shady Acres Cafe, basic food, decent service and just enough attitude to make it fun.\n\nThe food here is good but doesn't...", "One of our favorite places!!! The breakfast burritos are awesome! Always a good go to for any diner needs!"], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.95], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "rrlFichTnAsfJJhgop3nPQ", "text": ["\"Cut my pie into four pieces, I don't think I could eat eight.\" \n― Yogi Berra\n\nI am the 22nd Yelper to review Shari's in Meridian near the freeway- Easy on...", "I am an Uber Eats delivery driver.  Went to this Shari's to pick up an order and had to wait for 40+ minutes for the order. They knew I was waiting for this...", "First meal of the day was here. Food was amazing, service was good, and I would come again! On Wednesday's it's free pie day! How neat is that?! I highly..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "p2kxmxH7oOskYk4VFxNqYA", "text": ["This is probably my favorite breakfast place in all of Idaho! The food is great and the staff is even better. Cassidy, one of their servers has the best...", "Great atmosphere. Awesome wait staff.\nFresh squeezed orange juice is a must!!\nQuiche was wonderful....3 stars was for biscuits and gravy and over medium...", "Well I've been here several times now- I love it every time- food is fresh & extra yummy.  Unfortunately the service can be hot or miss as they are always..."], "rating": [5, 3, 4], "TBscore": [0.73, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["breakfast"], [], []]}
{"id": "o-qSKPjoMhQZVsvn9wtDlQ", "text": ["This was a great little breakfast spot. \n\nThey had a large range of donuts - plus breakfast sandwiches & croissants. We ordered, grabbed some chocolate milk...", "I know I say this on most every review I write, but I really do hate writing poor reviews. My wife gives me grief for writing reviews, many of which are...", "Okay, I know a one-star review is harsh, but I'm going for it.\n\nDisclaimer: the woman behind the counter was absolutely sweet, clarified everything I..."], "rating": [4, 1, 1], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["donut", "breakfast", "sandwich"], [], []]}
{"id": "ONlmxkw9jwZytY2IDZIINQ", "text": ["I came in on a Saturday morning at around 9:00, and they had their fair amount of steady traffic. Not thinking ahead, I walked in knowing that I had to get...", "There I was browsing my FB news feed when a link popped up claiming a list of the top donut shops in every state. Normally I don't go for this kind of click...", "My favorite go to donut shop since moving to the Treasure Valley 1.5 years ago.  Nice selection of donuts and prices are reasonable.  Last time I went in it..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.42, 0.33], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["donut"], ["donut"]]}
{"id": "U8TY8RR3Cz5FuJ1Sbedb-A", "text": ["This is my go to donut place and it has been for years.  I highly recommend the maple bar with bacon bits!  It's delicious!  If your not a maple bar fan...", "I stopped in here early morning, about 6 am, to get 2 dozen doughnuts for a work meeting. The couple working were friendly and are hard workers. They had...", "Get the bear claws. Don't think about it, just go get one. Happy, sad, celebrating, just go get a donut from this place. The best! The addiction is a..."], "rating": [5, 5, 4], "TBscore": [0.6, 0.0, 0.43], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["donut", "bar"], ["donut"], ["donut"]]}
{"id": "g8GPzLIBDJdsKxA2C4IKtw", "text": ["Finding gluten free treats that satisfy can be a daunting and expensive task. Finding ones that are actually made of healthier ingredients, and LOWER in...", "I have been following their Instagram page for a while and finally went in to try them today. I'll preface my review by saying these aren't exactly like a...", "Not really a donut. It's not tasty and doesn't taste like any donut. I really don't understand why this place still exists. \nAnd the price is just outrageous!"], "rating": [4, 5, 2], "TBscore": [0.0, 0.0, -0.3], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [["gluten"], [], ["donut"]]}
{"id": "3dhah8zpkvc_juFE3xB_pQ", "text": ["Great donuts, very well Maintained establishment. Will definitely being going back. Great prices.", "I thought I'd take donuts into the office this morning... I stopped into the Eagle shop 6:45 am--prime donut time, right?  The parking lot was empty, the...", "Hate to say it, but I had the same experience as some other reviewers: not enough donuts! I made a special trip to this shop today to try their donuts, but..."], "rating": [5, 1, 2], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "nMLZh1mfsg9RpmwtIAlq4A", "text": ["While not exclusive to this location, Krispy Kreme knows how to do donuts. They are all fresh and delicious and I am yet to be let down.  Pro tip, getting...", "Wowzah! Never lived in an area that had an actual Krispy Kreme location. These doughnuts are what all doughnuts aspire to be! Fluffy and sweet and theres a...", "A single doughnut costs $1.58 now?! But they aren't even full sized! And no, I can't have ice water but I can BUY a bottled water.\nAnd they don't seem to..."], "rating": [5, 5, 2], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "PKQ8u65he4JlUpUCS200cQ", "text": ["Just walking the streets of Boise, I saw a dog outside on a patio and knew it was pet friendly. I decided to stop in for a quick breakfast: coffee and...", "I had been buying all of my beans here since moving to Boise- solid coffee at a decent price. It usually takes 10 minutes to get beans so I work this into...", "My entire family loves this coffee!  So excited to have found this amazing place.  Dawson Taylor European Dark is our favorite that we first purchased at..."], "rating": [3, 2, 5], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 1.0], "keywords": [["breakfast"], [], []]}
{"id": "WKGW6s10eL_xL-xaB2c_og", "text": ["Cute and comfy. I got a sandwich from Subway and ate it on the spacious patio before heading in for a drink. I got a chai latte that was exactly what I...", "Whenever I need a break from SB's, I stop at Moxies for coffee. Service is friendly and fast. Lots of people seated in the lobby enjoying their drinks and...", "I was hesitant to try this place with their overall rating not being great, but decided that could be just the reason why I should try it. \n\nI ordered a..."], "rating": [5, 4, 5], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sandwich"], [], []]}
{"id": "PuyBQ-n5YQF5o0xCNO4aGg", "text": ["Great place to stock up all of your groceries when you need.\n\nIndeed, after 45 minutes or so, my cart was full of things we needed. Freshly sliced lunch...", "Fresh organic produce.  Artisan cheese section.  Both with increasingly interesting array of options as two key reasons this Fred Meyer has moved to \"second...", "Always shop here.  Wish they kept up fresh fruit and veggies more and maybe widened the organic stuff.    They get picked over fast and run out of veggies..."], "rating": [4, 5, 3], "TBscore": [0.48, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["lunch"], [], []]}
{"id": "tOnXahakElIlWRhHmi0NIw", "text": ["I had to say great job here.  The Staff they have makes me come back. Whether they are collecting baskets outside or calling up more checkers, even late at...", "It would be great if the cashiers worked as fast as they talked....  if I have three items,  then maybe I am in a hurry and don't have time to listen to the...", "Full disclosure: A decade ago, I worked in the produce department here. Sometimes, I secretly wish I still did. l had a spectacular time carefully stacking..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "wZhGuW7vQpfhxeEvLHkTrA", "text": ["Best breakfast around. Huge delicious portions, plenty for leftovers. Hollandaise sauce is the best as are the omelets.", "Express Cafe is Iconic locally owned and operated for over 30 years breakfast and lunch restaurant. 86th person to review Express Cafe in Meridian on...", "Don't really understand the hype behind this place. This was my first time here, I really wanted to like it based off the 5 star reviews, but I'm just not..."], "rating": [5, 3, 3], "TBscore": [0.85, 0.25, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["breakfast"], ["lunch", "breakfast"], []]}
{"id": "5VR7HFaGtdTPYZd7nJPd8w", "text": ["This place is amazing. My husband and I stumbled upon Twigs when we were checking out the Village. I had two signature cocktails and the mojito was the best...", "Oh my gosh I can't believe I've gone this long without experiencing the yumminess at Twigs.  We were invited to a friend's birthday dinner with a group of...", "Twigs has a secret menu! Yep!! It's true. \n\nAsk for the Polynesian Pizza. Even add feta. Its absolutely to die for. Pulled pork, pineapple, veggies and a..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["dinner"], ["pizza"]]}
{"id": "t2vRcqKj0CifbKrCYeZx9A", "text": ["Carl's Jr is pretty much my go to fast food when I want a quick and cheap burger. I never expect excellence when I hit up a fast food place. This location...", "Arrived at the restaurant at 11:05 pm on a Saturday, only to find that the drive thru was open and not the dining area, which was ok. We pulled into the...", "Friday, September 21, 2018: they like to close up shop 20 minutes early. Just a heads up to whomever is managing this location."], "rating": [4, 1, 1], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["burger"], [], []]}
{"id": "FORQKw62kgJl_r7VRn6lRA", "text": ["This is a great place to eat if you like Mongolian. The environment of the workers make it especially great for me. They remember me every time and always...", "Quite simply, the very worst food I have ever paid to eat.\n\nThe food was laid out in the opposite order of what you'd expect for a Mongolian BBQ. For...", "I have eaten here for many years, but not for some time as I no longer work close to the grill so I never make the time to come during the week and normally..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "dUpz8bx5_TVfsaS7wwW6ww", "text": ["3 out of 4 of the people I asked for assistance were rude and talked down to me while being seemingly too busy talking with other employees to be bothered...", "This is a great grocery store. It's not as large as stores like Winco or Costco, but it has a different focus; it provides reasonably priced food, with an...", "WORST CUSTOMER EXPERIENCE EVER. I spent 30 mins at the pharmacy when I was the only person in line and my prescriptions were all filled, and ready, I called..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "-SGvS9V0Yc5Ler2HrgtYJw", "text": ["Ok, if you're looking for fancy, this isn't it. Keep going. If you're looking for new or modern, this isn't it. However, if you're looking for great food at...", "Last time I went there I asked what local beers they had on tap,  they expressed that they didn't support local breweries. I'm not going to support a local...", "What a delightful find!  My friend and I were headed to Willi B's for some music and dancing and were looking for someplace to have dinner.  Lo and behold,..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 1.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["dinner"]]}
{"id": "i9S34Jvd1Ijblm0TrnCVqQ", "text": ["I feel like I don't have a lot of \"wow! experiences\" with food. I reserve Yelp-ing for these such moments. \nThank you Cottonwood for the exceptional service...", "The food was pretty rough. The French Onion Soup was what brought up the average rating culinary-wise. Service gained the other star, really sweet...", "After our recent visit to Cottonwood Grille I am lowering my review to 3 stars and removing them from my Boise favorites rotation.  We usually visit the..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "kF89t83G376kVxW37m5pnQ", "text": ["This review is for gourmet night, all you can eat 12 types of pizza, including a dessert pizza. Also salad bar and breadsticks. All for a measly $8.50....", "My buddies and I took the risk and stopped here on a whim. That was probably the decision we've made in Boise so far (we're here from California for...", "I really like Flying Pie Pizzaria because the pizza is solid. I love their wheat sourdough crust with pesto, tomatoes and artichoke hearts!!! Also the free..."], "rating": [5, 5, 4], "TBscore": [-0.57, 0.0, 0.39], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["bar", "pizza"], [], ["pizza"]]}
{"id": "k6IiU_AZOZc6myOXfV1-IA", "text": ["Love this place pizza is great would come here agin and agin the wings were great to lots of tvs I would come here to watch a Game", "For chain pizza it's not bad but it's chain pizza so it's not very good. Open late which is nice.", "really great pizza for a good price!\n\nwe were looking for a good place to order delivery from, and they did not disappoint!\n\nwe got the pepperoni and the..."], "rating": [5, 3, 4], "TBscore": [0.43, 0.0, 0.85], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["wings", "pizza"], ["pizza"], ["pizza"]]}
{"id": "WfPmZ9hp50ttugTVgfcPpA", "text": ["Hahaha, I wrote a review for this place earlier, took me a HOT minute to write it and then Yelp said it was too long.\nHave they met me?!?! My reviews are...", "GASP. How have I yet to review this little 'slice' of heaven! (See what I did there? #Punny.) Perhaps I've had it in my head that since I've been here a...", "I have to give it to LuLu's. They might feel like a budget Brooklyn joint, but they offer a North End experience worth 5 stars.\n\nFirst, their choice of..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "5in65oQ8raShdBAqiCLx1w", "text": ["Potato bacon, you're welcome. You're probably drunk reading this. If you got this far reading, congrats. Time to get in line\n\nAs a heads up, their workflow...", "Great spot for a large, thin, greasy slice of pizza.\n\nWe had two slices of potato and bacon, because it seemed appropriate for vacation and who doesn't love...", "Terrible customer service. Used to come here when I was in town for a late night slice, and I won't be in again.\n\nThere were two employees working. As I..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "yuQFaYy6VVQiDTotUorYMA", "text": ["I have been going to this location for a while now, sometimes once or twice a week.  However, the last 2 times I have been, the salad bar has been in awful...", "I will not eat here again; it's an unequivocal fail IMHO. Most or all of the employees are Millennials who don't know-- and don't care. I flew into Boise...", "I am updating my review as my most recent experience was leaps and bounds better than my prior visit. \n\nThe pizza (sorry for no pictures this time; we ate..."], "rating": [2, 4, 4], "TBscore": [-0.5, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 0.6], "keywords": [["bar"], [], ["pizza"]]}
{"id": "lrdbP1EQzMvg44ljKaVblw", "text": ["Well ran pizza buffet with a very good selection.\n\nAmple salad bar with good selection\n\nDrinks included\n\nI fed a family of three for $16. Super value", "I've been to multiple of the IPC's and this one is my favorite lunch buffet location. They are usually busy, they crank out pizza, and I've never left...", ".This place evolved from the old Grizzly Bear Pizza, in a smaller location, but they have kept the old life-size bear figures. I think the lunch buffet is a..."], "rating": [5, 4, 4], "TBscore": [0.65, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar", "pizza"], ["lunch", "pizza"], ["lunch", "pizza"]]}
{"id": "ugubnQSdlQOGyyBMx7a_Vw", "text": ["Came here on a Sunday right around noon, and my overall impressions were positive. The pizza here definitely isn't the best in town, but the atmosphere was...", "I've been a huge fan of this place for years. They used to occupy what's probably one of the best locations in the heart of Hyde Park at 13th and Eastman,...", "I use to think this was a great local joint to stop by and have a few drinks and some food. But just recently my opinion has changed. \n\nThe staff has..."], "rating": [4, 4, 1], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["pizza"], [], []]}
{"id": "YlZ2IgW3f2pLqBKqIJl8SA", "text": ["It says a lot about a business in how they handle customers who come in after closing hours.  After a long day hiking we arrived here about 15 minutes...", "This place gets a 10 out of 10 for the service. Everyone was very sweet to me, even when I messed up my own salad order; they were willing to fix it for me....", "Fun place with yummy food. I love the whole concept of going through a line choosing what you want on your pizza as they prepare it for you. It's kind of..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["pizza"]]}
{"id": "UrUmhdZLsWcVoIXV9keiVg", "text": ["I love their garlic bread and their crust! My only complaint is that the gyro meat was was a little scant. But the pizza was delicious! And the service was...", "Delicious! Very very good pizza, and delicious meatball sandwich! Whenever we come to Boise, we will definitely be ordering from you guys. Very fast...", "I still love it, cheese cheese and more cheese.  Only thing I would change is maybe offering a stuffed or garlic crust, because I never can eat the crust."], "rating": [5, 5, 5], "TBscore": [0.23, 0.63, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["sandwich", "pizza"], []]}
{"id": "z-G-WVOJoY8QVNfATkMxGw", "text": ["Just left Grimaldi's at The Village. Thank you for taking care of us Madison and making menu suggestions. Started out with the Caprese which was fresh and a...", "Inedible. This review is for delivery through Door Dash.\n\nWe just spent $40 on pizza that EVEN our dog wouldn't eat. \n\nWe ordered the Brooklyn with extra...", "Worst service I ever had. First time there and won't be back. Host said it would be about 15 minutes for the pizza to come out which is totally fine. We got..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "R2Jvs-QnzvitdWkzBgD1Cw", "text": ["Always get our delivery order correct. Always shows up in a reasonable amount of time! Love their app to order!", "Ordered online and they must have made our pizza right away because it was just about cold and had to be reheated when we got home. Note to staff - check...", "Dominos is well dominos lol. If your looking for your typical chain pizza place this isn't a bad place. I like the new look in the dominos locations; menu..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "iEikRs0aTF0tAriKsLB8PQ", "text": ["Ok, I've been here 3-4 times now, so I'll give my yelp opinion. Love this place. Great food, great service, great atmosphere. \n\nSat at the bar last night to...", "So first time to this restaurant, service was good at the bar.  I had the pot roast sandwich with side salad.  The meal arrived promptly.  The salad didn't...", "I've been back multiple times and still the same great, delicious food experience. I have a favorire Salmon BLT that has never been topped, so I'm hesitant..."], "rating": [5, 2, 5], "TBscore": [0.57, 0.47, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["bar"], ["sandwich", "bar"], []]}
{"id": "3xHkEBrXjrTrAY3vpxy23A", "text": ["We wanted Brunch - but finding a spot in Boise on a Saturday morning is a struggggggggle. We ended up at Legends which was perfect! The place was empty, the...", "Friendly service and nice environment to watch games, but two problems I have. First, I order the nachos, way to much chips!! The nachos were ok, but the...", "Great service, friendly bar and waitstaff, and a comfortable,  cosy atmosphere. \n\nFood was awesome.  I had the sliders both times my husband and I went..."], "rating": [4, 2, 5], "TBscore": [0.45, 0.0, 0.64], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [["brunch"], [], ["bar"]]}
{"id": "4pt7e4SNv9DGkqNSER-OWQ", "text": ["I ordered a Thai and a supreme pizza last week. It was EXPENSIVE, but I figured we would try it. The pizza was 25 minutes late, so it took 1:25 to get 2...", "We have literally been coming to this location for years...Well over (20). This will probably be the last time. For one of the anchor pizza restaurants in...", ".Some of the photos present this location as a dine-in restaurant. It is NOT. Call ahead for pick-up or delivery. If you walk-in, like I did, you won't even..."], "rating": [1, 4, 3], "TBscore": [-0.27, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 0.2], "keywords": [["pizza"], ["pizza"], []]}
{"id": "pH8Ivol4wnezrJCECnn7hQ", "text": ["OMG i had the Mexican omelet (I think it was called) best omelet EVER. And the toast (sour dough) was so good that I asked where they got it, Then drove...", "Ordered gluten free crust pizza with ONLY the following toppings:  oil, chicken, and spinach (I can't have dairy).  They brought out one covered in cheese...", "47th Reviewer of Sun Ray Cafe in Old Town Boise. \nThis is my 385th review on Yelp. \n\nI love the location and I hope to buy a home down in that area..."], "rating": [5, 1, 3], "TBscore": [0.39, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["mexican"], ["pizza", "gluten", "chicken"], []]}
{"id": "awOKeCwbzutECzI4R6JGFg", "text": ["Original comments for restaurant owned by talented French chef Franck Bacquet and his charming wife, Michele, contained high praise for excellent food,...", "What a wonderful addition to the culinary choices in the valley! \nLove this place! \nThe menu changes frequently. Wow! How cool is that?! For us Eagle...", "I normally don't update a review so soon as I am doing here but the dinner was so good that we returned almost a week late to try the lunch.\n\nEach day the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["dinner"]]}
{"id": "guvNNiQurBpsjTxi96zaOw", "text": ["Quick, cheap pizza. Cheap both in quality and prices both. Will do in a pinch but I have my own favorites and Domino's just has never made the cut. The...", "I ordered at 10:12pm and got my pizza mins pass 11pm, I'd like everyone to keep in mind that dominos is maybe a block away from me, it might be easier for...", "If I could leave a 0 star I would. I ordered two medium pizzas tonight and upon following the app it said my pizza was done and it was on the app as..."], "rating": [3, 1, 1], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "EUjqIw0cCJuNfgwJEdoQOQ", "text": ["Had lunch today here. Good Italian food. Loved the warm bread they serve with the meals. Wonderful chewy texture. Salad was crisp, fresh and served...", "Oh, Carino's, what has happened to you?  We used to go to this restaurant a lot.  It was our go-to.  The food was always good, the service was always great,...", "They KEEP cancelling these damn Uber Eats orders and ENOUGH is ENOUGH I've had it. If this problem doesn't get fixed oh my lord will i just be such an upset..."], "rating": [4, 1, 1], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["lunch", "italian"], [], []]}
{"id": "cvHBGwiYio1NoDC_eALCkQ", "text": ["We stopped and got a sticky bun to go. There wasn't a lot of choice available at 10 when we stopped in but the sticky bun was very delicious. As others have...", "If you like Quality pastries like me! We know that quality product makes quality pastries. Little Kitchen Pastries bring extra smile with delightful party...", "I arrived at the bakery around 8:00 AM on a Tuesday.  There wasn't a lot of items in the cases but what was there looked fantastic.  I selected a caramel..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "UZ-_prvEV4ENbMGKChl6vQ", "text": ["This is a small bakery. Right beside Idaho youth ranch thrift store. So make your visit count twice in your community  \n    I have bought several items here...", "Love having a bakery within walking distance from my house! You really can't go wrong with any of the breads or croissants. I especially love the ham and...", "Product - 5 stars. Location and ambiance - 2 stars. Gaston's is a MUST if you love legit French baked goods. The disappointment does not lie within the..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "6UZfJmVt8O1kpYRjAUFU2Q", "text": ["Great customer service and wonderful, cozy place to work or just hang out. We're from Seattle and visit very time we come to town.", "Had a bad experience with the drive thru at the coffee mill and management did the right thing, reached out and made it right. Went back several times since...", "Nice little place, only one of its kind in the Harris Ranch neighborhood. I had a hard time deciding between 3 & 4 stars on this one. Redeeming qualities:..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "XifhhRHdU6Lt9W4BEhAbJA", "text": ["What's that you say? Neckar Coffee finally has a storefront downtown at 10th and Main? Is it Christmas? Or my birthday? \n\nI've dug that sweet nectar of...", "Indigo & I love Neckar Coffee. \n\nI have an appreciation for marble and empty space. It's sort of a trend with coffee shops nowadays and I'm not mad at it....", "A neat, trendy coffee place.  The long coffee counter with bar seating looked very appealing.  \nAs well as the velvet covered bench along the wall.  \n\nFor..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "pk8qkVzhj2M3O3CEiv3veg", "text": ["I love the earthy trend and edgy-ness with the menu! I have tried the pour over, old fashion latte and the thyme latte with regular milk and almond on...", "Slow by Slow makes a great cup of coffee! Right out of the gate if you like Dutch bros, or tons of sugar in your coffee... this is not the place for you....", "Really awesome artisan coffee shop in downtown Boise! Great coffee and cool atmosphere which is great for working or chatting. Lots of outlets for your..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "9RxsZl2lwzrdTHxwgrpchg", "text": ["You can sample the bulk candy even the huge giant snake gummy worm. The store is always fun to be in and I always find a cool exotic candy.", "What a great candy store!!! \n\nFirst of all it is such a throwback to the original candy stores,  I mean way way back.  It's wonderful!! The store has bulk,...", "Dtr. stopped in tonight with a couple of friends (who happen to have darker skin). The store had a few customers. Dtr. noticed the clerk staring at them and..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "ynIeFwYcNI82cM9LuuqJWA", "text": ["The intense dark mocha is amazing. The service here is alway excellent! They are very supportive of the military. We have now moved away from Boise but make...", "This little coffee shop surprised me. We have seen white some coffee shops in Boise but always tried to stick with what we were familiar with, Starbucks,...", "Really love this place.  1- its close to where I live so I can walk over and relax with any of their great drinks or food.  2- they make a lot of their..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "OJQ-LAvYrCmGlmN3d99fMg", "text": ["Best coffee in this part of town. Beans are quality. Owners are avid coffee fans. Wonderful seating with plenty of charging ports. Couldn't ask for more.", "Indigo and I stopped in for an Italian soda. It was grapefruit, with whip cream. The barista asked if I wanted sprinkles, I laughed (was it a joke? Next...", "I love Strongline Espresso! Sam is always great. When she sees me she knows exactly what I want and she is getting it ready for me before I even pull out my..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.23, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["italian"], []]}
{"id": "f_w3vvy3q-p7DFVRo-EUIg", "text": ["A really cool modern coffee shop that offers many different coffee flavor options to choose from. The modern space is small but offers plenty of seating for...", "The coffee is good coffee but my husband and I both ordered a toasted bagel with cream cheese. My husband's was toasted mine was not. There was so little...", "This is their store number 5 in the treasure valley that just opened today! It's no brainer why they are so successful! I love their coffee! My favorite is..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "9pbEWyLUfPWqmeOklf2v4A", "text": ["I wanted to give this particular location a shout. I'm already a lifelong Human Bean fan!\n\nI stopped in this location a couple of weeks ago on a Sunday...", "Several friends recommended The Human Bean to me during my trip to Boise. I'm so glad that they did share this gem with me! The Human Bean is a drive up...", "Their mochas and lattes are like watered down. I once asked to put 1/3 of milk with everything else remaining the same. It tasted better, but it's a bit..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "tueA4ip6XgUhHRGG-2-EJg", "text": ["The drive thru is my go-to morning coffee spot (on days I want fancy dessert coffee and not just drip). It's speedy, decently priced, and they must treat...", "Reviewer no. 21\n\nI visit this location when I'm in the downtown area and don't have time to park and go to the indoor downtown Dutch. The location is right...", "Rich coffee full with great flavor. Conveniently located off of State St and down the road from the Capitol Building. Love this DB, lines are never stalled..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "K3TITXVTmZcBJdWLeU0LeA", "text": ["Love this place!! So welcoming and not too busy. I was able to get my work done and enjoy the great drinks and atmosphere. Would totally recommend.", "I love this place! The coffee is amazing and the employees are the best. They are so friendly and always make sure your coffee is exactly how you want it....", "Someone give me another five stars for this review! Impeccable customer service, like beyond worldy! These two baristas were incredible. They were comedic,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "i5tz7suqZ_MIZSUpyimI_g", "text": ["Very nice people, really comfortable vibe. And there's a drive thru! Blimpie/moxie Java", "Nice little coffee shop mixed with a Subway.  Makes a good cup of coffee. Has pupachinos for the dogs and gives a military discount.", "Indigo and I have been frequenting this place for about a year. They remodeled it and it is a Blimpie Moxie Java hybrid cafe. I find it delightful. The..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "scvINAyroSODU64b73QEBw", "text": ["Well they ran out of the bagel I wanted but they substituted it for a decently good muffin. Cordell also made me a frozen mocha that was very delicious. You...", "At 7 am they are out of  bagels, cream cheese and only one muffin left. The guy serving me is rude. I ordered the remaining muffin.  He handed it to me and...", "I was helped by a barista named cordell this morning when I had an Alaska flight to catch. I was a little upset that it was so busy with only one person...."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "BbgoWcqBMpP5X61lGSuOMA", "text": ["We stopped in right before closing and the employee was so nice.  My husband wanted a mid-afternoon cup of coffee and ordered a latte.  The coffee was so...", "The lady taking our order was grumpy and didnt smile the entire time we were there. She was also wearing sweatpants and flip flops. Very unprofessional and...", "Great coffee, home made breakfasts, from scones and muffins to quiche and oatmeal... homemade granola and privately, locally owned!!! And a cool wine and..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "QLbOnu0nyFfmAy_EfB1a9g", "text": ["A taco truck getting a 5 star review? And from a very picky reviewer? This place is an absolute gem. They make their own tortillas homemade, and trust me,...", "Ordered super burritos. Ruined by the chunks of styrofoam in the shape of onions. Did not taste great anyways, very bland.", "We walked to this taco truck after having a wine tasting at Cinder. The place is clean and the tacos were delicious! I ordered 4, two tripe and two carne..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.68], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["tacos"]]}
{"id": "47v8tz1tHLZJ0h5tTskC4g", "text": ["2 street tacos for $6. Great carne asada! The tacos were overstuffed with meat and pico! Great fun atmosphere, family-friendly, many menu choices to choose...", "This is the second of three Calle 75 enterprises if one considers chronology of appearance.  First their food cart-truck, then this order at counter fast...", "Stopped into the downtown location over Memorial Day weekend. \nThe Food: Better than expected, could be better.\nThe Service: Painfully poor, not a grain of..."], "rating": [5, 3, 1], "TBscore": [0.65, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["tacos"], [], []]}
{"id": "anwGeALaMlP8HT54iFDD8g", "text": ["First!   Wowza!  I really enjoyed the food I had there today. I started out slow;  tacos.  My favorite was the pork taco!  They are served with slices of...", "This is one if the best taco trucks in Boise. The family that runs the truck is very friendly and everything is clean and delicious. You can tell they...", "I've seen this truck a few times driving by and decided to stop for lunch today. I had 2 tacos (pollo & carnitas) which were both delicious, and a tomale..."], "rating": [5, 5, 5], "TBscore": [0.3, 0.0, 0.4], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["tacos"], [], ["lunch", "tacos"]]}
{"id": "cul9zG3Oy-B9dKLqRg58FQ", "text": ["I like it here. Never had a problem coming here for for lunch. My favorite part of the tacos is the cheese. They don't mess around.", "What used to be good service has gone way down lately. On Sunday 9/9/18 I met my husband for lunch at 12:30pm. There was something really weird and...", "Condiments unstocked, plastic forks & spoons & container dirty, and skimping on portions which left us unsatisfied with the meal. Staff were friendly, but..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["lunch", "tacos"], ["lunch"], []]}
{"id": "3Jryb5rOkljKxmGLofRI1g", "text": ["The carnitas tacos are amazing!  Authentico with pickled vegetables! And they don't mess around with the hot sauce . We'll be back!", "My daughter insisted that my love of all things taco truck had to meet this love affair. Boy was she correct. I do have to mention that I actually visited...", "The taco truck is a bit of a drive to get to if you don't live close. We didn't but wanted to see how good it was. The tortillas were not warmed up enough...."], "rating": [5, 5, 3], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["tacos"], [], []]}
{"id": "j_6LvHUJlu-wI5bJUDgMtA", "text": ["Was a little hesitant after seeing some negative reviews of this place, but I'm glad I still tried it!  \n\nThey offer gluten free options!!  Just say you'd...", "I never understood the infatuation with tacos...until I came to Tin Roof! I had no idea Tacos could be this good! This is one of my favorite places to eat!...", "I'm from California so clearly I understand what it takes to make great food.  Dont listen to the reviews from all these local yahoos.  \n\nThis place is..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.75, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["gluten"], ["tacos"], []]}
{"id": "MbV8a6UG5Q1_CVtQFRc_nA", "text": ["I love this Del Taco cuz the employees are always so much fun! The food is good, not great, but decent. I think you get a good quality for what you pay....", "Horrible food. Slow service. Management needs to step up their game. I was offered a refund on my meal, because it was cold, hard and disgusting, and Was...", "Ordered here last night for the first time and I wasn't happy. We went through the drive thru and ordered the Fiesta pack. The lady who took our orders was..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "dcnPaO-iuv7B-Dai-r-d_A", "text": ["As an LA native, moving up here I was skeptical about finding a legit carniceria in Boise, however, thanks to my fellow Yelpers, I stumbled upon this gem....", "So delicious! Very authentic and fresh! Come hungry! They have a Mexican market with dried chili's, spices, marinated meats, and sweets. In the back is the...", "I got the carne asada burrito and it was delicious. Price was $6.99 which I thought was a steal for the size of it. I gave the burrito 8/10 but to be fair..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["mexican"], []]}
{"id": "BJZRXB6e1XkearWslqrt5w", "text": ["When and for breakfast for a change yes they are open for breakfast ordered a country breakfast burrito which has sausage, eggs, hash browns, and country...", "Went through the drive-through at TacoTime in MERIDIAN on progress avenue. We usually get great food and service at the taco time in Boise. Our order took...", "Another fast food staple for my family. Quick & easy but truly fresher than what you'd expect. \nPrices are considerably higher than the standard \"Mexican\"..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["breakfast", "egg"], [], ["mexican"]]}
{"id": "OHBBeHXOnqYM6O9a6trpag", "text": ["Ive worked next door for 5 years, so I eat here quite often. Every time I've eaten here, the restaurant has been clean, staff is extremely friendly and...", ".This is one of the iconic restaurants I grew up with. Not this exact location, but same business. As a working young man, it seemed that my lunch money was...", "It's a taco time and it makes the hubby happy!\n\nWe were thrown off a little bit when ordering crisp meat burritos and they asked if we wanted a side of..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "lHndmmPiVHzZ9PLz_su8Zw", "text": ["The food is good and the employees are friendly. Never had a bad experience here. The only thing is the drive thru is slow but it's worth the wait.", "I don't think I've ever been to a fast food place where the employees were as nice and helpful as I have with this location. I love Taco Time food but the...", "NOT HAVE AGAIN: The meat burrito was terrible! Not a lot of meet and it tasted so bad, I only ate half of it. Plus, at $2.69 the burrito was way overpriced..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "TQj3IdS1_J9po6tQvfieTg", "text": ["We had dinner here tonight, their special was an awesome homemade Salisbury Steak!!! So worth the price!!! I recommended this place to a few co workers and...", "Every time I drive by Eddie's Diner, I always find an excuse to eat there. Even if I just ate. \nI love the atmosphere and food.\n\nGreat Diner!", "Stopped in for lunch when we were house hunting and enjoyed the food and the 50's atmosphere. Great service and our server couldn't have been nicer, gave us..."], "rating": [5, 4, 5], "TBscore": [0.44, 0.0, 0.65], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["dinner", "steak"], [], ["lunch"]]}
{"id": "EqYmE48JUiquJMlmfpAdGA", "text": ["Ssh. Once you come here, you'll want to keep it to yourself...\n\nMy favorite coffee place. Spacious interior with lots of seating. They're personable and...", "I've really enjoyed the coffee & the overall experience here both times I've visited.  They use clearly quality products- incl Monin syrups (vs those yucky...", "I have walked by it so many times. The name always caught my attention. I finally stopped in today and I ordered a Huckleberry Mango Smoothie. It was..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Eto7duDaxGiOvtakWiGEqg", "text": ["I honestly cannot recommend Gyro Shack enough.  Their heritage name is misleading - they now have full service restaurants all over the valley.  Their food...", "I'm giving it 5 stars based on I've never had a group that I enjoyed this much. Especially if your in the mood for a small and quick bite it doesn't cost 10...", "The gyros in here are the best and I love the PHILLY and And the meat was amazing. A perfect dinner place!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.78], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["dinner"]]}
{"id": "aL_o2o6DBAXI662UeDCWJw", "text": ["After experiencing wildly successful popularity last year for their Friday lunches, owner Rita Sturiale closed the cafe portion of this gift shop - café in...", "Make sure you have a reservation before you come! We got turned away at the door because we didn't have one. Not subtracting stars for that, since it was...", "If you want to experience a family run restaurant, just like we found in Italy, this is the place. It is so much like the small places that we visited in..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "5u-fuXhvuwQfaB_E0JGV_A", "text": ["This is a pretty special place. Both experiences have made me feel like I have stepped back in time to the 40's/50's. The only thing that was missing was my...", "I've been to the Sapphire Room many times and continue to be impressed by them. Not only is it a good sounding music venue, but the servers are really good....", "!OLE!\nI had the pleasure of watching MahaVia Flamenco perform this evening at The Sapphire Room. It was my first time at this venue. When I checked in, they..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "Cc2WkBGuXwTD5axRxcWHRw", "text": ["15th person to review Riverside Grill, Boise, Idaho, located inside the Riverside Hotel. Open to the public, not just hotel guests. \nThis is my 380th review...", "Staff talks badly about customers!\n\nAte here for Thanksgiving. We had reservations for 3 adults at 12:30 and were not called until 12:45. The hosted...", "Good, large portions, if you do take out ask for multiple extra salt and pepper.  Very karge variety of foods to choose from"], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "UedwUkX2R0yX8Fgj0cAPsw", "text": ["There are so many different flavors of popcorn to choose from, and you can sample as many as you'd like! There are quite a few options of sizes and tins as...", "heaps 'n heaps of flavors, star service\n\n-samples galore, enough to stuff your belly full to the max, without even asking \n-The owner's brother was working...", "FANTASTIC flavored popcorns!  We went specifically looking just for caramel popcorn, because the overpriced caramel corn at the grocery store wasn't that..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["corn"]]}
{"id": "CCRmyL5ClU_ZfpjB1rfIQA", "text": ["I love this place. I started coming here a few months back and instantly felt welcome. The whole environment is great. Jessica, the owner does such a great...", "Where to begin, where to begin! Ha! Ok, so literally a year to the date (a few days ago lol) I joined a gym for the first time in my entire life. Kinda sad,...", "their drinks are so good i love the thin mint"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "7gaW40r-IZfLjcOFCXKCjg", "text": ["Incredible smoothies! They are very flexible about substitutions, which is great when you're as picky as I am.\nDo yourself a favor and grab one of their...", "Boise Juice Company is the highest quality smoothie and juice bar in Boise. It also is the most expensive, but you definitely get what you pay for here....", "Holy cow, I have found my bliss!! I have been patiently anticipating their opening at this Southeast Boise location. \n\nI tried the Berry On Açaí bowl which..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["bar"], []]}
{"id": "zpw_DlkyGrDT6IJEMrhAMQ", "text": ["Sambal Cashews - came back a second time just to make sure I'd have some for the drive home.\n\nOwner was there both times which leaves a good impression on...", "What an incredible staple for this community. Truly original and truly delicious. Maple bacon cashews are the way to go for first timers. Visitors of the...", "Maple Glazed Bacon Cashews are fantastic.  Reading the ingredients...no bacon!  I love it.  Cashews, brown sugar, organic maple syrup, spices, salt and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Qfhf_0TSTL_ezoUVBUVk5A", "text": ["Happy, friendly and extremely knowledgeable staff! The juice is amazing! There is something here for everyone. Try the Mighty Mango bowl. Stop in and check...", "This is hands down one of the best places in the Treasure Valley! The staff is super friendly and their juices and açaí bowls are heavenly! The tropical...", "This place is ideal for on-the-go healthy meals, but also doubles as a guilt free \"treat-yo'self\" experience!\n\nLooking for a fresh pressed juice to give you..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "hWFeY5J42n8K12_nCgTJEQ", "text": ["Small family-run Korean store where you can get basic Korean groceries, ingredients, seasonings, snacks, utencils and etc. No English translated labels for...", "Mom and Pop Korean grocery store! I been coming here about once a week since the first time they open their door! The owners are nice Korean older couples....", "A small Korean market.  Very clean.   You need to know what you want, or you speak or read Korean, otherwise, it may be a bit difficult to find or buy..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["snack", "korean"], ["korean"], ["korean"]]}
{"id": "1uR8FrUDrJFwtdUu06_amA", "text": ["Really yummy smoothies! I got the triple berry blast with extra raspberry and it's my new favorite thing! The staff is friendly, the space is clean, the...", "Friendly cashiers. \nFairly pricey. \nThe Peanut Butter smoothie was good but not amazing. \nI liked the way the place was set up and decorated. It looked...", "I will cut straight to the chase with this review, order the \"higher grounds\" and ask for them to add peanut butter to it. (I've been doing this since I..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "DL1JRfRo3Wtc76PY8-hWeg", "text": ["What a wonderful surprise this was! Urban Fox is a delightful place to get a huge variety of fun drinks including color changing lemonade, strawberry milk,...", "My first visit because I was told their Boba was pretty good.\n\nI ordered an original milk tea with Boba.  The Boba is indeed very good.  Very chewy and...", "I really enjoyed my first experience at Boba Tea. The enviroment made me so happy because the barristas were so friendly. When you walk in they welcome you..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "tCKx9bkvughZdZK4vbiJ1w", "text": ["First and foremost we were totally floored by how busy everywhere was to get breakfast on a Sunday morning around 1030. We went to three other places...", "Everybody likes to have a place to think, to meditate, to eat a burrito --\nSherman Alexie\n\nIn Downtown Boise you will find this magical place. 56th person...", "Delicious coffee and bagels, super friendly service, and great atmosphere with ample seating and cozy couches. What more could you want from a coffeeshop?!"], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["breakfast"], [], []]}
{"id": "J1YFY4tPH3JmwfM4o0p_Ig", "text": ["This place has the best vibe. What a cool addition to down town. It has the exact styling you would expect at a \"sit down\" Dutch Bros. Broke in leather...", "This is a must-visit for me whenever I am in Idaho. I love the drive-through concept (sometimes have to wait awhile as there are other like-minded people...", "Cool place with a chill modern vibe. Plenty of different coffee drink options to choose from. Very friendly staff and outlets along the walls for your..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "pG_VmYfvQ7ELc3ySasCN_Q", "text": ["Great place for boba! The staff is really friendly and knowledgeable about their menu. They even have us a sample of their tea before we decided what we...", "zingy flavor, 10-star service!\n\nThe chipper young lady who served me today went way above and beyond. She offered to let me read the ingredients label on...", "Meh- I'd definitely recommend Urban Fox over this business. The counter guy was clearly done \"adulting\" for the day.  I tried to be gracious & tell him..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "r8fLZeMxHCWaQ0wrv1bK3w", "text": ["All in all this a very good place to get pretzels. I typically come here on the weekends and the pretzels have always been fresh. I can't make any...", "Great place to grab a snack while shopping at the mall. Salted pretzels really hit the spot after walking around for so long. Not to mention their delicious...", "Ordered bites and a salted original both with cream cheese. The bites were good but the original tasted like it had been in the warmer ALL DAY...."], "rating": [4, 4, 2], "TBscore": [0.0, 0.49, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], ["snack"], []]}
{"id": "pnR9ex4IWiYrnexU6qNP9Q", "text": ["Food is awful I got the new chicken crisps and they tasted like they weren't  fully cooked which is weird McDonald's has timers on everything so idk how...", "I know this is McDonald's but the level of service at this one is just so poor.  The staff is rude and surly. Can McD's please check into this.", "No clue why they blocked all the outlets. Jack in the box has outlets. In a digital age where even children have cell phones, why would they plug the..."], "rating": [1, 1, 1], "TBscore": [-0.49, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["chicken"], [], []]}
{"id": "r3uzfxFNR_ZT6cRUrE4Kyw", "text": ["I swung in here to check out the loose tea options and wasn't disappointed. The Om, coconut oolong, and chocolate pu-erh are some of my favorites of the...", "A friend of mine brought me here for tea one afternoon and I am sooo in love with it.  TONS of choices to choose from and the staff is super helpful if you...", "I flippin' love this place!! I'm a huge tea fan, but not a teatotaller...har har. Gourmet teas for the most discriminating tea palate abound here!! It's a..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "bwDeI0YRqn7rToBwH4ptKQ", "text": ["We come here occassionally to get an ice cream during our long evening walks. Every single time we come in, which is at least once a week on any given day,...", "My boo bear and I came in tonight, and ordered for some organic nuggs and the crew members gave me and my sweetie pie the dirtiest look, I was shook! That...", "There was plastic inside my Egg Sausage McMuffin, it's all I have to say. I'm not coming back to this location."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], ["egg"]]}
{"id": "SDF1usj2mnUNqbIy4JBQTQ", "text": ["I have had several meet here. Very friendly staff. Good coffee. The drive up is great too! There are not a lot of coffee spots near us so this is my go to...", "Delicious coffee, a relaxed and friendly atmosphere and a decent amount of seating. A few little board games and such for kids of any age and a helpful and...", "Have been once and it was good. I'm sure we'll go back when in the area.  The breakfast food offerings looked good but we'd already eaten so did not try...."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], ["breakfast"]]}
{"id": "-M7aI9P2XG79_E0c3sN7gQ", "text": ["Drink: 5\nService: 5\nValue: 5\n\nTheir signature coffees are great with lots of flavor and the right amount of sweetness to start your day off in a fun way....", "My wife and I had a few hours between when we checked out of our Airbnb and when we need to head to the airport, so we stopped in at Thomas Hammer for a...", "I was in town for 36 hours and went twice, highly recommend The Hammer with cinnamon, chocolate and honey....good stuff."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "GwNcWvkGxqjo0_Ko558nAA", "text": ["We were doing our own little bar crawl and stumbled upon this awesome little joint! The cocktail menu was simple and the drinks were incredible. \nI am not...", "I recently went to the Adelmann Building for a night out. First, to The Spacebar, second to Dharma Sushi & Thai, and I thought well I'll just make it a...", "My friends and I stopped in at this cocktail bar during our trip to Boise. Press & Pony is clearly going for a Prohibition Era Speakeasy theme. The decor..."], "rating": [5, 4, 4], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], ["sushi"], ["bar"]]}
{"id": "V3wGj8wcKpL5HIZAIvj01A", "text": ["Super friendly place. Drinks are not spendy at all. A gin & tonic and a Mac & Jack for only $6.\nAnd they have Golden Tee!\nGreat place to prefunk or just...", "Had a nice time there 2 weeks ago befire a BSU game. So we decided to come again for the Frsno game. This time the bouncer wouldnt let my 72 yr old wife in...", "So this is great place to go with friends or even fly solo. Always nice people to take too, even if it's just the Bar tender. \nGreat place for game days."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.52], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "3S9GYtMOYhbZl4MMPOHT0Q", "text": ["This bar represents a fresh and fun approach to the \"social club\" atmosphere we all crave.\nWith an original design and a woodsy flavor and great floor plan...", "This place is awesome! They had mini bike races going on inside the bar! There was a whole obstacle course set up with nerf guns and everything. They have...", "There are many reasons this place has 5 stars on Yelp & you just have to go see why for yourself! \n\nWaited for rims/tires to get put on & guy at Big O Tires..."], "rating": [5, 4, 5], "TBscore": [0.36, 0.6, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "-rNeSxVqiz22c1iyqt1O5g", "text": ["AWESOME!!!! LOVE this bar. They have rad drink specials on the daily- service industry night for those of you that work the restaurant/service industry....", "Great Dive bar, with tons of characters.  Beer Garden out back, with a fire pit and horseshoes.  Places like this are an endangered species, so enjoy it...", "McCleary's. Wow. What can you say about a place that has $2 shots of Jack every Friday? They are truly doing the community a service. Whether you are there..."], "rating": [5, 4, 4], "TBscore": [0.5, 0.4, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "z8BpDzgSp-8eKgnT62HPwg", "text": ["This is the coolest retro arcade I've been to.. such a fun thing to do any night. Being an 80's baby, I loved playing all the fun games, it's like a time...", "This is such a fun spot! They have several pinball machines, arcade games, game consoles/games, and board games to choose from. A dj was playing great...", "I went here last night and played a few games and had a beer. The beer selection was pretty good and the bartender was great. The venue is in a cool lower..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "zAHwr8T05SOG93UzVonfNA", "text": ["Perhaps it's the risqué name, the long line that this bar always has out front, or the fact that I go downtown maybe once or twice a year that has prevented...", "Humpin', Humpin' Hannah's! With a name like that, what could go wrong?\n\nIt took me probably 10 years of hearing the name and living in the area to visit...", "Humpin Hannah's has a fun atmosphere, great band and a busy dance-floor. It was easy and fast to place drink orders, and I discovered Huckleberry vodka, a..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["bar"], [], []]}
{"id": "ywCHJnkPPWd9xLBOMRy-rQ", "text": ["\"The party before the party...\"???  \nFor me, Prefunk is the party! \nI mean, with all those rotating tap options and a killer dog-friendly patio... it's the...", "Boise's beer scene is growing and being a native who no longer lives here I can see the growth very time I return. However, with this being said, I'm...", "I LOVE PREFUNK!!!!!  I mean what is a prefunk anyway?? YOU GOT IT...THE PARTY BEFORE THE PARTY!!!! These guys do it right with their incredible beer and..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "7LU0SrVoaqP6AgOI8bf9Xg", "text": ["This dark and mysterious bar is one of the best kept secrets in town. It is full of dark, unique character. High ceilings, tight space, good drinks. \n\nI...", "This is a really cool spot! Very small and can get very crowded but it's a great place to stop in for a drink. Definitely had a dive bar feel but very nice...", "During our last visit to Boise, local friends suggested we have a couple of drinks in this place. Good tip, local friends!\n\nThe drink menu is clearly the..."], "rating": [4, 5, 5], "TBscore": [0.23, 0.32, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "YYG0AjTxT915O0UqmJhCPQ", "text": ["This place is an easy 5 stars for me. It's a simple bar that serves beer and that's it. It has an outstanding collection of brews to choose from and if you...", "I love this place--the selection of bottles and cans will make you clap your hands, clap your hands. \n\nThis place is super chill and there's beers here that...", "This is the best thing to happen to Boise. I love the huge selection of all beers (IPAs especially) and the wonderful staff. I can't forget to mention how..."], "rating": [5, 5, 5], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], [], []]}
{"id": "p3hwoEvtIH6cQjDKh-8eOg", "text": ["I really wanted to check out the queer night life here in the \"famous potatoes\" state. And it delivered. \n\nIt just so happened to be karaoke night (Tuesday...", "12th reviewer of The Luck Dog in Boise, Idaho. This is my 374th Yelp Review. \n\nI've spent many nights at the Lucky Dog-- well, not too many, but over the...", "It's our dog's first gay bar and what an appropriate name! It's a nice bar, friendly staff & patrons, and respectable bar drinks. I was overjoyed to find a..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.46], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "JyzHxEzAEwhHQZuAyzzrMA", "text": ["Reviewer no. 24\nMy 355th review. \n\nCHECK IN ON YELP FOR A $5 COCKTAIL! \n$3.50 in savings. \nThanks, YELP! \n\nI had heard the name several times (always good...", "Rude bartender with an attitude. People feel unwelcome. The rude bartender I had was apparently one of the \"nicer\" ones. They wonder why the place is always...", "Capitol Bar is rapidly becoming one of my favorite spots.\n\nWhat I love:\n\nCapitol Bar mixes some of the best classic cocktails in town. Their Old Fashioned..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "z83l8khn06lZob--b_hpCw", "text": ["Sounds like this place in a classic in Boise- been open for years & years, also some of the only late night eats around downtown.  \n\nIt's somewhat divey &...", "Came here on a Wednesday night with a group of coworkers, all from a restaurant/bar. We are normally the chillest people towards service industry staff. But...", "DISCLAIMER: I love dive bars.\nI do not love it here, and yeah, it's the people. Feels like a Portland train kid place. Filthy, greasy, and boring."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "e69Ht-381jkwWBav6xNsWw", "text": ["Great find in Boise. After a nice walk along the river thru town, it's great to just sit and grab a beer in a pod bar with a chill environment and good...", "This is a great little bar that sometimes has a food truck open.  It will remind you of those wonderful beach bars you get in Hawaii or the Caribbean....", "Fashioned out of an old shipping container, The Yardarm reminds me of the ramshackle bars on the beach in Jamaica.  It's an *awesome* vibe, a few minutes..."], "rating": [5, 4, 5], "TBscore": [0.73, 0.4, 0.3], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "gZu_gWmG_AyDQVs_I8WO9g", "text": ["My friends and I stopped in here for a drink last Friday night. Originally, we went to a neighboring bar, and decided we were looking for something a little...", "The service was so poor that we left after waiting at the bar for 30 min on a Wed happy hour.  Their drinks are great if you get served before the happy...", "Whiskey selection in Idaho can be a tough thing, but this is perhaps the best selection I have seen in the state. After a nice Whiskey snob conversation..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "GAli3uK_AvEDnpLnKIYGTA", "text": ["This is a very cool bar with great drink prices and great bands.  The crowd was perfect sized to keep the place lively but not uncomfortably crowded.  The...", "When I want to feel all cool and young again this is my spot to go!! This is my top bar choice to visit for a night out. What is special about here though...", "Literally my favorite chill out bar. The bartenders are amazing and the regulars (for the most part) are great. One of my favorite after work spots."], "rating": [5, 4, 5], "TBscore": [0.57, 0.34, 0.58], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "ucOBzRHDHSJ456N90WVrBA", "text": ["The pizza? 5 Stars! The beer? 5 Stars! Bru has quickly become our favorite beer + pizza joint in town. IPAs?  Check. Lagers? Check. Cider? Check. Seasonals?...", "Wandered by Bru a couple times during the day, and when it was finally drinkin' time, wandered back to check out what they had to offer. Bru is a cool...", "Awesome place for team/group events. \n\nI was hesitant at first because of the self-service system, however it was much cheaper than I anticipated. Not to..."], "rating": [5, 4, 5], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["pizza"], [], []]}
{"id": "wcfYcAfujUZ6eFxII1iNAg", "text": ["I really like this place and I am sure you will too! Not only is the environment welcoming and relaxing, the drinks are pretty dynamic and full of good...", "Checked this place out based off recommendations from coworkers.. oh man, am I glad we found this place! If you're in the mood for fancier cocktails, this...", "Man... what a cool place! Great decor, awesome location, and amazing drinks! I had the Smoke & Thyme, and it was fantastic. This is a smoked drink where..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "5-HsdtO1r_9a3aqfwqy3BQ", "text": ["The Modern Hotel is definitely a place you should check out! \n\n- They have a very creative menu in their restaurant and bar! \n- Rooms are spacious , clean...", "The Modern Hotel and Bar in Boise was astonishing. One of the most original hotels we've experience. This place is for sure five stars! The front of the...", "The Modern has a unique food offering and wonderful drinks. They offer quick, friendly service and food and drinks were made as specified and served in a..."], "rating": [5, 5, 4], "TBscore": [0.34, 0.44, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "xtcF-OG3e3ykqWoHGlOfsw", "text": ["It should be noted before you read any further that I'm a very, very big fan of dive bars. With that in mind, you'll find that I'll give glowing remarks...", "Been coming here for months and all of a sudden they're charging a $1.50 per drink upcharge for ICE, and claiming it's a \"standard bar upcharge.\" Never in...", "Kurtis is no joke one of the best bartenders I have had in awhile! Friendly, courteous, and delightful to work with. Non judgmental and fun! Highly..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "V9ZR9Y3dm1In75HYsaHwnQ", "text": ["The definition of \"Dive Bar\". It is located out of the way of anything, allows dogs (actually encourages it), filthy carpeting, cheap tables, stiff drinks,...", "There is not much to this bar. Old and ugly blue carpet, but probably because of the reason they do allow dogs inside here! They do not serve food, but...", "Great dive bar that allows dogs!  No really, you can bring your dogs in and let them off leash to roam around.  They also have pool tables and the drinks..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "Pz4BjuaA6cjF0FeC6j-dmw", "text": ["Stopped in today for Happy Hour. Not sure why it's only a 3 stars. 1/2 price apps and drinks. We had great drinks (I had pear martini and actually 3 of...", "This is a really nice place to have some drinks with friends and coworkers.  I was in Boise for a business trip and we visited the bar several times. Every...", "Asked for a dirty martini, Tito's vodka. Completely unable to drink. Tasted like fish water, no really, like a fishy water. I got the bartenders attention..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["bar"], []]}
{"id": "hvvxTFbnrd28Ddebgc8SeA", "text": ["Hell ya!!  \n\nWe were in Boise for a couple days and we're wondering what to do with ourselves \nBeen downtown and seen what there was... damn near ran outta...", "Dropped my kid off at college. Yelp said it was the best bar. I confirm. Good vibe. Burger charred with thick Smokey bacon and two dogs running around. Feel...", "Best place ever, the staff the environment it's an all around fabulous place to either start your night or just to have a drink and relax!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.47, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["bar", "burger"], []]}
{"id": "kD_sB-s57BYwP6QND1sVdQ", "text": ["This place is the greatest in Boise! The drinks are great prices and the staff and bartenders are amazing and friendly. This bar becomes a place that you...", "Most disgusting bar in Boise Idaho. Visiting from CA and we wanted to find a Karaoke bar. This place stinks! Literally! Filthy bathroom, dirty glasses, and...", "I had a lot of fun on my first time at Charlie's. I will come again, and enjoy the karaoke!"], "rating": [5, 1, 4], "TBscore": [0.69, -0.57, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "HZMeLuRifg0ZIsXSZAKc1Q", "text": ["I really love this bar!\n\nfirst off, they have drink specials every single night. it's posted behind the bar. monday night is craft beer night- $3 all night....", "It is what it is! Go there to have a good time with close friends in a comfortable dive-bar atmosphere. Cheap drinks, loud music, and pool. What more could...", "Terry's is the local watering hole for me. I've lived in the area for less than a year and have been here plenty of times. It's an eclectic place.  You get..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["bar"], [], []]}
{"id": "wWjxUs1nuqXeMdTE9uukpg", "text": ["They know how to make a martini! Just pick the vodka. \nI'm suppose to keep writing to get this posted so:\nThey know how to make a good martini! Just pick...", "I am a big time fan of the grapefruit martinis at the bar here. The service was decent - a bit slower than other bars in town but understandably so since it...", "the staff was very friendly and accommodating here. never had to wait for a single thing. turned the baseball game on for me when i asked too, which was..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["bar"], []]}
{"id": "fhKSroLBUfASNMquHVVusg", "text": ["They get a lot of good shows here, and do a really good job putting them on. Sound is almost always among the best in town, and the space is just big enough...", "I've slowly but surely fell in love with this place.  \n1st they had me with their bloody's (Barb makes THE BEST) & then it simply become my go-to spot on...", "The first bar I went to that I could truly feel comfortable at. Everyone is chill and nice. The bar staff are so great and All walks of life come to this..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.51], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "p0f4D374WNSAFq2izAHHvg", "text": ["This bar always has a very welcoming feel the staff is always amazing and treats everybody fare plus the stiff drinks and cheap prices you can't beat them...", "I like this bar. From homebums to hipsters, you will see them all here.\n A $20 bill and you will get yourself a buzz. It's not often that I remember leaving...", "CASH ONLY\n- Great place for a cheap drink and a very dive bar atmosphere. Nothing fancy here."], "rating": [5, 5, 3], "TBscore": [0.25, 0.0, 0.35], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "JIgMaSsHwvlrevGC5sat4A", "text": ["Came through here on random chance to watch BSU play in a bowl game. Decent service; decent local beers like Pray for Snow. Wasn't anything special that...", "For a Pescatarian-fitness freak -to find a sports bar with good food that's reasonably healthy is very rare! I had the Tuna Melt with cottage cheese and it...", "Awesome place with fast service and really cute waitresses. 15 beers on tap and great food with inexpensive daily specials! Great place to watch the game..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.56, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], ["bar"], []]}
{"id": "r8blrZhwh81yOm2pWWK7_w", "text": ["Beers cold and the shots are warm.  Pretty cool little joint and well lit by the big windows.  It's the only establishment near my hotel besides McDonald's...", "Great pool table easy to pick up a game of nine ball on Thursday nights.....friendly staff....good prices", "Bartenders are great.  Very alert and remember drink orders for occasional visitors.   Parking can fill up during busy times.   Walking through the smokers..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "XnXVJtLSi7sNrSpmt1Y_Xw", "text": ["This is a nice hidden little bar around the corner from the parking lot there  by bombay grill. There are stairs going down so take caution if you are...", "AS Mariah Sings:\nI had a vision of love, and it was all that you've given to me... \nTreated me kind, Sweet destiny\n...and that's all that I could hear in my...", "a cult of personality\n\n-cheap drinks for HH or otherwise, yay!\n-cool bartender who rocked his look\n-I had no alcohol-containing drinks there, just ginger..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], [], []]}
{"id": "-R9t30RvsG-Rtiq63yuEmg", "text": ["I really enjoy the Crescent. It's spacious, clean, and for old school sports bar patrons . Televisions everywhere, both pool tables and video games. Staff...", "I am trying to like this place. It isn't working. Every time I come here, they do something to make me mad. Maybe I need anger management lol.\n\nThis time......", "This will be my last visit to this bar. The waitress, Julie, was clearly overwhelmed with the tables she had but tried to keep up. The food showed up- every..."], "rating": [5, 2, 1], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "9qOhDtUP5OMk2w-CHQxcTw", "text": ["For those of you who know me, I'm a big foodie. I've traveled across several countries to dine in elegance, and to discover the smallest local gems that...", "Where do I start. I feel like we were just invited into a good friends home and served the most delicious home cooked meal. All of the food is made with...", "We really enjoyed our recent dinner at Epi's.  Chris is super friendly when she greets you at the door, and the whole experience makes you feel like you are..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.28], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["dinner"]]}
{"id": "l9QTHlTFmZhTw7Hdb1QyFA", "text": ["5 stars for HOSPITALITY! \nMy boyfriend and I were en route to Seattle from Dallas and decided to check this place out for dinner during our pit stop in...", "This place has the 'BEST' pho & eggrolls. The workers are short staffed (I believe...) but they put so much work and effort. I Highly recommend this place.", "My friend took me here today for my first time and I absolutely LOVED IT. The lady that served us was so sweet and nice. The food itself was delicious to..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner"], [], []]}
{"id": "bHPq-vQesglrIsvtkVdHrw", "text": ["This is the only Chinese authentic food. \nAmazingly delicious. \nNothing fancy but authentic. \nHowever, love the atmosphere with the soft music.", "SO GOOD!  This food is soooooo good and the noodles are made fresh!  I am only giving four stars because the wait time is long, the prices have gone up, and...", "Ordered delivery through Door Dash based on yelp reviews.  It's was totally okay but wasn't as great as I read about.  I ordered Pad Thai and an egg roll...."], "rating": [5, 4, 3], "TBscore": [0.37, 0.0, 0.65], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["chineese"], [], ["egg"]]}
{"id": "5C5v40wpZMYKBFvRJFD_pg", "text": ["So I come to Boise all the time. No matter if we stay in Boise or Meridian I like to order from this place. \n\nThe food is very good and the portions are...", "Normally packed for Thursday Thunder, the Boise Spectrum was a ghost town tonight, but it still offers a good variety of dining experiences all within a...", "If you think good Chinese food is one iteration after another of fried chicken drowned in gooey sauce - like Orange Chicken or Sesame Chicken or General's..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], ["chicken", "chineese"]]}
{"id": "qp6p-bx18FR3Djexu7sUuA", "text": ["This is my favorite Chinses restaurant i Boise!  I'm new in town & couldnt wait to find a Chinese restaurant that was willing to prepare food without MSG....", "Three stars because the service was fast and very friendly. The food was bland and lackluster. We ordered BBQ pork which was so dry that we think it had...", "This place is pretty good! I've ordered delivery twice from here and got the General Tong's Chicken which was super good. I also got the Chicken and..."], "rating": [5, 3, 4], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["chineese"], [], ["chicken"]]}
{"id": "neo3yvjRuRCp9tyq2DahUA", "text": ["* People I know seem to think this is the cat's meow as far as Chinese food. Decent food, pretty good service, but I've had much better Chinese food. The...", "Ordered delivery through Diner Dash.  Best almond chicken I have had in ages and that gets 5 stars!  Huge serving, yummy gravy, and so many almonds.  Also...", "Was in town for a business trip and was hankering for some Asian food. Came across this little gem. It's a bit more on the established side but the staff..."], "rating": [3, 5, 5], "TBscore": [0.25, 0.29, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["chineese"], ["chicken"], []]}
{"id": "qibDo7L7chTUKMMaMsXKzg", "text": ["Been here 4 times. The best Chinese restaurant I've tried out in Boise so far. No doubt dishes have been Americanized a little, yet they are surprisingly...", "When I arrived I wasn't sure if it was seat yourself or wait to be seated. I was taken to a table, made my order and my appetizer arrived. I had no eating...", "When Red Pavilion opened in mid 2016, a little over two years ago, it was connected in ownership to a Chinese food eatery with the same name in Mountain..."], "rating": [5, 3, 2], "TBscore": [0.32, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "6jCTcacVWUmnV0BNcIAKgA", "text": ["This is an excellent Mongolian BBQ place. They do a great job of cooking the ingredients evenly so that the meat isn't too overcooked and the veggies are...", "Um, what's up Idaho? I gave this a shot thinking it was fun to try something that doesn't exist back home but yikes I wish I didn't. There is no darn way in...", "My wife have been to couple of these Mongolian grills in the treasure valley. My wife is a big fan since the days during her first pregnancy in Carlsbad,..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "T7oDsacxvoHdHQmBZOjwuA", "text": ["My favorite Chinese restaurant in Idaho, by far. Good prices along with the fact that it's local helps, too!\n\nIf you go, and you should, try the Chicken Lo...", "Went here off of a friend's recommendation. So sorry we did. I actually went through the yelp reviews beforehand too!! It was so hit and miss that I decided...", "First time ordering and never again.  Egg Rolls were fried in old dirty oil, could not even tell what was inside them other than very dark whatever.  Orange..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["chicken", "chineese"], [], ["egg"]]}
{"id": "Xz7Wcc-C8JKFB4scBppLHg", "text": ["I'm surprised at the poor experiences of others.  I have found the food here to be good plentiful and fairly priced.  The place definitely lacks atmosphere...", "I had a couple of different menu items form here last night so I'm not too sure which item it is but I am super sick today and have major food poisoning....", "Worst Chinese food and service. I ordered chicken egg foo young, egg drop soup and a coke which cost $17.00 (before tip) \nThe dried up shredded chicken just..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, -0.38], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["egg", "chicken", "chineese"]]}
{"id": "IIpnIM1Wuf3oE9aqPeodew", "text": ["Updating my review after today's experience.  Quality seems to have dropped off as my lunch special's rice was vet dry, the small cup of soup was half...", "First off, the egg soup has corn in it and I mean a lot. It smelled like I opened a can of creamed corn and was completely unappealing. I've never seen corn...", "I can't say this is my favorite Chinese restaurant in town, but I LOVE their hot & sour soup. If you are a big fan of Chinese hot & sour soup, you've got to..."], "rating": [3, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [["lunch"], ["corn", "egg"], ["chineese"]]}
{"id": "B65v5G8kMbOz16YdLITHcA", "text": ["Travelling in the States includes at least one Thai meal! Being one of the first exotic ethnic food to be loved by the American general public, Thai Cuisine...", "I used to have a Thai roommate when I lived in Seattle and he would take me out to authentic Thai restaurants and he would sometimes cook for me and my...", "Our family's favorite night out. Massaman curry with tofu or chicken and volcano with seafood are both awesome!\n\nStaff is like family."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.3], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["american"], [], ["chicken"]]}
{"id": "q3nQcgx2KFYiAnTLfIx18w", "text": ["The food was decent, but nothing to write home about.\n\nThe service left something to be desired...  More specifically, the service left us desiring a refill...", "This place went down the drain. We used to order their lunch special #2 quite a bit and now they've really slacked off. There was no meat in the batter,...", "MMMM...Decent grub...\nWhite Chicken,Please...Check...\nDecent Portions...Check...\nTakeout...Everything accounted for...Check...\nYes! Chopsticks without..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [[], ["lunch"], []]}
{"id": "GxQqAlBts81cbP9h6rdluA", "text": ["I went to lunch here yesterday and it was quite good. The decor is a little run down but the service was great. This is your typical hole in the wall...", "Having had this repeatedly and in many different locations across the years, I've seen a number of different ways of offering this, including one place that...", "Ok I consider myself somewhat of a Mongolian snob, I have eaten at a lot of them all over the country. OK here is the disappointment. Having to provide 3..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["lunch"], [], []]}
{"id": "VLC9Nb_XBoMxBe146Bz2yg", "text": ["Great food, awful customer service. Don't expect the employees to do anything besides take your money, give you your bowl, and fry up your food. I've been...", "Just so-so for Mongolian.  If you're in the area and in a hurry worth a stop. Smaller selection of items than at non-express type eateries. Food tasted ok -...", "Last week, I visited my friend in Boise and she took me to this place. I really enjoyed the food. That was so amazing!!! There are many kinds of meat and..."], "rating": [2, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "bW8MxvFrRnZnJoU25dvdig", "text": ["The food is decent for what it is, chinese fast food. The service is just plain awful. Only one waitress does a good job. I think she only works friday and...", "So I'm a complete buzz kill when it comes to good Asian food. This place just so happens to be close to home so I figured I'd give it a try.  Tried the...", "I've had 3 experiences here, two times the person who I talked to was very rude and I left because she  just didn't seem like she wanted me there. And the..."], "rating": [2, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, -0.2], "keywords": [["chineese"], [], []]}
{"id": "r4khXlq-NMDxdEwG2KKfvg", "text": ["If you need or want Chinese food in your life, then look no further. Wok Fusion is the best Chinese restaurant in the Treasure Valley. They are a little...", "I'm here from out of town and felt like having Chinese food. I want a bit out of my way for this based on the reviews that I read here. Here's my...", "I took the family here this time.  We tried other dishes:. Chicken with broccoli, General Tsao's chicken (aka Orange Chicken), wonton soup war, Pork Chow..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, -0.38], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chineese"], ["chineese"], ["chicken"]]}
{"id": "byDF67_RYSmIOuQlwAD5KA", "text": ["Thai, so fly, flavor not shy, must try!\n\nAfter my massage last week, my massage therapist, who is now my friend, recommended that I pick up dinner to go for...", "First, I want to say the food we received and consumed was delicious and totally five star. We had spicy eggplant with beef, and lamb pad thai. The option...", "Went here for the first time today for lunch. Got the L10 Pepper Garlic with chicken. It was quite good and definitely garlicky as promised! I chose the..."], "rating": [5, 3, 4], "TBscore": [0.37, 0.42, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["dinner"], ["beef"], ["lunch", "chicken"]]}
{"id": "tVGHgilIsy1w4H4yvyjvAg", "text": ["Best sit-down Chinese food in the Treasure Valley, bar none.  This is a small, mom & pops restaurant, so YES, service can be a little slow if there are a...", "Went in with low expectations. Better than we thought it would be.  Not as good as it could be.  Not a place we would revisit on our own.  If suggested by...", "My favorite Chinese in the valley ! Always fresh and cooked to order .My family's once a week go to . The mandarin chicken and Mongolian beef are the best ...."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [["bar", "chineese"], [], ["beef", "chicken", "chineese"]]}
{"id": "BZNqCyMhZJREF8rfmrZ2bA", "text": ["It was good. The would was delicious. I wasn't fond of the chicken satay or egg rolls.", "Four of us stopped in for dinner on a Sunday night. The restaurant was busy, but we were seated quickly. We ordered a ton of food. The standouts were the...", "This place will always be my favorite. Located on Milwaukee St, in the shopping center across the street from the mall by the Ross.\n\nI love their red curry..."], "rating": [4, 4, 5], "TBscore": [0.37, 0.22, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["chicken", "egg"], ["dinner"], []]}
{"id": "aGlavYAbUGt944AimuGfVA", "text": ["We love this place! Good food, great service... popular place so we must not be only ones that think so. Delivery is good choice  as we like to avoid the...", "I am still searching for a descent Chinese restaurant in Idaho.  Although this is not an authentic one, I would give it a 3.5 star rating, if I could, and...", "I stopped here on the way home to grab dinner for my family. I order mandarin chicken, chicken fried rice, and chicken lo mein. My kids love Chinese food..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.25, -0.26], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], ["chineese"], ["dinner", "chicken", "chineese"]]}
{"id": "oCVcvXmtVJKAH8vpFCoVyg", "text": ["Not all Mongolian BBQ restaurants are the same.\n1 Mongolian steps it up a bit.\nYes, the ingredients are pretty much the same as other M-BBQ places in town,...", "Not a safe family friendly environment. \n\nIf I could give this place a negative star I would and not because of the quality of the food but more so for what...", "I really enjoy making this vegetarian \nThe sauce is always delicious and the veggies really fresh. Plus it's fun to watch! This is fantastic!"], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "f0Vqfu1dKzWE0QRnJHO3-A", "text": ["Great service with amazing smiles!!\n\nI had chow mein with broccoli beef and mushroom chicken today with veggie egg rolls as a side.  It was amazing!!\n\n\nI...", "Very Bad Experience, will not go there again! \n\nThe crew is very poorly trained and was unwilling to explain the various combinations and the pricing. I...", "Don't go here , someone from the drive thru stole my debit card information ( only person to handle my card within the month). When I called to speak to a..."], "rating": [5, 1, 1], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["beef", "chicken", "egg"], [], []]}
{"id": "KsoxCxPJvHqXnCyGKDhKxQ", "text": ["Yuuuuum. I'm a connoiseur of all duck dishes and the duck curry did not disappoint. It was a good sized portion and didn't break the bank (unlike duck...", "If we order take out, we usually order athai from Thai Basil.\n\nHubby is OBSESSED with their boneless honey roasted duck. Yes, it is a little fatty but the...", "I really wanted to like this place, but after two attempts and two misses I'm giving up. \n\nTheir online ordering system is pretty flawed. I got out of a..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "49dVbKxmhJ08KGH--9getA", "text": ["Finally found you guys!! Your broth is really REALLY REALLY delicious! It's been a while since I've had as good. However your noodles are sort of a let...", "Get the Tonkotsu Ramen! From the business website:\n\"Our most popular ramen. Made from a slow-cooked pork-based bone broth from boiling ground-up pork bones...", "I've come to have Tonkotsu ramen for 3 times. The cooking wasn't very consistent. The pork belly was super hard and dry when I came for the first time so I..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "6dVaWHvm8YEw11eHgDH2eQ", "text": ["My wife and I have ate here twice. Each time has been great and we are finally figuring out what the best spicy scale is for us.\n\nStaff is friendly and...", "2nd visit and glad to see improvements from the last time. The music/noise level is much more reasonable and   they've streamlined the counter process to...", "Good food with a fun atmosphere. Usually pretty quiet, which is great. \n\nI really like their tofu, and it's one of the few places where you can get really..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "LPgDe2lagIX6CfwsnLMiYQ", "text": ["There was one customer when we walked in. That is usually a hint right? But I thought, it IS mid-week and this IS Idaho - People don't eat out nearly as...", "Authentic Vietnamese food. This is where I always get my Pho. It works every time and I feel better in 1-2 days. They also have sandwiches and fresh spring...", "Very nice people.  The lady (she's always there) is the owner and very attentive.  The food is hit and miss, but when it's good, it's awesome.  My favorite..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], ["sandwich"], []]}
{"id": "WGPpkFUc9cWqUFgIaNFKBA", "text": ["Finally a healthier fast food place.  Meats and veggies plus you can add avocado for some fats.  There sauces give the food a little extra lift especially...", "You guys KNOW I love to eat  Have you been to Flame Broiler yet?!  If you know I like to eat, you know I also like to indulge  BUT I also am not a big cook,...", "Love love love flame broiler, the owner is just the nicest lady ever she's so kind and sweet. The food is super delicious I probably go at least once a..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "eR5dxMBiFXqQbv8Kego3FA", "text": ["OMG Freakin Amazing food!!!!! I was in Meridian for work and was told about this place by a co-worker.  The staff are very friendly and took the time to...", "Tried for the first time today. Got a manini plate. I had the park rice, which is delicious, and the mac salad, standard, as sides. I ordered the katsu...", "Good is ok for me, I wasn't impressed with the tacos and I know everyone loves them but it just tasted bland to me. I would rather have the bowls with the..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.51], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], ["tacos"]]}
{"id": "vtYjO_RZjSZWbwwN-AgqGg", "text": ["Really really enjoyed my meal. Best Mac and cheese I've had in a long time. Loved the option of the cute side salad.", "We walked in and we were greeted by a very nice lady. She explained the menu to us, answered all of our questions. \nWe received our food within 10 minutes...", "Back again for the truffle mac! I've been to other locations and made an attempt to at least try everything once, almost there! Definitely a great twist on..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "HjLYCBxJti8V-hsP_yVZ3w", "text": ["The food and service at the Taj Mahal in Boise, Idaho is excellent! \nThe owners go above and beyond making it an exceptional dining experience. If you like...", "Taj Mahal was ultimately quite a disappointment. The food was decent, but for the prices at dinner I would expect larger servings. I will say that the...", "It looks great from the front \nIt took over one hour to get my starter and a beer and to me it wasent busy, 22 people in the resturant but they apologised..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], ["dinner"], []]}
{"id": "zTZTx7_vhdvGk8bBe3vd3w", "text": ["We had a really good dinner tonight at Madhuban.  We have been avoiding this place, despite the good reviews and all the positive informal recommendations...", "Pleasant Indian restaurant near Boise! \n\nFood is delicious here. Got goat vindaloo, lamb korma, chicken tikka masala, and don't forget the garlic naan...", "Tried Madhuban for lunch recently at the suggestion of a friend. The shopping center is under construction, so it's a little tricky getting to the front..."], "rating": [4, 5, 3], "TBscore": [0.54, 0.31, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["dinner"], ["chicken", "indian"], ["lunch"]]}
{"id": "O9hmPhs7NFjpwjwN6Gtyag", "text": ["I rarely write reviews but I've been coming to this restaurant for months. I'm finally giving them a review. I have dinner here on Friday evenings when I'm...", "I was pretty excited to try Masala Bistro because of the reviews on Yelp. As always on Yelp you never know who paid for good reviews this place paid for...", "Delicious. Can we talk about the Cheese Naan, Chicken Tikka Masala, and Samosas?! These were the items on the menu I opted to try and all of them were..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["dinner"], [], ["chicken"]]}
{"id": "RM2frvRtz5LgdBZEZexRkQ", "text": ["First timer to this place... well actually to Indian food in general. My in laws were in town visiting. We were trying to find somewhere new for dinner, and...", "mild, wide variety, great for lunch buffet\n\nI've been here twice now for the lunch buffet. I only go to restaurant buffets for lunch, as that's just...", "Love love love this Indian restaurant!  Certainly one of the best in Boise!  Quality ingredients, great flavors, always delicious meals.  Very happy to have..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.26, 0.7], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["dinner", "indian"], ["lunch"], ["indian"]]}
{"id": "Ojo9FRfQ5Ruuv35RK2D1AQ", "text": ["Excellent, friendly service!  Extensive menu with many choices and accurate descriptions of the dishes, including many photos of actual plates.  My wife had...", "After almost 2 years in Idaho I have finally found authentic Mexican food!!! I owe a huge thank you to fellow Yelper, Greg D! He recommended Mi Casa to me...", "First off I recommend this place and to the owners, we miss seeing you but such is life and owning a business I suppose. \nI liked it better when they first..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["mexican"], []]}
{"id": "YmNSyqlJkaNg9Jl-ed4Dug", "text": ["I've been to a few different Mexican restaurants in the valley and this is still my top choice. We moved here from AZ and finding a good Mexican Restaurant...", "Warm chips and salsa...maybe I should say hot chips and salsa. Had a chicken enchilada and shredded beef taco combo plate. While nothing was wrong with the...", "Had a great lunch experience at Casa Mexico and can't wait to go back!  My family and I have dined at this location several times and it is one of our..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["mexican"], ["beef", "chicken"], ["lunch"]]}
{"id": "tAv_5GiXTzw7277C7MHr-Q", "text": ["I can only speak to the lunch buffet. I have eaten lunch here many times over the years. If you are looking for descent mexican fare, and want to get your...", "My daughter and I stopped by for the Lunch Buffet at 1:30. Took 10 minutes to get a drink or any chips. We went to the Buffet and half of the food was gone...", "Way too expensive, 3 tacos $13-14, everything super pricey. Prices not worth the food you get."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["mexican", "lunch"], ["lunch"], ["tacos"]]}
{"id": "bnf_heNHK8s9RUc0prursQ", "text": ["This is my 3rd visit here and it is always good. Best beans in the valley. Wait staff is always nice. Great margaritas.", "83rd person to review this Jalapeno's Bar and Grill located near Best Buy on Franklin Rd in Boise. This is my 425th Yelp Review. \n\nI am going to agree with...", "One of my favorite restaurants in town. \nLove their chips, salsa and bean dip for starters, BEST margaritas in town, and never usually stray from their..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.55, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["bar"], []]}
{"id": "uhYIm8v-y22avn9IIkPsTg", "text": ["My husband and I went in for a late evening supper and were not disappointed,.\nFrom the table guacamole appetizer which is guacamole made at your table...", "Love it when I walk in and 90% of the patrons in the place are Mexican or Hispanic. I know it's going to be good food. I know it will be authentic. I know I...", "We had a bogo coupon for this place, so we decided to give it a try. When we walked in the front door it looks like your typical mexican restaurant as far..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["mexican"], ["mexican"]]}
{"id": "DCeJCt69MiPfGb0Bmvb_Kg", "text": ["Great place and great service! Jessica was amazing and our food was good. Large portions and the fried ice cream was the perfect ending!", "Just recently visited from Arizona.. food was so gringo.. cheap but not worth the waste ... Nobody ate.. no beer selection.. no real margaritas just Jose...", "I've come here twice now, and both visits were motivated by the same thing--a chilly autumn day and a craving for some hot tortilla soup!\n\nThe Vibes:\nCasa..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "mx63XH-3ky3Voak73Uoehw", "text": ["I decided to stop by and try Chapala again even though I have had some issues with customer service in the past at this location. \nMy waitress was very...", "We had a great meal, food was hot, more than enough to take home for another meal! Service could have been faster, was about 4p.m., so not busy. Other than...", "Food is not so bueno.  The chicken inside the enchilada was old and not good, rice was ok, one bottle of beer was way overpriced."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], [], ["chicken"]]}
{"id": "bzvxt0sP9OMwwks1vLSzKw", "text": ["This review is for catering off-site.\n\nI facilitate large quarterly meetings for the state and this place was suggested to me as a lunch option.\n\nThe...", "Food was mediocre, margaritas were gross, and service was below average.\n\nI got the veggie burrito that they forgot to put guacamole and sour cream on. It...", "This was unpleasant AT BEST! Went for lunch with my daughter. The restaurant was not clean. There were chips and napkins all over the floor. Our table we..."], "rating": [5, 3, 1], "TBscore": [0.21, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["lunch"], [], ["lunch"]]}
{"id": "OwtU8ira23mQDHeeVvA2Hg", "text": ["This little gem is a hole in wall type of deal. ALWAYS packed and always delicious. The margaritas are legit and yummy! \nThe food takes a little while to...", "We came from Wyoming to visit the new digs.  The decor was interest for A Mexican personality.  Set in the bar, unforuntily to close to the door....", "A fall from grace!\n\nOnce our go to for consistent good food. Granted they just relocated and are still adjusting to the new location but you have to do at..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], ["mexican", "bar"], []]}
{"id": "bFnix_ymPvWttw1INbNq5Q", "text": ["This place was a pleasant surprise.   I missed Cinco de Mayo, but their sign was still up on seis, so I stopped in.  \n\nClean and pleasant restaurant. \nYou...", "Service is super friendly and attentive! Very casual and roomy interior.\nYou get chips, salsa, and beans upon seating. Nothing special with the salsa and...", "For sure one of the best TexMex restaurants that I've been to, so much so that when we are in Boise, this is our favorite spot!! The salsa is great and they..."], "rating": [3, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "q_9Me8WSq7X1t0McNzSW2g", "text": ["My new favorite authentic family Mexican restaurant in Boise!  Their albondigas soup is spot on and everything I had was delicious and perfectly prepared.", "I had this place delivered to us at work from uber eats. It did take 2 hours. We warmed up the food and it was still awful. I will not be ordering again.", "Met some friends here for Taco Tuesday !! They have a taco bar set up, and it's $8.95 for all you can eat. The bar consists of hard corn tortilla shells,..."], "rating": [5, 1, 4], "TBscore": [0.52, 0.0, -0.29], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["mexican"], [], ["bar", "corn"]]}
{"id": "uIK9cFiBkixiBLu4yXRQcg", "text": ["I've had Los Betos a few times throughout the years - mostly late at night when hunger pangs/burrito cravings become louder than any voice of reason that...", "We use to love eating here when they were at the old Fairview location. It was good, authentic, Mexican food. Now, the past two times we have eaten there,...", "27/7 real mexi! Yummy Mexican food at yummy prices. You'll always find a good value at Los Betos. $2 tacos are awesome! I haven't eaten everything on the..."], "rating": [3, 1, 4], "TBscore": [0.0, 0.26, 0.49], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [[], ["mexican"], ["mexican", "tacos"]]}
{"id": "9tsNyOv3ZI_gevi4r9C0lQ", "text": ["In Idaho I did not expect much because I live on the west coast where the best Mexican food on the planet exists.\n\nIt is not up to the best west coast...", "One of the worst Mexican meals I've had to date. The fish tacos were sad. I'm sure they meant well when they designed the menu item but what translated was...", "Another Margarita fail.. a good Mexican restaurant should also have good margaritas.. not pre-mixed Jose Cuervo garbage. If you're looking for good drinks..."], "rating": [4, 2, 1], "TBscore": [0.47, -0.25, 0.32], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["mexican"], ["mexican", "tacos"], ["mexican"]]}
{"id": "bDWomEUt-uOBYk5m068JPA", "text": ["2 stars:\n1 for location.\n1 for bacon... not that it's particularly great bacon... just the fact that they serve it at all gets them a star.\n\nMy husband and...", "Slow and female cook would rather joke around then do her job. Slow service and slow getting ur food. Would not recommend at all", "We had breakfast here the other weekend and it was pretty enjoyable. The service was good and the diner atmosphere was nice. The food came rather quick and..."], "rating": [2, 1, 4], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [-0.2, -0.6, 0.6], "keywords": [[], [], ["breakfast"]]}
{"id": "ZegbzWP56yvDzwCI5FHOVw", "text": ["My mom and I enjoyed our last time together before I moved to California at the bar with our PHENOMENAL bartender, Katie. She is such a joy to be around and...", "Fantastic service, thanks to Angela at the bar.  Fish and Chips were good too!  Cheers", "The food was quite good, the beer selection was very mediocre, but the service from Angela was the best I've had in years which is why I gave it four stars."], "rating": [5, 5, 4], "TBscore": [0.36, 0.49, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "GWykf3nN8kiW-Nv3pIeKeg", "text": ["BEST BLOODY MARYS EVER!! Ask for Lexi for makes the best!!\nSuper great food!!!\nGreat atmosphere!\nSuper friendly. A must try!!!", "One of our favorite \"Sunday Funday\" stops. Well really, it's a great stop in general. No need to golf at this place, but if you wanted to swing a few clubs...", "Went to Sandbagger just for the Friday night prime rib. Not a disappointment! Our dinnerscwere big, the prime rib cooked perfectly, very tender and very..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "CqUyK5sLX1hG15_dJAK5Nw", "text": ["Great Lager, Great team, got some great sounding beers coming soon! Back patio is legit!", "We went to grand opening. Had the American lager beer made here and it was better than I expected. We look forward to coming again when construction is done...", "Incredibly friendly and passionate people which is reflected in the tasty beer selection. Definitely a favorite."], "rating": [5, 4, 5], "TBscore": [0.0, 0.23, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["american"], []]}
{"id": "6VDSx-ghQwbYvMaS0fz9xw", "text": ["Have been here several times, and once in the Village (not a good visit). Really love the atmosphere of the place. I won't go into detail about how it...", "*Vino*, vidi, vici. \n\nThat's how you'll feel after having 1+ flights of wine from among the staggering array of offerings here, from around the world, at...", "Talk about a cultivated, classy corner of the city! For this special experience you'll pay for it, but if cozy, classy sophistication is what you're after,..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "AsYatpyVqR2jUTOvs7W2_w", "text": ["Happy to find a traditional style Italian restaurant. I am a huge fan of Chicken Parm, and I was very happy with the dish here. I ordered it with the Tuscan...", "Mediocre food, the wait staff was far below average and just not a good experience. Much better Italian food at Gino's or Bella Aquila. Disappointed that...", "We just got home from a nice dinner meal at daVinci's.  My wife picked out tonight's dinner location on a whim, so off to Eagle we went, with visions of..."], "rating": [4, 2, 3], "TBscore": [0.27, 0.0, 0.6], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["chicken", "italian"], ["italian"], ["dinner"]]}
{"id": "7uzaR-kdTNOG5-0tVdhA7g", "text": ["Hands down, best Pizza Hut in town! \nThey have a friendly staff and hot food! Being next to the only movie store in town also makes for a great night!", "Very poor service. Took more than 40 minutes to make a pepperoni pizza I ordered 20 minutes prior to picking up. Very unimpressed. Rude service. The cashier...", "Ordered on the phone and changed our mind on the order on our way to pick up. Michael, was very accommodating and was patient and took excellent care of us...."], "rating": [5, 1, 5], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["pizza"], ["pizza"], []]}
{"id": "H_fAst-jpZFcRzqcweNKHA", "text": ["Emilee was absolutely fantastic! My wedding pies were beautiful, delicious, and well packaged. She made sure to let me know what I what need to pick them up...", "This bakery is amazing. We ordered our wedding cake here and it turned out better than we could have expected. We had a rustic wedding and the cake was a...", "I received the best customer service from Emilee at Flour Child! I needed a Hawaiian themed cake for my Mom. I was surprising her with a cruise this year to..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.33, 0.85], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["cake"], ["cake"]]}
{"id": "3GDLoVYrpSCE-0wuPPrweg", "text": ["6 stars for Kristina!  Her cakes are beautiful, delicious and creative.  She has done now each of my kids' birthday cakes according to their wishes, and...", "Kristina is a delight to work with, she is incredibly accommodating and makes the most delicious sweets! I am incredibly extra and had two wedding...", "I can not boast enough about Kristina and her super yummy and ridiculously adorable cakes! This lady has a true talent for design and aims to please with..."], "rating": [5, 5, 5], "TBscore": [0.78, 0.0, 0.33], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], [], ["cake"]]}
{"id": "y26un7khjB4X0iv_XMT8Nw", "text": ["So I found the cake ballers while visiting my favorite candle shop (Lit &!Co.) at the wintry market. They were neighbors so I gave them a shot. The rest is...", "Let's start with the good:\nPre pick up Communication via email was great.  I told them specifically what I wanted (with actual pictures) and she clarified...", "I could see someone who has never had a cake ball from Cake Ballers drastically underestimating the power of those little bites of yumminess.  \nLook at the..."], "rating": [5, 2, 5], "TBscore": [0.62, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["cake"], [], ["cake"]]}
{"id": "AxrXjreBrscFUU62hoWnIw", "text": ["I was so happy with our wedding cake and desserts! Shantelle listened to my vision and delivered! The cake, cupcakes, brownies, and cookie dough were...", "We love Boise Cakery. We got a cake for valentines and we did a custom cake for my 30th birthday. The cakes are always delicious and very high quality....", "Absolutely one of the best cakes we've ever had.  We ordered 2 different 6\" cakes for our mother's 70th birthday (because the flavors looked so amazing that..."], "rating": [5, 5, 5], "TBscore": [1.0, 0.57, 0.45], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "EDaEarTGJfoBWtBNQy4R1g", "text": ["Can these cakes BE any better???? Haven't had a bad one yet!! I freaking love this place!! All the flavors are delectable!!!", "Apparently the customers time isn't valuable. Think I could call in a cake? Nope. Can I call in a cake if I pay over the phone? Nope. Any order has to be...", "love this place so much! the cake is just so soft and fresh and flavorful - i just love every single kind i have tried (which is most of them)! my coworker..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "FviwMEmIA0K3mwcetiSvTw", "text": ["I've ordered several times from this company before.  I called 3 times to inquire about ordering yet another cake. When I couldn't get ahold of anyone I...", "I am writing this review after our wedding celebration by 6 months.  Why?  Because not all things go perfectly.  Greg came highly recommended for our event...", "Awesome cakes!\nExtremly Professional staff very quick to respond and customize to your liking.\nBeautiful and very delicious cakes \nI recommend the Idaho..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.68], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [["cake"], [], ["cake"]]}
{"id": "a-nSAR-9Hf8SK3LoWcuF9Q", "text": ["I can dig it. It satisfies the sweet tooth and does exactly what ice cream is supposed to do!\n\nStopped in and tried a few different flavors of ice cream...", "You can easily get yourself in trouble at this place, because everything looks so good and the sizes appear to be smaller than they really are. Their...", "It was an \"eating my emotions\" kind of day and ended up here for lunch....\n\nGot myself the one with cookie dough, can't remember the name. \n\nAmazing...."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "vD9_8q3Nrm1BrWN1gQTnPw", "text": ["This place is so neat! If you want to be entertained while getting ice cream, then loook no further. \n\nStaff-  so nice and...", "Wont be going back unfortunately. The ice cream was good and kids enjoyed the freezing process, but too many negatives. Store was under staffed and the two...", "The concept of this place is really great. I have seen it done in other countries and it is way better. The teenagers working there are not really that..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "G-OwBg3doMu8CSz5Gy1Vew", "text": ["Yesterday, we decided to cruise through the drive through on the way home to get our kids a treat. We ordered at the speaker, finding the woman that was...", "Good ice cream! Typical for a Dairy Queen. Only complaint is the drive through. It isn't very well situated in comparison to the building. Overall good ice...", "I wish I could review this place in 2 categories. \n\nFirst. Bakery. And to be specific, Brittany, the cake goddess. 3rd year in a row getting my son's ice..."], "rating": [1, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [[], [], ["cake"]]}
{"id": "kbzYUn3C1pMmqIYTyOUVFQ", "text": ["Updating my review to let you all in on a little secret: they have the best return policy, EVER.\n\nI recently bought make up from here, and after using it...", "I absolutely love this store. For years I was so anti-Whole Foods. That was kinda crazy lol. They have the best fruits and vegetables and I was happy to...", "HQ in Austin; one of the prominent early mainstream leaders of the healthiest foods movement\n\nI always inwardly groan and get a little irritated when people..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "JtE-xxZRBYyWKWaooUye9A", "text": ["I'm not sure why this place is only getting 3stars...good food and good service. \n\nI had the 3-meat plate, pork ribs, beef brisket, and pulled pork. I also...", "I'm a fan of bbq pork ribs but not from here! I just ordered the ribs with 2 sides. One Mac and cheese the other creamy spinach. I got these really soggy...", "I am legit surprised this place is as good as it is!\n\nHusband wanted BBQ for Father's Day and we opted to try something new. Dangerous, I know.\n\nBecause our..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["beef"], [], []]}
{"id": "dDEcUbkCC1q-bsGOd2L8Pg", "text": ["I ordered the Hot Mama Hen wrap with ranch dressing. My review is in present tense, because I'm writing it as I eat. Typically, a wrap is a wrap no matter...", "P Ditty's was one of five food trucks at the Boise Food Truck Roundup at the botanical gardens. Now if you ask me, five food trucks does NOT a roundup make,...", "It was pretty bland, and reminded me a lot of Del Taco, except that it was more expensive than Del Taco :/\n\nOn the up side it's local and the guy was really..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "PWGcA2s9sf4iMb4dcLz6Hg", "text": ["Excellent BBQ.   Had the Beef brisket meal, pulled pork meal, set chicken meal.  \n\nThe Coleslaw & baked beans were also very good.  Defiantly the best BBQ...", "I was in Boise for a business trip. It was lunch time and I am lucky this restaurant came out on my yelp suggestions. \n\nThe Food: \nThe menu features...", "As far as chain bbq... it was okay. Great service and the place was clean, but who goes for service and clean when you are getting bbq. You really just want..."], "rating": [5, 4, 3], "TBscore": [0.58, 0.33, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["beef", "chicken"], ["lunch"], []]}
{"id": "n-CIOneE4RybJJQmp5bykg", "text": ["Steve catered a party at my hotel and did an amazing job, I didn't have to lift a finger. He was kind enough to let me sample his food and OMG sooo good!", "I like to visit Big K BBQ. There are many delicious eats on the menu. One of my favorites has been on the menu before and is making a return. It's known as...", "Wow, I come from a family of BBQ masters, and Big K BBQ is as close to home as they come. Steve's love of creating the tastiest brisket and ribs is off the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "qQtUsFWfgUsEu2kfaDoJLQ", "text": ["Rarely do I give 5 stars but this place is worthy of it, they are a small local meat shop offering expert knowledge and farm fresh meat. \n  I came in to...", "This place ripped me off. I was charged 6.87 per pound for goat meat. I got about 9 pound meat and almost 75% of my meat was bone. So I paid for the bone....", "Occurs to me that an entire generation or maybe two are unfamiliar with a honest to goodness butcher shop.  This is one.  It is also one of those long time..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "jtDTN8JfNk1vl2uLb2nHpw", "text": ["pho heaven!\n\nThis place is DY-NO-MITE!! Were it my neighborhood, I'd be here every week. I wouldn't change a thing about my chicken pho. Full-blown goodness...", "Dropped by this pho place on our way to Boise airport. The restaurant was mildly populated, playing soothing background jazz. TV on the wall was playing a...", "208 Pho & Vegan just opened another restaurant in the tiny Gary Lane Plaza at the busy intersection where W. State Street intersects Glenwood/Gary Lane...."], "rating": [5, 4, 4], "TBscore": [-0.6, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken"], [], []]}
{"id": "Bzsh379eU98B4IRDogy8Wg", "text": ["I mean, it's the Micron cafeteria, so why are you even reading this?  But surprisingly the food is pretty good.  Bonus: on Wednesday the small soup is...", "The Ramen and soup are always a hit. The salad bar is also a favorite.", "Decent food but the prices are high. A sandwich for $5? The one saving grace is the $1.05 cup of soup on Wednesdays. If you can stomach the chili it's..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], ["bar"], ["sandwich"]]}
{"id": "6hBy3r_MQTIf29DfM2y8_Q", "text": ["From the moment you walk in the door the customer service shines here... and then the food and beer back it up 100%! \n\nWe had a bit of everything from the...", "The ordering process is a nightmare. Several employees walked past us with no greeting as we stood there confused about what's happening. It's very...", "I went to this restaurant with good reviews in mind. I'd heard many good things and, even though I don't care for ribs, I decided to give it a try. I walked..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "3OO7ZAQa2sqUo2rzO3UanA", "text": ["One can only go without Pho for so long, and the craving starts!\n\nSince my trip from Vancouver, BC to Boise, ID I had gone without anything close to a bowl...", "It was about time I gave this place a try. It's very new and clean, I really dig the modern design of the place. Oddly enough it looks very similar to...", "First time here. It was deeelicious! \nClean, bright and open restaurant. \nBeautiful presentation of food. Fresh ingredients. Tasty and delicious!\nStaff was..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "U61GVlMhdnMPri2NJXHayQ", "text": ["We love authentic ethnic food. We go to Japan for sushi and Singapore for chicken rice. Luckily, we don't have to trek to the Middle East for real Iraqi...", "OK, let's start with the bad.  Atmosphere is pretty meh.  Other than the cool traditional seating along the North wall, the rest of the seating is pretty...", "Went back after reviewing other reviews and got the kabob plate. Place made a few changes to the menu and got rid of fries which I really liked since it..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sushi", "chicken"], [], []]}
{"id": "AzylMkpWl-OLWQLMKVRoVg", "text": ["Just had one of those, \"Where have you been all my life?\" moments this weekend when I came here. Then I realized I've been walking by this place for years...", "Meh....  it's ok.  The broth of the Pho' is pretty bland.  It's almost like they don't know about a spice called \"Chinese Five Spice\".    The other aspect...", "The Good: Attentive and friendly wait staff.  Diverse menu.  The peanut sauce that came with the Fresh Summer Rolls was really good.  The protein in the..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["chineese"], []]}
{"id": "bsRJY9hRr_p3PNZnxCqbjw", "text": ["The food was great. From the sweet potato fries, to the addition of brie and bacon jam (who even knew that was a thing?) on the turkey sandwich. I would go...", "I don't do reviews very often but this one merited it. Really overall terrible experience and we won't be back. To start with, took about 5 mins of us...", "This place has a great menu and vibe, but unfortunately the food and drinks aren't good. We went here with 2 other couples (6 total people) and everyone was..."], "rating": [4, 1, 2], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["turkey", "sandwich"], [], []]}
{"id": "jNbGTU9RJ_HK-O3tdo3hKA", "text": ["Seriously THE BEST THAI place in Boise! We love the food, the ambiance and the best thing is the two lovely owners!!!! Spicy fried rice is my favorite but...", "I can dig it.\n\nVibes: Nothing too crazy. Just a quaint, cozy little restaurant. Sort of dimly lit and kind of quiet. Not my favorite atmosphere-wise, but...", "I would have given 4 stars but the food delivery was off by 4 minutes. I received my dinner first then my wife received hers 4 minutes later.\nThe restaurant..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], ["dinner"]]}
{"id": "C4Tb9k29pPwUWQ-42Y3SMA", "text": ["This review is based on food, not service, as I was not with my husband when he ordered from the drive thru... it's probably been about a year since I've...", "I've never been treated so rudely at a FAST FOOD restaurant. The manager Alexis at the eagle and chinden location chose to concern herself with the PERSONAL...", "* This is probably the smallest, most plain Jack's I've been to. Attached to a Stinker fuel station, helps to draw in hungry customers who may not really..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "AbFmB9JxE40z4w2bO9XBgw", "text": ["* When I walked up to the counter, three smiling young ladies wearing wireless headsets were seeming waiting for someone to talk to. They did not welcome me...", "Abrupt, Adequate and Annoying.\n\nI don't enjoy writing negative reviews. I sincerely wish that any single negative review would not ever result in someone...", "Went in to try the Flaming hot Cheeto mac and cheese bites... Was not thanked was not told how much my change was going to be... Based on customer service..."], "rating": [3, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "21jWOqiOzcqHYFKqMEAczA", "text": ["We went through the drive-through at a little after 5 PM on a Tuesday night and the service was so fast and we got $1.29 chicken sandwiches to stave off the...", "I love Wendy's.  I love the quality and the healthy options. This is the WORST Wendy's experience I've ever had. I ordered 3 kids meals; two cheeseburger...", "Pretty good customer service and the drive thru times are pretty quick during the lunch rush.  They listen to you while you're placing your order and they..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["sandwich", "chicken"], ["burger"], ["lunch"]]}
{"id": "nTRmnPPZO-N2auMyEwlSNg", "text": ["I was a little nervous with the reviews but had nothing but fantastic service here and friendly employees, 10/10 would recommend to a friend", "Too long; didn't read? Conclusion: Don't go here. They'll get your order wrong even though the ingredients are in the title of the burger. \n\nI usually make...", "And become I can't see a way to get this less than one star. After waiting 30 minutes, I got a refund and left. This is by far the slowest service ever. You..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.27, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["burger"], []]}
{"id": "KCTq7SSxmdsUS4c3WHubYg", "text": ["Enjoyed the service I got today! The GM waited on me and took my order and she was amazing!\n\nI ordered a Famous Star with cheese and extra cheese, of course...", "Welp- Carls Jr. thanks for reminding me why we don't spend money at fast food restaurants & especially yours.  \n\nI enjoy knowing that Carls Jr. offers low...", "HOLY SHIT! This place is a nightmare. I think they are understaffed,  so I was patient. When I entered the woman was walking around apologizing to all the..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "UFa2v-FmElnYeD4tnMz5aQ", "text": ["The service has gotten better of late and the food is coming out quickly.\n\nThe drive thru people could maybe be a bit more friendly, but I have noticed a...", "Hey Carl's, the general public here. There is no one in your \"restaurant\" for a reason. You have a prime location and with no line I'm waiting over 10...", "The CJ breakfast is a little (understatement) greasy,  I would highly recommend something else unless you spent the last 6 hours on a drinking binge that..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], [], ["breakfast"]]}
{"id": "9bAYdUprc7jSNv_zY5C6cA", "text": ["I'm a Burger King fan...usually.  This one doesn't seem to have the friendliness I've found elsewhere.  Also, I was told they NEVER have decaf coffee....", "This was the worst visit I've ever had to a restaurant. And it was really disappointing because I love Burger King. The service was rude, we walked in and...", "I always get a great meal at this particular store. Being on the road I eat all kinds of terrible for that is bad for me. For some reason this place always..."], "rating": [2, 1, 4], "TBscore": [0.0, -0.35, 0.0], "normalisedRating": [-0.2, -0.6, 0.6], "keywords": [["burger"], ["burger"], []]}
{"id": "83xuDqpGbY0Oua455__ugw", "text": ["Just stopped in for a couple quick meals to go. The cashier was friendly and courteous and the food was ready to go in less than 5 minutes. The buns were...", "This Wendy's is consistent on their customer service and their food quality. They recently wentthrough a remodel (Summer 2017) and it looks very good on the...", "I ordered the North Pacific Cod Sandwich from this location. Just some background, I've had this sandwich before from another Wendy's location and it was..."], "rating": [3, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "nhq6rD6JlD2RtoTC1wCEPw", "text": ["Fun bar attached to a hotel. It's on the river and has a nice beach vibe. It connects to the hotel pool. Drinks are great as are the wings (mango BBQ is...", "This place tickles my happy cortex! Great drinks, good food and all outdoor seating on the greenbelt of the Boise River....YES PLEASE! \nI have to admit,...", "We went here after work and had dinner. I must say that although the location and Ambience was excellent right on the river, the food was only mediocre. I..."], "rating": [4, 4, 3], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["wings", "bar"], [], ["dinner"]]}
{"id": "ub8HSWJPsD_CqImzCehrZg", "text": ["I came here expecting a cheap, delicious, fast, and accurately made burger that looks just like the ones in the ads served to me with a genuine smile and a...", "Well they don't have the boneless bbq wings. I'm really bum about that. The drive thru is very slow so expect to wait 8-10 minutes for your food", "Great location, clean and neat inside. Have always had great customer service. And they work well with you when you use the App!"], "rating": [4, 3, 5], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["burger"], ["wings"], []]}
{"id": "BN-t1ClpbFyJ5vOhJUrmQw", "text": ["109th person to review Fresh off the Hook on Milwaukee in the Target and Ross Shopping Center. This should not be confused with the location that was closed...", "I hate giving less than stellar reviews but the food was just \"meh\" The shrimp bisque was a tasty tomato soup with bay shrimp floating in it. If I had...", "Have I said how much I detest coated French fries? Well, probably not, since I tend to avoid places that serve them, namely fast food joints.\n\nThe rockfish..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "gy3XoTsWd-DzQrr6moWi_g", "text": ["Yes, I'm giving 4 stars to this Sizzler. Yup. Sizzler. 4 stars. \n\nHas anyone NOT been to Sizzler?  I don't think there's anyone I know who doesn't know...", "It's pretty rare for me to give a single star review. I try to look for the positives in a business rather than focus on the negative, but unfortunately my...", "At dinner tonight with my mom and family friends, the waitress had a band-aid on her hand, flopping around as she poured more water.\n* Friend to Waitress-..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["dinner"]]}
