{"id": "7ZsmbGzW0L27Tjv5QCBLyw", "text": ["One of my favorite spots (pun intended) to do some work. I don't use Wifi when I'm out usually, so that's not something I worry about. My major issue is...", "I like the space, the coffee is good enough.  But needs more couches.  And a little better attention to hygiene.  There were some pretty dank corners of...", "This bad review is for this location on Elmwood only. Note to the staff- how hard would it be to make your customers feel welcome, especially when they try..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "AXO4ZCTlAB0kuc8TQsjFdA", "text": ["When I think of food you must try when you visit buffalo, Jims Chicken Finger sub is high on that list. Jims is great for lunch, dinner or late night after...", "Arrived in Buffalo late and needed to get some food. Apparently just about everything closes early in the area so we decided to come here. Reviews were...", "I love Jim's Steakout! It's so yummy I could eat it all the time: I always get a Buffalo Chicken Tender Sub on white bread with mild sauce and blue cheese..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["dinner", "chicken", "lunch"], [], ["chicken"]]}
{"id": "0PWa1u46M7eJKxYIFWvFrA", "text": ["We were seated quickly and glad we got there when we did because  then it got really crowded. The wings were really good. My husband and i agree that they...", "First time customer.  Ordered a simple large cheese, pepperoni and half mushroom pizza for take out.  I have to say, it looked awesome.  Thick crust,...", "Awesome little bar! Friendly attentive staff.\n\nIf you think you know the best pizza in western New York, you're wrong. But don't ever come here..... \nI want..."], "rating": [4, 3, 5], "TBscore": [0.43, 0.0, 0.27], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["wings"], ["pizza"], ["bar", "pizza"]]}
{"id": "wWdaF4vOHwWm3sag4HEPug", "text": ["The food was good, but the girls were better.\n\nIn all seriousness, the wings were great - 5/5. The fish and chips left a lot to be desired. The batter was...", "It had been a while since I've been in a Hooters and I'm not sure if all Hooter locations are like this but this one is definitely divey. Me and my sister...", "I usually really enjoy Hooters - I've been to them all over the world but this one is AWFUL! The fried pickles should be a shoe in, but they aren't. The..."], "rating": [3, 2, 1], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["wings"], [], []]}
{"id": "_H-GZZTEvYinDlEE5SHhlg", "text": ["As always HRC doesn't disappoint you. . The jumbo combo having chicken wings, egg roll, bruschetta , onion rings were simply amazing. The seasoning used on...", "I wish I could give it a zero.\nWe were seated promptly, but service horrible. Had appetizer but wings were not cooked fully. Rest of visit just...", "Got seated and ordered our food. The nachos were so dry. There were barely any topping on them. Additionally, service was either very slow or really poor...."], "rating": [5, 1, 2], "TBscore": [0.0, -1.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["chicken", "egg", "wings"], ["wings"], []]}
{"id": "7dZx172mKFb-fP7oFL-I-Q", "text": ["Excellent service and delicious food! I took my grandfather here while he was visiting in NY and we split a NY cheese board and a yummy salad with THE BEST...", "TERRIBLE SERVICE. If I could give no stars I would. \n\nTo start off, we (only two of us) waited to be seated near the hostesses while they were talking bad...", "Food was not good.\nGreat view of the fog and mist and you could hear the falls...\nPrice was high for amount of food and the quality was poor.\nOur waitress..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "AHJH4-Yz9gWW6-XEMprmWw", "text": ["Came here yesterday and had a very good sandwich (to go). I had an Italian cold cut combo, on a toasted bun with lettuce , tomato, onion, oil and vinegar....", "The subs are the bomb!, I drove from Cheektowaga tonight and brought a friend with me to get the wings, I ordered double hot wings for $12.49 and my friend...", "I can't even give this place one star. We called for a delivery of pizza and wings and were told \"within the hour\". An hour and a half later we called to..."], "rating": [3, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, -0.6], "keywords": [["italian", "sandwich"], ["wings"], ["pizza", "wings"]]}
{"id": "KW_HJzMK7TyvmVxKprUM1g", "text": ["Me and my kids went here for lunch and it was pretty good. The onion rings were really good, and went well with the bbq sauce. The only problem with them...", "Carside parking says ten minute limit I'm going on 20 sitting here waiting for my food...\n\nOK pushing 30 mins now.... This is fucked up. Never coming here...", "Went to Applebee's last weekend , waited for a few minutes to get seated , no problem , got menu looked at prices for drinks and food items , decided with..."], "rating": [4, 1, 1], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["lunch"], [], []]}
{"id": "Du5SNDrvBS1-Cf44GXIn6g", "text": ["I couldn't believe there was an Andersons in Buffalo that I haven't been to, but here it is.\n\nYes, Anderson's is a chain, but it's a WNY chain, and there's...", "Went there a couple days ago they under cooked my meat and put mayo  when they weren't supposed to. Today I tried to claim my burger that they messed up on...", "Ice cream was very expensive.   Ordered a banana split without the strawberries pineapple or nuts and asked for more banana and they charged me for it. Gee..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], ["burger"], []]}
{"id": "uRU48rdEfPEoO4DRqXYPQA", "text": ["It was excellent ! Started out with complimentary fresh hot out of the oven bread and kept getting better! The prime rib flat bread had a lot of shaved...", "Have been here several times.....always good. The warm bread & dipping oil is always a nice start. On my last visit I tried the crab stuffed broiled fish,...", "My boyfriend and I decided to try this place after being recommended by his family. We started with the Calamari, which came with a lot! We also had the..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "L_VZ5JxmKxNpGvGKStXarw", "text": ["I ate the ice cream so quickly that I forgot to take a picture. \n\nI ordered a twist with sprinkles and it 'hit the spot.' It was creamy and delicious. I...", "Have been going to Anderson's since I was a child, back when they had only soft serve at a single location on Sheridan Drive.  I now appreciate the full...", "Anderson's has been a staple for me since I was a child and it has not yet disappointed me. Now that I am older and refined, I have graduated from getting..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "8DsDc9k3E-0Dk1eRVasdgQ", "text": ["Brand new construction.  Nice place even a tv and fireplace.  Same food and pretty good service.  Instead of a number they take your name.  Getting a little...", "Scene: the Drive-Thru.\n\nThe hero orders two fries.\n\nOrder is delivered after a delay.\n\nWindow closes.\n\nHero checks bag. No ketchup.\n\nHe to knocks on...", "Came in for the best fast food burgers in the world. Five dudes? Nahhh. The king or the clown? Nahhhh. Wendy's is where it's at. I met my boy Chris here..."], "rating": [3, 2, 5], "TBscore": [0.0, 0.0, 0.6], "normalisedRating": [0.2, -0.2, 1.0], "keywords": [[], [], ["burger"]]}
{"id": "fW8MROzEitgpQGAfk0knDg", "text": ["Haven't been to this establishment in over a decade. It had changed a lot and I was very impressed. The decor was very American pride forward. Didn't get a...", "My son and I were heading to a comedy night on Friday and thought a \"quick\" burger at Red Robin would be a good start to the evening.  How wrong I was....", "WOW seriously, don't come here. BLACK LISTED, I won't come back and neither will my family. Such a shame, I can't even say its a chain problem because the..."], "rating": [5, 2, 1], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["american"], ["burger"], []]}
{"id": "RrzLoCEDCE5J2KOdvzuV4Q", "text": ["Went out with an old roommate from my DC years last night. This place sits across from the famous Nietzsches music club. Really a wonderful funky...", "I ordered via SkipTheDishes, so this isn't a review on service or experience. \n\nIn one word? Underwhelming. \n\nI ordered the catfish po'boy with some really...", "This is THE BAR to go to on the Allen bar crawl. Mind you, I've never had the food so I can't comment on that but the drinks are everything!\n\nIf you're..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "X1nqV_PTJJH1mVCOQcF8Sg", "text": ["I wish the mall had a bit more healthy quick food options, but since they don't I always find myself here.  Which isn't a bad thing because I like five...", "I've dated a lot more than 5 Guys, but if guys were as talented as these burgers I'd never date one again.\n\nOne of the worst chains imaginable because it is...", "I was looking for a quick bite at the mall that wasn't just food court food so I decided to try Five Guys. Walking in I was a little put off by the peanut..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], ["burger"], []]}
{"id": "ndAeFK3tSbI0IjIaeujLjA", "text": ["The Brick House Tavern & Tap is a nice and huge tavern! The bar area is nice to sit at and the family seating is also nice. It's so spacious you don't have...", "Very cool place. I really enjoyed the ambiance. The couches as seats by the big fire place was a really a nice touch and provides a unique dining...", "The bf wanted to hit up a nice brunch spot to watch the World Cup, we saw Brick House on yelp and remembered my dad raving about this place.. i guess he..."], "rating": [5, 4, 4], "TBscore": [0.58, 0.0, 0.6], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], [], ["brunch"]]}
{"id": "LWNLaJWOv2WA7Ifq1cbdxA", "text": ["Being a recent transplant to Buffalo, it was inevitable that I'd try Ted's Hot Dog's, and more likely sooner than later.  I didn't even make it a month...", "We visited here during our vacation to Niagara Falls based on the superb reviews and we're so glad that we did!\n\nWe wanted to try a little bit of everything...", "Though like on somewhat of a lesser known scale Ted's Hot Dogs is very much a Buffalo institution as are the Buffalo Wings of Anchor's Tavern. Their Shalens..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["wings"]]}
{"id": "uSHYYHrOQerv_GFMzQv68A", "text": ["What a pleasure! Food was awesome. My husband and I had 2 foot long dogs, curly fries and a creamsicle milkshake. Everything was excellent. But the beat...", "Driving back to Rochester from Niagara, this is a must stop. Got the foot long with mustard and pickle, foot long with chili and cheese, curly q fries and...", "Another top notch experience at Louie's Foot Long Hot Dogs....wow! Everything is cooked to order, comes out piping hot and delicious! Everybody who works at..."], "rating": [5, 5, 5], "TBscore": [0.65, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["milk shake"], [], []]}
{"id": "QjudX3aUTlu7ERZ0fh2N5g", "text": ["Nice spot to have breakfast now and then, Food comes quick and prices are great. Can't ask for more", "Average hot dog joint. This place was good when you're in a pinch, and close to it, but I prefer other hot dog places in Buffalo. \n\nOn this date I ordered a...", "A Buffalo Coney Island.  More like Detroit style Coney than NYC.  That's a good thing.  The Texas Hot Sauce is basically a no-beans chili.  Good place for a..."], "rating": [5, 3, 4], "TBscore": [0.56, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["breakfast"], [], []]}
{"id": "qCjy2FjDt3ad9c9UCXxWRg", "text": ["Great Italian Sausage!  Greek fries were delicious too!  Big portions, quality food.  Restaurant is very clean and neat.  Friendly service too.  We'll be back!", "As I was driving south on I-190 my passenger blurted out that we have to stop at this hot dog place just off the Tonawanda Expressway. The exit was just 500...", "Sullivan's is the type of place, that reminds you of your favorite childhood memories. Having burgers, hotdogs and even Perry's ice cream at the local..."], "rating": [5, 4, 4], "TBscore": [0.33, 0.0, 0.25], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["italian"], [], ["burger", "hotdog"]]}
{"id": "1OSb5r9_5GLN6BEj4Cy6HQ", "text": ["Grabbed lunch today here and enjoyed the experience. Sahlen's are a buffalo brand hot dog that I definitely enjoy and that's what they use. The chili was...", "I just went to pick up an order for my hair stylist which was called in at 2pm. I arrived at about 2:15, waited in line for about 7 minutes because the 2...", "Long before they discovered the Mississippi River's path to the Columbia River and the West of the USA, Louies & Clark, the explorers, decided to open a hot..."], "rating": [4, 1, 5], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["lunch"], [], []]}
{"id": "r2I2IvtyoC78zTiaTJ9Jnw", "text": ["Tony's is a place I frequented a lot in the summer as a child with a big family and many mouths to feed! I am always driving by so over the weekend, I...", "I've been coming to Tony's my whole life. As a kid, dad would take me and we'd get to play mini golf, go-kart, and pick a flavor of ice cream. \n\nTony's is...", "Great service. Delicious chili dogs. Thick chocolate shack. But not so thick you can't drink it. Plenty of seating. We will be back."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "1YXdHh_CcetcHbc6sxsxNw", "text": ["I blame my out of town visitors.\nWhenever anyone visits from away, they always want Buffalo's big 6 foods.\n1. Do I have to tell you? Elmo's, Duff's and...", "Still excellent. I finally got around to trying the burgers.  Now I order the burger more often than the dogs.  Burgers are grilled to perfection over...", "first time trying Teds since i moved to buffalo. i gotta say i didnt have high hopes as i thought it is a hotdog place what can be so special about it. but..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.5, 0.26], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["burger"], ["hotdog"]]}
{"id": "uSNlpq6l3-nRiR9nEp-fSw", "text": ["This is the best Texas sauce in Buffalo. It's also an old diner - you have to judge it as such. \n\nThe food is amazing, service is quick. That's all that...", "Best beef and barley soup I've ever had, Texas red hots dog was good with its slightly spicy sauce, mustard, and onions.  Egg salad sandwich was big and...", "The quintessential \"hole in the wall\" greasy spoon.  You can get \"slime dogs\" anywhere in Buffalo but not everyone uses Sahlens.  Those make the best \"slime..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.31, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["sandwich", "egg", "beef"], []]}
{"id": "vk023fD7nTMWiH5NuuCYFA", "text": ["How does a Canadian living in the States celebrate memorial day? Well, I do it by eating a hot dog and a cheeseburger because it seems to be the thing to...", "Food was not good, fries tasted like fish, overpriced asf, the employees stank ass attitude stunk up the entire \"restaurant\". Service was horrible 10/10...", "There aren't that many people that could literally always eat a hot dog. Like every day. But I'm one of these people. I know my hot dogs. This place does up..."], "rating": [3, 1, 4], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [["burger"], [], []]}
{"id": "j0-s8e2Rc41Qr_DapJmH2A", "text": ["Portions were small but other than that this a cool place. We enjoyed the rustic setting and the outdoor seating on picnic tables. Staff was pleasant and...", "Stop for lunch a month ago,the hot dog was cook already ,they just heated it up,tasted like crap,the fries I order  was like eating a cup of grease.They...", "What's not to love at this hole-in-the-wall hamburger joint?\n\nFirst let's talk location. Sit outside under the pavilion & you can enjoy a great view of the..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.25, 0.39], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["lunch"], ["hamburger"]]}
{"id": "t1dao92XnIHamnGMoIL4lA", "text": ["Pretty much your basic campus fast food... but nice employees, cheap prices, and fresh (unpreserved and unprocessed) meats!\n\nA-OK for my standards, will...", "Tasteless burgers. Everything here is premade frozen garbage. The advertised 1.99 combo consisted of a tiny cup filled with ice and small scoop of the worst...", "I LOVE the veggie burger at Three Brothers. The best on campus honestly."], "rating": [3, 1, 5], "TBscore": [0.0, -0.29, 0.7], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [[], ["burger"], ["burger"]]}
{"id": "rWrvFwebaETQnC7vQ5v3uw", "text": ["When in Buffalo,  Ted's is a must do!\nWell know for delicious char broiled hot dogs\nThey also have amazing hamburgers, milkshakes and of course Loganberry...", "We were on our way to BUF after Niagara Falls and when I googled what's a must eat in Buffalo, NY two things came up.  One was Buffalo Wings (see my other...", "I can't say enough about how this location always gets your order right and everything is well done. The staff are friendly, the food is fresh, and you..."], "rating": [4, 3, 5], "TBscore": [0.62, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["milk shake", "hamburger"], ["wings"], []]}
{"id": "2_aILMk4akRW2TguIPB7Dw", "text": ["We were impressed with how clean this location is! We came in at sort of a weird time (9 pm on a Sunday) and there was one person sitting. We got our food...", "Louie's is always hit or miss for me. It's never really busy on the times where I've been, but yet the service is always lacking. The worker to worker...", "grease food at it's  best.no ideas how this place stays open and top of that bad service.the only good  thing the prices are very reasonable  if you have a..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "iHUYfz1h4WgLKBGVlECn9w", "text": ["We love this place ! Small family-owned restaurant. Delicious cheeseburgers, hot dogs , fries. The milkshakes are to die for !! They have kid size shakes...", "I decided to stop here for a hot dog with sauce and a pineapple milkshake. I ended up receiving a hot dog with no sauce, a fry with sauce, and a vanilla...", "Everybody raves about this place and perhaps that's why it didn't live up to my expectations? The staff supposedly never write anything down so has to..."], "rating": [5, 3, 2], "TBscore": [0.44, 0.25, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["milk shake"], ["milk shake"], []]}
{"id": "KhZC2lZYTaoFW16eqAaSbA", "text": ["I love Teds! Every-time Im in Buffalo I always have to stop for a hotdog! In the last 20 years of living away from here it is still amazing and as I...", "I love Ted's! There is just something about their hot dogs and onion rings that puts a smile on my face! They also serve burgers, chicken sandwiches, French...", "I love chili dogs and after reading good things about Ted's Hot Dogs I had to dine there.  I did not realize that beef hot dogs were only available as..."], "rating": [5, 4, 2], "TBscore": [0.46, 0.0, 0.35], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["hotdog"], ["sandwich", "chicken", "burger"], ["beef"]]}
{"id": "_PQKWjISE8rKKxNQ5JW0Uw", "text": ["Nice country setting for your hot dog.  Lots of outdoor space.  Cool classic ordering system.  I would like more spicy options but truly it works perfectly...", "Hot dogs, hamburgers, curly-q fries and milkshakes join chicken sandwiches, sausages and even some salads on George's large menu. What makes them a fan...", "Super great place to eat and sit outside. Kids play, you relax at a picnic table. Love it here- bring cash and come a little early Bc there's usually a line."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["sandwich", "chicken", "milk shake", "hamburger"], []]}
{"id": "fZu1e5rVfW5O0_gLeiToAA", "text": ["My smart wife, who lived in Buffalo for 27 years, told me that Ted's is a fixture here and would be a great place for lunch. Hmm. I had to try one of those...", "Ted's is a WNY institution. When I was a kid growing up in Orchard Park it was the go to fast food option in town. \n\nI'm not really a fan of their burgers....", "Always great service. Perfect hot dogs and the best onion rings. It helps that everyone is friendly and the place is very clean. Love that they did profits..."], "rating": [5, 3, 5], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["lunch"], ["burger"], []]}
{"id": "tLtrVVHg0vvh6Ex5HT2hFA", "text": ["Bill Gray's is one of, if not the, best places to get a burger in Williamsville/Clarence. \n\nFOOD: \n- I am in love with their $9.99 special! 2 burgers and an...", "Wish the Buffalo area had the amount of locations that are available to our Rochester neighbors.  The Clarence location, though not in my neighborhood, is...", "Undoubtedly the best burger place in this area (considering price and quality). We tried onion ring, curly fries, cheeseburger, crispy chicken burger and..."], "rating": [5, 5, 5], "TBscore": [0.65, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["burger"], [], ["chicken", "burger"]]}
{"id": "X-s_oGoVHf317dGrJvpfQQ", "text": ["Yes the hot dogs and hamburgers are great. Can't complain about the fries either but it is the Ice Cream, that I come for. So many flavors to choose from...", "its labor day weekend why are you closed for the season??? one star for coming all the way here just to find the place closed.", "Randomly are here.  Quick yummy hotdogs and hamburgs. Would recommend if you're in the area.  Just around the corner from the USA falls.  Greek fries were..."], "rating": [4, 1, 5], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["hamburger"], [], ["hotdog"]]}
{"id": "7s57N5rSj-R8_vVspuyXNw", "text": ["Absolutely adore this tea truck! I had a strawberry lemonade while they were at the Rockin at the Knox event. Not only was the beverage delicious and fairly...", "Came across Tuk Tea at Canalside during the Saturday artisan market. The cold teas ranged from $3-$4 which I thought was fair because they're served in 16...", "It Tuk a long time for me to figure out what to say about this little truck serving up very interesting and not-too-sweet tea products.\n\nTuk Pendleton from..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "kBk7A2Kn4liEkG2QCS8ncA", "text": ["The best French fries in the whole state of New York!! Truth! Everyone is family when you come to Connors! That's how they make you feel.  \nThey give summer...", "What an adorable little restaurant! Connors is right off the water and it's a great little spot to drop by for some ice cream when you're done with the...", "Short and sweet, if you want a decent hamburger or hotdog and you're near Mickey rats here's a great place for you to go."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.28], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["hotdog", "hamburger"]]}
{"id": "Kp_0N_-YsCQUFb1cg8-Lug", "text": ["I really like this place.  I've had a hot dog, a BBQ burger, a Grilled Chicken sandwich, fries, and onion rings.  The hot dog was delicious.  The burger was...", "I decided to venture to Red's for lunch.  On the positive side, the service was friendly and it the decor was attractive for a diner.  There is a very large...", "Super cute place! I opted to take my brother here as we were both out in EA for the afternoon, I had wanted to get some work done at Taste and knew he..."], "rating": [5, 2, 4], "TBscore": [0.22, 0.34, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["sandwich", "chicken", "burger"], ["lunch"], []]}
{"id": "FP5qL6w3HMGwj6T4b6SoXg", "text": ["I'm not even sure if they have a physical location but I have eaten from the food truck a couple of times. The beef and cheese pastelillos are my go-to...", "I tried this food truck for lunch one day when they came to my office. \nI had a beef and cheese pastellieo (sorry about the spelling) this was very...", "Parked conveniently in the Lower West Side, Ricos Pinchos always catches my eye when I drive by. One day when I had yearning for mashed up plantains I..."], "rating": [4, 4, 3], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["beef"], ["beef", "lunch"], []]}
{"id": "LaAoEGC8YMQguKZ_XnnaJA", "text": ["The lovely and gracious and radiant Mrs. Yelper and I were in Buffalo for a wedding. We like this area! Downtown has its sketchy parts, but hello--look at...", "This was a miss for me. Charged $5 for entrance per person and then had to buy tickets for $1 each. Wings could be bought with these tickets for 1 wing per...", "This really was a cool event! But honestly year after year it's an unbearably hot weekend to be standing in the sun eating hot wings. \n\nThis is the reason I..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], ["wings"], ["wings"]]}
{"id": "z7pwCMK8wByOZJdHW_2OUg", "text": ["Donatello's was on my regular rotation years ago when I lived in NF. \n\nI made it back up there today for a slice of pizza pie and seafood platter. Wow,...", "Went to this pizza place, \nPizza was Great, and the hot wings\nWere Excellent. \nHighly recommended this place\nThank you for the courteous friendly \nService...", "This place has some of the best pizza I've had recently. I ordered the personal Buffalo Chicken Finger pizza, and it was REALLY good. The chicken was crispy..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["pizza"], ["pizza"], ["chicken", "pizza"]]}
{"id": "R-Tthh7UiHjGD9Oz-el-3g", "text": ["Easy comfortable and accommodating. The staff was on point for us and the food was memorable. I had the Greek salad. I originally am from Michigan where...", "Came here based on Yelp reviews describing Yanks as a \"good alternative\" to other Clifton Hill bars. My group was looking for a place to grab casual food...", "Service was slow at first but picked right up. We had some dip thing called cheesecake, not a dessert. It's served with tortilla chips. It's basically a..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["bar"], []]}
{"id": "9WHIVNVXXKvUIChzbpWkkw", "text": ["alright, let's be real here... kalypso is THE spot for all your Caribbean flavor needs. I used to ride my bike over there as a freshman in high school for...", "Loved the veggie patty. They were out of coco bread, so it didn't really set the patty off the way I would have hoped but that's ok. The meal I got was...", "What a gem. This place is really the spot! If you want good Jamaican food and a lot of it this is your place. The jerk chicken here is literally so tender..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "tlg97wsv2sG31KCcSu-1yA", "text": ["You can't come to Buffalo, NY without trying Buffalo wings. Yes, Niagara Falls is really a suburb of Buffalo with casinos, LOL. This is our first time to...", "Came here with my fiance a couple of nights ago and there was maybe 1/3 occupancy and service was very very very slow. Our waitress said it was her 2nd day...", "AVOID!!!  i also was drawn in by the whole lighted sign, gottaeat buffalo wings while in buffalo. paid  $6 for deviled eggs as an appetizer which didn't..."], "rating": [4, 2, 1], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["wings"], [], ["egg", "wings"]]}
{"id": "KsglxmIMEBpFzbbu3XAaDQ", "text": ["30 plus years of regular visits.\nI love the city. It's got flaws (everywhere).\nTransit is an issue, definitely a CAR city (like Detroit).  For Canadians a...", "So even though I worked at City Hall for 20 years I never really appreciated the beauty of this magnificent art deco structure. So now that I'm retired I...", "Overall, it was a good experience. There are a few hidden gems and some nice landmarks. The downtown area is ok. Some parts I felt safe and some parts just..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "vtPF8PTtCY-AhWWz_aOcUA", "text": ["A gem in Old Town\nIt's not a Riverside bar\nGreat veggie burgers\n\nCraft beers for four bucks\nIt's ridiculously cheap\nThere's wood paneling", "Great place to stop for wings if you are in he area and looking for something out of the norm. I went with a group of friends and we tried Chili lime,...", "This place Is a hidden gem! Mondays and Thursdays are 50 cent wings. Over 20 flavors. Great crispy wings. \n\nBar staff was great. Good selection of craft..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.8, 0.52], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["wings"], ["wings"]]}
{"id": "K285e7lNo5kjd7SzMs6l_A", "text": ["I believe this place has some of the tastiest chicken fingers in all of WNY!\n\nNOTE: This place is cash only!!  They do have an ATM inside.\n\nNow, this place...", "Went to pick up wings last night and it'll be the last time I ever order from there. We go back time and time again thinking it'll be amazing, but, it's...", "Horrible service!! Received a burger with out lettuce, tomato, onion, ketchup, mustard.. Never experienced a place that with such lack of respect for a..."], "rating": [4, 1, 1], "TBscore": [-0.38, 0.0, -0.47], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chicken"], ["wings"], ["burger"]]}
{"id": "TjOGp-X5u9ivXarpxAFnpQ", "text": ["I walked into this place and immediately felt like I was home (not really). But, the atmosphere made me feel comfortable. You walk in and you immediately...", "For bar food in a relaxing atmosphere, Lenox Grill hits home!  We went on Monday, which is 0.64 cent wing night (aka 10 wings for $6.40).  We tried three...", "I consider myself a wing snob being from Buffalo. This spot is definitely in my top five for wings. There Korean BBQ are the best in the game. They have a..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.37], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["bar", "wings"], ["korean", "wings"]]}
{"id": "n6OgWFlLjCRWWtbHKU5jOQ", "text": ["Been going to this place for years.  The best chicken fingers anywhere, and the wings rank high, too.  Don't overlook the bacon-bleu burger either.  Drinks...", "Although their chicken fingers and fries are AMAZING (their blue cheese is pretty good too, pretty sure it's home made) I can't give it a better rating,...", "How long do YOU wait for service before give up?  \n\nA coworker recommended this place for good wings and finger.  Stopped on midafternoon Saturday. There..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.28, 0.32], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["burger", "chicken", "wings"], ["chicken"], ["wings"]]}
{"id": "T9tF_1slsUWDg86BoXrUxQ", "text": ["This is a good pizza place crust is a little bit bland but u can choose your customize your crust tona extent", "Had takout from here. Everything was good but nothing spectacular. The pizza was the biggest letdown. The crust looked to be amazingly crispy but then it...", "This Pizzeria has gotten terribly overpriced in recent years while the quality of the food has decreased dramatically. l recently purchased a small..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.63, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["pizza"], ["pizza"], []]}
{"id": "g1dftiwyulL3ZGFaWmQJNw", "text": ["I've ordered from Just Pizza only a handful of times, but their pizza is by far on my list of top three pizza destinations in Buffalo. \n\nDuring my last...", "The Steak and Cheese here is just so dang awesome....\n\nWe were greeted by the owner and he made it a point to let us know that he loves making them, and...", "For many years, Just Pizza has been our go-to pizza place, which we've had every week or two all year long.  (And at least once a week during football..."], "rating": [5, 5, 3], "TBscore": [0.0, 1.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["pizza"], ["steak"], ["pizza"]]}
{"id": "qr4-BO8EtUQDL46OHbSvRg", "text": ["I've always heard great things about Swannie being an amazing dive bar. We stopped in on a weekday night and were pleasantly surprised to find plenty of...", "Good eats Beef on Weck for me and chef salad for spouse.  Lots of working class vibe and definitely one of a kind place.  Garden patio was nice and weather...", "Prefer my burger without tar and nicotine.\n\nSorry Swannie House because your food was decent, prices reasonable and ambiance nice, but allowing smoking at..."], "rating": [4, 4, 2], "TBscore": [0.5, 0.47, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["bar"], ["beef"], ["burger"]]}
{"id": "hSlPZHhxjrM1GQE2dBTCVw", "text": ["If you're craving poutine, and don't want to visit the Griffin up the road for whatever reason, this \"fry café\" gets the job done. I had the medium for $7,...", "Soooo disappointed, being at the outlet mall and being pushed for time I wanted a quick snack kind of lunch and having eaten at their other location figured...", "This is a new \"fries-only place\" inside the mall. Super yummy and you can customize your fries yourself! If you love fries this is a definite must try...."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["snack", "lunch"], []]}
{"id": "9LuPK2HtATgEFJzQRQPirQ", "text": ["BEST POUTINE EVER! I brought my friends from New York to see the Canadian side of Niagra falls and after strolling around, I wanted to make sure we didn't...", "When in Canada, how can one miss the opportunity to eat poutine? Not us. This place was recommended by a local, our waiter at Peller Estates Winery. \n\nIt's...", "It was here, one hour after I arrived in Canada for the very first time, that I discovered my deep disliking for poutine. To be fair, I don't think it is..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "Ft_BrbTzpq9BhfC_3tDOgg", "text": ["First time here and I just ordered the shanty mak hamburger and I can honestly say I have never had a better burger.\nI know I will be back but I would say I...", "I had lunch here for the first time and was not disappointed at all. There is a very appealing soup and salad bar with plenty of choices. The regular menu...", "A very reasonably priced lunch! Not only is there a soup and salad bar special (including 5 soups, Romaine and iceberg lettuce, fruit salad, pita bread,..."], "rating": [4, 4, 4], "TBscore": [0.34, 0.32, 0.23], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["hamburger"], ["bar", "lunch"], ["bar", "lunch"]]}
{"id": "ZQmw26JUzsjUwa4Z1qrNwQ", "text": ["I hired Roaming Buffalo for a party that I had and it was the biggest hit. Chris and his staff did an amazing job catering to my hungry guests. \n\nEveryone...", "Edit:\n\nReceived this compliment from the owner, calling my review phony and re-assuring me how great his food is:\n\n\"All we have to say to this phony review...", "There were some good things, and there were some missteps, I think that overall though I was pretty happy with my experience of Roaming Buffalo.\n\nIn an..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "VhS1iZ7YA-vf4dYNe_5QTg", "text": ["I am gonna start by saying GREAT ....\nAnd I am gonna go backwards ...the service , the attentiveness, the personable approach, the information was...", "I wanted to try Neat out well before it opened. By the time I caught the reviews, I have to admit, I was less enthused. They weren't the best which was a...", "I went with a decent sized group for the first time on a Saturday during restaurant week and they were very accommodating. The food was fantastic. I had a..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "cdMHPQ6juYZx-hmcm405Bw", "text": ["My wife and i used to come to Smokey bones pretty often when we lived in Cicero. The location in Clay was really convenient and i am a bbq loving man so it...", "Pretty good food here!!\nService was pretty good too:) I forgot her name but she was running the show when we went all by herself. \nDrink wise I stick to my...", "once loved it\nplace was soooooooooooo cold everybody near us had coats on and hats/scarfs  come on\nwe asked for heat and we saw another couple ask the..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "MJqLupnhTybQ00KrJdLPCg", "text": ["TEMPORARILY CLOSED UNTIL 5/15/18\n\nThey are updating the kitchen and the chicken shop is closed. The market is open.", "If I could give this place 5 million stars I would. Hands down the best fried chicken I've ever had in Buffalo. The chicken is so tender & juicy. Every bite...", "The best thing about this place is they only start fry the chicken after you order so you won't get any cold fried chicken. Their fried chickens are crispy..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [["chicken"], ["chicken"], ["chicken"]]}
{"id": "up_6c6tn6SBedkzWHMtWug", "text": ["This place has great food, great service, great price, and is 100% zabihah halal!  Thank you, Chester's!  As for the food, the fried chicken is the real...", "Ordered online from here. The food was hot and fresh. Chicken wings and tenders were juicy and tasty. The burger could've been a little better. However,...", "I was pleasantly surprised with the friend chicken - it was super crispy, nicely seasoned and well cooked. The sides aren't really anything to write home..."], "rating": [5, 4, 3], "TBscore": [0.44, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["chicken"], ["burger", "chicken", "wings"], ["chicken"]]}
{"id": "W6eLo0WaCOsogYqs1-ww6g", "text": ["We have driven by here a lot and it appears to usually be very crowded with cars parking down the street on occasion.   Stopped tonight and were very...", "My boyfriend and I came here tonight for dinner with our two dogs. We live down the street and always order take out as a convenience but never dined in...", "Really busy Lenten Friday in Western NY...We didn't wait long at all. I ordered the beer-battered shrimp. They were pretty good. Everyone at our table did..."], "rating": [2, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, -0.2], "keywords": [[], ["dinner"], []]}
{"id": "c51sdOSeB2_kvnunj_tLlw", "text": ["I guess I wanted more. I popped in here for lunch today as I was two doors down doing some shopping and I really didn't want to put much thought into...", "My experience was ok. They owners were extremely kind, but the smell of the place is really bad. The pick up and go experience was fine, but sitting in...", "I come here all the time for Chinese take-out. They're fast, the food is always what I'm craving and I always end up coming back. The sweet and sour chicken..."], "rating": [3, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.6], "keywords": [["lunch"], [], ["chicken", "chineese"]]}
{"id": "FauTjWm8LRDzlqPuG3liPQ", "text": ["I apologize, I for some reason only gave 4 stars when I meant to give 5. I love the food, everything else is awesome as well.", "Since I criticized their fried chicken I should make sure I am as fair as possible and point out the good stuff I saw here.  It's clean, and I could tell by...", "This place is absolute garbage. Got a 1/2 sheet and 50 wings, the pizza is basically rubber with some cheese on it. We asked for \"extra, extra, EXTRA..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], ["chicken"], ["pizza", "wings"]]}
{"id": "fLuBOgcSFfbeB4vvz87uPA", "text": ["Great prices & good portion sizes! They're always very quick and the food is delicious. I just moved nearby and frequent this place often now.", "A gem in South Buffalo! I think it's often overlooked because it doesn't have a chain name and the hours are super random, but let me tell you, this place...", "Ignore the fact (or at least try to) that the neighborhood is not what it once was & dive right in to this South Park Ave dive of a diner. The food is well..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "B9Ga4dv2stKngeyca4b36Q", "text": ["Best pizza in Buffalo, great wings as well. They are often pretty slow but the wait is worth it.", "Whenever I come in here, the owner (Pat) Pat's me on the head. Maybe that's how Pat got his/her name. As for the his/her, I don't know if they have a...", "Greasy pizza, flavorless crust and I should mention that it is severely overpriced. Some things never change, there is a reason that I haven't ordered from..."], "rating": [5, 4, 2], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["pizza", "wings"], [], ["pizza"]]}
{"id": "CQj3cyZirac-kOAPR4kcEQ", "text": ["This new place in the McKinley Mall good court was getting some traction in the vegan world, so I came to scope it out. \n\nThis place has a variety of egg...", "This new place in the McKinley Mall is fantastic! They offer many egg roll wrappers filled with all kinds of american food options. I selected the buffalo...", "If you're wandering around the mall or just looking for something different to eat, try Howie Rolls! Their vegan roll was light, crispy, and very tasty."], "rating": [4, 5, 5], "TBscore": [0.42, 0.31, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["egg"], ["american", "egg"], []]}
{"id": "yuclOle-ViW101PjYARb5Q", "text": ["I ordered from skipthedishes. My order was screwed up, food was missing. Their bacon was more like dried meat. The type you see on an animal who died and...", "So glad destiny's does SkipTheDishes. It's hard to travel in negative degree weather with 2 under 2. Especially finding takeout food that a picky toddler...", "Welp it's been about about a year since I last ordered from here and it seems as though nothing has changed!!!  I should have known the food wasn't gonna be..."], "rating": [1, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "CHTBYHRmt90gXtZFyao8vQ", "text": ["I don't always visit chains, but when I do, I try to keep a critical eye.\n\nThe food here is great if you have an empty stomach. It's junk food but it tastes...", "I'm upset that this place has been here for 2 years and I had no idea! Why has no one told me about the awesomeness that is Checkers? Hmph! Let me start...", "Checkers is the perfect place to go to satisfy those late night fast food cravings. You know what I'm talking about, when it's midnight you are craving..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "W5Ns4NCPa-xdIP-Psxqldg", "text": ["This KFC sucked when Wendy P. left her review in November 2007 and it still sucks. I'm giving this place one star because as Wendy P. said, a quarter of a...", "This KFC has the worst Asian server I've ever seen. Deserves real zero start. I have no idea why this KFC has a one and half start instead one.", "Tonight was the night, the yearly \"Purge\" of Kentucky Fried Chicken (I allow myself to eat at each of the fast food joints once a year, because why not?)...."], "rating": [1, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], [], ["chicken"]]}
{"id": "D4OiqmW2ENMuxpkM7JAhIg", "text": ["Tiny new neighborhood place in the Kenmore/Tonawanda area. My sister took me here (I am from out of town). We ate in and had 20 medium wings, which were...", "Wow I waited 1hourand25 min for a delivery I had the stk and broc rab sub they were out of broc rab the stk was burnt which is odd because it said its...", "We chose to try the new place down the street this pass weekend and a pizza shop named Big Vinny's sounded like it hadpotential.  I was wrong big time.  A..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["wings"], [], ["pizza"]]}
{"id": "lT-cl0nkjfdnN_xBGS0ZIw", "text": ["America you have THE REAL KFC. In Canada we're frauded!!\nI paid like $11 for two for a filling meal, which would be like $20 and just meh. Like sad chicken....", "Never would I ever come back to this or any other KFC. I haven't had it in years and as soon as I got it I remembered why ....... it's awful small/Dry it...", "We go to kfc all of 1 time per year, so I have no idea if any others are this bad, but I am so unimpressed and even upset! \nThe chicken looks like it has..."], "rating": [4, 1, 1], "TBscore": [-0.26, 0.0, -0.74], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "bU3VIHnDdDQ1Iz4JhUZdOQ", "text": ["One of my favorite black-owned spots in town. I go for the atmosphere and time with friends. 60 cent wings on Wednesdays and great drink special most...", "I love this place. Great people, fair prices, really pleasant decor. Menu looked good, as did the food when it came out. But as I didn't order anything can...", "Had a great fish fry here with the husband last week portions were a little on the small side but very tasty I got the beer battered, he got the southern..."], "rating": [5, 5, 5], "TBscore": [0.54, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["wings"], [], []]}
{"id": "vvZtVIsBW9RdH9ORGM8msA", "text": ["My fave butcher to get Polish goods and high quality meats. It is a combination of old-fashioned Broadway Market birch meets Buffalove. The butchers are...", "Always fresh and tasty meats and a great selection of condiments and seasonal foods and gifts. A favorite of ours is their beef sticks, one taste will ruin...", "Love this place. Old fashioned butcher shop. Wide variety of meats and products such as Buffalo favorites I.e. pierogi from Ru's , Weber's mustard, Anchor..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["beef"], []]}
{"id": "bDhmBVideVPlo19b09nudA", "text": ["My teenage son loves Subway and today after his Dentist appointment we stopped in there for him to get a sub so he can bring it to school for lunch. The...", "Although the staff is very friendly and efficient, it is disappointing that management does not seem to care that common ingredients are not available.  Out...", "Typical Subway, no complaints!"], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["lunch"], [], []]}
{"id": "999Xubc6WJbC8I9Ip4yKTw", "text": ["Ok, so I wanted something \"homemade\" for lunch and I found Risa's on Yelp.  I ordered the egg salad sandwich and a knish.  The sandwich was fresh and...", "*****Update 4/20/18*****\n\nI've been going to Risa's regularly, so I thought I would post an update. My usual is a knish and matzo ball soup. However, I have...", "go as soon as you can & get some of risa's faboo chopped chicken liver & potato blintzes!! yu-u-u-u-u-u-u-u-u-u-u-u-u-ummmm!"], "rating": [5, 5, 5], "TBscore": [0.4, 0.0, -1.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sandwich", "egg", "lunch"], [], ["chicken"]]}
{"id": "Ghhd90URXXqaaGMps2Folg", "text": ["My neighborhood is lucky enough to have a Federal Meats butcher shop. Everything is of top quality (and top prices), but when you don't want to line up at...", "All food sold here is of high quality and worth every penny.  Staff is incredibly friendly and helpful.  They go out of their way to please a customer.  The...", "Always the best care and service.  Truly great gents work here!  Meat is of highest quality. ..I've never gotten something I've been less than impressed..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Z5V5GiTHyQBC1StRN4zSJQ", "text": ["Rainbow Deli is one of my go-to favorites downtown, especially if I'm hankerin' for a salad. Everything is so fresh, you can choose your own toppings and...", "Love the salad, all fixings were fresh and tasty.  Owner works behind the counter, all staff members are friendly.  Making their salads a part of my weight...", "This is a dynamite deli in downtown Buffalo. I highly recommend their salads, which you design yourself by picking all the toppings. Some of my favorites..."], "rating": [4, 5, 5], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["deli"], [], ["deli"]]}
{"id": "8cExbfx7WBTrQpdM2E7R-A", "text": ["Sometimes it is hard to trust a name or proclamation of an organization.  I mean we have all tried the best coffee of a given town, the best wings, the best...", "What an easy and amazing experience. I called and the customer service rep. helped me through the process of catering for a birthday party. Not only was it...", "Great Selection, delicious food, excellent service! My husband and I recently hosted a party at our home and I was so happy I found Kim. We were able to..."], "rating": [5, 5, 5], "TBscore": [0.48, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["wings"], [], []]}
{"id": "VkzOZLsSrRYEhcTdPRrMNw", "text": ["I love Subway in general and this one is a good one. Overall clean, pleasant employees. Can't complain! The flatbread is my new favorite bread. So...", "Walked in and everyone greeted me more than once, which was awesome! The man taking my order was friendly and efficient. It was great service !!", "Very nice and friendly Subway that guided me throughout the process patiently. The vegetables here are fresh and the Black Forest ham sub was overall..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "JJmm1J3IXJA5dHmHVkQf-g", "text": ["I have previously been to Ashker's Elmwood location and was curious to try this location out. I would say it has a very similar vibe, and I wouldn't really...", "Tried a pina colado drink which was a pina colada but with avocado. It was delicious! The avocado made it creamier. \nThe place is super trendy and casual. I...", "My first visit to Ashker's Blackrock and I will return! Two rooms with a couple of tables, some comfortable seats too.\nI just had coffee and was pleasantly..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "8D1P_jpMkQYYFbp9Py7oEQ", "text": ["Fera's on Franklin is a lifesaver.  What I mean by that is that if you were floating in the middle of the ocean, suffering from hypothermia and nearly...", "Quick update on my previous review...\n\nFera's on Franklin doesn't seem to have a website, but the Buffalo Place has a write-up here:...", "A great place to pick up a quick lunch or breakfast for a good price.  They always have some really great lunch specials which aren't on their regular menu...."], "rating": [3, 4, 5], "TBscore": [0.0, 0.0, 0.53], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [[], [], ["breakfast", "lunch"]]}
{"id": "3D5ZZtXGxL2YbNBN3lnSEg", "text": ["Super-friendly people, affordable pricing--you can get out of there with a sandwich, chips, and a drink for under $10 (including tip).\n\nFood is as good as...", "Consistently fine food and service for years! The helpers are cheerful and pros at customer service. The wraps are amazing.  \n\nRoly Poly is THE place to go...", "Roly Poly is definitely underrated as an easy lunch or dinner spot! The price is definitely right for picking up a satisfying, no fuss meal when you're..."], "rating": [4, 5, 5], "TBscore": [0.7, 0.0, 0.33], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["sandwich"], [], ["dinner", "lunch"]]}
{"id": "m1aELSkaSZIpwhXj3v9rbQ", "text": ["A locally owned sandwich shop. I went here on my birthday and the owner is very friendly and makes your experience very personal. His prices are really...", "Great gem of a lunch spot if ever you're in the neighborhood (e.g. jury duty, catching an afternoon Bisons game, etc.).\n\nIt's nestled between a parking ramp...", "Great little lunch spot. Always fast n friendly. Get the Turkey Bacon sandwich and a bowl of soup and enjoy a lunch under $10."], "rating": [5, 5, 5], "TBscore": [0.0, 0.33, 0.32], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sandwich"], ["lunch"], ["sandwich", "turkey", "lunch"]]}
{"id": "QF8iNiegnuD3_H2mWrZ5-A", "text": ["What a hidden treasure. It's easy to miss, and took me years before I actually gave it a shot.\nThe hoagies are top notch, huge and easily yield two meals....", "Credit this one to Yelp reviews because I needed a lunch take out to bring back to the office from the Eastside of the city.\n\nI discovered that this golden...", "I really enjoyed my steak sub frm the Buffalo's golden corner. They fixed it jus the way I like it. That steak sub was the best I have had yet frm a fast..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.42], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["lunch"], ["steak"]]}
{"id": "-ZTFpJyjrhF7CnCmPN2jNA", "text": ["This is the best grocery store!! \nOne could spend the whole day here and still not see everything it has to offer. This store is huge. They keep the store...", "I was just at the wegmans cafe checkout on Amherst st in buffalo. Fatima was my cashier. She was short and unfriendly didn't even say hello, took 5 minutes...", "I love Wegmans!! They have everything I want and need and oh so much more. I never post the food I get from Wegmans so I made sure I snapped a photo today!!"], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "WvfnXgAWzZGfOVfK2-Z-WA", "text": ["The boss makes employes in this place work both on subway and a gas station the boss makes them pump gas and work with food  which can food poison someone i...", "I used to love this location.  There was great customer service and they were so friendly. The subs were made just right with everything spread evenly. But...", "I live very close to this location and get out of work at 9pm. It's nice to have a healthier place to stop and get food around 930pm. I walk in around that..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "YCEqmupqSueCtNelugXFig", "text": ["Everyone needs to chill out. The food here is top notch for what it is and he has the cheapest deli around. So call your order in and I guarantee you'll...", "I called in an order for work friends. When I wasn't sure what one of them wanted on the sub, he went Ballistic!! Screaming at me that who the heck doesn't...", "The owner is a total jerk. Never eat at this place. Learn some customer service skills. He told me to **** off on the phone because I had to ask someone..."], "rating": [5, 1, 1], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["deli"], [], []]}
{"id": "OtOE2QQnhZpNIcH68fmZ0w", "text": ["Great for takeout during the lunch hour- they are well staffed and don't keep you waiting long for your food.  \n\nThe first time I stopped by I got the...", "I didn't actually eat here.   But I wanted to.  Waited on a long slow moving line one day for some 10-12 min.  Only to FINALLY get to the front to be told...", "Best roast beef sandwich you can get.  They have turkey and other specialties such as corn beef and prime rib on certain days.  Very convenient location..."], "rating": [5, 3, 5], "TBscore": [0.33, 0.0, 0.26], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["lunch"], [], ["sandwich", "turkey", "corn", "beef"]]}
{"id": "VYIo9Uty2TlUWO1qHZWLZg", "text": ["Arby's used to be my favorite place to eat at when I was a kid, and it's still one of my favorite fast food joints around. I enjoy their beef and cheddars...", "went here on the fly (last thurs)\nthe lady that took my order was the kindest soul ever\nfood not too bad & the float yummy", "Quick and friendly drive-thru service, which is always appreciated. Ordered my usual grand turkey club which was fantastic again. The shake I ordered was..."], "rating": [4, 5, 5], "TBscore": [0.4, 0.0, 0.26], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["beef"], [], ["turkey"]]}
{"id": "iZkqZC4-FbwO3hmZT7_uaA", "text": ["Extremely surprised by this gem. It looks kinda run down and uninviting at first. We were visiting Buffalo and wanted easy breakfast options. Portions were...", "First, let me start off by saying I was extremely disappointed from the moment we walked in the door. \nMy friend & I were not properly greeted when we...", "Super cheap breakfast place! If you go with little expectations you will pleasantly surprised. The place is nothing fancy but service is great and you can't..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.31], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["breakfast"], [], ["breakfast"]]}
{"id": "93_sj0yd5eMBBcTdnK7xxg", "text": ["Sign me up for breakfast for dinner! Caught these guys at Food Truck Tuesday and thought, why not? Their menu has a ton of tasty breakfast dishes, mostly...", "Very glad we came across this amazing food truck. We were actually just going to grab coffee at Tim Hortons before heading to airport back to Manhattan. We...", "This food truck came to our work today. Very glad that it did!! I got the Tighten your B.E.L.T. and it was super tasty! Just like a BLT, but it had an egg..."], "rating": [4, 5, 5], "TBscore": [0.5, 0.0, 0.71], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["dinner", "breakfast"], [], ["egg"]]}
{"id": "HikFJL4BG7p8892bAg-0_A", "text": ["My Upstate New York #foodbae.\nI never leave unsatisfied when I can munch on a chicken salad sandwich while working in this cafe. \nSmall and homey,  with...", "This place I perfect and low key. I can get work done on my laptop since there is and outlet at the tables  and WiFi. Lunch there is pretty good.", "Love the food and service the employees and manager/owner give. Highly recommend to try out this cafe if you're visiting the area. Also, the prices are..."], "rating": [4, 5, 5], "TBscore": [-0.24, 0.39, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["sandwich", "chicken"], ["lunch"], []]}
{"id": "tv5Zg3hfOhFanM1DcrME7w", "text": ["I really like Athens and come here with my parents quite frequently.  I will almost always get the big breakfast (eggs, home fries, toast,...", "I generally like this diner. It's right around the corner from where I live, there's relatively cheap items on the menu for when I'm low on funds, and the...", "Very test breakfast , reasonable prices, friendly service... they gave me option for onions in home fries , toast done perfectly . Place was clean ...and a..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.43], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["breakfast", "egg"], [], ["breakfast"]]}
{"id": "6o4NLQfezI6oFTAyIOe60Q", "text": ["This is a great family owned restaurant thier chicken souvlaki breakfast is great chicken is very good and you get a good portion and the homefries are the...", "Great breakfast....we had the homemade potato pancakes, crispy bacon and the gyro omlette with toast and potatoes... both were amazing. The service was fast...", "Not the worst.... but certainly not the best either. This place has dated decor, and it can certainly be cleaner. The service is a bit gruff. I had a Greek..."], "rating": [5, 5, 2], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["breakfast", "chicken"], [], []]}
{"id": "p555D3S1tGTSgAoLcpszyQ", "text": ["Nick's is the best. It's a small dining room\nwith a counter. Everybody feels like they're part of Nick's family when dining here. If you're looking for...", "At first was hard to find lol\nBut after that was excellent !!!\n1. Easy parking next to the building \n2. Is a tiny place but with wonderful customer service...", "We've visited a few times now and this place is so solid! Every item is of great quality, from the meats to pancakes and fresh veggies. They have a great..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "NA63-jg1qporkOK1ZgtrqQ", "text": ["E-Café is very convenient to my office, so it's a quick place to run to in bad whether, or when we can't decide on where we want to go.  \n\nEverything is...", "I came here on my lunch.  I was in a little hurry because i only get 1 hour for lunch.  I ordered the lunch special which was really good. I do like the...", "Everything I've had from here has been good. Portions are okay and the service is good. Can sometimes take longer than expected around lunch time, but at..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.22, 0.45], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["lunch"], ["lunch"]]}
{"id": "U8xLBt3Mx0h8oGL5DEjwpQ", "text": ["I've been going here at times probably 20 years. A few things that I noticed some good some bad: restaurant was impeccably clean and the air-conditioner was...", "I love a good family restaurant with that old school diner feel to it. The kind of place that reminds me of the 90's when I was a little kid and would go...", "Nice service , good food , the spanakopita was a little hard or dried with too much oil if I can compare  with others I've eaten before but overall we were..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "bZjzFaTHJCXiqjWlydeMFg", "text": ["Love this new ice cream shop! We stopped by on a bike ride just to grab an \"ice cream cannoli\" and it was delicious. Our nephew was with us and mentioned...", "Great new addition to Abbott Road! An awesome little ice cream stand with all the usual cones, scoops, and sundaes on top of homemade deserts like peanut...", "Superb service including a very informative window service worker who asked if it was our first time, and upon hearing it was, gave us the low down on the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "v7FhlAtrkArOOqqq9TLEzw", "text": ["Excellent food. This is a very nice locally owned diner, much better than, say, Denny's. This is definitely an unconventional restaurant, as I ordered the...", "I came here on Monday morning with my family for a late breakfast/ early lunch. The service was friendly and quick. We all liked our meals. I had chicken...", "Starving one morning and wanted some breakfast bad. Order for take out here, place was nice ins9de when we grabbed our food, staff seemed great. I got the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.23], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["breakfast", "chicken", "lunch"], ["breakfast"]]}
{"id": "_hvoic7M9p5UjTY9Ywp0lQ", "text": ["I went here for the first time with my grandmother over the weekend. We went right after church on a Sunday, so there was about a 20 minute wait which...", "My family has been coming to this place for over 30 years. It's just been around forever! If you want a place with vegan or healthy options, this place is...", "I honestly just don't understand the hype with this place. It's a lot more expensive than most of the other breakfast places in the area. A tiny glass of OJ..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["breakfast"]]}
{"id": "JGTEo_VvbqY0zFa7cHR56A", "text": ["The ultimate \"drunk food\" \nBest steak hoagies in buffalo. \nJust only eat half if you're sober, otherwise u won't be able to accomplish much after bc you'll...", "I spent a large amount of years in my twenties going to Jim's Steak-out.  This very one in fact. Countless times it was the last stop of the night.  Their...", "This location is conveniently located on Elmwood across from ETS. My top Jim's dish to order is the steak deluxe fries. My God!! But unfortunately every..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.31], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["steak"], [], ["steak"]]}
{"id": "qrm6xCUVpWpwsVfv4efWYw", "text": ["My first time at this location was a good experience! Good Customer Service, Order was accurate. The place is really clean !!!!!!! Only reason it's not...", "Thanks for lying, taking my money and the mild embarrassment this morning. On Sunday 10/28 I came through the drive through and ordered a large coffee and a...", "Just ran here for some coffee, parking was non existent at all. But the service was friendly. I am enjoying my coffee and cinnamon bun. \n\nParking is always..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "EVFyyrDv0PAY9FteopiMUQ", "text": ["THE BEST RYE BREAD I've had since I was a kid  when we bought what is called \"Jewish Corn Bread\" from a famous bakery called Pakula's, in Spring Valley, NY....", "The best deli style rye bread hands down. If you can't get there it's worth spending the money to have it shipped to you.", "I get this bread at a Wegmans in Fairfax VA. I can't tell you how much I love it... I mean, LOVE it. The flavor is astonishing. Rye Bread was never so..."], "rating": [5, 5, 5], "TBscore": [0.5, 0.38, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["corn"], ["deli"], []]}
{"id": "CQTXmVnGPyAcSqT_LmRiDQ", "text": ["I'm a BIG fan of simple comfort food.  And for me, Curry's definitely hits that spot.  My husband and I have eaten here a couple times, and are always...", "This place has existed right under my nose for years, until a friend dragged me here one day; I am damned sure she did.  \n\nThis place boasts a nonchalant...", "Curry's has great homemade food. Love this place....but I have a suggestion.....please serve the food hot! Whether it's soup, fish, prime rib, potatoes,..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "GNiOe96mcdRVtg9xLQkpfQ", "text": ["One evening after a long day at work,  I came home to 3 hungry teenagers.  To make the evening easier on myself,  I decided to go to Boston Market. \n\nBoston...", "Stopped in here on the 4 rth of July 2018 . The place looked closed from the outside . There were a few cars in the parking lot so I ventured in .  BIG...", "Never have been to a Boston Market before so we decided to try it. I was pleasantly surprised! I got a chicken market bowl with stuffing and mashed potatoes..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, -0.24], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "ydYvnHqi8Y5BPV6OGJw14A", "text": ["Top notch. I worked with George to come up with a cocktail/station style event for my recent wedding. It was a huge hit. We received compliments on the food...", "Found this Place, had them cater our office party and the food was remarkable. Had stuffed shells with a white sauce and like a stuffed chicken that was...", "George and his staff just catered our daughter's wedding.  The food and presentation were remarkable.  People can't stop raving about it.  He did everything..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "GINfnKIC4rRNQVMwTHTMvA", "text": ["I have lived in buffalo for years and had no idea that Jerk's existed until the #yelpadventure ice cream passport journey came out. How could I have never...", "Super cute place..... with friendly people working behind the counter. These guys seemed to really care about the beauty of their creations. And, there were...", "The only real downside is they serve Hershey's instead of Perry's or homemade, but Hershey's salted caramel truffle is pretty much identical to Perry's, and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "buoNWLPr5-3OIhaUV8ELGw", "text": ["Nothing says Winter is over quite as perfectly as when the local ice cream stands open back up. Hanna's is my local joint, about a 7 minute walk from my...", "I stopped at Hanna's Frosty Treats for the very first time on Sunday and I'll be honest, I didn't expect all that much. The place looks old, outdated, and...", "In my area, this is my favorite ice cream place.  The ice-cream/custard is nice and rich. Prices are very reasonable comparatively.  My favorite thing about..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "ei_vwqNCd7kUoaa01w-07w", "text": ["So cool and old school. This is a hidden gem, easy to miss. This place doesn't only look retro, the service is also like was back in the day personal with a...", "We sat down for table service ice cream. I ordered a root beer float. It came with the ice cream on top of the cup so you got the joy of pushing in down...", "We have been wanting to check out Parkside Candy for years and finally got the chance on a day we were both off from work and the traffic on Main Street was..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "baptF3FlFEDLpaCd9B_Z4Q", "text": ["My last review (I procrastinated) of our trip to Buffalo back in early September (2018)...\n\nA friend who grew up in Buffalo use to return and visit family...", "I have always loved the charm of Antoinette's. My good friend from high school and her family used to take us here from time to time so it holds a little...", "What a gem!  We don't have places like this in the GTA.\n\nAfter reading favourable reviews, I drove out of the way to indulge in a sundae and I was not..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "6SiHiOShyQetXfvxEiCjgg", "text": ["My wife, our pupper and i came here tonight for a sweet treat. We attended the yelp event here a few weeks ago, but of course had to come back to order our...", "Came here for first time for the Yelp adventure.  This place has great parking and seating outside.  Employees are very friendly.\n\nI can tell you they give...", "After my wonderful first experience with the Yelp Elite event at Frosty's, I was more than ready to go back for their Yelp special. They scored points for..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "JaZwlkpd23skffzmpP0psw", "text": ["My wife wanted me to have some Western New York food before we left, so we went to Anderson's to meet a local artist for lunch. On her advice, i ordered an...", "A Buffalo classic ice cream place! \n\nAnderson's offers a variety of desserts, such as ice cream cakes, arctic slushes, hard ice cream, and soft serve. For...", "I'm told this is a Buffalo institution, but I'm left wondering why. I'm more of an ice cream than custard person, and I noticed they only sell ice cream in..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["lunch"], ["cake"], []]}
{"id": "Y5BV7p3eFlFiolOruILm2A", "text": ["This is a very cute little chocolate/candy shop. They had quite a large variety of chocolates. There was sponge candy of different flavors, many types of...", "After dinner we were in need of a small dose of chocolate so why not check out a new candy shop? Walking in here is a little over whelming as this shop is...", "The owner works hard to keep the place afloat. She is also super nice. I come here for my ice cream fix and the portions and prices is more than reasonable...."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["dinner"], []]}
{"id": "_L8Nkx65vLIPmWukzR2K3A", "text": ["For so many years we had Sonic commercials here in WNY and no Sonic! My friends and I took a road trip at one point to Pittsburgh, in a snow storm for their...", "It's about time that we've gotten a Sonic in Buffalo! Like any chain restaurant, you have the staple items and quick service. If I ever have any errors in...", "Sonic is such a novelty for me - now that I don't have to wait until I go to NC to have some I thought the novelty would wear off... Nah. :)\nTheir onion..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "5i3-U0MLQ0FtbUjKiCodgQ", "text": ["This place is the cutest. You can tell it's catered to families and kids. It's bright, vibrant, and it made me smile on sight. I love all of the kid artwork...", "There is a reason this place has and deserves their 5 star rating. PJ COOLS is a top notch ice cream shoppe.\n\nThis cute little shoppe is family owned, by...", "We have SO many fantastic little ice cream treasures in and around Buffalo, NY that we love to try new places.  Yesterday we yelp'd and found this treasure,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "3qLS5SqoyFY1OMMlP17Kig", "text": ["Anderson's will always be my favorite ice cream place. In kindergarten got to go on a private field trip due to having the owners daughter Inga in my class!...", "Long lines which move really fast!\n\nI got the soft serve Greek yogurt with chocolate sprinkles. It wasn't great...wouldn't get it again. It had a weird...", "Anderson's is fast food. If you don't like fast food, go somewhere else.\n\nTheir specialty is beef on weck. Beef on weck is not my thing, but you know what..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["beef"]]}
{"id": "mQ1gky9eaBRl2JgVcXQe6g", "text": ["CUSTARD & MORE: \n- Mirror Mirror on the wall, who has the creamiest custard of them all? DEE DEE's!!! Dee Dee's Dairy is a bit of a drive north of the city...", "Friendly staff, delicious ice cream and soft serve and ridiculously huge portions.\n\nI didn't really notice the size guide before ordering a medium, I...", "Dee Dee's Dairy is the best!! This local ice cream shop is known for their generous portion sizes and friendly staff!\nIce cream cones, milkshakes, Sundaes,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.49], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["milk shake"]]}
{"id": "lLAePpRVR4gsPqldk-tIyw", "text": ["Forgive me stomach, for it is time for my yearly Burger King purge (I only eat at each fast food place once a year and we call it a purge for some...", "I admire their consistency over the years. No matter what or when, they have the slowest drive thru of any place I've ever been. Also they screw up my order...", "This Burger King has undergone a renovation. Top to bottom.  Just finished May 2015.   I still don't frequent BK but I had to check out the new version...."], "rating": [3, 1, 3], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [["burger"], [], ["burger"]]}
{"id": "Q6GkesVJemT-x5VEs_-vDw", "text": ["Yesterday, I had my brother and his wife visiting from Texas... heat birds?    When they come to Buffalo I try to think of a fun place near water for them...", "My husband and I came here to try the Yelp Ice Cream Adventure Special and some food. It's a cute little ice cream shack with a seating area across from it....", "This place is really expensive for basic items, I can get ice cream elsewhere for half the price. I ordered chicken fingers and fries tonight, paid over $9..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, -0.32], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], ["chicken"]]}
{"id": "iyRFvg3ykea8XjuWfwRHZA", "text": ["Sister and I wanted to try this place and found that it was a chain out of Massachusetts! It would be comparable to a Denny's in which it serves fully,...", "July 18, 2018, Wednesday - 9:30 AM for breakfast\n6 Adults and a teenager\n\nAtmosphere - 3 stars\nFood - 3 stars\nService - 3 stars\n\nBackground - Breakfast...", "Great service,consistent food (so much that when you know what you want you don't need the menu), and perfect milkshakes - love this place for lunch during..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.62], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["breakfast"], ["milk shake", "lunch"]]}
{"id": "WfHrkJGRGbcq52rzi8jyqg", "text": ["I live for ice cream. So when I drive by an ice cream place that I have not yet been too, I stop, no questions asked. I pulled into Route 20 Ice Cream on...", "This is the coolest place for ice cream(get it?)\nSuper goood every thing.  Besides all the amazing flavors, memorabilia, swing benches and plenty of...", "Ive driven by this place many of times when going to Lancaster to the movie theater. I know this place is good because the line is long during hot summer..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "GxMntcXKZFCALW-fJXiBsA", "text": ["One of the first craft breweries in Buffalo, started at the end of Lafayette Ave., near Niagara Street, years ago. It has not changed a bit since; it is...", "Here for a Spree event. The event was supposed to be on their new facility on Seventh St., but it was not ready yet . The brewery on Lafayette near Niagara...", "People often ask me where to take out of towners. Sure, there are fancier breweries but CBW is one of Buffalo's first and it's got a ton of character. While..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "pygKUIq9yIGDsR9wGJ1FPA", "text": ["The best donut I've ever had. This was my first time visiting, so I brought home half a dozen for my husband and kids to try as well, and we were in heaven....", "There is not much else I can say that hasn't already been said. This location is simple right off Sheridan drive, in strip mall - easy parking. \n \nThey make...", "My namesake makes terrific donuts.  They remind me of the donuts we used to be able to get here from Mister Donut.  Selection and flavors are impressive...."], "rating": [5, 5, 4], "TBscore": [0.36, 0.0, 0.5], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["donut"], [], ["donut"]]}
{"id": "0dbhOCQPVeraum-p6DIq6Q", "text": ["So if I had to pick sides between the Donut Kraze and Paula's Donuts battle, I would hands-down suit up for battle to defend thy Donut Kraze empire....", "Stopped here for breakfast last Saturday. The shop is unassuming from he outside but pretty cute (and clean!) on the inside with a large donut case to...", "Nice space. Donuts are amazing. I've been to both locations and it is excellent either way. Parking is easy and the prices for the donuts are very reasonable."], "rating": [5, 3, 5], "TBscore": [0.0, 0.24, 0.58], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["donut"], ["breakfast", "donut"], ["donut"]]}
{"id": "AhCATr9PvWW_9le_sWBNGQ", "text": ["The apple cider donuts are addictive. You will be upset with yourself if you buy anything less than the 1/2 dozen. It is so easy to eat at least three at a...", "I have tried them over and over again... and I'm just always left a bit disappointed.  At first bite, yes, yes yes, YUM... but then I'm left with this...", "We love Duke's so much we are had them at our wedding!  They were such a blast & we had so much fun. Everyone loooooved having DUKES!!!!!!"], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["donut"], [], []]}
{"id": "GbLwN-NPsbUj5NphlB0MNA", "text": ["I mean what really needs to be said. Who doesn't love donuts? Who doesn't love AMAZINGLY DELICIOUS donuts? Hands down, the cheese donut (think cheese danish...", "The streets of Clarence, NY can be rough, but there's a place we can go that makes us all feel safe, and that place is Paula's donuts. The staff was...", "Still awesome. Fresh. Filled. Delicious. The line of people coming and going in there is incredible. The staff is very courteous and on top of everything...."], "rating": [5, 5, 5], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], ["donut"], []]}
{"id": "FSCAqQsMv7w51zUJ_COcuQ", "text": ["These are the best Donut's I've had in a long time. Baked fresh serval times a day. \nThere just that good....puts Duncan Donuts to shame.\n\nCream and Jelly...", "Paula's is a cafe offering delicious homemade donuts and pastries as well as limited sandwiches on fresh bagels. I've had their donuts numerous times and...", "Paula's has perfect donuts. I am not surprised most of the Duncan sites have closed in our area, and people seem to mainly choose Tim Hortons for coffee and..."], "rating": [5, 4, 5], "TBscore": [0.42, 0.31, 0.3], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["donut"], ["sandwich", "donut"], ["donut"]]}
{"id": "VBJekd_EHJ3jBT0sc6GPwg", "text": ["If you live in the area and you've never been to Mayer Bros, you're missing out.  Their apple cider donuts are the best around, I especially like the...", "You know summer is ending by two things: Erie county fair & the cider mill opening. \n\nBut if you love fall like me and you love everything about donuts,...", "This place is a staple for my fall. I love the apple shushes and hot apple cider. They also have a wide selection of apple and regular donuts that you..."], "rating": [5, 5, 5], "TBscore": [0.23, 0.57, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "sYluTgygQf4_ls6YB7Ap6g", "text": ["Freshest donuts you will ever get! The eclairs are my favourite!! Their whipped cream is like taking a bite of heaven - so fluffy and airy. I also love...", "We ordered the large Wonton Soup and it came to about 10 pieces. For some odd reason, there was barbecue pork pieces in the soup as well. The soup tasted...", "Came in here late at night and absolutely zero donuts on the shelf. Not impressed. This place is pretty run down inside, and they only accept cash as..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["donut"], [], ["donut"]]}
{"id": "ChBOxGAj8SZlsH6cTSGqqA", "text": ["Delicious donuts at a great price! I stopped here to pick up a few donuts on the way home and was really pleased with the selection they had. I was also...", "This place has such good reviews, but we were so disappointed in our experience. Hopefully it was just an off morning. \n\nMy husband and I came in around...", "I'm going to call this a Fusion diner because what better a combination than Pizza and donuts. They have a 2 slice, can of pop lunch special for $4.50...."], "rating": [5, 2, 3], "TBscore": [0.57, 0.0, 0.43], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["donut"], [], ["pizza", "donut", "lunch"]]}
{"id": "Lvu91F7DuiBXJSgA4BOFCg", "text": ["I'm not a Dunkin' Donuts girl, but I needed a quick coffee run before school. \n\nI have the Dunkin app, which has great deals and has a point system. \n\nI was...", "Anton and Julian are great.  Always a good experience at this location.  I stopped going to the one near my house due to poor service, so I am happy that...", "Whaaaa? Wheeled into the the parking lot at 3:15 a.m. only to find this 24/7 Dunkin was CLOSED! \nHeaded back to work to face disappointed co-workers..."], "rating": [5, 4, 1], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["donut"], [], []]}
{"id": "I8yZxNwEKUyVnA8KmNKTEQ", "text": ["Timing is everything at this location. You come here on an off-minute and you'll get an incredible breakfast sandwich. You get here at a bad moment and...", "Not a coffee drinker so I don't go there for that. The only donut I like is the peanut. The others aren't even half as good as Paula's!!!", "Service was very poor. Employee might have been new but still. Took our order and then left, didn't even begin preparing it and even when he did start..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [["sandwich", "breakfast"], ["donut"], []]}
{"id": "jFna-TIc2204B4zM6s-opw", "text": ["Justin is super friendly and upbeat.  He did a great job remembering the \"usual\" components of my order.  He did a great job making my cold brew!  It's nice...", "This Dunkin' Donuts is located right inside of the Delta Sonic on Main Street making it a pretty convenient location if you need to get some gas. I came...", "This is a second listing for the same location.  I used to get coffee here a few times a week.  back when I drank more coffee than I do now.  This place can..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.23, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], ["donut"], []]}
{"id": "60c6bNXs3RsNMrIrvnGK8Q", "text": ["If Ms Basinger worked here, then it'd be Kim Hortons. And I'd come here all the time, so to speak. In fact I wonder if she was the one driving that truck I...", "This particular location is near my place of employment, so I am inclined to stop here whenever I am early for work! I have never had any issues with wait...", "So it was a tale of 2 out of 3 ain't bad.  But the reality is almost every time I come to this location I need to check everything I ordered for mistakes...."], "rating": [2, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "vuKmR-7LkK6R8Uz4mMLgNA", "text": ["Classic Buffalo bagels. These are lighter in texture than others I have had. The shop is clean and the choices are what you would expect.  Because employees...", "If I'm being honest, Bagel Jay's is just ok. To borrow a phrase from a prior review, \"it'll do.\" \n\nBagel Jay's has one Buffalo location (Delaware Ave) and...", "Giving 1 star because of how rude the employees were and for how the food turned out to be. (As seen in the picture) They couldn't even put the pepper and..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "I5SWEPe9MCjSoR_Z9ffcTg", "text": ["This was my first experience at Tim Hortons. I have to say it lives up to the reputation. Very Canadian due to the courtesy of everyone. \n\nLucas in...", "Coffee is good, donuts are good, service is good.... \n\nHowever they have the worst coffee container tops in the industry, C'mon Tim Horton you cheapskate...", "Tomb Hortons is run by Angelina \"Lara Croft\" Jolie, and serves coffee to all sorts of crazy video game characters. Unfortunately this is not that.\n\nSince I..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], ["donut"], []]}
{"id": "CpFA4fHdZ-B4Clhiqbck7g", "text": ["Dunkin' Donuts may be the king of New England, but it does not reign king in Buffalo. I usually come to Dunkin' Donuts for Loganberry coolatas and nothing...", "Tried the croissant doughnut and it was pretty good! A little pricey compared to the standard $1 at a price of $2.47 but worth the money! Inside was layered...", "I enjoy Dunkin's coffee, but their donut recipes could definitely use a makeover. They were better decades ago. Now they taste factory produced, are very..."], "rating": [2, 4, 2], "TBscore": [0.0, 0.26, 0.28], "normalisedRating": [-0.2, 0.6, -0.2], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "MFewd7Ie38igbMU025RgHQ", "text": ["Ok, it's hot outside at Buffalo's Canalside so where does cool exist???  At Timmy's of course where ICE CAPS await.\n\nI feel for the staff who have had to...", "Store. Exclusive. Donuts. Yes, Tim Hortons is an international brand, but only at this location can you find Sabres' themed donuts. 3 in fact, at least when...", "I understand the Sabres don't win often, but when they do, they advertise an order of Timbits for free with your admission ticket the next day. Tim Horton's..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["donut"], []]}
{"id": "Qla7SWobM5etjFy2szb6-g", "text": ["This is the go-to Tim Horton's while I'm at work, why you ask? Because I work in the Larkin District and it's literally located inside of the Larkin...", "Exchange Larkin location. I think this place should be run by owls and called Tim Hootons.\n\nGreat that they put a coffee shop here for the employees. Second...", "Dark roast. Yes please."], "rating": [2, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "JsMsGZoQWkXcLLj_bfqq-A", "text": ["I'm not a TH regular.  Especially not in the US, I prefer Dunkin.  In Canada I prefer TH.  Not sure why.  Could be a difference in coffee, could just be a...", "Fast friendly and awesome. Thank you brewing the freshest coffee. Ready to venture our mini getaway.", "This is honestly THE WORST Tim Hortons I have ever been to. Every time I come back, I think the experience will get better.. but it doesn't. The wait time..."], "rating": [3, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "XXWsCva1aUEGUGYzZo8sUQ", "text": ["They try really hard to make people happy. Yes can be distracted. They make a great bagel with cream cheese.", "2nd day in a row I purchased a white cream donut .  No cream whatsoever! I can understand 1 day but I guess this must be the norm!", "Come here at least a few times a week for my fix. Five stars!!\nThey always have my coffee ready when I order ahead"], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["donut"], []]}
{"id": "_idTeIGNkrAdfsw4dTbTXw", "text": ["Another Tim Horton's? Yes, because that's what seems to happen a lot of the time. I ended up stopping at this Tim Horton's location on Saturday night when...", "This is the worst tim hortons ive ever been to. I understand that long drive through lines work day morning rush is to be expected in WNY. Sometimes I suck...", "I haven't been to all the Tim Horton's, but this has to be the absolute worst. Nine people behind the counter and it still takes more than 5 minutes to get..."], "rating": [3, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "Ti4k3auAYKxzS56XpOXh8Q", "text": ["I've heard that Black and Blue has $1/oysters Mon-Fri from 4:30-6:00pm, so of course, I had to check this out!  Right after work, I drove over to the...", "So I was contacted by Therese O. of Black & Blue Steak & Crab\nBusiness Manager about my review.  She asked me to email her if I was open to speaking about...", "How have I never eaten here before? And when can I go again! My bestie and I stopped in here for an impromptu dinner date when we discovered thier neighbor..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["steak"], ["dinner"]]}
{"id": "N9kTkaTpanD-33iUQEAQzA", "text": ["Had a great meal here tonight while enjoying the region.  The server was pleasant and attentive.  The food was wonderful and did not disappoint.  My husband...", "I wanted to like this place, but it started off with slow service, we were seated right away, (since we booked our reservation thru yelp) which was great,...", "I'm pretty observant when it comes to service and I definitely give props when props are due. It's hard for me to complain about service because sometimes i..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "b5hOc5wvkZmrWzEd9hDo5w", "text": ["Went there for the first time ever for dinner last night with the family. I didn't expect a whole lot going in because it's just another chain restaurant....", "About what you expect going to a chain restaurant. Beer selection was the same as a dive bar. Nothing to declare themselves unique. Food options was...", "I have to qualify this review because it was a takeout scenario. I always feel uneasy about reviewing my takeout, because it is less that's the full..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["dinner"], ["bar"], []]}
{"id": "-s6Hkm0SCcGwBZMpMcS_2A", "text": ["Wow!\n\nWe stopped in today for the first time, and were completely wowed. \n\nIt started when we walked in, and were enthusiastically greeted and seated by the...", "I have been to this place twice in one week and I regret taking any pictures of my meal! First time I ordered a lemon martini which was very good with the...", "We were down in the falls and wanted to try something beyond the chains. Waiter was very friendly and informative. Food came out in good time and at a good..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "iesyaYhClCY-5ZmRCuImEQ", "text": ["Stopped in with a Groupon and had a good experience! All the dinners come with salad and bread bar too. The salad bar wasn't extravagant, there were 3 types...", "I've passed this place so many times on my way to the Boulevard mall. The parking lot is always busy and I took that as a good sign. However, after stopping...", "I have been to this restaurant many times since it opened approximately 50 years ago. It was one of the first restaurants to have an unlimited salad bar and..."], "rating": [4, 2, 3], "TBscore": [0.88, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["bar"], [], ["bar"]]}
{"id": "FUYl8KCvKR5ycny_jkh4mg", "text": ["Wow wow wow!! This gem has been on my list for too long and I wish I would have come here sooner!  The steak is AMAZING. I don't say that lightly. This is...", "Fantastic food and service. We stopped in for their Tuesday night special, two entrees and a bottle of wine for $50. We ordered the NY strip and ahi tuna....", "Terrible waitress \"Jill\"ruined are dinner,will never return. I am positive she could not even work at McDonald's.Will never go back because of..."], "rating": [5, 5, 1], "TBscore": [0.22, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["steak"], [], []]}
{"id": "2gtYJUXj9ixiWlsX-7-tMg", "text": ["A small, cozy, hidden gem of a place. It's your typical greasy spoon style diner and the interior seemingly hasn't been touched since the 90s but don't let...", "I would have died of hunger at work by now if it wasn't for Milo's. They always have my food done and ready for pick-up in less than 15 minutes so I'm...", "quick, cheap, and scrumptious, is the name of the game. we've been trying to get here for the last few weeks after finding out about this hidden gem. she..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "3KqJpHeQfOQK2_mDZGQigg", "text": ["The hype is real, if you're a fan of Neapolitan pizza. Jay's Artisan delivers -- definitely at a steeper price due to the higher quality ingredients and in...", "I'm always game for eating pizza these days, and Jay's did not disappoint. \n\nI generally prefer red pies over white pies, but of the two pies my husband and...", "I've read where people have found food so good that it moved them emotionally. I had never experienced this myself until my wife who is not prone to..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["pizza"], ["pizza"], []]}
{"id": "wbrCLtLnQIZIcvfcvFjPEQ", "text": ["Great pizza! Need I say more? Actually drooling writing this review seriously craving me some Lovejoy right now. While I have never dined in, my experience...", "I work on the BNMC and this place is my lunch go to. It's fast, cheap and good. I've been here countless times and my go to order is the Turkey Sub combo. I...", "WORST pizza I've ever had.  And the 2 young male staff forgot my order.  The owner kept bragging that his pizza was the best in town, but I have literally..."], "rating": [5, 4, 1], "TBscore": [0.29, 0.33, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["pizza"], ["turkey", "lunch"], ["pizza"]]}
{"id": "UYq3OENxuLy13ER8HjbuUg", "text": ["Overview: I went back here for the first time in 10 years and was delighted it is still the hidden gem I remember!\n\nAmbiance: The seating area has plenty of...", "My favorite pizza place downtown hands down. If you go around lunch time, there is always a huge assortment of slices to choose from. The BBQ chicken with...", "This is for the lower level location.\nBusy at lunch hour but line moves fast. They keep the pie selection pretty well stocked despite the turnover.  A bit..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["chicken", "pizza", "lunch"], ["lunch"]]}
{"id": "4t7FkGkWvJL0hQSjhPGFQg", "text": ["When I moved to Buffalo in 2011, I was NOT happy about the pizza choices until I stumbled upon this gem of a pizza shop! To all my NYC people: this is legit...", "Good place. The guy who brought this place to Buffalo is from NYC so it's legit NYC style pizza. I go to NYC about twice a month and it's pretty much the...", "First time here and in NY!!! We got 3 slices of pizza as well all of them were so delicious and exactly what we wanted when we were looking for NY style..."], "rating": [5, 5, 5], "TBscore": [-0.5, 0.38, 0.58], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "K5pDlLI9nSxv8ZkxMsaFEw", "text": ["If you have been contemplating trying this place, here is your sign to try it. I have lived in Buffalo for my whole life and this is the best pizza I've...", "Excellent all around- the pizza is delicious and homemade blue cheese is a great addition. Here's a new picture of today's pie!", "Spoke with the owner today. Super nice customer service, when the order was taken. Great smile and presence of customer service when walking in. Extremely..."], "rating": [5, 5, 5], "TBscore": [0.6, 0.59, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], []]}
{"id": "1tAlrDXIo9o0nG4Ggp2oMg", "text": ["It had been a while since I came here, so I tried one of their more traditional pizzas and man, it was fantastic!\n\n*Since the parking lot, building, and...", "First time here. My husband & I split a half pizza. We really liked it. Staff was nice too.", "I tried the pizza and also got a cheesesteak. The pizza slices were huge and are not typical NY thin crust. I did not care for the sauce as it was sweet..."], "rating": [5, 5, 4], "TBscore": [0.33, 0.32, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "BJQnVzOFuw7xy1wPu2ppuA", "text": ["I've been going to Picasso's for years for their \"2 Slices & 20 oz.\" deal. I've never been disappointed, the pizza is the best in WNY without a doubt. \n\nI...", "Been here couple of times but this is the first time I am writing a review. Picasso's is my all time favorite in town. \nWould highly recommend this place!", "Not a great slice experience.  Staff unfriendly.  Was there at 3:00ish, and pizza slices were readily available, but I was given the old pizza slices and..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "qk4IyRE4zCIBi-U1NZsW5A", "text": ["great pizza ,if you are grabbing a slice or order a whole pizza, we have only two people so we get a small and it plenty of pizza,always hot and fresh.", "I am a South Buffalo resident and whenever I was in the mood for affordable pizza, I would always turn to Wiseguys.  \n\nWithout questioning other options, I...", "I would've given a 5 on my first visit because it was amazing the first 2 times. The pizza is really good and so are the wings... when they're fresh. The..."], "rating": [5, 2, 3], "TBscore": [0.22, 0.0, 0.42], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["pizza"], ["pizza"], ["pizza", "wings"]]}
{"id": "5cHse4QVKXXjxbpplK7zyg", "text": ["Mmmm.... buffalo pizza.  This place is a throwback to my childhood memories of deliciousness. My dad used to make the trek from Cheektowaga to the old...", "Came back to try a more traditional-style pizza and am absolutely impressed!\n\nI decided to order a half, cheese/pepperoni/mushroom/hot pepper pizza.  It...", "I looked up reviews and found this place and immediately bookmarked it. We decided to order a half pizza which is plenty for 2 people. We had a few slices..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.33, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "SwyYYJSTSbkXkyFLmRH5BA", "text": ["Found this place on Yelp, while visiting Buffalo. 5 of us ventured over to it based on said reviews and it was only a couple miles away from our hotel.\n\nThe...", "Had an event nearby and found a coupon on their site for 50 wings + a sheet pizza. Called an order ahead the day before and the person on the phone was...", "Was in the neighborhood and my husband wanted to try a few slices as we have heard such great things. The police had just opened and their slice pie was..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["pizza", "wings"], []]}
{"id": "koB2gli1xbqzJHc45gVsog", "text": ["A friend of mines is one of those guys that goes around to random pizzerias, & food spots to just try new food because he doesn't like ordering from the...", "I was driving and saw this place, so I thought to try it. To my surprise it was quite good.\n\nAs I walked in the place was quite clean and has a seating of...", "We went with the medium pizza, with one topping, small wings and an order of fries and two drinks. $25 not to bad all. Tasty food, pizza was good we looked..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], ["pizza", "wings"]]}
{"id": "wZwxNoA789FOtyu96cOHiA", "text": ["Stopped in tonight to grab a small pizza for the kids for dinner, I have never had anything from here so on the way home with the pizza it smelled amazing...", "I have ordered subs from here twice and both times were pleasant experiences.\n\nThis place is close to my house so I'm not sure why I haven't had their pizza...", "If I could give zero stars I would. I called up and asked the person answering the phone if they put Parmesan cheese in their sauce, the girl said no.  I..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.24, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["dinner", "pizza"], ["pizza"], []]}
{"id": "b4IMzoh2UqDfawmfElWkhQ", "text": ["Yum... wings perfect. Bartender who served our table was excellent, spot on service with a genuine attitude. Pizza pic speaks for itself.", "I visited the E. Mohawk location downtown the other day; bought two slices, which came out piping hot, and tasted every bit like a NY-style pizzeria helping...", "Delicious Dinner after the game! Eggplant parm with a side of penne. Service was excellent. Thanks Judy."], "rating": [5, 3, 5], "TBscore": [0.8, 0.0, 0.42], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["pizza", "wings"], [], ["dinner"]]}
{"id": "9YlBbSIUjBCkMBDMldE15Q", "text": ["For being a local pizzeria in the heart of a millennial atmosphere Allentown Pizzeria keeps traditional flavors whilst bringing more modern dishes to the...", "Allentown Pizza is one of few pizza joints in Buffalo that has vegan pizzas and delivers pretty late each day. They also have vegan slices in the store.\n\nWe...", "Vegan options available all the time? That's hard to find for pizza, so I was super excited to visit this place while in Buffalo.\n\nYou order at a counter...."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "GFq6qFCEHLUf7LvFE4EKTQ", "text": ["My wife loved her chicken fajita pizza. I liked the cheese and pepperoni however it was very greasy.\nWe loved their Greek salad.\nWe ate in and the place is...", "I frequent this place for pick up orders (though they do have a sit down area off to the left/straight through the main door). It's great pizza with room...", "My co workers and I have been looking for a new pizza place that offers something that we all enjoy. One of them lives around the corner from Bella's and..."], "rating": [4, 4, 4], "TBscore": [0.27, 0.23, 0.21], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["pizza", "chicken"], ["pizza"], ["pizza"]]}
{"id": "HtM-8pCrykmtccQ0ZLEMPA", "text": ["Delicious pizza and reasonably priced! You can get a large pizza for around $15. The crust is on the thicker side, so if you prefer thin crust, this may not...", "I love this hidden gem! It's my go to place for an awesome lunch special!\n\nI love their taco salad, I get it was too much for lunch. \n\nTheir pizza is also...", "I have lived near this place for 4 years and never had been as I simply always forgot about it. One day recently my husband and I were driving by and saw it..."], "rating": [5, 4, 4], "TBscore": [0.27, 0.41, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["pizza"], ["pizza", "lunch"], []]}
{"id": "-bNaS3dAKQKgloIQRVPbAw", "text": ["A long overdue review. We don't order from Picasso's that much because there are decent pizza places closer, but when we really care about quality, it's...", "In my quest to find good pizza in Buffalo, I came across Picasso's and I have to say, I was a little disappointed.\n\nI called at about 6:15pm on a Saturday...", "Along with Imperial Pizza in South Buffalo, Picasso's is in my opinion the best. Stop into the McKinley and Union restaurants often. Top notch!"], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.81], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "8jq2naJmJL1K_8andocJnQ", "text": ["The wings are Awesome!!! You have to stop in at Chuck's and get some of their wings, just the Best, So Good!!! They are Wingalicious!!!", "Awesome portions, great wings and good service. Seating is really tight and can be improved.\nTap collection is great.\nThe place is super crowded so expect...", "Oh mah gawd! Yummy! We are at the Adams mark and they delivered piping hot and super fast! Extra cheese pepperoni pizza to die for and yummy yummy yummy..."], "rating": [5, 4, 5], "TBscore": [1.0, 0.58, 0.21], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["wings"], ["wings"], ["pizza"]]}
{"id": "7mhZfFmeSsYhdEKgW_V9MA", "text": ["Good food at a low price and they treat you like a king thank you guys", "Had two slices of cheese and pepperoni which were great and cheap only 2 bucks each. Also the staff was extremely friendly and polite which is rare now a days.", "Good pizza for a good price. To be honest I didn't know if this place was open or not... could use a bit more brightening. Besides that,the owner was super..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["pizza"]]}
{"id": "vb8TdtTOJ7l5SV57ozkpDA", "text": ["This is the second time I have ordered (this week)from Mustachio's in many years,since they moved their location from North Buffalo to Kenmore.\n\nMy son...", "Have only had good experiences here. The place itself could use some TLC, but the staff is super cool and appear to have a lot of fun while working there!...", "I will start this review by saying I am not particularly picky about my pizza. But I find that whenever I order from them they are reliable which I really..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["pizza"]]}
{"id": "kN-ZdnZf7MBXMxOm8wHd9g", "text": ["Ordered two medium pizzas for pick up recently. Service was fast and friendly, took about 20 mins between call and pick up.\n\nThe first pizza was the chicken...", "I must start by first saying that I was NOT a fan of pizza. I've lived in other cities, and have eaten at several different pizza shops because it seems to...", "Firstly, the food is good. I always enjoy it, especially the garlic bread sticks. But the service is rubbish. \n\nOut of 4 orders I've placed at this store..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["chicken", "pizza"], ["pizza"], []]}
{"id": "2hmGf_6LtDrbPH5xYG_8Vw", "text": ["I'm not a steak on pizza type but I decided to give Jimmy's Big Cheese Steak pizza a shot, and overall, I was pleased!\n\nI ordered a half (9\" - six slices)...", "After trying for 45 minutes for skip the dishes to inevitably not load for me (smh) I ended up ordering for pickup as they are outside of my delivery zone....", "After 10 years of living in WNY I finally tried Bocce Pizza.  I've heard many raves and I was excited to give their food a try.\nSuch a disappointment!\nWe..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["steak", "pizza"], [], ["pizza"]]}
{"id": "XZ8vzuvxyBSpVJNqzEBJfg", "text": ["Love there subs there food is pretty consistent. I've come here for years. Great menu variety.", "Stopped in for a quick slice at 12:10 on a Thursday. I was a little Worried I'd be stuck in a long lunch rush situation, but it took no time at all. The...", "I got a few slices of cheese and pepperoni. There were some things I really really liked and others I didn't care for. \n\nThings I liked: the pizza tasted..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["lunch"], ["pizza"]]}
{"id": "rMm8_wEtLC_RIBiae0H0LA", "text": ["I stopped here for the lunch special,  2 slices and a bottle of soda for $7.50\nThe deal is fantastic. The slices of pizza are HUGE!  I didn't expect so much...", "Mattina's is my local go-to pizza.  Great buffalo style with sauce running all over the edges of the crust, giving it a nice char.  The pepperoni is always...", "Don't make the mistake of ordering a large/whole pizza for two! It's delicious, but when it's the size of a party/sheet pizza, your wife won't be too happy!..."], "rating": [5, 5, 5], "TBscore": [0.36, 0.47, 1.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza", "lunch"], ["pizza"], ["pizza"]]}
{"id": "c19X86McSzcysNJjQ8iOOA", "text": ["My husband absolutely loves this place so we wanted to stop there when we were in the area. I thought the quality and flavors of the food were amazing! The...", "4.5 would be a more appropriate number if I could choose that as an option. Service is always kind, the tables are clean, and the parking lot can be a...", "Came here for a quick lunch since we were in the area to run some errands. It was an interesting experience as you order/build your own pizza and pay at the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.48], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["pizza", "lunch"]]}
{"id": "vGCIqpF8UQXJdj34J0Rd7A", "text": ["I've previously frequented Larkinville but had yet to stop by Hydraulic Hearth. I finally got the chance to stop by after the Larkinville Block Party. My...", "Visited hydraulic this time for alpaca happy hour but stayed for the food and drinks! Every visit here I've had great service and great food. This time we...", "I have been wanting to check this place out for almost two years! My visit was long overdue, but I am so happy that I finally made the trip. \n\nTalk about..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "pe0HbQPZwjzH5zmtSvSoog", "text": ["I absolutely love LaPorta's. The food is wonderful (Minus the soup, although I may have just gotten an off batch. It was a tad watery and tasted like Cup o'...", "First, the service has always been friendly and polite. \nSecond, I really wanted to like their pizza, but couldn't get past the cheese. It has an oddly sour...", "A friend recommend this place for a calzone. I ordered over the phone for pick up. I got there about 6 minutes early and it was still in the oven. Which I..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["pizza"], []]}
{"id": "uMUxiv2W6CDbAyKRKqtkzA", "text": ["We got a large pizza for lunch to share and it didn't take long for it to be ready. We all enjoyed it. It was hot and very tasty. It was cooked perfectly...", "I discovered Ricotta's through a friend of mine. It is the go-to place for her when ordering a pizza, so on a cold winter night I decided to ditch my normal...", "Front of the house Staff seemed like they weren't very interested in taking the order or even being there - but in all fairness , it was a Sunday night..."], "rating": [4, 5, 4], "TBscore": [0.33, -0.22, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["pizza", "lunch"], ["pizza"], []]}
{"id": "9bdsFM1jMmqrroTv1BIhkg", "text": ["My friends and I picked up some stuffed hot pepper ravioli from the south buffalo farmers market last weekend. The gentleman at the stand was very helpful...", "I bought only some of their flavored pastas, not the sweet treats(mostly cupcakes). I had a coupon for up to $5.00 off. The man who was there pointed out to...", "This stuff is the real deal and so fresh and delicious. I made some for my Mom and she oohed and ahhhed through the entire meal. It's a family business and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "wn35BUZpgOy7BR2eipfn7w", "text": ["Best ravioli I've ever had. I don't usually eat ravioli but omg the cheese ones are so good!(: Really need to go buy some more. It's definitely worth it", "Hands down my absolute favorite tortellini in the world. Sounds a bit over the top, but for real, I have yet to find any other tortellini that is half as...", "I went to Gondolas storefront location for the first time a few days ago. Let me start by saying its so adorable, with PLENTY of old school charm this place..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "DlqTDzR10zyt0hpB5DV8lA", "text": ["The only decent pasta you can get while on campus at the university at buffalo. \n\nThe line gets super long so specify a date to go with your buddies knowing...", "Build your own pasta or panini?  How could you not be a fan.  Visited my sister at Buffalo and lets just say that college food has seriously upgraded since...", "Probably the best place to get good on campus, but the long line makes it inconvenient for getting food before class or in between classes. That being said,..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["pasta"], ["pasta"], []]}
{"id": "jkxw8U27l7Tsa2XT2TwuXg", "text": ["I did not expect to come to Carrabba's Italian Grill and eat anything above average. I pretty much expected to come here and enjoy some Ruby Tuesday quality...", "We went to Carrabbas for their bar area special. Each night from 3-6:30 all appetizers are 1/2 price, but only in the bar area. Additionally there are beer...", "My wife and i came here for dinner last night. This rating is so hard for me to give, so let me start by saying if this review was based solely on the wait..."], "rating": [4, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [["italian"], ["bar"], ["dinner"]]}
{"id": "Zx6McAWLkNNQCw7jVN14og", "text": ["OMG!  I found this place quite by accident but was immediately impressed with the charm and friendliness of one of the owners,Sue.  The food was...", "We were a  group of 8 for dinner after a play.  We were seated and Gary, our waiter,  who greeted us immediately. \n   The food and service were excellent....", "My husband and i will continue to go to this bistro for any celebratory dinner we have, we came across it while walking the dog one day and said that we..."], "rating": [5, 4, 5], "TBscore": [0.0, 1.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["dinner"], ["dinner"]]}
{"id": "xlUCl5PPnPN803FXKew-XA", "text": ["First rule: no credit cards.  Second rule: be prepared for some yummy comfort food.  It's a bar with a nice pool table, and a dining area annexed. The...", "Definitely a hidden gem and a must stop for anyone looking for a work happy hour or quick lunch in the area. For being hidden back in a neighborhood this...", "Things you need to know right off the bat: \n1. They do not take cards.\n2. The dining room is very small. Options for large parties are limited. \nI visited..."], "rating": [4, 4, 4], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["bar"], ["lunch"], []]}
{"id": "Dn8CxYwDmeZheWXdDRVXyQ", "text": ["I have been here twice now before going to the theater. Both times I found the food delicious although slightly pricey for the portion. But I suppose that...", "Joe Jerge of Mulberry Italian restaurant in Lackawanna has brought his craft to patrons of the Theater District in downtown Buffalo with the opening of...", "We went to Della Mostra before going to Shea's and I thought the food was really great.  I had the Homemade Manicotti and it was delicious.  The atmosphere..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["italian"], []]}
{"id": "tsqleSAOxWhbyut0m1WerQ", "text": ["I thought Gino worked a diner all day. Jon told me. Turns out Gino actually works an Italian Bakery, but not all day. Just until he runs out of stuff, which...", "Ginos Italian Bakery has many delicious offerings to choose from.  Italian specialty cookies, pastries and cakes.   I've had some of the cookies and enjoyed...", "GET THE ALMOND RING.  You won't be sorry!  The first time I tasted it, I ended up eating a quarter of it in one sitting.  I smartened up the next time and..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["italian"], ["italian", "cake"], []]}
{"id": "2Aec9BtxaYzclVT2HZgoHw", "text": ["Each truffle created by Blue Table is very pretty and colorful. If you like truffles with filling, you're in luck, because the amount of filling in each...", "Wow! Blue Table Chocolates are not only delicious, but from the candy to the packaging, everything is so visibly appealing! The truffles are so colorful and...", "Much better than Yellow Table or Red Table. Also better than Blue Chair. Don't make tea next to them, or you'll have melted chocolate all over your \"Brew..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "qulVHC58b7ZOpB75p5umZg", "text": ["Phenomenal coffee shop alert!  This is hands down the best coffee place in Western New York. I'm not even sure where to begin...\n\nThere's an outdoor patio...", "Super cute place across from the co-op on Hertle.  Opened a few months ago.   Nice outside patio.  They have coffee and tea.  I think two cup sizes, I had...", "Finally, the buf coffee revolution has made its way to North Buffalo! Roots is an awesome new addition to Hertel, and to the larger coffee scene that's been..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "CqdEmeAT8ZaoobJsy-zk9w", "text": ["It's back! Choco Logo reopened last year (http://news.wbfo.org/post/choco-logo-reopens-under-new-ownership) and it's a good as ever. I walked there today...", "I know I wrote a review of this great chocolate factory.  They make chocolates that go across the country.  In fact, if your company ever had \"company...", "BEST BEST BEST CHOCOLATE SHOP IN BUFFALO!!\nI call Dan the owner, \"The mad scientist of chocolate\"\n.  He's sometimes up late creating his new chocolate..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "H9ehUnTRtOzY-ecGD0UQJg", "text": ["Super cool place! Went there to study with a friend and there was plenty of seating. \n\nHad an iced coffee which was good and a wrap which was friggin...", "This is one of the best places to relax in South Buffalo, and if you have a kid between 2 and 5, make sure you check out Storytime! Mr. Tom, the owner, is a...", "Went there last night to grab a coffee and a light bite to eat and boy was I impressed. I have been there several years ago (under different management, I..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "BKgq3diqhQSAvT1SR1Ztwg", "text": ["Pretty much the same as all of their other locations..... except this one doesn't have the selection of Italian Cookies (and I absolutely love those!). The...", "The pizza is delicious and so are their sandwiches and salads. The service can be a little slow at times but we love the atmosphere. Their cannoli and...", "This is one of my absolute favorite spots in Buffalo. The inside is super cozy and intimate. It's the perfect date night spot. There is a beautiful fire..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["italian"], ["sandwich", "pizza"], []]}
{"id": "NBWFlSRsulCEc_JoNybLvQ", "text": ["At first I thought they manufactured Chrus Missiles but then I realized it's just a cute little Polish Bakery on the old East Side.\n\nI really wanted to love...", "I am addicted to the double cake short bread thing with the raspberry jam inside. To die for. Their cupcakes are so good and the frosting is top notch. I've...", "We went to this bakery at the broadway market and purchased some neopalitans because they looked tasty, wow was I wrong. They were stale. I was shocked..."], "rating": [3, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [[], ["cake"], []]}
{"id": "1bRFffTUq8KXTwrbsI-78w", "text": ["Excellent friendly place. Everything was great If you're looking for an old world experience and really want really, really\n good pastries and bread this is...", "Fantastic bakery with super cheap prices. Bought 6 items and spent $16 total. Cheesecake is amazing", "This is where the locals go for there bakery and specialty Italian grocery needs. Amazing selection, from bread to every kind of pastry imaginable...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["italian"]]}
{"id": "Ks04OrE0AEi0rIcI1GY3Ww", "text": ["This Tim Hortons knows exactly what to do to please people in the drive thru- they are fast, efficient, they're never out of things, and the orders are...", "Finally checked out the newest location near me.  \n\nService with a smile! Drive-thru is quick, everyone seems happy and a quick hop on/hop off near the...", "This is my favorite Tim Hortons minus that awful drivethru (if you don't come in the right way either you're too close or you're miles away from the window)..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "ZUeEJPAGHv-15rq9kzPbfw", "text": ["Still love this place! The happy hour deals are unbeatable on transit road and they have different drink specials for different days of the week. \n\nThe...", "Wow!  What a disappointment.  It's a cool looking place,  busy when we walked in and our anticipation was high.  We were quickly let down.  The \"loaded...", "Taco Tuesday done right! (Or any day for that matter!) This place has a really nice causal and classy atmosphere walking in with lots of bar style seating..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "gR6N3-k75znVUwXOhgKj4g", "text": ["This is probably my favorite Mexican restaurant in buffalo. \n\nThey have a great happy hour, nice people .\nThe atmosphere is amazing, they have awesome...", "This place is a buffalo classic. Although there is many variations of Mexican around the city, this one takes the cake. From the variety if margarita drink...", "I really wanted to like this place bc I love Mexican and it's so close to my house. First let me say our server was nice as could be so this has nothing to..."], "rating": [5, 5, 3], "TBscore": [0.61, 0.22, 0.31], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["mexican"], ["mexican", "cake"], ["mexican"]]}
{"id": "1DG1-gDSiU5ks1EmipRXJQ", "text": ["This place is INCREDIBLE! First, the prices are super low but more importantly the flavor of everything we had was awesome! \n\nI wish I wasn't so full I...", "They make tacos, nachos and fries.  I tried a taco.  I probably should have gone with one of the special tacos.   But I didn't really understand the system...", "The food is fantastic, but the location needs some work. Go for the eats but plan to take it with you. I think tacos are meant to be eaten when served so..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.28, 0.4], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["tacos"], ["tacos"]]}
{"id": "R4dEKGft5-Q84XZ_DrO62A", "text": ["I had no idea that mighty taco had salads! I came here for a quick bite to eat at the gym and I looked for the healthiest option possible. \n\nI ordered the...", "The WORST! I'm not really a taco fan, but when you're around friends who are.. you kind of just have to eat where the masses go. Disclaimer: I have had...", "I like that Mighty Taco has vegan burritos on their menu. Vegan drive through food?! That's the type of stuff I dreamed of when I was more or less..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "BpDqsXgL8xnsdPl0LO4xBQ", "text": ["I have stopped by Ziggy's a few times since I used to work very close to it. The food itself is okay. I've had the tacos and burritos and they all tasted...", "Not like how I remember it :-( \nMy grandpa used to bring me in here every Friday after my piano lesson when I was growing up. I'm now 30 and brought my own...", "This was our 3rd time having a bad experience here so had to finally write a review. This used to be a favorite place for a chicken finger sub and tacos. We..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["tacos"], [], ["chicken", "tacos"]]}
{"id": "nfeT1WtWYD4rY0jrlZQY2g", "text": ["Welcome to mighty taco. It's mighty taco, end of review. \n\nLol, been to like all the mighty tacos in the area, place is the same as others. Fast service,...", "So I live right next to the N. forest and Maple location and haven't had a bad taco yet. \nI come here while waiting on my daughter to be done with...", "Had a great experience during my most recent. I stopped in with two friends, and we each got an array of different things and enjoyed them all! \n\nFood: I..."], "rating": [3, 2, 5], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 1.0], "keywords": [["tacos"], [], []]}
{"id": "XIPdvlf5mlk6Xe6HfRcUBQ", "text": ["Little gem of Tonawanda. This place has been here forever and their open till like 4am. Back in my younger, drunker days, yes. I was here a lot. \n\nNow, I go...", "I once made the mistake of walking into Colosso Taco and asking for a chicken \"wrap.\" The cashier looked at me like I was bonkers. \"We're a taco place.\" And...", "Went there for the first time today. Very friendly staff and great food! I got the stinger sub and it was delicious. I also like that this place is open..."], "rating": [5, 4, 5], "TBscore": [0.0, -0.6, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "BhHH-ZhQ-Qh0n78Ikk9yNQ", "text": ["The yummiest and a staple place to try when you are in the area. This MT was a larger location compared to the others I've been to. The restaurant is clean...", "This used to be my go-to for a quick drive-thru meal for the kids and me. Tonight was so disappointing that I probably won't go back for a long time. I told...", "OH NO! Say it ain't so!! You really can NEVER ago home again!\n\nWe were in Western New York having evacuated Hurricane Florence and needed a Mighty Taco fix...."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "KpPr9zZYScwRUnS6pM58mA", "text": ["Yum. No, I'm not a local but I've heard about this place for years. We came here for lunch. They have a lot on the menu and the prices are very reasonable....", "Best food in WNY hands down. Pass on the wings. Pass on the beef on weck we've had at every single family gathering and catered event since you were born....", "This is neither mighty nor a taco. Save your money and go somewhere else. I couldn't have more than a bite of this food."], "rating": [4, 5, 1], "TBscore": [0.0, 0.26, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["lunch"], ["beef", "wings"], []]}
{"id": "Biq6cqZ_3v7HdydlxMg6sQ", "text": ["True authentic Mexican food...JK:-)  If you are not from Buffalo you maybe confused as why the local population loves it so much, frankly so are we, I guess...", "Since moving to Buffalo I've made it a point to give Mighty Taco a ton of chances since everyone here seems to think its great. I would say my stop here on...", "I had my trouble with mighty, but today I walked in. Greeted by Kim. A+ for a wonderful job. Kim took my order and asked me all those questions that corp...."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["mexican"], [], []]}
{"id": "y8-vpZ3IHofNWmLrRO2pCw", "text": ["I've been to this location twice and each time it's been a great experience. It's a little hard to make a left into when traffic is going strong, so I make...", "Mighty taco is a stable of Western New York, if you go there don't expect the best food in the world, but you can expect the best fast food in the world. I...", "I was quite hungry one evening about 7:00 PM and decided to try Mighty Taco again, I say again because my last experience at one of their locations was..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "hB4ymfxYPb9dczoK_ch79w", "text": ["Every year around Lent everyone gets into a full debate about where to find the best fish fry in town, and I remind them how adorable it is that they're...", "Finally caught up with these guys  finally got my hands on one of those fish Higgins, fish was fried to perfection sautéed peppers and onions cheese and...", "Tried the catfish Po' boy for the first time this summer at Food truck Tuesday and it was absolutely delicious. It was hard for me to order anything else..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Rv8DRZ8OHXTPfxhp0K9Knw", "text": ["I called here earlier today to inquire about their new fish tacos. I wanted to know if they were gluten free. I am not a gluten free person, but I was just...", "Mighty Taco, It's Buffalo's answer to Taco Bell and a guilty pleasure of the people here. I remember trying Mighty Taco for the first time roughly 2 years...", "Smart, friendly, courteous staff and the best fast food on the planet."], "rating": [4, 3, 5], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["gluten", "tacos"], [], []]}
{"id": "BLr3pDeZ_gwzDpPM56N6_w", "text": ["I love breakfast.  Like, a lot.\n\nI've been here several times over the course of two years.  Pretty much all standard breakfast fare, but I'll point out the...", "I was spending a night in Niagara before heading back into NYC and was in need to some breakfast before the 8 hour drive back in the morning. I trusted yelp...", "I've only ever ordered the EZ breakfast and will continue only ordering the EZ breakfast.  For $7.99, your plate is packed with 2 eggs, a choice of bacon,..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["breakfast"], ["breakfast"], ["breakfast", "egg"]]}
{"id": "bkW6KjMKKnr5bz5eU1u4oQ", "text": ["Came here for breakfast. Amazing restaurant! Food and service were great! Will definitely be back!", "Down home, country cookin' where everyone knows everyone.  We had western omelette with hash browns and biscuits. It was good food and good service. There...", "We found this diner on our way though Arkansas heading from Louisiana to Wisconsin. Food was great breakfast food and the coffee was the best I've had in a..."], "rating": [5, 4, 5], "TBscore": [0.58, 0.0, 0.9], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["breakfast"], [], ["breakfast"]]}
{"id": "cRM8NEsREU0Q_VehPqwjAQ", "text": ["Who doesn't enjoy supporting a business that serves fresh healthy options?! Many people do know a days..\n\nKornerstone Cafe Larkin not only has breakfast to...", "The newest location of Kornerstone Cafe turns out healthy, affordable and savory meals for breakfast (served all day), lunch or in between, in addition to a...", "This is a wonderful coffee shop! The area is so beautiful. The quality and taste of the coffee is very good. I had an espresso and a muffin. The staff is..."], "rating": [5, 4, 5], "TBscore": [0.35, 0.5, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["breakfast"], ["breakfast", "lunch"], []]}
{"id": "3MdNUD0O6jM1TwH0Ej-BLQ", "text": ["New favorite health food spot! I absolutely love salads/smoothies & all the goodness that goes into them. Homegrown definitely checks off all the boxes for...", "Cool little place for lunch! Homegrown Kitchen has salads, smoothies, and many spots for an Instagram backdrop for sure. I recommend the almond...", "The location is perfect with the medical corridor and UB right across the street. I swung by on my lunch break to see if I could put this place into my..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.28, 0.43], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], ["lunch"], ["lunch"]]}
{"id": "IGbmbEJkvWyvcH0qaUtmdA", "text": ["Stopped here for a drink and dinner before a show at Shea's and it was the perfect quick meal! The bar here has awesome beer and cocktail choices. The...", "It's so hard to give Expo an accurate rating because your experience here will really depend on which of the places you eat at! Overall, this place is...", "Classy cafeteria! Great concept!\n\nI've known about Expo for the longest time but never bothered to venture in for some dumb, ungodly reason. This is one..."], "rating": [5, 4, 4], "TBscore": [0.81, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar", "dinner"], [], []]}
{"id": "5n_ne8kXeH-RmPnNLPY6jQ", "text": ["A nice option for lunch inside the Tri-Main building. I was here for a meeting and started off with a small cup of coffee. There are comfortable booths for...", "The name really speaks for it's self. With the lack of food within the area this place is really convenient especially in the breakfast/lunch hour. It's...", "The food here is hit or miss. The first time I went I had their jerk chicken sandwich which I have to say he was a huge disappointment it was chicken lunch..."], "rating": [4, 4, 4], "TBscore": [0.25, 0.0, -0.23], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["lunch"], [], ["sandwich", "chicken", "lunch"]]}
{"id": "U9tVe706I8X_CdXAb7HqkQ", "text": ["I came here with a small group after experiencing Lock & Key Escaoe room right next door.  I had been dying for some hummus! \n\nOn street parking is free...", "It's been a long time coming but I was finally able to give the House of Hummus on Elmwood a shot last Friday night and it was definitely worth the wait. I...", "Although it's name has 'hummus' in it, it should really be called 'house of falafel.' Honestly, this is THE BEST falafel that you can get in Buffalo. \n\nI..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "rRiMFsTL011vi3GE12nc9w", "text": ["Such a gem!  We showed up with a party of 7 close to their opening time.  Although I had called ahead to see if they would be able to accommodate us (it was...", "The patio is nice and large and so is the restaurant. They use fresh ingredients and prepare the food well, but I find it lacks flavour. I had the pickerel...", "We stopped by for lunch during our recent day trip to Niagara-on-the-Lake.  \n\nThe restaurant was busy for a weekday at 1:00 PM, which is always a good sign..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "jOkrCu9bOYRfXcdtVFOfHQ", "text": ["It's been years since I thought about Natalie's, but we ordered from here for a work lunch, and it hasn't left my mind! \n\nJust FYI, they do not deliver, but...", "Natalie's Mediterranean is a locally owned Middle Eastern restaurant. The family is Lebanese and makes fantastic homemade food. \n\nI've been to Natalie's...", "This was ok, but a bit, well, unusual. \nSchwarma, Perfectly done, is a wonderful wrap. But stuffed with French fries as a filler, not so much. And pickles?..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["lunch"], [], []]}
{"id": "Rv8Vyhbm69JQawTr1QNb6Q", "text": ["Again and again I return to my fave restaurant. \nTable for 4 and we were hungry. 4 apps, a few drinks, including the wonderful Figenza.\n\nThe apps were...", "I am a very regular customer and usually love it here. It has gone down to three stars for me after my visit today.\n\nNot sure if they switched chefs, but...", "I just thought this place was ok. Their cracker/bread for the table wasn't great. Scallop appetizer was pretty good. Calamari app was kind of odd -..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "oBnNIKDtJtA5btyC25Wafg", "text": ["Family and I stopped in on a Friday afternoon when coming  back from Niagara On The Lake and had great crepes, a very good cheese board and coffees. \n\nGreat...", "The food was tasty although I would expect a French restaurant to provide pastries that were locally backed. \n\nThe dishes were very small. \n\nThe service was...", "On a recent trip to Niagara Falls, I was hunting around for a good brunch spot that wasn't a tourist trap. After an extensive search, we found Paris Crepes..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.23], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["brunch"]]}
{"id": "vp5SIKKSPjiPA1Mphu2_Fw", "text": ["Great place on Elmwood. Has a unique vibe for a Greek restaurant. Kind of like a fancy Greek place but goes well with the Elmwood strip.\n\nAlthough I didn't...", "What a great happy hour we had here! $2 off any drinks, and select apps for $5. Tyrosata (spicy feta dip) and keftedes (Greek meatballs) were very tasty....", "Delicious lunch! 2 sandwiches and 2 sides for $20.18. The avgolemono soup was the best I've had in a long time. The Reuben was just so so the corned beef..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.65], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["sandwich", "beef", "lunch"]]}
{"id": "c1kNPC-AZ4Y_G_5DS-KpvA", "text": ["When I heard that OR was opening up in Buffalo, I was extremely excited. Falafel Bar was my favourite restaurant for many years and then it closed for about...", "Oded is back!  We were there for the chef's table opening. So happy to see the new place is small, this guarantees the superior quality I remember from the...", "Overpriced, under-serviced and with meh food. \nIf that's all you need to know to make your dining decision, stop reading & go someplace else, you'll be MUCH..."], "rating": [5, 3, 1], "TBscore": [0.26, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["bar"], [], []]}
{"id": "v_NrupgiSQAn_5GwU1F4og", "text": ["Loved it!!!  \n\nWe went here for a girls night and we all loved everything we tried. The appetizers and main entrees were all delicious.  You can't go wrong....", "Ordered food from here via Doordash. I got the poutine to start and it had no seasoning at all. It definitely would have been amazing with seasoning. I also...", "I was looking for a good place to grab dinner, and the Yelp app led me to Falley Alley.  What made this place look promising was the broad array of..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.32], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["dinner"]]}
{"id": "-QnSa--liKaZXJDXyyw8-g", "text": ["Excellent cupcakes.  Many varieties to choose from and it was open on a Sunday.  Perfect snack after Church!  Yum", "Fresh and delicious scratch made cupcakes. They were a big hit!!!!\n\nThe owner was friendly and accommodating as she worked around my schedule.  If you are...", "I love this place. They are only open on Sundays but will make a custom order for you if needed  for an event. The owner was very nice and the prices were..."], "rating": [4, 5, 5], "TBscore": [0.62, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["snack"], [], []]}
{"id": "uVf51aR6RmxdVSJuTi7D2w", "text": ["I really enjoy Planet Smoothie and any time I'm strolling through the mall (however infrequently), I really enjoy making it a point to grab a smoothie on my...", "I never in my life thought I would be issuing 5 stars to a smoothie place located in a mall like the McKinley.....but here I am, doing just that. I ended up...", "I always have great service from Planet Smoothie. I can ask the same question just about every time I come here, and you'd assume since I'm a pretty..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "VMC1-KEPjpGU5IszbNLeRQ", "text": ["Delicious food! So clean and an amazing stuff!! We ordered the bag of pork which is flavorful and tasty!!", "I've heard so many good things about the pastelitos here, I finally decided to check it out on my lunch break.  Montes is a small deli with some amazing...", "YEEEEEEAH BOYYYYYY!\n\nNothing gets one's attention like the ridiculous and outrageous war cry of Flava Flav (well that and wearing a full size clock around..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.31, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["deli", "lunch"], []]}
{"id": "RG1W4hMeMcAG06qaRtmdOA", "text": ["I always get the twist and shout smoothie without apple juice (no they don't use apples) & I have them add chocolate whey! It's AMAZING!! \nAlso got Pink...", "I had a coupon to buy one smoothie and get one free. It cost about $8. I believe there's only one smoothie size and it's large. I got the Mrs. Robinson...", "This place have a soft spot in my heart and it is my to go to place for breakfast \nI became addicted to pitaya and acai bowls because of this place\n\nI have..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "iSx4ETpVsPUa5MjBXjMNQA", "text": ["Everything in here is always neatly displayed and organized. It smells nice, I can easily find everything I'm looking for, and the staff are all friendly...", "This is my favorite Asian market in Buffalo, hands down. It is huge and completely stocked with amazing food! The store is very clean, spacious and has a...", "I heard about this market from a regular customer at my job! I was super excited to come in. Once I walked in, it was an unbearable smell. I was trying to..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "_abg6c1lZWnHjDNO7glZBA", "text": ["We stopped here in search of some food and gas for our trip back to Ohio; as it is attached to a Noco. Skeptical of the low reviews, but not without a...", "This particular Timmys is quite decent! Typically fill coffees properly, staff is super friendly and service is usually quick and accurate. Convenient...", "They managed to get my order right for the first time today.  Only to take five minutes to figure out how much change they owed me. Can't even bother to..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "ww9oTjvy5QDzvsoRajkjWg", "text": ["Oh My Gosh!! I love love LOVE this place!!! First time going here, and I know I will be back!!\nI came here because they're was a Pop-up artistry event here...", "I received an extremely aggressive and threatening message from the owner of this shop, which was beyond inappropriate. The point of yelp is for people to...", "Like most of my reviews lately... my first time here. I came across this this morning and decided to surprise my husband by going. I said we're going on a..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "PRQV0Wuxt6rulARL0aTbXg", "text": ["Tai Chi is the kind of hangout my high school self would have loved after school, with its roomy booths, games and bubble tea. I still love it, though I...", "I really had high hopes for this place, seeing all of the great reviews, but I fear I set the bar too high...\n\nThe inside decor is really cool! The booths...", "Sister has been begging to go to this place and we adore sushi. Never had bubble tea so I wanted to try. I had a strawberry fruit black tea, with strawberry..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["bar"], ["sushi"]]}
{"id": "h830gINKh9HULEq8IEUcvw", "text": ["Nutto's is a hidden gem. I never would have thought to even stop in the store, thinking it was just for suppliers or restaurants, but my Mom started going...", "I recently bought Belgian candy wafers in milk, white and dark chocolate as well as plain sponge blocks. Hands down the best candy making chocolate I have...", "Great store. Went in for first time today and was very impressed with their selection. It smells so good as soon as you get out of the car. We bought..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "ax86FI7SFs1Yl6W_Kt-VsA", "text": ["7-11 Day! Get a free slurpee at any 7-11. How can you lose. You are greeted  with a smile, even when they know you are only there for the freebie.\n\nI read a...", "Predatory towing.  They work with a towing company to have your car towed even if you are a customer.  Avoid!", "The owner is stealing. Rats droppings on shelves and inside drink coolers."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "0-EhWj8cE1KXMVzLcPCyfQ", "text": ["The best pho I've had in my life! I thought Brooklyn had the best pho until I came here. (I have yet to go to Vietnam so I cannot speak for the most...", "I prefer Pho Lantern on Niagara, but Pho Dollar is A-OK. As a vegetarian, I obviously can't compare their versions of beef pho, but vegetarian food-wise,...", "Best Bahn Mi Sandwich in Buffalo!  So delicious.  \nThe bun is freshly baked and toasted just so it's crust is crispy. Lean, well marinated Asian sliced..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.57], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["beef"], ["sandwich"]]}
{"id": "yR5Ve-h67v2PY2KCxD4D8Q", "text": ["I wasn't all for The Healthy Scratch when it first opened. It's a little over priced, so that put a bad taste in my mouth. But now I find myself thinking...", "I honestly wish there was more healthy options in Buffalo that carry juices. It's a bummer that this one is so far from my house but I've been a couple of...", "Got a chance to eat here while my wife was in an event at Canalside their avocado toasts are very good we make them at home and never thought of some of..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "lN5jP8-45DKV-McphzcN4Q", "text": ["We went to Tipico on our recent trip to Buffalo, it was pretty nice, the atmosphere is great, the whole place is spotlessly clean and tasteful decorated,...", "The espresso just isn't good for how expensive it is and the atmosphere is uncomfortably trendy to the point its sterile. \n\nTwo stars for them raising money...", "Spent about an hour here on a Sunday morning after church. Enjoyed a turmeric tonic hot tea that came in its own tea press as well as the egg sandwich. Both..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.31], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], ["sandwich", "egg"]]}
{"id": "N8ANIkURrlRSPYzHFLFeHA", "text": ["After many people told me about Country Peddlers I finally took a ride over to check this place out. I needed to get a pumpkin pie for my dad's birthday and...", "Adorable little shop. Stocked with fresh produce, locally sourced honey and baked goods. The building itself is a work of art ~ all natural woodwork...", "Convenient, affordable, and great quality. Great stop when I forget something or when I just need a couple things. Fresh produce and fresh deli meats...."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.55], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], ["deli"]]}
{"id": "rt-sTqKiv9450skJuqMsFQ", "text": ["I use the meal prep service and it has done wonders to my diet. I was almost 360 pounds and starting to have serious health issues but using 95 nutritions 7...", "First I will say that the meals here are very tasty. I only ever had one not-so-great one and I've probably purchased well over 50 meals. They're flavorful,...", "Amazing. Food is tasty and appealing. Prices are excellent for the portions you get. They change their menu weekly which is great because I never get bored..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "79bCd9__Zzaf9zshq901mw", "text": ["Awesome staff good food. Definitely a good spot to go to. Ask about the pickles and milkshakes!", "I really wanted to like this place a lot mainly because I like pickles. I went there and they have your casual fair, including wings, sandwiches and subs. I...", "Yummy pickles and fries. Weird little place.  I wasn't very hungry because I was super hot. I mainly wanted a snack and something ice cold to drink. It was..."], "rating": [5, 3, 4], "TBscore": [0.86, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["milk shake"], ["sandwich", "wings"], ["snack"]]}
{"id": "0def6paHCpkSLinZwfXuvw", "text": ["Went here last night to get some frozen yogurt. The place is very clean and all the toppings look fresh. The store was empty while I was in there. I got the...", "This was my first time here, and I left a happy camper!  Lots of options, quiet and clean atmosphere.  The toppings bar makes you feel like an excited kid...", "This is probably one of the pricier fro-yo shops I've been to (I think most are under their 50 cents an ounce) but the fro-yo tastes great and the location..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.33, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["bar"], []]}
{"id": "pmznJGtUyg-PTcfJTOETXQ", "text": ["Great little shop and bakery that carries pies, jams, loaves, and a few more things! For pies they have fresh baked pies out, as well as frozen pies. They...", "I've had 3 things and each was excellent. First was the Buffalo chicken pot pie. It had just the right amount of spiciness without being too hot. My second...", "Happened upon this place while driving by. Stopped in to check it out. It's a small store, with a person behind the counter. I got there right before it..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "WP9ovuPVxo8riIytztnQ5A", "text": ["Spot Coffee is a cafe chain in Buffalo, New York. Other locations can be found on Main Street in Amherst, Main Street in Williamsville, Hertel Avenue in...", "This was my first time at this location. There is a gazebo outside with a piano inside of it that I heard got donated. \n\nThey have a wide variety of...", "Spot coffee is great for quick meals or casual meetings. I do wish the spot in Kenmore was a bit bigger. The tables are close together. They do have parking..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "WgBX6R6Z4_KNHpjit1-niA", "text": ["Looks very clean place , decent food. What really impressed me was how friendly was the service , Mr Michael R service was outstanding. I have been in many...", "Two stars may seem generous but really this place helped pass time since our flight was delayed by 2+ hours. The bar remains open if the last flight...", "If you're flying US Air, you're at the empty end of the terminal with this boring place. Lots of bad reviews about the MTO food. I'm not sure why you would..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], ["bar"], []]}
{"id": "TDxMteB7BZd1k7bzLTzlkg", "text": ["I've been here a few times already and always have had a great experience. Staff is friendly and knowledgable on all the sausages. The prices are great too....", "Ok I will say my son is a very picky guy. So when he came home from school and told me he likes salami, I was floored. Why you ask? Because I bought salami...", "This is the place for authentic German sausage in Buffalo. I met the founder, Erich Spar years ago. He came from a town in Bavaria very near to where I..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "JR4YBfdjlX9614p3dRn4gg", "text": ["It's 4 degrees in United States temperature measuring units. I'm just trying to get a few Big Macs at one am. But I have to count the cash out nbd. We got...", "I made the mistake of going to the men's room on 9/27 and10/11 at about 4;00 both times . Besides having no toilet paper it was filthy. Maybe after the...", "I came at 1130 yesterday and had the worst double cheeseburger ever roll was hard and over cooked and the meat was over cooked and cold the cheese on my..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, -0.47], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["burger"]]}
{"id": "tLU692OG_3DrxT9aoyYm2w", "text": ["If I judged the Pink with my usual criteria, it would be a serious one. As we all know, it's a dark and disgusting magical land with snowflakes and flames...", "We rolled in here on Saturday night after looking for a great dive bar to hit on our road trip. It looked like our type of place, and we were excited to...", "I'm honestly really disappointed in the pink. Tonight my boyfriend & I came out with a bunch of friends for drinks (some friends who were from out of town)...."], "rating": [4, 1, 1], "TBscore": [0.0, 0.59, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], ["bar"], []]}
{"id": "XCewLbNNPn8AiS-sZYXSIw", "text": ["Fun cocktails and great staff. Definitely do the mini Funday if you can (check Groupon). It's worth it. All the cocktails are $9. You can also buy bottle of...", "Well generally I do the wineries, but my hubby likes bourbon and wanted to go here as we tried their bourbon at another venue.  We were going to eat lunch...", "If you're looking for a great evening out with a bunch of friends, you should try the taste tours at Black Button Distilling.  Just be sure to have a..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["lunch"], []]}
{"id": "xhvtoWIUiBoa74zG_mUyFw", "text": ["Awesome wings!  Crispy and flavorful and staff was amazing!  We did a wing tour of Buffalo and this was our favorite, especially the homemade blue cheese!", "Great local tavern! I didn't stay long enough to try the food, but I heard it's good. I'll have to report back on that.\n\nThis was the first of a multi-stop...", "Owners are great people who remember how to keep it down to earth. Good vibe and always a pleasant experience. Bartenders are friendly and food is great."], "rating": [5, 5, 5], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["wings"], [], []]}
{"id": "Qqn5ecXGC-um_q2rQi7cgw", "text": ["This is a fun little club. Holds its reputation. It's kind of a gay dive bar, shows its age. \n\nGood bartenders, strong AND TASTY drinks, reasonable prices....", "My favorite place to un wind and have a cocktail.And play pool listen to music and watch a show it's a great place to just hangout.... Feels like Home.", "This is the bar where everybody knows your name...\n\nGay cheers... order a drink from Jayme Coxx she Roxx..\n\nopen noon-4am everyday, wow...."], "rating": [4, 5, 5], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["bar"], [], ["bar"]]}
{"id": "BmLPoziqjgRL69eMCI3hfg", "text": ["I went here with my boyfriend and I have to tell you... This is probably the best hookah lounge I have been to in Buffalo! Apparently this place was...", "I've been to Lit three times and had a good experience each time. My hookah bar experience is limited, but the environment of this one is definitely not...", "Nice hookah lounge to hangout with friends. Specially while they have nice music. They have special on Tuesday and Thursday's hookah for just $10. The..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["bar"], []]}
{"id": "ETZF9uyAFUlaflL2DECPew", "text": ["I had their mac and cheese special. It was bow tie pasta, with red bell peppers, carmalized onions,  bacon,  and potato frites. It is served in a hot cast...", "The Jake is an excellent spot I kid you not! they did a great job with the place, met my friend there and we chilled at the bar area and enjoyed life....", "This bar is located in the center of Kenmore. Parking can be difficult at times but the inside looks newly redone. I just came for drinks with two friends..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.77, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["pasta"], ["bar"], ["bar"]]}
{"id": "olYNtzISzWTjhe0LmL9l9Q", "text": ["What a cool place! First off staff are awesome, Nina one of the owners is super friendly and makes you feel welcome, music is great, the bar is roomy and...", "Well, I came to Savoy at around 8 PM and I was sipping on the savory new marg they were selling and it didn't taste pomegranate flavored it tasted like more...", "Stopped here for memorial day weekend and the bar created an outdoor beach area in the parking lot outside the bar. Such a pleasant surprise. There was a..."], "rating": [5, 1, 4], "TBscore": [0.57, 0.0, 0.24], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "MDS_QyQJuIWSzIcT2hh2Dw", "text": ["Wee!\n\nThis place is on my corner. Literally. Some people say this and mean that it's sort of close to them. No. This is literally on my corner. I could walk...", "Just went to this bar for the first time and absolutely loved it. Though it's a dive bar, it's clean and relatively big. It has darts, pool and foosball. I...", "a bar with 6 dollar pitchers?! You can't go wrong! \n\nNot much to say, this place doesn't serve food, the bar has a pool table Foosball, and darts. drinks..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.33, -0.36], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["bar"], ["bar"]]}
{"id": "tp_8lsKzlLk-3m7QEy25cw", "text": ["Great little bar off of Delaware ave, place was really nice inside, staff was excellent, I stopped by for a beer with the guys and was very pleased. The...", "Excellent service and food. Some of the best wings in Buffalo and on game days the specials make it really affordable.", "I saved my review until I had came a second time.\n\nWe originally came during restaurant week a few months back. I couldn't find anything I liked on the..."], "rating": [4, 5, 4], "TBscore": [0.57, 0.45, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["bar"], ["wings"], []]}
{"id": "_Kx_NIf5MtmlBYwgFiVi2A", "text": ["Loved the vibe here! One of the spots I visited with a friend when I arrived from AZ, and really enjoyed the food, especially the homemade chips! they were...", "As a regular at the old our bar, I was very excited to see something reopening on its spot after it's sudden and unfortunate closure. After stopping in this...", "I'm happy that I get to review this place before my girlfriend. She loves blues bars and I tolerate them for her sake. This bar has an old shuffleboard..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "I9f9QBUZ-JbW-VPMer6Q2A", "text": ["Ok so this wasn't apart of the food tour but I wanted to write a review bc I had a great time with the college kids here. It took me back to my college...", "We used to go here when we were younger and thought this was the spot to be. Looking back this place was an absolute disaster and I think I spent more time...", "SHITTY ASS DJ! Didn't play any of the songs requested, refused to take any requests, shitty playlist, didn't know any new popular songs. none of the crowd..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "i2hrwv1TcOIPWZfWmdy3Og", "text": ["Small and cozy restaurant. Serve food and wine (of course). Small menu but lots of great options. Came with my mom where she ordered a wine...", "Loved this place! I tried to come last summer but didn't realize they don't normally open til 4pm so I finally had the chance to go last weekend. They have...", "Super cute place with a wine list of about 20 choices... reds, whites, and mini bottles of prosecco. And, they do wine flights. The guy who owns the place..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "88dTTzNRfbQBhcWmnuyUcQ", "text": ["Working here and always looking for the local places. Brunner's Tavern didn't disappoint. Ate at the bar and had the filet sandwich. It came with a. Side of...", "YES YES AND YES!  This place is always top notch to visit.  I usually make my rounds here a few times a month and I'm always happy to come in here.  I used...", "It has been many years since I've been here however in previous years I would come here with my parents often for the Friday Fish Fry so after Mom recently..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["sandwich", "bar"], [], []]}
{"id": "6uG-sgf5Y1EDY8HJLDNlmQ", "text": ["Checkers is a mainstay on Hertle.  It's been here forever.  So when it closed a lot of us were surprised.  And a little shocked.  But it has quickly...", "Compared to the old Checkers, JPs Checkers like freaking luxury!!! You kidding me it went from Buffalo grimiest bathroom place to absolutely gorgeous. Great...", "The fact they kept the name \"checkers\" in the name just to steal big events like the turkey trot . When the owner wasn't even a patron at the old checkers...."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], ["turkey"]]}
{"id": "qlXrKlgPKu_Pi91u-SawVg", "text": ["Food is tasty especially the wings, Cassie and John both do a great job behind the bar, and you can't beat the happy hour prices. Only issue some people...", "If that older blonde lady is at the bar, LEAVE!!! You will wait 20mins or more to be served, she'll leave out for countless breaks and she had the nerve to...", "The nicest, most attentive bartender in the world world here.  He is slight with a shaved head and looks like he could stand his ground, and unsolicitedly..."], "rating": [5, 1, 5], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["bar", "wings"], ["bar"], []]}
{"id": "3H22nYapwBCs_CvtGVOmjQ", "text": ["Cool local dive for local music. Drinks are really reasonable. Bar service is solid. Mad Max was on the tv, so that was pretty awesome to watch between...", "Friends brought me here for the first time and I absolutely loved it. Seems like a great dive bar in the dt region of buffalo that has its usuals. Had a...", "Great dive bar in the greatest city in the world. \n\nThey have PBR, it's cheap, they also have decent beer selection. Nice pool table, pinball, good service,..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.58, 0.61], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "cqjRzEUUGfFVvNodtHNKRw", "text": ["Been going to Goodbar for as long as I've been able to legally drink. It's got divey vibes, but that's its character. \n\nThe bar is approachable as soon as...", "Mister Goodbar is one of my favorite bars in the Buffalo area. The location is what I like the most, very close to other great bars and food options.", "This is one of my fav bars in Buffalo for the beers, prices, and specials. They have a good vibe generally as a more sports centric places, but it doesn't..."], "rating": [4, 3, 4], "TBscore": [0.22, 0.38, 0.4], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "UR31de1u3xPyKQ3QKkkmhA", "text": ["a nice small bar with great beer deals! To bad they dont accept debit cards for their customers but they do have great deals that you can go in and have a...", "The Good: local feel.\n\nThe Bad:  don't accept credit cards; ATM machine with a fee for cash; pour for drinks is very lame (see picture) it's like less than...", "Make no mistakes, this is a neighborhood joint. More commonly known as a dive bar. A bit \"on the path\" yet packed with locals and free of trend. Full bar,..."], "rating": [3, 3, 3], "TBscore": [0.29, 0.0, 0.24], "normalisedRating": [0.2, 0.2, 0.2], "keywords": [["bar"], [], ["bar"]]}
{"id": "y_AhfuXAaTMFnkLMQFL4PQ", "text": ["I love this little place. The guys are so genuinely welcoming, the atmosphere is cool, and it's just a short stroll down Main St. from the theaters I...", "As a lover of beer, good service and film - my hats are off to these chap-lins. Pun intended. These native western New Yorkers have gone under the radar for...", "I have frequented this place of late, as it has become a destination of choice for actors downtown.  It's awesome when it's not too crowded; great for quiet..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "4vtmy3IduXVhjljTNyP-qw", "text": ["I've been here countless times and continue to come back because the food is tasty and the people are very nice. \n\nWe ordered the hummus, meat kebabs, and...", "The felafel was terrific. Larger than most, perfectly crispy on the outside and hot and soft on the inside. \nSpeaking of the inside, this is the type of...", "Great food and good sized portions. The prices are reasonable and they pump out orders quick."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "xwSL908wXOa6e7p7WaCUCg", "text": ["This is an exciting new addition to the culinary offerings on the West Side/Buff State area.  Of course its not brand new, but a free-standing version of...", "There's a new Lao/Thai/Burmese/Bubble Tea place on Grant Street and it's delicious with great prices! The woman from West Side Bazaar known for the Lotus...", "This place is awesome! Highly recommended if you want authentic Laotian! Very clean and the staff is friendly and attentive."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "tvtA2uPySgfEl4J967qj2g", "text": ["Went here right before closing. A little hard to find as it is not a restaurant of its own but rather a group of businesses sharing the same building....", "As a Chinese person, I can say this is not good dim sum. The shrimp dumplings were the tiniest shrimp dumplings I've ever seen a dim sum place serve. Those...", "Some of the best dim sum I have had in this area. The shu mai was perfection. It was well seasoned, soft and juicy. The char sui/mega bun was soft and the..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["chineese"], []]}
{"id": "CSKxgHTFNLyYha4FW7qLOQ", "text": ["Food is always good. Made fresh for you. I ordered the General Tso and Sesame Chicken lunch combos and they were both tasty. Each came with a choice of side...", "Sometimes you just want to find a small random Chinese place and eat there, which is exactly what I did on Sunday night. I had a hankering for some sweet...", "I was just looking for Chinese within a 5-10 minute drive, so Chinese Kitchen was the highest rated. General Tso Combo, A small shrimp fried rice, and small..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["chicken", "lunch"], ["chineese"], ["chineese"]]}
{"id": "xVVPna8jYyCE0wXutPJBeQ", "text": ["China Star is our favorite Chinese take out. The food is very good and flavorful. The size of the portions is okay, it comes with more than enough white...", "I love love love love Chinese food. I want it all the time. It's my go to take out order, my first choice in any mall food court, and my favorite kind of...", "Love this place. My favorite are the shrimp egg rolls and the egg foo young. There shrimp fried rice is also good. Reminds me of the Chinese food I had..."], "rating": [4, 5, 5], "TBscore": [0.34, 0.42, 0.36], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["chineese"], ["chineese"], ["egg", "chineese"]]}
{"id": "kUdT5GORVBoE6vY-VtkaoA", "text": ["I've been coming here as long as I can remember. Your typical Chinese American food  but it is very high quality. Best in the area by far. This place is...", "Hands down my go-to neighborhood Chinese place! The food is delicious, portion sizes are huge and prices are great. It's not fancy by any means. Just your...", "Easily the best chinese food take out I have had in WNY. The sesame chicken and general tso chicken have the right amount of breading and sauce.  The sauces..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.41, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["american", "chineese"], ["chineese"], ["chicken", "chineese"]]}
{"id": "4fIPU-PirHzBYs6uWNgRlw", "text": ["This is my favorite \"Chinese\" food spot in North Buffalo.  I love the bbq spare ribs with a side of white rice.  The wait time is never long, the people at...", "Meh. Strip plaza Chinese food in a place that looks like it's in the middle of a renovation. The floor is missing tiles.... and packages of building...", "Finally, a place that has General Tso chicken that isn't hush puppies with sauce. Next time when you eat your General Tso chicken from another Chinese..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["chineese"], ["chineese"], ["chicken", "chineese"]]}
{"id": "9pNnjWCoqLiHcM9ybQcEBw", "text": ["This is our favorite Chinese restaurant in Western New York. It is owned and operated by husband and wife. Food is delicious and reasonably priced. Only...", "Order the sweet and sour chicken to go... the restaurant has 1 table and it took about 30 minutes for my 1 order to completed.\nMaybe just me but for $15 and...", "The atmosphere and food were just wonderful. We ordered all vegetarian items which were very fresh and delicious. This is definitely not your cheap greasy..."], "rating": [5, 3, 4], "TBscore": [0.26, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["chineese"], ["chicken"], []]}
{"id": "oOfVnY2iyMEGnItEtecnkA", "text": ["This place really hurts itself by its appearance. I wanted to walk out the second I walked in, there's boxes stacked everywhere, tables covered with junk...", "The family working was nice. The food itself wasn't anything special. I ordered the General Tso's chicken and the chicken was dry and crunchy (brittle) It...", "I have been searching for good Chinese food in the Kenmore area.  And... if I am being honest with myself... when I say \"good Chinese food,\" I mean..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.28], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["chicken"], ["chineese"]]}
{"id": "C4S9Mcs4-HoaZZvKW403Bg", "text": ["This has been my go to Chinese restaurant for the longest time.  Since I moved to OP it's been difficult to go to my favorite Chinese spot, but today I...", "Best Chinese food in WNY in my book. Stopped by randomly when we were out shopping over a year ago and have been back many times.\n\nFirst the woman behind...", "We don't order Chinese take out often, but today we had a hankering. Gin Gin is close to home, so we finally gave it a try.  We ordered a beef & broccoli..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["chineese"], ["chineese"], ["beef", "chineese"]]}
{"id": "hbP2ewQ-WqR1fdo272111w", "text": ["We decided to try out this restaurant as we were in the area. This is by far the friendliest Chinese restaurant I've ever been to, considering how lacking...", "This place is amazing, been going here for nearly 20 years and I'll continue to go there until the day they stop business. The people are amazing and kind,...", "Horrible service. My experience here was terrible they did not provide cups when we dined in and bought a liter soda instead they said each cup is 5 cents..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["chineese"], [], []]}
{"id": "WYp4klviQ5oEunFFu168aQ", "text": ["Wow!  The best Chinese food in Buffalo is actually right over the border in Fort Erie!!!  \nIt's  literally 5 minutes across the border, and so close!  The...", "I love Ming Teh, we've been coming here for a few times a month for the last 8 years for two things - fragarant clouds and dry fried beef strips. Totally...", "I am beyond impressed with this food. I came here for dinner. The place was pretty packed, our server told us it would probably be a while for our food. We..."], "rating": [5, 5, 5], "TBscore": [0.46, 0.0, 0.62], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chineese"], ["beef"], ["dinner"]]}
{"id": "k7UEo1R0h-SK6tqVABuQyw", "text": ["This place is pretty great. Don't come if you're looking for American Chinese! But if you're looking for great Xi'an style food or just something different,...", "I had high expectations for this little mom/pop restaurant that serves Xi An style Chinese food - I believe a first for the area!\n\nLocated just 1 street...", "It's a tiny place but the food was pretty good. Ordered the Chinese hamburger & spicy chicken pot (both specials). The food was kinda pricey but looking at..."], "rating": [5, 3, 4], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["american", "chineese"], ["chineese"], ["chicken", "hamburger", "chineese"]]}
{"id": "sOn1YOgvlOJHSG64i60qkw", "text": ["This place is great! They literally know us when we call or walk in. The food is awesome. We order at least once a week. Their seafood &noodles is my favorite.", "So glad to finally have Chinese in our hometown neighborhood! AND it's really good! Great value for fresh delicious Chinese in a clean welcoming...", "Just ordered them for the first time. We got their Sweet and Sour Chicken and Beef and Mushroom combo meals. Well all both were absolutely delicious! The..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["chineese"], ["chicken", "beef"]]}
{"id": "ORmyd4_X54s_8gARVmm91g", "text": ["Every time here is amazing. Great service , friendly people ! The food- I can't expect you to understand but this is the best food ever. Chef in the back is...", "Best Chinese food around. \nIt has an off day sometimes not gonna lie \nBut it usually has a great track record of good Chinese food!! \nIt's a little higher...", "This restaurant deserves a five but as mentioned by previous reviewers some of the staff provide horrible customer service. The older people probably the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["chineese"], []]}
{"id": "oGdtlgCBcx1EmYj-lY07ZQ", "text": ["Great Chinese food!!! My favorite so far here in Buffalo. Always fresh when I go and they serve a lot, very generous. Nice employees and decent prices.\n\nI'm...", "I'll be darned if I didn't take pics of our meal! My family and I enjoyed a small feast that barely smacked our wallets!\n\nWhile staying in a nearby extended...", "A great little Chinese take-out place in the West Seneca area.  The staff are super friendly and always remember to remind you if you qualify for one of..."], "rating": [4, 5, 5], "TBscore": [0.33, 0.0, 0.26], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "myXxVnGbcwdI_RhkLfmNKQ", "text": ["We were given a gift certificate for the Eastern Pearl but we had never gone before.  We had two adults and a seven year old.  The hostess was very friendly...", "Have been here a couple times and really like the food. The menu is large and has a ton of choices. Even my pickiest family members found something to eat...", "This is one of the best Chinese restaurants we have been to. The service is prompt and the food is fresh.  We enjoyed the edamame,  then shared two entrees...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["chineese"]]}
{"id": "zg81Shk60l1PvNSnMOquoA", "text": ["I order Chinese food very infrequently, mostly because Chinese food isn't on my mental take-out radar most of the time. Even though I don't eat it often, I...", "I always get great service and great food!", "As far as Chinese take-out goes, this is my favorite in the southtowns. My family has been ordering from here for years. My husband always gets the General..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "LYgOzxxmEUa2M4i3K4MzvQ", "text": ["My first malatang exerience was here,  approximately 3 weeks ago. Very fresh and authentic. Costly though ($14). Mouth numbing indeed. Loved the inclusion...", "The food is normal, each dish is about $5 over price. Not a good service, you need to call the sever every time for something. Spending $50, I feel like I...", "Wow terrible experience here the waitress was trying to force you order more which made me feeling offended. The food itself is mediocre."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "bN2QAv0Hd-zUhyiSnO1zMA", "text": ["Three words !!!!! GOOD, HOT and FRESH !!!\nThis is my go to chinese place when I'm craving \nEgg rolls, chicken wings or the great ol General Tso. It's not...", "Enjoyed the food. Will be back. Was really quick and the staff was friendly. Had the Pepper Steak w Onions which was great, egg roll, and fried rice were...", "We were delighted to find this place - an alternative to the Golden Dragon just south of this location on Harlem.\n\nHunan Wok serves piping hot, well made..."], "rating": [5, 4, 4], "TBscore": [0.26, 0.4, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["wings", "chicken", "chineese"], ["steak", "egg"], []]}
{"id": "vvHeuCWiX3CO02bfoBb7bw", "text": ["I have had China Kings General Tso's combo platter a few times now and have found it average.  I prefer several other places around Hamburg / Blasdell...", "So far iv gotten really good good here, only thing is the rudeness i seem to get when I call it's like I'm inconveniencing then by ordering food. Prices are...", "This place is great! One of my all time favorite chinese take out places locally. Ingredients always fresh and doesnt leave me feel bloated like other..."], "rating": [3, 3, 5], "TBscore": [0.0, 0.0, 0.28], "normalisedRating": [0.2, 0.2, 1.0], "keywords": [[], [], ["chineese"]]}
{"id": "8_-LRKSaN55RSMQB0fdoeA", "text": ["Their delivery driver just hit my vehicle and took off. Management not trying to cooperate and denying the entire incident. Even though we have several...", "Great food . But get someone who speaks English to take orders on the phone.  Very  rude on the phone . Very bad service it's sad that that lost us as...", "This place used to be a KFC, but then someone from the UFC who supported LFC bought a team that plays in the AFC East and teamed up with ABC to sell ATBs in..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "xBO8FuhJ49BVjeXlUOJ-0Q", "text": ["Call me jaded - as I've recently relocated from the NYC metro area.  After a year, my search for good chinese take out has ended.   Thus far, I've had the...", "Your typical Chinese spot. I think one of the better ones in the area. Food is decently priced. \nTried the orange chicken (actually for the first time) and...", "Mmmm first, this not a place to bring that special lady to nor would I suggest it as your meet & greet choice for the mystery person picked from an online..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["chineese"], ["chicken", "chineese"], []]}
{"id": "AeA8kf8WSXmYlZIjTFfCxg", "text": ["Before I get into what I thought of my visit to Great Wall, I want to point out that a person reviewed a Chinese Restaurant, called the food pathetic, and...", "Let me start out by saying this is my local Chinese place. Would I drive out of my way to order here? Prob not. However it's a mile away from me and food is...", "I have noticed that wherever I go in the country to visit a \"Great Wall\", the (American) Chinese food is terrible. \"Great Wall\" must be another name for..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["chineese"], ["chineese"], ["american", "chineese"]]}
{"id": "y08ap7juvqiZCWav9Ul28Q", "text": ["China Jade Kitchen is a small establishment with grand establishment qualities.   I am very particular about my chinese food and where it is cooked so with...", "This is my personal favorite Chinese place in the area because it's always consistent quality. They cook everything so quickly and they are super nice too....", "Yang Chow Fried rice was good.\nEgg foo yong\nGeneral Tao chicken\nHunan shrimp\nBbq ribs\nBeef & broccoli\n\nThey are very busy with take-out orders."], "rating": [5, 5, 3], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["chineese"], ["chineese"], []]}
{"id": "rYVwhNCm3tNKkLbrrFWSag", "text": ["I stopped into Dragon Express on Sunday while waiting to pick up tickets for an event at Shea's down the street. This restaurant is massive for the kind of...", "Average Chinese food with a terrible dining room.  Overheard that the egg rolls were terrible... I would avoid unless you really wanted Chinese food in...", "This is definitely what you would call a dive. Food tastes good and at a good price. It is better if you do take out. Anyone who hasn't traveled the world..."], "rating": [2, 1, 4], "TBscore": [0.0, -0.33, 0.0], "normalisedRating": [-0.2, -0.6, 0.6], "keywords": [[], ["egg", "chineese"], []]}
{"id": "qpLqEjeMPQmlzNYO1m7_4Q", "text": ["Do not go here! I love a cheap Chinese food but this is awful excuse for it. We have tried multiple dishes--different meats and sauces--and none of them...", "Fast and tasty Asian cuisine.  The place to go for takeout in Lancaster.  They have a dining room, but most people buy and go.  The thing I like the least...", "Live just around the corner from China One Express and after stopping at the Tops to pick up some groceries was stuck for something to do for lunch.\nPeeked..."], "rating": [1, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [["chineese"], [], []]}
{"id": "RqTZR7brS2VuuAmoFVCCZg", "text": ["Maybe the only Chinese restaurant where I've cut into a piece of General Tso's chicken and not wondered if it is, in fact, actually chicken. Prompt service,...", "Ordered takeout tonight. Lady on the phone was so monotone and not personable at all. \n\nI should have know when I ordered in quarts and pints that I wasn't...", "Was going to order from my go to Chinese restaurant, but saw on Yelp that Sesame House was closer and rated at 4.5 stars. We put in our order for four lunch..."], "rating": [5, 2, 3], "TBscore": [-0.23, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["chicken", "chineese"], [], ["lunch", "chineese"]]}
{"id": "0TA72ZTxOsBIpNg7_BxE-Q", "text": ["It-was-PER-FECT! Variety of food for all! Different kinds of sushi, steak, dishes, seafood, soups, salads, desserts, at least 10 different flavors of ice...", "Haven't visited in a while so my sister and her bf joined me last night. The place was packed. For a big parking lot, there was hardly any parking. \n\nFood...", "Love it here.. always yummy ! If you are to go try and go during lunch or dinner hours cause fresh food is always better food. Haha think it was like $15..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.41], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["sushi", "steak"], [], ["dinner", "lunch"]]}
{"id": "cpGHSCLnXPqW5eaCJX894A", "text": ["You know what really makes me happy? Having a reliable, tasty, and close Chinese takeout place 5 minutes away from my work, and that is exactly what House...", "Exceeded my expectations! Ordered kung pao chicken and egg foo yung. Both very fresh and cooked well.", "Really nice takeout place. The things are made right away. Only thing is, some of the items in the menu are a little weird. By weird I mean, they are not..."], "rating": [4, 4, 3], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["chineese"], ["chicken", "egg"], []]}
{"id": "UadeDydsCacUILvNa3-TTw", "text": ["Hong Kong Kitchen has been remodeled very nicely.  The food has been good all along so now it gets 4 stars.  Today I ordered the pepper beef lunch special....", "To start, the woman behind the counter is rude and miserable. Food was excellent once, now, it's mediocre at best. Sure not worth the attitude you receive...", "Food is usually delicious.  However the woman (younger) running the phones is not the friendliest."], "rating": [4, 2, 3], "TBscore": [0.61, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["lunch", "beef"], [], []]}
{"id": "i3m-RxcWC7OJFm1K2ssISA", "text": ["Adequate food, but not nearly as good as the Golden Duck.  The food is fresh but bland.  I prefer a restaurant with a Chinese menu and unique items.", "If I could give it a 0 I would. This is a far cry from when I was in high school when it was wok 22. Ordered general Tso's combo meal with lo Mein instead...", "These employees are so RUDE. My boyfriend and I wanted to order Chinese for dinner and they were so rude to us on the phone. They didn't understand how to..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chineese"], [], ["dinner", "chineese"]]}
{"id": "x8B4ZTygDeMgqmdB9BaYZQ", "text": ["Amazing pad Thai! Kumiko is a gem in our neighborhood, everything we have ordered has been delicious!", "Their food is really good, but every time I order a meal mild it comes spicy. I can't handle spice with some medical issues so it renders it inedible for...", "Ordered the Sesame Chicken, Pad See Ew, Chicken Panang, Tom Kha, and Spicy Tuna & Avocado sushi roll.\n\nI haven't had my beloved sushi in a long time, but my..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["sushi", "chicken"]]}
{"id": "qPFWNwTSfIcZdfS8C-S9oQ", "text": ["The transit location is not my favorite. The one on maple is the great one. I had no choice though. I was by transit. This time I ordered take out. I have...", "I love Hibachi. Fresh cooked food right in front of you, generous portions, all for a good price. Unfortunately I would have to say that Fuji Grill is my...", "Their sushi lunch is always quick and the same great flavor consistently time after time. This location is our go-to for sushi lunch. Sometimes it's busy..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.3], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["sushi", "lunch"]]}
{"id": "O4lbXvayHvEtFYMSMmDI6g", "text": ["Authentic Japanese cuisine off the beaten tourist path. When my husband and I dined in for lunch, the vibe was relaxed, providing a nice reprieve from...", "I had the crunchy salmon roll which was fine, nothing to write home about, small. Their spicy mayo is actually spicy which is nice. Good miso soup... but...", "Visited Yukiguni on a weekend trip to Niagara Falls because it's within walking distance of the main hotels and tourism area. Overall, the service was..."], "rating": [5, 2, 2], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["japanese", "lunch"], [], []]}
{"id": "wBYPKss_z1-yxjDNzZ7YCg", "text": ["Food is good. However, for those who are talking about Japanese food...this isn't Japanese food. this is American food with some Japanese flavors. if you...", "Let's be honest, Japanese food at the mall is delicious.\n\nOkay, I just wanted to get that out of the way. This place is located right in the food court at...", "I used to love the food here; but after a year or more hiatus, I returned to a bad experience and will not eat here again.\nEDIT- forgot to mention: no..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.48, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["japanese", "american"], ["japanese"], []]}
{"id": "meISlM03h4fBaewxXHEmHQ", "text": ["I went here for dinner on a Thursday night at around 6pm. There is also a little koi pond off to the right when you enter, which was really cool.\n\nI did...", "After a year of forgetting to check out Kyoto, I finally made it! I stopped at Kyoto for dinner on Saturday night and was super excited to see what this...", "Finally got around to checking out this place and we are really glad we did. When we walked in, it was super busy, esp for a Thurs night, but there was only..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.24, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["dinner"], ["dinner"], []]}
{"id": "F2kM78gSTwltR1qS19zjlA", "text": ["Where can you go for great food, and even a great show?! - Fugi Grill! \nJohn and I came in for lunch during the week and we left completely satisfied. Much...", "I feel as though over the years I've spent a good amount of money to this establishment, and gave my business even though they are a chain restaurant. \n\nIf...", "I have been there a couple times with colleagues and i have to give it a good score for the quality of the sushi offered. The rice is moist, which is very..."], "rating": [4, 2, 4], "TBscore": [0.5, 0.0, 0.45], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["lunch"], [], ["sushi"]]}
{"id": "bflGBHARCh6H_h7NCvEP-w", "text": ["I tried this place for the first time today. I ordered the three roll lunch special and shrimp dumplings. I had the eel avocado roll, crunchy spicy...", "This is my favorite place to get Japanese food. Samurai is not only affordable but high quality. I was happy to find them open on the 4th of July so I could...", "Love this place, service is friendly and it is usually quiet (not sure why because the food hasn't disappointed), the chicken hibachi is large enough for 2."], "rating": [5, 4, 5], "TBscore": [0.3, 0.24, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch"], ["japanese"], ["chicken"]]}
{"id": "zG4qfx5s1c-cbGXiBBxCpQ", "text": ["Excellent meal all around. From the miso soup, fried octopus, seafood dumplings, sushi boat, edamame to the chirashi. Drank about 5 glasses of water each...", "I haven't found a place I'd send people for sushi in the area until I came here.  \n\nWe ordered sushi rolls, nigiri and sashimi.  The sushi isn't bad, it's a...", "We were in the area for our annual GWL getaway. We don't normally eat at GWL, cause the food is not good. Japanese is usually one of the meals we head out..."], "rating": [5, 3, 4], "TBscore": [1.0, -0.7, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["sushi"], ["sushi"], ["japanese"]]}
{"id": "ekjwEUX3OqEPbqAbtQ_bgQ", "text": ["This is one of the nicest Sushi restaurants in the area.\nThe staff is always friendly and accommodating.\nThe sushi is fresh and the menu is full of unique...", "Sunday lunch. A few people stopped in for take out, and there were 2 tables of people eating in. Fresh, fresh, fresh. I had a yellowtail had roll,...", "I went to sake cafe last night with a friend, iv been here a few times now and I continue to return as it has delicious sushi, and I am a HUGE sushi fan. We..."], "rating": [4, 5, 5], "TBscore": [0.35, 0.0, 0.3], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["sushi"], ["lunch"], ["sushi"]]}
{"id": "fDd_p6nACDOq3CaRBiy11A", "text": ["Got out of my comfort zone coming here and trying something new. Tried Chicken Pad Thai for the 1st time based on other's reviews of this restaurant....", "Not impressed.\nUgly bright ceiling lights.\nThe place was empty on a Saturday night, a telling clue we mistakenly ignored.\n\nThe sushi was sub...", "I'm very happy with the service and food I enjoyed this evening. Although I did overdo it.\nSpicy salmon,tuna, yellow tail, salmon skin.\nAlaskan roll and of..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["chicken"], ["sushi"], []]}
{"id": "CH8YclnHqybHe6q_bC8SnA", "text": ["I went to Fuze Asian Grille while staying in Buffalo during a business trip and it was easily one of the best Asian restaurants I have been to in that area....", "I came to Buffalo for a conference, and coincidentally I chose to go here for lunch on the same day that they took us here for dinner... On the bright side,...", "Came for dinner during restaurant week and ordered the Mango Salad, Sushi Chef Creation (Crab Rangoon with Salmon Roll and Miso Soup), and Mango Spring..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["dinner", "lunch"], ["sushi", "dinner"]]}
{"id": "oX0U6a9fF0dGY-EkRYFyyw", "text": ["Good sushi, great lunch specials! I prefer the raw seafood. I had the yellowfin, tuna and spicy crunchy tuna. My office ordered delivery and it only cost $1...", "Your typical sushi place, consisting of different varieties of rolls and sashimi. I've only had their lunch special here, and it was very good, so I do...", "This place between 3 and 4 stars for me, the food was A-OK but the price, service, and convenience is really great and is why I will probably order from..."], "rating": [4, 5, 3], "TBscore": [0.37, 0.22, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["sushi", "lunch"], ["sushi", "lunch"], []]}
{"id": "InPW9SrrGLyY-2jir02c_A", "text": ["Decided to drop in after work on a whim. Small & cute restaurant. Fast & friendly service. Everything I had was great. Green tea, miso soup and a few rolls....", "Just had the new all you can eat menu. Rolls are great. Tempura is fantastic and Miso soup is very tasty. Service is quick and friendly. Excellent price for...", "We just tried to eat here but first no one greeted us.  A girl getting take out acknowledged us before the woman at the front desk did.  She said she thinks..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "nhtoLy-wvtOtVEExvNiObA", "text": ["There really are not too many authentic Korean restaurants in Buffalo, so when my friend told me about Woo Chon Korea House I was ecstatic! \n\n I've never...", "Came here for lunch and to see if the food was worth trying. I'm always a fan of Bibimbap, and that was absolutely out of this world. If you want to try...", "Amazing food with the option of self girl style hibachi. Very simple to cook your own food and it still comes out delicious. I highly recommend bringi g..."], "rating": [5, 5, 5], "TBscore": [0.44, 0.25, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["korean"], ["lunch"], []]}
{"id": "KRUTej4TELdcs5Znwi2TSg", "text": ["The number 2 on the menu is spicy pork called Dweji bulgogi which is amazing. It comes with steamed rice, kimchi, seaweed and fish pickle. And I could eat...", "Walking into this restaurant, it gave me the feeling of a Chinese take out restaurant. I expected the quality of the food to be mediocre here in honestly....", "This place deserves more recognition!\nThe restaurant itself doesn't look fancy and it looks like an average/ below average Americanized Asian restaurant,..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["chineese"], []]}
{"id": "GhR6ifk8IVVVaVEwbR3QCQ", "text": ["Really fun Karaoke experience! They have private rooms for karaoke that you pay to rent by the hour. In the room there's a table, seating, 2 mics, 2...", "I came here on a whim last Friday with my fiance and his friends and had more fun than I have in months! First of all, I love karaoke and was jonesing for...", "Large song selection. Food choices we had were all delicious. Soju is definitely something to try."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "tA_OjI6fuBTMwvjt0HXhfw", "text": ["Food was good\nIt was a short walk from our hotel\nDecor is in need of updating!\nStaff is friendly and polite", "The food does not worth the price at all!!! Even comparing with other Korean restaurant, this one is more expensive! There are only very small dices of meat...", "The side dish was not good to me and the main dish also was terrible.\nIt is not very good for the price.\nAnd they don't receive credit card for paying. Only..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], ["korean"], []]}
{"id": "_T5C6D0tW6BfqDrZARFS5g", "text": ["Korean Express offers decent food at reasonable prices, with many healthy and several vegan options on the menu. You can't go wrong with the classic tofu...", "This is one of my favorite fast food places on North Campus at UB. It's a small shop with a fast kitchen. Everything is made fresh.\n\nMy favorite thing to...", "#7 BIBIMBOB\n\nAre you following my quest at KE? Sadly that may come to an end at some point without being fulfilled as I am no longer a carnivore. BUT hey!..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["korean"], [], []]}
{"id": "LWni7xIT9zuS8egC26kBYA", "text": ["Haven't even finished my Kcafe burger yet and had to review, it's amazing! It has an egg, bacon, cheese, avocado spread, garlic mayo, and ketchup on a...", "I've been pondering how I wanted to review the K-Cafe Food Truck since I ate there last night and it's been bothering me a bit. My girlfriend ate here last...", "You never realized what you love till it's gone. \nHowever,kcafe has open again not as a restaurant but as a food truck! Go on their Facebook to see where..."], "rating": [5, 3, 4], "TBscore": [0.75, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["burger", "egg"], [], []]}
{"id": "C6aPB_espMbHWw3VYzzDvQ", "text": ["As far as I can tell, all restaurants in Niagara Falls are not very good and are overpriced. The food here was ok, but not the best examples of dishes that...", "Ordered bibimbap with chicken.  The chicken tasted and had the texture of something that had been sitting in the fridge for too long and wasn't fully...", "Ugh. Just a no. Pricey, terrible service. Who pays $25 for a bibimbap?\n\nPaltry portions, unfresh ingredients, and seriously awful service. Don't get ripped..."], "rating": [3, 2, 1], "TBscore": [0.0, -0.42, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], ["chicken"], []]}
{"id": "ATef296TA3hKxy48xKECyQ", "text": ["I love this place! If your new to hot pot don't be shy, just go in and tell the wait staff it's your first time. They were so helpful the first time I ate...", "I have been here twice: once for the regular food and once for the weekend brunch. (not hot pot)\n\nI'd like to say that the food is pretty good, I like the...", "Buffalo Little Lamb is a really fun place and it feels like you've been transported to a restaurant in Asia. \n\nI've been here a few times and I continue to..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["brunch"], []]}
{"id": "KIPN9E--zSwPd9GanlmwLw", "text": ["Full disclosure: Ms. Judi is married to my cousin, so technically she's a relative and I probably shouldn't be reviewing her business. If this review isn't...", "The people who own this food truck get a 5-Star rating..... and the food (that we tried) gets a 3. Judi\nand her daughter have to be the friendliest and most...", "Food trucks are becoming a necessary part of my work week. Whenever one rolls up for lunch lately I just have to check it out. Today's offering from Ms...."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "VBPPFgIzOOAH_WKzw6mTWQ", "text": ["UB Commas is actually a 300-level English class, whereas UB Comatose is any given student after a hard Friday & Saturday night of typical collegiate binge...", "Heart of SUNY buffalo, we can find restaurants of various ethnicity here like Indian, Japanese, Thai, Mexican and even has Subway and Pizza place.", "I went to UB for a while and found myself at the Commons even after graduating when I was meeting a faculty member or student. The great thing about The..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["japanese", "pizza", "indian", "mexican"], []]}
{"id": "0jCNheHmMiHyEnWWe89wVw", "text": ["First experience with this one. The wife had a sloppy Joe but nothing at all like that stuff you get out of a can. Very flavorful from the single bite that...", "I'll admit, I'm easily drawn in by vibrant colors and awesome artwork. So yeah, the first reason I tried this truck was because it looks super freaking...", "I consider Lomo Lomo to be one of the most Bold & Unique Food Trucks in Buffalo, Fusing the flavors & spices of India & Asia in Perfect Harmony. The first..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.49], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["indian"]]}
{"id": "3jEIMUhFMxHWwHseqsKCtg", "text": ["This little market has a great variety of value priced packaged & fresh items.  We visited on a Monday evening, and had the place to ourselves!  The...", "I just went to this store for the second time ever. It's a cute little Asian market right on Millersport near Eggert. You walk into the store and to the...", "I used to frequent Hana Mart before discovering Lucky Dragon Foods and spent quite a bit of money for a small amount of groceries. Lucky Dragon Foods have a..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "c0t2IJuJo5azbdMffuoO3g", "text": ["Excellent service - Dave in specific was great.  That's the kind of guy you want to promote to management.  Really kind, forward thinking, set me up with a...", "A great healthy choice, especially considering it's in a mall! My favorite part was that vegetarian and other special diet options were super clearly...", "This place was pleasantly surprising.  I had seen it come in but with Moes, and Chipotle and Panera near by, if I'm in the mood for a fast food sort of meal..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "uGIxVUZXXLouWZjxBxwy6Q", "text": ["The worst service I have ever received. DO NOT EAT HERE. Not only are the owners rude but they can't communicate. The food comes in small portions and is...", "Came here with my husband after a morning of strolling along Niagara Falls. My husband ordered the bibimbap. It was ok. Not a lot of flavor. I added lots of...", "I came to Coreana with my fiancé this afternoon. We were worried about the  negative reviews, I don't know why people complain about the restaurant. The..."], "rating": [1, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "vhXREFM1dOthqezSat_ziw", "text": ["Pleasantly surprised to find out this place had a FULL Korean menu. Huge variety and selection and the soups we ordered tasted very good. Highly recommend.", "Not sure where to start. The portion size is a joke and the food flavors are very blah. It's also unbelievably expensive for what it's worth. I don't...", "WARNING!!!! Do not eat at this restaurant. This is the absolute worst sushi restaurant I've ever been to (been to 75-100 different ones around the world)..."], "rating": [5, 1, 1], "TBscore": [0.38, 0.0, -0.27], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["korean"], [], ["sushi"]]}
{"id": "w6z4cNtcXuIyc5TpthnY2A", "text": ["After being away from Canada for 12 years, I returned to Mandarin for dinner.  OMG the best meal of my vacation!!! Everything was hot, fresh and delicious....", "My wife and I have been to this restaurant a few times with success but tonight it was really terrible.\n\nThe place is open until 9:30 and we showed up about...", "Service was great. Hosts were incredibly friendly and my server was great as well. Also, the manger was friendly and was taking care of everyone in the..."], "rating": [5, 2, 3], "TBscore": [0.64, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["dinner"], [], []]}
{"id": "PPDFNyGuBYit3y5iLQEoug", "text": ["One of my favorite bars in Buffalo! It's located in a plaza with a bowling alley, planned parenthood, and a pizza shop. What more could a girl need?\nThe...", "Fair drink prices, good food and great wait staff.  If you are looking for a place to hunker down for a game or UFC fight I'd recommend this place. They...", "Haven't been in but got takeout tonight and it was pretty tasty.  We've seen this place every time we pick up Chinese takeout and it always looks to be..."], "rating": [5, 4, 4], "TBscore": [0.56, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar", "pizza"], [], ["chineese"]]}
{"id": "hTIM7Ko-G6BlYYtUMml9Dg", "text": ["Went on a buffet at Skylon Tower at lunch. Overall, decent service and appropriate price for the view and food.\n\nThere's a good price for a package with the...", "Six of us came here on a Friday afternoon for lunch and had a pretty good experience.\n\nWe had made reservations for 1:30pm and had no issues getting our...", "BE WARNED!!!  TOURIST TRAP!!!  \n\nThe only thing I can say that's good about this place is the view.  Our party of four had reservations for the buffet at..."], "rating": [3, 3, 1], "TBscore": [0.34, 0.47, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [["lunch"], ["lunch"], []]}
{"id": "HwhDT7rEVpnIRMmtNLSAkA", "text": ["Short and simple:\nAs far as the food is concerned, it was average. If it were cheaper I wouldn't mind returning. Serving size, my husband and I were still...", "This is probably the worst buffet I've tried. The tofu is so bland, the area is messy. I would not recommend this place to my friends.\n\nP.S. - This is my...", "The worst restaurant ever!\n\nThe variety of food was awful and the food was bland. I did not think it was possible to go wrong with chinese food, but I was..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, -0.44], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], ["chineese"]]}
{"id": "qDR3YdXzlC0LJ--TfaAn0Q", "text": ["Ok.  To celebrate my first Diwali in the USA for 3 years I thought I would head out for some Indian cuisine.  I've been to a few Indian restaurants all over...", "It is a disgrace as to how the quality of food has deteoriated over time. \nI remember eating there in their opening week. I still remember their...", "I'm sad to say I have purchased my last meal from tandoori hut. When they came to buffalo a few short months ago, me and my Roomate stumbled upon the..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["indian"], [], []]}
{"id": "m0MPjX7qfz7q592_VbNnFw", "text": ["Went there for dinner.  Ordered the Samosas first. Let me tell you something about the samosas", "Review summary:\nFood: 4/5\nService: 5/5\nAuthenticity: 5*/5\nAmbiance/Location/etc: 4/5\n\nGreat, authentic Indian food. Good deal for buffet. Family run. Clean....", "First time visit on 9/17/18.  We ordered a lot of food, some of which we took home.  For starters we had the chicken tikka, shrimp manchurian, and paneer..."], "rating": [5, 4, 4], "TBscore": [0.25, 0.59, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["dinner"], ["indian"], ["chicken"]]}
{"id": "RtTKpizyprsikcyrLIN91g", "text": ["This was my first time here and perhaps my first Indian experience. I thought I had Indian food, but it turns out all of the places that I've been to were...", "I was in Buffalo for work, so Yelp pointed me to Spices of India. With a whopping 4.5 stars, how could I go wrong? \n\nThe food was okay at best... the...", "A pretty solid buffet option in the area that's attached to a grocery store! I was honestly skeptical at first, but the idea is very cool. The owner is..."], "rating": [5, 3, 3], "TBscore": [0.25, 0.33, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["indian"], ["indian"], []]}
{"id": "2Ibo1K9Gl9laMWV_obOAHQ", "text": ["Awesome food. Great atmosphere, awesome staff and really great food. All cooked in authentic clay pots. Really warm and sumptuous food. Deserts are spot...", "This was our first time here. Unfortunately we were overwhelmed and confused by the menu. \n\nGenerally speaking, it was alright, but just not for us. I...", "I wish I could put less than 1 star. All the good reviews are fake. I came for dinner and waited for more than an hour for the food even when the restaurant..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], ["dinner"]]}
{"id": "9Y3Qi78W8QjmTI8KF0n4Hw", "text": ["I have never had a bad meal from India Star. The owner is so pleasant and everything is so well done. We love the Chicken Makhani, the Chana Masala, and...", "I might be new to the Buffalo Indian culinary scene; however, what I sampled at India Star didn't actually appear to be authentic Indian food.\n\nThe Chicken...", "Came here on a Tuesday evening for the buffet and definitely enjoyed it. Service was friendly and I was greeted warmly and with a sense of humor upon..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["chicken", "indian"], ["chicken", "indian"], []]}
{"id": "wWXIzTd8LtJpDaS32qxgzA", "text": ["This place is ok if you are starving or drunk.  Otherwise you're better off going up the street to Taj Grill, where the quality of the food is a lot better....", "I have been to India Gate several times over the years. Have had mixed experiences, so this review is based on my last visit. \n\nI went on a Tuesday...", "India Gate offers a decent lunch buffet in Elmwood Village. While not the best buffet I've ever had, I appreciate having this option relatively close to..."], "rating": [2, 4, 3], "TBscore": [0.0, 0.0, 0.32], "normalisedRating": [-0.2, 0.6, 0.2], "keywords": [[], ["indian"], ["indian", "lunch"]]}
{"id": "QZNNp07uhleoyF95CniUBA", "text": ["Amidst buffalo en route to Niagara Taste Of India is finest restaurant in buffalo. The food quality is good and the restaurant is average. Although, their...", "This place is not good. There was no air conditioning. It completely milks the fact that it is next to a wonder of the world. The restrooms of this...", "I really like the food here, especially the lunch buffet.  It's a great way of trying different dishes and is a very good value.   I like that every time I..."], "rating": [4, 1, 4], "TBscore": [0.27, 0.0, 0.38], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["indian"], [], ["lunch"]]}
{"id": "942ARY3sYno2Xbemb7je1g", "text": ["The food was good, for some reason my favorite was the tea and naan they gave us, the host who was a lady was very nice", "This place was really, really bad. We ordered take-out today. It tasted like bad, cheap buffet food but at normal prices. \n\nLamb saag ($14) - Cubed lamb in...", "Chicken Vindaloo- It was really bland. The sauce was very tomato-y, it wasn't spicy at all, and the chicken was dry. The sauce was watery, I expect chicken..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, -0.31], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], [], ["chicken"]]}
{"id": "-vpiP4k8UNYy4PyKzf_cmg", "text": ["I was quite excited to see a new Indian restaurant that delivers throuth skip the dishes, so I decided to give it a try. I was surprised to see a very...", "A hidden treasure. Delicious fragrant Bengali food you would never find without a recommendation.  I had a chicken with rice and Sam had the lamb. The meals...", "GO FOR IT. THEY SELL REAL INDIAN FOOD. Don't judge it from outside and also interior. The most authentic Indian food you can expect in USA. Curry goat,..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.3], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["indian"], ["chicken"], ["indian"]]}
{"id": "5s_kMLz3IwtjbdZZK_FrxQ", "text": ["Beyond delicious, the service is very good, and their policy around food waste is awesome. \n\nWendi was our server -- she's great!", "Don't go with the reviews been a victim of this ‍\n\nThe buffet hardly has any starters, no biryani, no deserts and the curries are dry and felt old.", "Loved the food and service. The naan bread was absolutely brilliant. \n\nWe had the lunch buffet on a packed Sunday; We were informed in regular intervals..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.53], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "TxNwfTsTJfsofD5Phd0G7A", "text": ["The nihari at this place is phenomenal.  If you pre-order the whole baked chicken and ask them not to overcook it, it actually turns out really good.  Be...", "Delicious food. Horrible service. Atmosphere terrible. Prices and menu inconsistent. Nearly impossible to communicate and order. \n\nAlmost everything we...", "Appletree makes the best local info-pak food! The food is delicious, prepared fresh and authentic as can be. The chicken seekh kabobs are near perfect, with..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.41], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "w_-ubE2M3R38-QhZ1nj4NA", "text": ["Visited the place couple times. It is good restaurant with nice south Indian food.\nTried various dishes. Great ghee dosa, great vijaywada chicken biryani,...", "I have been here six times now hoping to have a better experience than my previous visit but it always disappoints me. First of all, every time I go and try...", "The chef changed so the food is not as amazing as it used to be. I guess it is still among the most authentic Indian restaurants in Buffalo. I just don't..."], "rating": [4, 2, 4], "TBscore": [0.38, 0.0, 0.53], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["chicken", "indian"], [], ["indian"]]}
{"id": "nTm20ZEsVE7s2XzHUdtQcA", "text": ["This place is destination yummy South Indian food! \nI loved my Masala Dosa, Sambar, coconut condiment, & the Masala Chai is the best. If you are Gluten...", "It seems like they make an effort for shitty service. Their food is served with a condescending tone. They use packaged products and do not cook from...", "Is this the most decorated place with the best atmosphere for an Indian restaurant.. nope. Is it cheap? hell yeah. is the food good? absolutely. My parents..."], "rating": [5, 1, 5], "TBscore": [0.85, 0.0, 0.56], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["gluten", "indian"], [], ["indian"]]}
{"id": "uGWQP6jaX4GiPdGP1nLV8w", "text": ["Bollywood Bistro is my favorite food spot on the North Campus. At less than $9, the combo meal includes generous portions of two items, plus white rice and...", "Eminem told me they'd closed down. In fact he kept tunelessly singing about it, something along the lines of \"say goodbye, say goodbye to Bollywood. Say...", "Ordered a chicken kebab roll(similar to a gyro). The worst decision of my life. I've never seen and eaten such a stale, disgusting wrap ever before. It's..."], "rating": [3, 5, 1], "TBscore": [0.0, 0.0, -0.62], "normalisedRating": [0.2, 1.0, -0.6], "keywords": [[], [], ["chicken"]]}
{"id": "IUUGkCn-aRwjM0hnI9ng7w", "text": ["These are nice people and so is their food. We order from them all the time. The food is always fresh, delicious and up to the quality standards. I would...", "The first Nepali restaurant in town. Nice, clean and simple restaurant. They're running with few items, but compared to other \"so called\" Indian...", "Yum! Came in for a mango lassi and their dumplings yesterday and came away excited to try more of their menu. It's one of Buffalo's only Nepalese places...."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["indian"], []]}
{"id": "lWNyU2cg66akSeKKEXAsSA", "text": ["Delicious Buffett dinner.  Probably even better at lunch if they have a lunch price, not sure if they do.  Would be a total rip off for older small/petite...", "Opted to try this place out instead of one of the large chain restaurants that dot Niagara Falls.  \n\nThe food wasn't bad and the staff was friendly.  The...", "Not. Impressed. At. All.  \n\nDuring a recent family trip to the Falls, we were craving some Indian food on our first night.  Not only was Cheetal close to..."], "rating": [4, 3, 2], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["dinner", "lunch"], [], ["indian"]]}
{"id": "W5146EAibysfkhTPaOF_Yg", "text": ["So they're talking about having a black guy play James Bond. Idris Elba, I believe, was the front runner.\n\nSo my question is...\n\nWhen are they going to make...", "My husband ordered the chicken biryani. The rice was perfectly cooked and was aromatic. The chicken was well cooked as well but for the Indian palate of...", "New to the West Side Bazaar is this Indian window.  I can't remember what used to be here actually.  But since I'm a fan of Indian I've tried this window 2..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["indian", "chicken"], ["indian"]]}
{"id": "yZ6qSszFNuxAwikmB_n0ig", "text": ["UPDATE TWO YEARS LATER:\n\nThis place is even BETTER than it was before, I didn't even think it was possible. Also, tried the falafel here this time and it...", "Wow. I should've read some reviews first because the portions are HUGE here! It's literally enough to feed a small village. Food was super tasty.\n\nI ordered...", "Visiting Buffalo, I instantly notice many local restaurants and pubs every where.  \nIf the statement \"Don't judge a book by its cover\" where true, It would..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Vb4VpH6skPjAJ4oPAEVf_Q", "text": ["i stumbled here by accident but i am so glad that i did. this restaurant has such a warm and loving environment. the owner is the most genuine and kindest...", "I live nearby and drive past the place daily.  Finally, curiosity made me stop for a take out lunch.  I had chicken and vegetables, which was pretty...", "Food is so good. We have chicken with rice. The flavors...OMG. great friendly service. Not your traditional restaurant but you will come here again and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.26], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["chicken", "lunch"], ["chicken"]]}
{"id": "8yvsE5mhC_178RJ6rmSPtA", "text": ["I had breakfast here and it was the best Indian food and chai I've had in the states. We ordered aloo and gobi parantha, chola puri and kulcha chole. If you...", "Perfect place any time! I had lunch buffet. All dishes were perfect blend of indian spices. Dal makhni, butter paneer and chicken korma reminded me of...", "Yummy home cooked food. Amazing flavor, good hospitality.  They have good selection of vegetarian food and appetizera."], "rating": [5, 5, 5], "TBscore": [1.0, 0.47, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["breakfast", "indian"], ["chicken", "indian", "lunch"], []]}
{"id": "VjyoBSqrEzJAj1PkwL9X_Q", "text": ["We got the chicken shawarma and karahi gosht. nothing that came was below average. everything was delicious. i've lived here for my entire life and regret...", "Grill Kabob changed ownership, therefore kind of did not want to go back not knowing who took over. However, one fine Saturday, I called in an order of...", "Ended up here on a Saturday afternoon, the place was completely empty. Outside there's a sign for a $5 chicken on rice meal. We went up to the counter to..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, -0.23], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "5H9i_hJteLX15OY4VaJznA", "text": ["This is a little neighborhood place, with only one customer when we arrived. During the dinner, 4-5 more tables came in, and it was clear this was a...", "If you care for ambience, don't come here. If you just want good, authentic Indian food, then this place is worth trying out.  I had the lamb biryani which...", "Great spot for awesome indian /pakistani food.\n\nwe ordered the lamb biryani and the nihari.\n\nthe biryani was mind blowing, the rice was perfectly seasoned,..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.5, 0.68], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["dinner"], ["indian"], ["indian"]]}
{"id": "sq3z9IePcy7xV-674QgZ4Q", "text": ["My husband and I decided to go to Delhi Darbar when we were told that there was 30-45 mins wait at zaika.\nWe had buffet at the restaurant and let me tell...", "Nice owner and we had good service there.\nFirst time try India traditional food.\nEspecially those two was so gooood!", "This is a 3.5 ish place. Came here for lunch buffet with family. As my family is vegetarian, this place surprisingly offered enough Indian choices. \n\nGood:..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.31, 0.47], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], ["indian"], ["indian", "lunch"]]}
{"id": "yf9c7j43E9nxfk32MG886g", "text": ["Great punjabi food. Had kurchan chicken. Paneer masala and daal fry. \nJust having daal fry reminded me of the dhaba's in India. Delicious is the only word...", "It was refreshing to see a place that wasn't buffet for lunch. But Chicken Biryani which I ordered was very underwhelming. First, it wasn't cooked to the...", "So we sat down in these booths. We asked to be seated at the table that had chairs and they said \"no it's for 9 people\". We were only 4. But it was 45..."], "rating": [4, 3, 2], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["indian", "chicken"], ["chicken", "lunch"], []]}
{"id": "3paYD3DQex7TonfIwX_qhg", "text": ["There's ample selection of Indian food in Niagara Falls (Ontario or New York), but Moksha stands out for a single reason: it has a separate vegan menu...", "The appetizer (Paneer Tikka) was amazing! I also always order Butter Chicken and Chicken Tikka Masala at every Indian restaurant because it's one of my...", "I've taken many visitors to Moksha and had some of the finest Indian food I've ever eaten. I first started to visit Moksha in 2014 and the owners were a..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["indian"], ["indian", "chicken"], ["indian"]]}
{"id": "unE0G-6yYxE2JSWAV87zRw", "text": ["We just moved to NF, NY from Seattle where we were accustomed to eating some really excellent Indian food. India Grill is not far from our house, and we...", "This was a low key spot I would always bypass on my way to work. My boss was interested in eating some Indian food so I suggested we try in this place. A...", "The food at India Grill is amazing and perfect! My husband and I came for a late lunch. We realized they were closing soon for an hour and a half from the..."], "rating": [5, 5, 5], "TBscore": [0.47, 0.0, 0.28], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["indian"], ["indian"], ["indian", "lunch"]]}
{"id": "fVKAFupoUI7P78EodmBgPA", "text": ["I'm a very regular take-out customer of Tandoori King. So much so that I have them on speed dial. The staff treats you like family and I haven't had a dish...", "I was heading to outlet mall with my husband and found this place on our way. The location of the restaurant looked weird and deserted. We were the first...", "Food gets a 4 out of 5. Decor and service gets 2 out of 5. Went there for lunch,  no servers on just one person to serve the whole place, luckily there..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], ["lunch"]]}
{"id": "N_2Vqaqs74YV2BBTKgFUAg", "text": ["Great south Indian Vegetarian food. If you like spicy food , order Chilly Idly. We ordered chilly Idly, idly vada combo and utappam. All turned out to be...", "Pros: I would echo everything good written about this place as it relates to the food. It was delicious and a nice getaway from the processed food that is...", "Food and service was good.\nParking is in rear through an alley, which is in a bad shape. They need to invest some money to make this alley drivable \\ be..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["indian"], [], []]}
{"id": "RsS1Ml_jw3HCvsLtqo71VA", "text": ["Ok, so the atmosphere will fool you. Not much on the outside and the same on the inside. A bit old and can use a fair bit of work. The place is a family...", "This was some of the very best Indian food we have ever had! Highly recommend. Owner was a delight. Only disappointment was we had hoped to sit outside and...", "Authentic Indian food, fresh, homemade, absolutely the best I've had! I had to give it 5 stars for the food, but the decor is meh, and the building could..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["indian"], ["indian"]]}
{"id": "-Omyk-0EPU5l0aUZfqeipw", "text": ["If you're looking for a quick, tasty, vegan snack before or after visiting Niagara Falls, come to the Kathi Roll truck. \n\nKathi rolls aren't super easy to...", "Despicable food that you want to avoid! \n\nGot a Kathi roll that was served with spoilt chicken, few spoons of terribly spicy biriyani for a price that...", "So disappointed we were not able to taste the food here. \n\nWe came here just to try the food between the hours they posted on their website. There was no..."], "rating": [4, 1, 1], "TBscore": [0.37, -0.6, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["snack"], ["chicken"], []]}
{"id": "kuyUkHWplFlrVmbpfINBog", "text": ["OK Buffet food\nOK service\nOK ambiance", "I ordered the chole batura at the counter. The interior is small and drab and doesn't have much of an atmosphere.  It's really a to-go place. \n\nService was...", "Fast food with table service . I got buffet which was on Saturday four pm. Food is tasty and not that hot being spicy. Limited choices with one sweet item ...."], "rating": [3, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "rf9fn1UmmyVJ-_C7W5OfSA", "text": ["The entrees at this place don't even come with rice - it's an additional $5 for a small side of plain, steamed basmati rice. That's enough to ruin an Indian...", "Loved it! Not all Indian food is created equal, and this place is as good as any, and better than most. A proper restaurant, not just a take out joint....", "We were the only customer at 4:30pm on a Monday and we received excellent service! Loved the Butter Chicken + Coconut Naan bread. Best combination with the..."], "rating": [2, 5, 5], "TBscore": [0.0, 0.43, 0.42], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [["indian"], ["indian"], ["chicken"]]}
{"id": "B-GPjwShbWD9d-aLd_XgiA", "text": ["This is an a hidden gem! The food is delicious! The best Indian food I've had in a long time! If you're looking for Indian food in Niagara Falls area this...", "Arrived 12:20pm, Lunch buffet at $15 was solid, place is clean and bright, good service, she brought the naan bread out fresh which was included with the...", "Just loved their food! Everything was like homemade and fresh...if you r in Niagara Falls you won't want to miss this hidden gem..."], "rating": [5, 4, 5], "TBscore": [0.43, 0.41, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["indian"], ["lunch"], []]}
{"id": "QwcOqeTr9-9_sCUFrnaYPg", "text": ["I read the reviews of this place after I ate here and was surprised to see the low opinion of this place others had. Maybe it was a rare day of being on...", "On The 7th of August my wife, our 6 year old daughter and my mom decided to go to this restaurant for dinner. We ordered the food and one of the dishes we...", "It's a given that any place you visit in Niagara Falls will be higher priced and the service will be less attentive. It's an unfortunate truth, so my..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], ["dinner"], []]}
{"id": "k7BIFoR_JTsVXFHwWg6Nrw", "text": ["We spotted Godavari on our way to another Indian restaurant and instantly decided to dine there as Godavari is our go-to Indian restaurant in Atlanta. There...", "This is the worst of the lot ... bad food in the name of the chain restaurant. There nothing in the name of a South Indian restaurant. No South Indian food...", "I went there because I was craving kerala food, place was full and I didn't read the reviews online.\nVery disappointing, they didn't have any of the local..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.85, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["indian"], ["indian"], []]}
{"id": "yesMpuTpQND1slL2Bm6ZTA", "text": ["There are better local options...\n\nMy wife & I like to try different Indian restaurants; we found this one and tried the buffet. It was okay, but certainly...", "If Zero stars were possible, I would give this place ZERO, it is sooooo bad! No taste, even gulab jamun was so bad, never thought that was possible. Food...", "We had morning breakfast here. Amazing dosa, and Idli. \nVery close to Niagara Falls. Our parents are Jain. We ordered Plain Dosa and Idli with Jain sambar..."], "rating": [3, 1, 5], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [["indian"], [], ["breakfast"]]}
{"id": "NtALtsl90GGIxpqtEfOghw", "text": ["Visited here on Victoria Day weekend, it was a Sunday evening. Unfortunately there was no parking so we ended up doing a takeout....so we could not enjoy...", "This place caught my eye as I was walking up Clifton Hill. It was late night and I was hungry. There were at least 2 big groups of people and some smaller...", "I had take out from here and boy did their food blow me away.. Price was fair and food was awesome. I had the chicken priyani, lamb curry and chicken curry,..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "wL73VR7ltH6ZOMDN-Y9_MQ", "text": ["Went here despite the bad reviews below since we didn't have many options at the time. \n1. Service - we experienced great service from our server Priscilla....", "EXTREMELY RUDE!!!\nThe food quality was mediocre and the service was the worst I have ever experienced in canada. We were told to leave and they forced us to...", "What a bad experience! Food terrible, service terrible and fly infested  Restaurant was empty and they took 10mins to take our order. Food tasted like it..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "HYS7gyBPjs8e1dgYG_za2A", "text": ["Food was awesome. And tea was just perfect. I am glad I could find this wonderful place right near Niagara falls", "Stay away from this place.\n\nThey sell Dosa that doesn't taste/ look good... also you will have to enjoy whatever they serve right next to a garbage can +...", "we stayed in comfort inn next to this hotel. We were happy to find the hotel so ordered all we could for our batch of 6. But none of the food tasted good...."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "LBI1UFrAtlZVXpUHSfEI1A", "text": ["This is probably the best buffet I've had since a long time. \nVarieties were good and staff is courteous and friendly. Freshly cooked food and mouth...", "This is probably the worst Indian restaurant ever I have been to so far in the last 8 years, they just refill the food uncooked. Rice is very bad and the...", "Pathetic food!! Please stay away!!!!!\nSpoilt veg curry. They serve the same food from the morning for dinner and that is spoilt. Dirty interiors .No idea..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.38, -0.53], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["indian"], ["dinner"]]}
{"id": "TZV3ncX6lOFTQOBgrKOccQ", "text": ["Wasn't expecting food to be good... I'd say better than any Indian food in the surrounding areas...", "This is the worst buffet we have been to. Though I don't care about customer service being worst, it's a buffet place with all trays empty laterally. Every...", "If I could give this place no stars I would. We decided to eat here while visiting Niagara Falls for lunch. First the service was the worst by far that I..."], "rating": [3, 1, 1], "TBscore": [0.6, 0.0, -0.22], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["indian"], [], ["lunch"]]}
{"id": "Ur57o6Y_quj9v-_cvblvlA", "text": ["I'm a huge fan of the El Ranchito in Clarence, but not a fan of the distance, so I was excited to find out about the new location in Williamsville. \n\nI like...", "Good food, so-so service mar a potentially good all-round restaurant.\n\nEl Ranchito's web site makes the bold claim that they serve the best Mexican food in...", "I don't know where all these amazing reviews are coming from. We must have been eating at different restaurants. I came here with friends who love El..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.55, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], ["mexican"], []]}
{"id": "wbRQBC4xZSGncDS5ENNmDQ", "text": ["If you are looking for authentic Mexican food then El Ranchito is the place you have to go. I'm from San Diego and grew up eating Mexican food daily, since...", "Very good Mexican cuisine. I had the Texas fajitas and the steak and chicken were perfect. The shrimp also tasted very fresh. Decent prices too. \n\nI would...", "Well worth the 30 minute drive from the city! My fiancée and I tend to stay within our city bubble for dining but El Ranchito is the only place that..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.31, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["mexican"], ["steak", "mexican", "chicken"], []]}
{"id": "ZuNtLb-pbRK0jdjtvV838A", "text": ["Don't miss this place!  Good food, large portions and crazy low prices. The service and atmosphere are also very good.\n\nThe menu has a very nice number of...", "Niagara Falls surprisingly has a lot of Mexican options and El Cubilete was the one to pick last weekend. Located on Niagara Falls Boulevard away from the...", "We came here while on vacation in Niagara Falls wanting Mexican food. I had looked on Yelp for local fare and the reviews sold us on this place. We arrived..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.23, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["mexican"], ["mexican"]]}
{"id": "SUlGAZ9sTPI01vglueB1-g", "text": ["As I review the comments provided by Buffalo residents I'm shocked by the average 4.0. What does it take to achieve a 5? Surely, this is the place! If not...", "Here's the summary: decent food, terrible value for your hard-earned money - ridiculously overpriced for the tiny portions, and HORRENDOUS service.\n\nIt was...", "Short version: horrible service, overpriced, amazing food. \n\nSo, six of us went to Las Puertas because our friends were dying for ceviche (which they no..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "pGK3EyzTtlYEove91eAdSA", "text": ["I've tried a few Mexican places in Buffalo/Clarence/Williamsville and I have to say, this one is my favorite. I love their chips and salsa and I just really...", "Just went here for the first time last night. The look of the restaurant is really cool; there are pops of blues, reds, yellows everywhere and paintings on...", "I used to be a huge fan of LaTolteca. I especially loved the Chicken Enchiladas with tomatillo sauce.\nWe haven't visited in a while ... so many new Mexican..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["mexican"], [], ["chicken", "mexican"]]}
{"id": "gSAM3z2heOR2gyi7gsdfXQ", "text": ["i'm surprised there aren't more people in here from East Amherst... it's so close! I think the sign is a little weird, it screams \"White person from Walmart...", "Excellent food and attentive service. Reasonably priced too. \n\nMy wife and I had an outstanding dinner at Juanes recently.  \n\nNot quite the \"heat\" level of...", "There are a lot of Mexican restaurants popping up around town. Getting somewhat hard to tell them apart. Juanes Is a hop, skip and jump from the house..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["dinner"], ["mexican"]]}
{"id": "nx8_eL-HRkrLXbHLlcWLxg", "text": ["My boyfriend and I had spent the day at Beaver Island State Park and were heading home and starving. We decided to make a quick detour for something to eat...", "This place was ok; I would say mediocre Mexican restaurant in the Buffalo area.\n\nOur waitress was super nice and helpful. I really appreciated her...", "I have been here for just drinks before but tonight was the first night I was here for dinner. It was throughly disappointing on about every aspect. First..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], ["mexican"], ["dinner"]]}
{"id": "usJXeN-R7rb6regI91U9JQ", "text": ["I am so thrilled this restaurant is in East Aurora -- it's truly a great addition.  My wife and I have been twice now, and were thrilled by the quality of...", "We decided to try Las Brasas on a whim for dinner while driving through East Aurora. It was a Friday night and the place was already pretty busy. We managed...", "The atmosphere was very pleasant and colorful.  The servers were polite and friendly.\nI went on a Wed around one pm and there was a few tables of people,..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], ["dinner"], []]}
{"id": "46-DPBCkJ1Op9dEy6sKCxA", "text": ["I've been going to Salsarita's at the Cheektowaga location for nearly four years and I can say that the food is delicious at both locations. I tried it in...", "take care of your cockroach problem. health department has been contacted.\n\n\nalso firing employees because they expressed that they were uncomfortable...", "I know people seem to love this place. \nYes, it's ok. But not great. I think the best part is the chips. \nI won't be back as long as we have La Divina, Don..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "Q5MBfzgcWdZu66skFpHjVQ", "text": ["I've been coming to this establishment long before it was at their current location. I remember dining at their first location when I was in my teens and...", "This place gave me meat sweats and I'm vegetarian.  \n\nService is good. \nMargaritas are good. \nFood is nowhere close to Mexican.  Literal blocks of American...", "If you like mexican food, go here. Now granted, my mexican taste buds are not that great or tuned as some. I get cravings every now and again, but when I do..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.35, 0.27], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["american", "mexican"], ["mexican"]]}
{"id": "aUIOvdI7TLJ_11V7qynF2Q", "text": ["We stopped in for lunch the other day for our first time and we throughly impressed! Ever since I've had \"real\" Mexican food in California, my taste buds...", "Did I choose to visit Aguacates Mexican Restaurant on Sunday night? No, but I'm certainly not upset that I got the chance I eat here. I came here with a...", "The wife and I stopped in here the other night for a quick drink and snack. Sometimes we like to stop while out and about for a couple of margaritas and a..."], "rating": [5, 4, 4], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["mexican", "lunch"], ["mexican"], ["snack"]]}
{"id": "BRzJvdpsduQFs5x38WCgRw", "text": ["We had salsarita's catered to the office today and I did not know what to expect as I have not had it before.. but I am extremely disappointed in this...", "Good for a quick Mexican food fix.  They have plenty of options available as you design your own meal. In fact, there are so  many options that a little...", "A little bit of Salsarita's in my life\nA little bit of diarrhea for the rest of the night\n\nBut yeah.\n\nI like to try all of the corporate chains at least..."], "rating": [2, 3, 2], "TBscore": [0.0, 0.34, 0.0], "normalisedRating": [-0.2, 0.2, -0.2], "keywords": [[], ["mexican"], []]}
{"id": "0itbBnAIYV4yiksMlQPOkw", "text": ["Best food, great staff. Give it a try you will not regret it.  Place to eat inside, take out available,\nReasonably priced.  ENJOY", "Not too many choices in Niagara Falls for food, and wanted to try something outside the main areas. Went here with yelp reviews in mind. We ordered a...", "Ok for what it is...a Chipotle.  However, prices are higher as were portions that are slightly bigger.\n\nStaff was patient as burritos/bowls/tacos do require..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "4YphJvYkHCjrNiB9LMRouA", "text": ["I wanted a spot by the water, with nice views, an outdoor patio & something delicious to drink. I got all of those things when I stepped out onto Dos...", "We took my FIL to Dos Amigos for a belated birthday dinner back in mid-July. I made reservations on Opentable for 6pm and we arrived right on time. The...", "So sadly disappointed in this place! It has so much potential! But I was not impressed at all. \n\nI am vegetarian and they have not a single thing on the..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], ["dinner"], []]}
{"id": "5CVBOyZwkHFj4l8sGumLkw", "text": ["This location is our 2nd fav to the downtown Buffalo location. Can't go wrong with build your own bowls, burritos, quesadillas and nachos! The boyfriend...", "As far as fast food Mexican goes Salsarita's is okay. I would rather come here over going to Taco Bell or something like that. The food is OK.  They have...", "What the heck happened to my favorite Salsarita's? I stopped in for a \"small quesadilla combo\" and, sure enough, everything I got was \"small\". I received a..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.26, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], ["mexican"], []]}
{"id": "qT922fXFXKCelChpoWmc-w", "text": ["This has been a spot in Black Rock for sometime, but new ownership catches one's attention, especially when you know them and they are such good folks. So,...", "Wonderful restaurant, convenient parking. Food and service was great. Will definitely return!", "Food is great. Wine selection so much better than previous owners, yet accessible. Service is perfection.  Can't wait to go back. Feels like home!\nDave and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "hrv-Jl5mnkset3KSWnDDuQ", "text": ["Located in the former American Malting Company office building where Childs Street meets Silo City. This place is definitely off the beaten path and smack...", "Discovered this hidden gem when I came to town for the Buffalo Paddle - Bike - Run Adventure Triathlon! I love the decor and down-to-earth atmosphere. Our...", "Great location. It was about time something a bit more permanent showed up at Silo City. Unfortunately I can't quite figure out what this place is trying to..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["american"], [], []]}
{"id": "LEj7u0POttyC3jH8USjt1g", "text": ["The food was on point and Joelle was a great server. She really makes the experience at Local Grille a superb one. \n\nMy girlfriend and I live at Fireside...", "This restaurant opened up inside the Wehrle Golf Dome about 4 months ago. Having the restaurant at the Dome is great because I can grab lunch, bring my wife...", "This is a pleasant restaurant hidden in the golf dome.   We stopped here after a movie at the nearby Regal cinema and I'm glad we did.  I saw the good..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.8, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "4JlX0FT6-FdQ-MlyTPARog", "text": ["My mom and I heard about this food prep business  from a  friend who is not only health-conscious but has one of the best food palates I know.  When she...", "Simple no frills, in & out. Great prepared food, plenty of variety which can change daily. Friendly staff. Selections like breakfast sandwich, M&M's...", "This the 3rd local meal prep place I've tried. Others were good but were not accurate in what they stated their macros were. This place is honest and the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["sandwich", "breakfast"], []]}
{"id": "PGXqbFTWDdr627Fpfcalng", "text": ["I used to get breakfast sandwiches from here when i was working at solar city, and now i miss it. Today, i had a day off and decided to hit up Ang's for...", "If you have a lot of ANGst, come here. If you have ANGer management issues, this is your place. If you are looking for a waitress who is an ANGel, you'll...", "Found this place on my way to work, and couldn't be happier! Probably the best breakfast sandwich I've ever had. You can even call ahead of time and pick up..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 1.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sandwich", "breakfast"], [], ["sandwich", "breakfast"]]}
{"id": "CVvdQBfE-fZ2tYoEtIqy0w", "text": ["This tavern has the kind of facade that invites a glance and a drive by, with an inner mumble \"I am not sure that place is safe.\" Resist judging this book...", "Such an awesome experience! We were looking for a last minute fish fry and couldn't have been more pleasantly surprised, the people were awesome and treated...", "To me my good friend Ron owns this place\nLooks like a dive\nBut wait till you taste the food.  Should change your mind fast\nTradition fish fry\nHundreds of..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "3oV0MYLFyAb0BdDn3kmgLw", "text": ["Chose to come here on a nice evening before a 7 pm show at the North Park. Arrived at 5:30. At 5:45 we told the waiter that we needed to be at the show at 7...", "Where do I start- I should have known that when we grabbed a table outside that the chain smoking lady slamming clams in the corner would be there all...", "Six of us came for dinner and \"Geeks Who Drink Trivia\" last night..... and while the trivia was super fun.... the restaurant in which it was held was..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.21], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], ["dinner"]]}
{"id": "wFdsOnwY9bc6PbC5wecfXQ", "text": ["The minute we entered the door we were made to feel loved and appreciated. The owner said, \"hello\" and the super friendly waitress welcomed us and told us...", "What s fabulous find. Everything is homemade by the chef owner. The Full Monty eggplant dish was out of this world. A must order!! The eggplant parm with...", "If you are looking for old school homemade Italian cuisine Fasos on Niagara street is the place.  This hidden gem has been around for over 40 years.  It's..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], ["italian"]]}
{"id": "xAsdBrEXDeaQeE3Z23xZUQ", "text": ["I recently went to Jovi's for dinner during Local Restaurant Week.  After my great experience, I found myself wondering why on earth I don't go to Jovi's...", "Excellent Fish Fry. Cooked just right Large Portions affordable price compared to most. If your looking for  the best hands Down Best Fish Fry in...", "This place wasn't really good, me and my boyfriend went and the chicken was really slimy, it was dead quiet when we went, all we heard was the classic rock..."], "rating": [4, 5, 2], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [["dinner"], [], ["chicken"]]}
{"id": "65gOLKblt6SrWDF6jXw3VQ", "text": ["Honestly, this restaurant exceeded my expectations for lunch. The ambience is very relaxing, but honestly what made this place stand out to me was the...", "I absolutely LOVE the fact that you can sample a large variety of oils here! It's a very chill atmosphere, super cute inside. The setup however makes you...", "I was craving some pizza so I headed down to D'avolio's after reading the reviews. The place lets you completely customize the toppings and sauce you want..."], "rating": [5, 4, 5], "TBscore": [0.47, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch"], [], ["pizza"]]}
{"id": "9dAGhQci1erD6GRh9m-lYA", "text": ["Always a must have dinner place when visiting the family in Buffalo. The entire staff here are a welcoming and friendly bunch!\n\nThe food is consistently...", "Poor food, served veeerry slloooowwwly. We had 7 pm reservations last night and were not seated until about 7:15. Wine took at least 15 minutes to arrive,...", "Please avoid this establishment. It is that bad. The staff is adequate. The food is subpar. Not worth going here when there are so many better..."], "rating": [5, 1, 1], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["dinner"], [], []]}
{"id": "vkyti0UyaHWJaDzkHNHd-A", "text": ["Great banana peppers ( if you're not from here they're called Hungarian peppers). \nAlso great were the specialty cocktails and the scallop app.\nThe dinners...", "I am torn between leaving a 3-star review and 4-star because we had one great experience and one bad. Take this as a 3.5-star review.\n\nThe first experience...", "I came here to celebrate a good friend's birthday. The first time I came here was years and years ago. We decided to come here because we both love Italian..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], ["italian"]]}
{"id": "GRdXp6koOwTYBidQgcjMCA", "text": ["Good Italian food, I eat here every couple years with my mom when I'm visiting her - it's one of her favorite restaurants in WNY. \n\nThe food is always right...", "The atmosphere didn't feel like I'd been taken to Rome, but the food was phenomenal and the pricing was great.\n\nThe stuffed shells were delicious; plenty of...", "Food is really good, the only thing is the cheese garlic bread is on sub rolls.  The staff there is not too friendly., they seem like they do not want to be..."], "rating": [4, 4, 4], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["italian"], [], []]}
{"id": "qj4BvhmdRnsj5m831dUrhQ", "text": ["Definitely a favorite of ours.  The food is always prepared fresh and tasty.  The rotating list of wines makes each visit special.  The hostess is friendly...", "Went to dinner here on Sunday. had a gift certificate and did\"nt feel like cooking!\n   I started with the Aroma salad which was quite good! artichokes,...", "They rent out space to BreaknEggs for mornings but the same space can be used in the evenings as a private room. I was looking for a private room for a..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.88, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["dinner"], []]}
{"id": "YBWaReu4hh_aYZxjr7dFbw", "text": ["This was my go to lunch spot when it first opened. The pizza is fresh made and huge (at least two people can share with left overs) but it doesn't really...", "I've eaten here roughly 15-20 times since D'Avolio opened, so I feel I have a pretty good sense of what's normal there by now.\n\nThe food is great. No...", "Not my favorite D'Avolio but still good. We came in 30 minutes before they closed because YELP said they were open till 5. We were half way done with our..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["pizza", "lunch"], [], []]}
{"id": "FB_OAdrjwQjbmwc3blJkug", "text": ["We've been here a couple times and it's been great each time. The food is good, service is friendly, and they have occasional events and live music that...", "Had a really wonderful meal here during local restaurant week. We had a 6:45 reservation for 2 on a Friday. We were seated on time. Our server was very...", "Let me start by saying that I know restaurant week is ridiculously busy. I came here with 3 of my friends and we had a 6:45 reservation. It took 10 minutes..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "BsYeoPR3PpgG20JpJkp9Zw", "text": ["Came here looking for Peeps at Easter. Should have read the sign better. Ended up leaving with pizza slices instead. C'est la vie.\n\nPretty good pizza in a...", "This restaurant just changed hands. My friend had a bad experience. Please disregard previous reviews.", "New owners, haven't been here in a few months. We were the only customers, 5 of us, after church. Only one server, & one other employee,but service was very..."], "rating": [4, 2, 3], "TBscore": [0.48, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["pizza"], [], []]}
{"id": "CcBB6QAB3niPHgbnkasHJQ", "text": ["I was so excited to try this place out! I started to follow this business on Instagram before she opened and got to watch her dream of opening the business...", "I was rerouted off Summer to Allen due to a road closure.  Got to the end of Mariner and saw the \"Open\" sign in the window.   Immediately parked and popped...", "Mundy Cakes is my #1 go-to for baked goods, especially her gourmet sugar cookies. As someone who's been a long-time customer, I can attest to the high level..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["cake"]]}
{"id": "SHSnFyiKXjdDmXMlz0gzuQ", "text": ["I've been a customer for 15+ years. My family and I enjoyed their cheesecake several times a year, usually on special days like birthdays.  The cheesecake...", "Stopped in to pickup their cheesecake sampler after seeing so many positive reviews about them! The sampler is $7.50 and comes with 12 bite size pieces of...", "Fresh, home style cheesecake shop. It's totally different than commercially mass produce cheesecake. And it comes in very reasonable price."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "8qx5gHsiSF9f2r98EOBlRg", "text": ["Danielle did such a beautiful job for my bridal shower.  Not only were the cupcakes DELICIOUS, she brought her own gorgeous setup that fit perfectly with my...", "Sassi Cakes....was it sassi? No actually, the employee working was friendly which was disappointing since I was expecting at least a little bit of sass, but...", "I am in love with Sassi Cakes' cupcakes! This was my second time catching her at the Plaza lunch concerts and both times I enjoyed an amazing cupcake. The..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["cake", "lunch"]]}
{"id": "ue4-FL37m36fQgyZcOQEmA", "text": ["Rosalie makes some amazing creations! She provided us with some adorable ice cream cone cake pops for my son's first birthday party and they were a serious...", "Love this place-I found her on instagram and from the moment I saw her cake pop creations I knew I had to try them!\n\nI love supporting local businesses when...", "Rosalie  told me two days before my affair she could not make these. This left me hanging. Very unreliable!"], "rating": [5, 5, 1], "TBscore": [0.29, 0.34, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["cake"], ["cake"], []]}
{"id": "KK7cIzdaW2hFiq12aaG8KA", "text": ["The owner Jamie is so talented. Her desserts are not only delicious but beautiful works of art! Her pricing is on par with others in area. Will definitely...", "Outstanding bakery!  Jamie the owner does amazing, intricate work when designing your special occasion cake!  She makes it very unique suited to your needs....", "This is the best bakery in Buffalo! Jamie (the owner)  has done the desserts for my gender reveal party and my baby shower and both times everyone was blown..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.54, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["cake"], []]}
{"id": "ILIuni3UHfvNWnBjmMTRwA", "text": ["They did the wedding cake for my sisters wedding. They were so easy to work with and they made the cake she envisioned for her special day. The price was...", "So glad I did NOT listen to them on cake size. I told them I had a 25 person wedding. They suggested a 12 inch round. My Mom did not think that would be big...", "What a cute bakery! They recently made a cake for me for a special dinner I was surprising my family at! They worked with me, from all the way across the..."], "rating": [5, 3, 4], "TBscore": [0.4, 0.0, 0.46], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["cake"], ["cake"], ["dinner", "cake"]]}
{"id": "PMllAwfm5MijVmSjpISD1A", "text": ["The most amazing first birthday cake for my Granddaughter was delicious and looked absolutely adorable! Audrey and her staff were able to create the exact...", "Today's adventure is a cookies and cream with a vanilla mousse, a vanilla buttercream light frosting and chocolate ganache poured over! I love this place!", "It's ok not much seating available. It's average in food drink. Nice people tho   Much better choices in Hamburg now"], "rating": [5, 5, 3], "TBscore": [0.53, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["cake"], [], []]}
{"id": "T_Jw0bXkrEm5TRdxv8Qj6g", "text": ["A couple of my friends recommended this place and told me it would be worth the drive from the northtowns.  They were not kidding!! You could smell the...", "This place is extremely frustrating.  i have tried so hard not to write a bad review for them, but after my FIFTH time going for a cinnamon roll and being...", "I was drawn to go back to this bakery, as I already had some great desserts and rolls from there and was looking to go back to try breakfast. I'm not a fan..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "_BZdtQrWOZIwuzgn99iEIA", "text": ["Caffe Aroma holds a very special place in my heart. I used to work next door and would frequent this wonderful shop all the time during my shifts. Then, on...", "After spending the evening at the Erie County Fair, my parents and aunt wanted to take me out for a drink on Elmwood. As school isn't yet back in session in...", "Favorite things about Caffe Aroma in a nutshell: \n\n- Outdoor patio first and foremost \n- If you order a coffee (iced or hot) to stay in, you get one free..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "O-JbYkEJllwLfAAO7-JuGw", "text": ["I dare you to have just one of the bon bons from Whimsy Confections; it is not possible.  At first I felt a little guilty about eating the bon bon as it was...", "Today I had the pleasure of interviewing Ms. Michele Ogden, and she walked me through the day in the life of a whimsical chocolatier. Her aim has always...", "Stopped in to checkout Whimsy after they were featured in an article on some of the best places to get chocolates around Buffalo. My first impressions of..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Lx-SDV8lVAaMieP0r4Gy3w", "text": ["I kid you not when I say these are the BEST cupcakes I've ever had!  In fact, even though I have a dessert place 1/4 mile from my house, and another across...", "Not usually a cupcake fan but these are delicious! Come here early because if you come near the end of the day they will be sold out or very limited on...", "OMG! I can't believe I haven't reviewed this place! If the heavens ever open up and decide to rain a series of delectable treats, you can bet they'll be..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "YKzJl9ABqyzNXh9pNDlF9w", "text": ["I devoured every cupcake I got from here! they're everything you would want in a cupcake; not too sweet and moist. plenty of choices in flavors and they...", "Great, small, local bakery.  The baked goods and service are always superb and the prices are very reasonable. My customers enjoy when I bring treats from...", "This place is to cupcakes what Lake Effect is to ice cream.\n\nToday was only the second time we visited, but they're 5 for 5 on individual cupcake flavors...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "zcm0gONmKeA2IT7TBX69pQ", "text": ["Very cute chocolate shop with ice cream, milkshakes, and floats on one side, and a chocolate case full of goodies on the other side. \n\nStopped in for the...", "Oh yes, I am a fan of this unique ice cream and sweets shop (the sister store to Sweet Jenny's) The first occasion I was able to come here, I brought about...", "We stopped into Oh Pour L'amour today after dinner to have a desert. This place is great the woman at the counter was very nice. When you walk into this..."], "rating": [5, 4, 5], "TBscore": [0.29, 0.0, 0.79], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["milk shake"], [], ["dinner"]]}
{"id": "----4o16nkNUYnN3S7KWXw", "text": ["Move in weekend for our son to UB.So, since Yelp has really yet to fail me, we decided\nTo try this place. Glad we did. We were seated quickly, sat outside...", "Weirdly, I ordered and loved their salmon. The rice that came with it was SO GOOD! If you see it as the special, get that! My mom thinks the ribs are bad....", "I have been here many times but tonight I would take off points for service this evening. Myself and 3 other members of my party walked in and waited to be..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "zAb2AdRa-MIEXbTa5KtQCA", "text": ["Without question, Wild Bills is the best BBQ around. The brisket, which much written about is unbelievable, none better. If you want fancy, style filled...", "A few co-workers convinced me to go out for lunch (for once haha) and wanted to come here.  Overall, it was a pleasant experience!\n\nLiterally, it's a...", "I drove by this BBQ place on my way to work and decided to check it out for lunch today. Bill was a great personality, someone who truly enjoys his job and..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.23, 0.8], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["lunch"], ["lunch"]]}
{"id": "9Y8HlsiKflO_HObGycronA", "text": ["Holy YUY!! I'm not a pork eater but I do love me some beef brisket & this food truck had it!!\nFriendly employees.. Quick service & most of all great quality...", "Tried this food truck at the Larkin Square Food Truck Tuesday event.  Enjoyed the food, but nothing to write home about.\n\nI sampled the jerk chicken tacos,...", "I visited Whole Hog during the Larking Food Truck Turkey. Unlike most of the other trucks, they didn't have a Thanksgiving special, but that's okay. I told..."], "rating": [5, 3, 4], "TBscore": [0.56, 0.0, 0.29], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["beef"], ["chicken", "tacos"], ["turkey"]]}
{"id": "UUppgTXYM-YG5bq7JovYVw", "text": ["Some diners are OK and some just better than others. This one is one of the others. Nice people, no rush, but quick service, good food, very reasonable on...", "They don't smoke anything here, except for maybe crack because they named a restaurant that smokes absolutely NOTHING \"Smokin\" Little Diner.\" \n\nTheir pulled...", "WoW!! I'm not sure how we settle on this jewel of a diner but after a flight into Buffalo we picked this out of a yelp search and I'm so happy we did!!!\n\nI..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "NxtlAFIy0p_5YtbjbMsN1w", "text": ["I love this place. What a nice neighborhood, I love how open the setting was. Food was great- I must say it was my first poutine ever and it was...", "I enjoyed it for sure.\n\nI had a double burger and it was cooked to perfection.  Juicy with that char-grill on the outside and swimming with gooey swiss...", "Came here for lunch as you Yelpers seemed to like this restaurant.  Yelp pulled through again!\n\nWith seating for about 25 and a bar area, the place was..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["burger"], ["bar", "lunch"]]}
{"id": "bPUw2pBd9COwH-6-UhOckQ", "text": ["This is hands down my favorite spot to watch a game. They have 5 TVs above the bar and usually hav several games going. The owner Bruce is always around for...", "If you're looking for BBQ in or around the city of the Buffalo, hands down this is the best spot. It is absolutely worth the drive, as it's closer to the...", "As far as BBQ goes it's a very very good place ! The pulled pork is very good and all the sides are as well. I give it 4 out of 5 because I've had ribs that..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["bar"], [], []]}
{"id": "Dnl2okxv-OGnlcD3ByY3vw", "text": ["My Favorite place to go for lunch!!!  (and dinner actually).  I am not a barbecue fan, but this place is delicious.  I love that you can see where they...", "Stopped by over the weekend for a Facebook deal of bogo meat plate with the purchase of two drinks. I ordered the pulled pork and chopped brisket, friend...", "I don't know what to say. What's the politest way possible to say \"don't do it to yourself?\" Imagine that's what I said.\n\nI didn't think I was super picky..."], "rating": [5, 3, 1], "TBscore": [0.62, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["dinner", "lunch"], [], []]}
{"id": "uVSJjDgKYxesWXd4E75_yw", "text": ["Mmmmmm Niagara Cafe. I can't say enough about Niagara Cafe!!! Back in the day my college roommate from NYC introduced me to the delicious food from here....", "Yum! Tasty food at a fair price. The chicken, the shrimp, rice, beans and various sides are all very tasty. The atmosphere can be a bit obnoxious and the...", "I felt absolutely stunned when I was told that Niagara Cafe is actually an establishment that serves Puerto Rican cuisine! Let's be real - with this generic..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "jOcRf03irv3jThGYzDXTDw", "text": ["Love this place. \nStop by whenever we visit the Falls ... probably my favorite pub in Niagara Falls. \nStandard pub menu, all very well delivered and...", "I hate giving negative reviews but this is a tourist trap which I'd strongly caution against unless you're on a Toby Keith binge.\n\nI had the baked haddock,...", "Very good poutine. Really enjoyed the beer flight of beers they brew. Read Cream was my favorite!\n\nThe service was quite slow the evening we were there...."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "z7EOLUxdRJJgxDcYOBeK0g", "text": ["OMG Becky-Where do I start!\nI ordered the 1/2 & 1/2(half turkey and half pork- you can pick and choose which meats you would like) . It was divine!!!! I had...", "Greeted w a smile, prices are low for the excellent quality of food, we had bbq pork delicious, saucy, tender, fresh cut curly fries. Very very very clean!!!!", "I love this place for their Beef on Weck & Sweet Potato Fries! That's all I have there, so can't really say anything else about other stuff on their menu...."], "rating": [5, 5, 5], "TBscore": [-0.41, 0.0, 0.25], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["turkey"], [], ["beef"]]}
{"id": "g9C_O2ULzQTapCO96pwN3Q", "text": ["Visited here last night for dinner. I'd heard about this restaurant from friends for a few years and just hadn't been in the area in order to visit....", "This is a good place to come before doing the air boats as they are walking distance.  Or, perhaps you are in town for one of several small town parades the...", "I was glad to finally be able to check out some of the restaurants in Lewiston! Took a morning trip up north to buy some tickets at the Artpark box office,..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["dinner"], [], []]}
{"id": "bcZK7WZxykeRBJQxcTFBvQ", "text": ["Great little shop on Main St. in Clarence for all your BBQ needs. Owner Bill and his wife were extremely helpful. Recently buying a smoker, Bill took his...", "I purchased my grill from them and leaned of their catering. Best catering I've had. Brisket was phenomenal. Really impressed with heir professionalism and...", "Stopped in today to look at outdoor refrigerators and stainless steel access doors for an outdoor kitchen I'm building. Didn't expect to see great prices..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "B0iZCGpJX5ky51Wihdi5vw", "text": ["I called to get delivery, (I live 10 minutes away) and the lady who took the call said it was too far away and hung up the phone as I tried to place an...", "They're like all takeout places where they have no patience, but their food is good and they never skimp portions, their specials are pretty good too!", "I've ordered from this location for about 3 years but within the last year in a half the food has definitely gotten worse. I order the usual chicken lo mein..."], "rating": [1, 5, 2], "TBscore": [0.0, 0.0, -0.24], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [[], [], ["chicken"]]}
{"id": "qGjhCrYtJrxzyjw8sXqxlg", "text": ["I admit it, it's my guilty crutch..when I leave house at 6am on some days or weekends, it's the easiest breakfast option for when I'm on the go. The 2 for...", "I usually get my food from here all the time been for 10 plus years but today for some odd reason the girl at the window was absolutely disgustingly rude...", "I went here the other day for a chicken sandwich. The drive-thru attendant was visibly flustered and it was clear that she didn't know who had ordered what...."], "rating": [3, 1, 1], "TBscore": [-0.5, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["breakfast"], [], ["sandwich", "chicken"]]}
{"id": "cUJKfy2a7igTr0_3SWX2zQ", "text": ["That song \"Nana Nana, Nana Nana, hey hey, goodbye\" is not about this place. But one day soon it could be. And that will everyone in WNY's loss, because we...", "(3.5 stars I'm rounding up to four.) If you're in a hurry and happen to be searching for restaurants in the Williamsville area -- with the quickness if you...", "Food is always fresh and flavorful. Great chicken souvlaki salad and fresh pita. Dressing is perfect. Can't give it a 5 because I always feel a bit like I'm..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["chicken"]]}
{"id": "1kHG9W0D0-f1UBkdSNigNQ", "text": ["I received great service and good food. I went inside to order, but it looked like the drive through was working efficiently and there was no wait time at...", "This location is consistently terrible. Cold burgers, old fries and long wait times. \nIf you want a quality Wendy's, go to the one on Main Street.", "Just met a nice and super fast server with tattoos. Took only less than 20 seconds to pack me for three different orders."], "rating": [4, 1, 5], "TBscore": [0.0, -0.28, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["burger"], []]}
{"id": "zFIEFnAIr8o1ADYpOkybsA", "text": ["I am only giving this place two stars because of the sweetheart at the register. The manager Mike is a huge dick. Yelling and swearing at the staff in front...", "I cannot believe how wrong this simple stop at Wendy's went.\n\nStrange morning. My daughter was en route home with some lovely flower pots from Someday Maybe...", "A very amazing fast food chain. My burger was delish. The fries are great. Also, my Frosty was amazing. Overall, come here for good old burger and fries..."], "rating": [2, 1, 4], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [-0.2, -0.6, 0.6], "keywords": [[], [], ["burger"]]}
{"id": "wVIEXaV6y_7feoRi-IdBYg", "text": ["Popeyes is on my annual Purge list which is the one time a year I get to eat at each fast food restaurants and Sunday was that faithful day. I came to the...", "DISGUSTING!\n\nHubby picked up some chicken and sides today.  As I have previously mentioned, he recalls our first visit to a Popeyes in New Orleans.  I'm not...", "We love this place! \n\nDespite being a chain it has the best fried chicken around! \n\nWe've been here 3 or 4 times now and the service has always been fast,..."], "rating": [4, 1, 5], "TBscore": [0.0, -0.28, 0.27], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["chicken"], ["chicken"]]}
{"id": "9ajihKPLJuPYQ0PpYX8OwA", "text": ["My go to Jim's, mostly because it's in area I work. Everything I had here has been very good, just go in knowing this isn't gourmet food. My go to picks are...", "Hands down best drunk food in buffalo with mighty taco being a close second. The stinger is a classic and all the hoagies are delicious. Usually come here...", "Five stars because they have street tacos and great \"poutine\" and I stop here every time I'm in buffalo.\n\nThe street tacos are my fave. Served in a bag of..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.8], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["tacos"]]}
{"id": "PueWaI4QC8AWSDg8JMkgug", "text": ["I was in a hurry today leaving work, heading to get my fishing license and then meeting a friend to drop a line into the local waters when I made the...", "Glad you guys don't know what cheese fries is.It means there's cheese on them or on the side not none at all.glad I payed extra for something u never gave.", "Who writes reviews on fast-food chains? This guy.\n\nAlways a crowded location due to being at major cross-streets near a mall. The food is what you would..."], "rating": [3, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "1g75HSeaRFbpTP9eyCg_2g", "text": ["Once a year I indulge in each of the fast food chains and last night was the annual purge of Wendy's. I stopped in at this Wendy's location around 4:30 and...", "This is an average Wendy's in every aspect, although,there is plenty of parking as well as a lot of shops and a movie theater right across the street. It's...", "They are very fast there but I made one \nobservation that troubles me- I seldom see a Caucation employee there, they all seem to be African American, what's..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], ["american"]]}
{"id": "YF4tvlsLAwYegjSX7iJ0yQ", "text": ["I was craving a Buffalo Chicken Finger sub and was told to give John's a try.  I am very glad I did!\n\nI called at about 5:15pm on a Saturday and ordered a...", "Great subs great fingers  great service!!!!\nI highly recommend all of their subs & fingers. Awesome steak & specialty subs. Good pizza as well. Service is...", "This place is ok. I've definitely had better pizza. But their pizza logs are good. My brother got a chicken finger sub, he liked it. I didn't get one..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.74, 0.28], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["chicken"], ["steak", "pizza"], ["chicken", "pizza"]]}
{"id": "L6ASr7jaanN8qi8IGFPPwg", "text": ["I went the with my cousin to get chicken souvlaki breakfast and the waitress there told me that on sunday they have a breakfast buffet and i can have all u...", "I feel like this place has gone downhill. Used to come here for great service and great food. We walked in and waited to be seated. A guy came over and...", "We were downtown visiting a friend who is in the hospital. We were looking for dinner at 9 pm. This restaurant was open and casual which is what we were..."], "rating": [5, 1, 2], "TBscore": [-0.6, 0.0, -0.25], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["breakfast", "chicken"], [], ["dinner"]]}
{"id": "pksU9QyyQVBAsS2RsUNp9g", "text": ["Buffalo is full of festivals during the summer- Taste of Buffalo, Italian Festival, Greek Festival...\n\nIf you're a Buffalo foodie, a Buffalonian, or simply...", "The Taste of Buffalo, the biggest food event of the year for the Buffalo community offering small plates from restaurants all over the Erie/Niagara County...", "This is my all time favorite event in Buffalo. I was at the first one 35 years ago on a cool drizzly day, with hardly anyone else. The following are the..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["italian"], [], []]}
{"id": "W9XKIGJMP0yY4MgPtlcqRA", "text": ["Very cool restaurant; good food, creative recipes, good atmosphere and very good service.\nCame here on Veterans Day with my wife and 2 small kiddos- our...", "Went with a few friends last night. Got a beer each which can't be messed up. Good selection and they have something for everyone. The waitress only came...", "If you're ever wondering when to visit this place, do yourself a favor and go during happy hour because it is awesome! Drinks are practically half price or..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "74YVkUVhNcBpaGadAAMYLQ", "text": ["I don't go to this location often because it's on the other side of Transit on my commute home and just not convenient to get to--plus my son prefers BK...", "We needed a quick meal to get to a movie after.  There was a line but it didn't move very quickly for a fast food restaurant. The lady at the cash register...", "Found hair in my food, manager tried debating me and was extremely unprofessional. I noticed none of the employees had hair nets he said they don't have to..."], "rating": [2, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "U7T-jpLoZuS2HyWw-fUozw", "text": ["I heard about Adam's Rib years ago at my hair salon and always wanted to go but never got the chance to make it. So when my friends and I looked over the...", "I was looking forward to eating here during Restaurant Week. I order the 12 Oz Prime Rib for 30.18. The meal came and the meat was 30% fat and it definitely...", "Heard about the place for years. Finally went with my wife and daughter. It was great,  very fair pricing. The owner stopped at our table a couple times to..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "RjCmWRHaOspsJtVDPIGjGg", "text": ["One star on the fact that the poor bartender is the hostess, waitress, and bartender. Where is the manager ? Obviously they had employees call off. \nAbout...", "I placed a skip the dishes order and the restaurant  called me and the caller id said daddy goo goo.  When I picked up, it was silent and then someone said...", "Ordered take out. Lasagna was ok, nothing to impressive. It was just everywhere in the takeout container. Still tasted decent and I did eat it. The side..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "rbD5qSEWfHEeSLX3rx9SLw", "text": ["We got to sit outside after claiming a last-minute Open Table reservation - the atmosphere is awesome! Got a little buggy at night, but we weren't close to...", "Went for dinner with my wife not to long ago, the atmosphere, FOOD, and service was great from soon as you arrive until you leave! The atmosphere inside or...", "What an awful experience..... I will never dine here again, and I will tell anyone who will listen to avoid this restaurant like the plague.\nHere's a..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.47, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["dinner"], []]}
{"id": "5uFUWjVXQIjV5XzId_2taw", "text": ["Had dinner at the Bakery on a Tuesday.  Our waiter was very friendly.  I had salmon with a fruit salsa and a vege", "I was here for a surprise birthday party for a friend of mine. The appetizers were great. Staff was very friendly and helpful. Bartender and server made...", "Came in for the Fish Fry tonight and the place was busy, but with all the space they have, still managed to get a table by the window. The server was..."], "rating": [5, 4, 5], "TBscore": [0.49, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["dinner"], [], []]}
{"id": "JC8M7qKAaigWXhJt4AHbpw", "text": ["Oh how I wish you didn't have to give stars  this place doesn't even deserve one , I agree with other people this is by far the worst store around...", "This store is quite possibly the worst Tops that I've encountered in the Buffalo, NY area. The employees are rude and the place is locked down like a...", "This is the worst supermarket I have ever been too. This supermarket is always understaffed even in the beginning if the month I have never seen all the..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "7yUVTqD4BHnb7UhSv0Z3Bg", "text": ["Yum, Yum & Yum. So if you stay in Niagara Falls 9 out of 10 you're going to be offered some type of incentive to eat here. We went on a Saturday night...", "We got a voucher for this place with our hotel package for $40 off our meal so we decided to try it since we have tried other brazilian steakhouses and...", "This place was recommended to us, so my friends and I were looking forward to eating here. Our plan was to give ourselves about 2 hours to eat and then..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "hgt_qiaHy2toO1Jy4wtYeA", "text": ["We went to this very favorite place last night and tried the Wednesday wine tasting dinner. Not surprisingly the meal was delicious! Perfect portions and...", "I couldn't wait to try this place, I've heard great reviews from family and friends and the reviews online are so good. I was so excited , but pretty...", "We have been to the Dove before and it was good. The bread home made was very good with a bowl of their pasta Fagioli worth the trip. \nWent the other day..."], "rating": [5, 3, 3], "TBscore": [0.46, 0.0, 0.45], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["dinner"], [], ["pasta"]]}
{"id": "PqkeS0szviBZqROdDxj8eQ", "text": ["I was pleasantly surprised after reading the reviews. The steak was perfectly seasoned and affordable. Service was fast and friendly. I had no issues and...", "well .... very disappointed  with our meal .... had roast beef dinner . yuck  the meat was so over cooked was old and dried out , the fries were also...", "Don't do it! The bathrooms are dirty, the prime rib sandwiches are not at all like what they show on the menu, the au jus is more like a packaged gravy, the..."], "rating": [4, 2, 1], "TBscore": [0.23, -0.36, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["steak"], ["dinner", "beef"], ["sandwich"]]}
{"id": "YxSMvvyyR-7ViaM7f1_QTw", "text": ["Food amazing!!! Customer service 5star!!! Elizabeth was my waitress, and she gave us outstanding customer service ! She's was well verse on the menu and...", "So went here for the groupon.. the price is around $100 per 2 people for a 5 course meal. That doesn't include drinks, tip and tax. The place is located in...", "Classy experience. I highly recommend the $45 5 course deal, other wise wouldn't have been worth it. Service was very fast and friendly."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "03__rYnFkVkw2YBDnjKulg", "text": ["My girlfriend and I chose to come here as our plan-B dinner location and couldn't have been happier with our choice. \n\nThe host, waitress, and wine...", "Every so often we drop by 21 and have a nice family dinner, especially when my brother gets $$$ from the casino\n\nThe food was okay. We got the \n1. Seared...", "For a busy casino, this restaurant has great service and excellent food. \nWe were a big group and the service did not miss a beat. The menu was set due to..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.37, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["dinner"], ["dinner"], []]}
{"id": "grzQpngiKanze95s9-Py2g", "text": ["Corelife is refreshing health tasty bites.\nSince their open over a year ago I do have to admit, I have my favorites but today I felt adventures and the cold...", "If you live in assisted living, you have a Care Life. And if you're drunk on watery Coloradan beer, you have a Coors Life. If you're afraid of everything,...", "Can't say I was super impressed with my meal but I did leave feeling satisfied (hunger-wise). It's finally warm enough in good ol Buffalo for outdoor..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], [], []]}
