{"id": "1Fu7mHsKoi-1pXppPF1KrA", "text": ["There sandwiches here are so delicious! I highly recommend the Dutch crunch roll, it really takes your sandwich to the next level. A little pricey, but well...", "Came here on a Sunday morning before heading back to the South Bay for breakfast. I ordered a custom made sandwich, and it did not disappoint at all. They...", "Craving a deli sandwich!??  this is your spot!! $10 for a sandwich with cheese. Worth it! They have great bread options. People are nice and they have great..."], "rating": [5, 5, 5], "TBscore": [0.23, 0.0, 0.64], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sandwich"], ["sandwich", "breakfast"], ["sandwich", "deli"]]}
{"id": "eZC8M-w39ywwMAL3zsoM5g", "text": ["I typically DO NOT like sandwiches...\n\nHOWEVER, after trying a Sub here...I ONLY like their sandwiches! It's super fresh and tasty! This is saying a lot...", "Owner quoted \"I didn't serve you because your not a local\" \nDevastated by the horrific experience and shocked by the poor excuse of an owner! Walked in...", "Oh man, these sandwiches are amazing (and huge for the price)! I ordered the ham, salami, and prov, and my boyfriend got the turkey breast, both on French..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.37], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["sandwich"], [], ["sandwich", "turkey"]]}
{"id": "lct6jJd8sstKQcsDWvyFRA", "text": ["We have had sandwiches \nthe cuban, the reuben, the pig out and the pesto (PESTO is the best!!!!) and potato salad.\n\nNice fresh bread, tangy dressings just a...", "There Mountain cabin feel which is perfect for the base of heavenly. When the hotel coffee won't do, come to the social house for a high end latte was...", "We were craving a sandwich and noticed Social House. Right away we were greeted with a smile. Great menu and prices. Our sandwiches were absolutely..."], "rating": [4, 5, 5], "TBscore": [0.63, 0.0, 0.32], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["sandwich"], [], ["sandwich"]]}
{"id": "nxxmjiWMPSFOWjKV0avxzg", "text": ["Nothing special here.\n\nThe staff was very friendly, the facilities clean. However the sandwich itself was lacking. I got. 12\" pastrami, and there was hardly...", "A tiny \"mom & pop\" sandwich shop with excellent freshly made sandwiches. \n\nBesides the quality meat and cheese, what makes their sandwiches great is the...", "Why a fantastic little hole in the wall! Check them out! The food is fresh and fantastic.  The staff is friendly and crazy fast! This is fastly becoming my..."], "rating": [2, 5, 5], "TBscore": [0.23, 0.53, 0.0], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [["sandwich"], ["sandwich"], []]}
{"id": "vvipS8cW_JoyL37vY3EmXg", "text": ["Drove down from SLT to return some goods, ended up the Yosh's and they had some brisket on special. \n\nHoly crap! It was good! Grandma had the turkey Sammy...", "I've heard great things about Yosh's so when my friend suggested it for lunch, I was all in. I went with the tomato basil soup and half sandwich combo with...", "Great location!\nClean and big store \nBeef dip was one of the best I've had\n\nMinus one star because they messed  our order a couple times \n\nMy friend ordered..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["turkey"], ["sandwich", "lunch"], []]}
{"id": "I4YnvbGtdi9SqafGR2iY3g", "text": ["We tried Port of Subs for the first time somewhere in between our drive from San Diego to L.A. and it was delicious!  Fast forward to our time in Lake...", "I can't say enough good things about Steve and his crew. They are always so warm and welcoming when you come in. When I order on line they have it hot and...", "Port of Subs is a nice stop in the South Lake Tahoe area for a simple subway sandwich.\n\nI came here in the afternoon after hiking to grab a small bite to..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "D5n8XvQqC_vzOCi63wNChQ", "text": ["Passing through to Idaho. Stopped for a sandwich. It is just off the highway. Small sandwich counter at back of convenience store next to RV campground....", "Hidden little gem tucked away off 80 East on route to burning man. Friendly service and amazing sandwiches. Went simple and ordered BLT-oh yeah!!! Sooooo...", "We came here for the first time today. Don't know what the hype is all about? \nGlad we tried it now, we know we won't be back"], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["sandwich"], ["sandwich"], []]}
{"id": "vm_ao4mhMOLNoLxkXsV40w", "text": ["Dropped by this place - there have been a many food establishments that never quite made it here - and was pleasantly surprised.  The \"barrel\" does not...", "Garbage\n\nMy two cousins, mother and father went there. You people need to learn how to make a hamburger. Burgers were raw in the middle....burgers also had...", "First time in, ordered the sampler with a few extra add ons. The take away from our experience beginning with the positives; Friendly staff, I loved the..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.23, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["hamburger", "burger"], []]}
{"id": "WoVAlBaOuxr3l5oB4NwE0g", "text": ["I come here 3/5ths of the work week and I am always pleased with the food selection and the employee selection. Being mostly comprised of students at...", "Wildcat Den is a nice little place to grab food on the campus of Western Nevada College. \n\nI got a BBQ tri-tip that was fairly decent. The BBQ sauce was...", "I've been coming here for a while as I am a student but I recently had such a horrible experience. I won't be returning for a while. \nI received an..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "C9UIYbLEKXErznOE3OhEbw", "text": ["Huge Portions, no joke, like huge!!\nFernley Dog was so yummy, but seriously, a filling meal!", "I've been craving a hot dog and decided to check them out. My parent came along as well. The service was fast, friendly, they were patient with me as I was...", "Tried this place out the other day. We were passing Through downtown on the way to wrestling. We noticed it was open so we thought what the heck. Though a..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "u0QiD3LDXc-gnIww1E-C1w", "text": ["Fabulous addition to a wedding reception after an evening of music and dancing.  The hotdogs and fries were unbelievable and the perfect way end a magical...", "Food truck at a gas station? How much better can it get?  The name says it all!!!\n\nIf you're like me and like to try 'odd' things and especially wieners,...", "Omg fabulous!! We just stopped all got different items to eat and the two guys that helped were fabulous!! Good food great service!! Another favorite spot!!"], "rating": [5, 4, 5], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["hotdog"], [], []]}
{"id": "iopqgn9CvqaDtVXY2RC3_g", "text": ["My wife and I have eaten at the other location a few times. It's our favorite burger place in Tahoe. The food is consistently good, and it's fairly...", "Delicious burgers.... went this past Sunday, our family's 4th time, and it was just as good as we all remembered.\n\nWe used a lot of napkins...burgers were...", "Wasn't open before the 4th of July. But this burger is better than most. We frequent as a local and take out touring friends! So many options and..."], "rating": [5, 4, 4], "TBscore": [0.32, 0.48, 0.27], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["burger"], ["burger"], ["burger"]]}
{"id": "NbJ2Oxf4M9epqHeJtnDJ-g", "text": ["Disclaimer 1st - I hang out here but I don't often make a purchase. Prices are steep, so are the slopes just a little further up the mountain.\n\nThis is a...", "Ate here yesterday and wanted to order the burger dog but they said it wasn't available.  Ended up just ordering a hot dog as thats all was available.  It...", "Steins Beers & Brats\nSouth Lake Tahoe, California\n1:30pm Friday 8th February 2013\nFour Stars\n\nMet up with everybody at Steins for a bite and beer.  I had..."], "rating": [3, 3, 4], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [0.2, 0.2, 0.6], "keywords": [[], ["burger"], []]}
{"id": "cSRIM3uELvz60lN7EoAEDA", "text": ["This place is so cool!! I love the atmosphere, the free live music, the cool deco, the vibes were just really chill and relaxing. \n\nThere's a ton of...", "Just a review for their brewery beers. They were alright, but they only had pales and IPA's. Also, a growler fill isn't on the menu, but it costs $30. Why...", "So on Yelp, there seems to be reviews for the Basecamp Hotel and for Outpost Brewing, as well as for their beer garden.  All are part of the same little..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "GqvPO838gC88BGiTgjP5Aw", "text": ["What a fun and unique way to dine. I went with my brother and his family. There were several food trucks to choose from. My favorite was the crepes. We...", "Outstanding event, even if it's located on the far side of the moon. Then again, if you live in the Damonte Ranch area, you definitely shouldn't miss...", "All of your favorite food trucks...now in South Reno!  Tons of parking, live music, and grass for picnics!  BoDawgs, Burger Me, Kenji's, Battle Born,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["burger"]]}
{"id": "FHf3Ugs6Yw66FIiGbDvYnA", "text": ["Great food, better service. A ton of different options. The burgers are simply amazing. They come with onion rings perfectly battered. Recommend this place...", "Went here today and had a great sandwich!! The pastrami deli sandwich is so good! And they serve it warm with your choice of fries or salad. We go here...", "Convenient.  Lots of TV choices.  Outdoor seating and good drink options.  Just not a 4-star bar unfortunately.  This place needs a facelift and more..."], "rating": [5, 4, 3], "TBscore": [0.58, 0.83, 0.23], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["burger"], ["sandwich", "deli"], ["bar"]]}
{"id": "riIEeMmgxU27o7liC9cbZg", "text": ["Great energy, beautiful view and amazing food.\n\n1. Lot of seating\n2. Bar\n3. Clean bathroom men- urinal and toilet\n4. One big table by view seats 7. View of...", "My husband, in-laws, and I were famished, and we stopped here to eat lunch after walking Taylor's Creek. When we walked in, we were a bit reluctant because...", "Came in here with a couple friends because we love a dive bar. This one seemed to fit the bill.  We sat at the bar. There were two bartenders at the time...."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], ["lunch"], ["bar"]]}
{"id": "HNTqXIDdA5jVA0gSd6NRAA", "text": ["This review is for Cliff the bartender... \nHe. Is. Awesome. \nDef would recommend coming here just to meet him. So friendly and helpful.", "Long story short; I am a huge foodie and have worked in the service industry for over 10 years (most of which have been in fine dining).\n\nCame here THREE...", "WELL HELLO THERE!\n\nSaw the pics and had to go, what a place to have a drink,,,,,, or three! \n\nExiting the elevator to the 18th floor of Harrah's we were met..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "b3UhwyPjbQIThVQi3WgDMw", "text": ["Came in to see the World Cup watch party on Father's Day. Got to see it on a big fat screen TV that took up most of the wall! And there is a TV at each...", "Went there for a late lunch and was disappointed.  I have had their breakfast and bloody Mary's at Sullys many times and it has always been a fantastic...", "Great place to go for any occasion. Even though it's a sports bar the atmosphere is great not to noisy, very clean. The staff was all wonderful. We had a..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.77], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], ["breakfast", "lunch"], ["bar"]]}
{"id": "I7yF2BD6OswUfmpvLhighw", "text": ["First time visit. Ordered the ribeye... was good tasting cut of beef but a thin cut. This is not a downfall but if you want medium then order medium rare....", "I've been here enough to finally write a review.  \nWell, I don't know - most of the wait staff seems to be nice but the hostesses.... We came in with a...", "Service was somewhat slow. Took about 15 minutes to get water and another 10 or so before we were approached to order.\n\nBeer was very good. Had the..."], "rating": [4, 3, 3], "TBscore": [0.21, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["beef"], [], []]}
{"id": "HY2wKVaQ0WYAoBkEp6NVOw", "text": ["Audibles is probably my favorite lunch spot in this area (and not just because there are very few options).\n\nThe bartender is nice and had an easy time with...", "I stumbled upon this little hole in the wall bar/grill while looking for a place to get a pedicure.  \n\nAt 1st blush, I didn't know what to expect -- a black...", "We were on our way up to Harrah's and we were looking for a pedicure.  We found a place on Yelp called Bliss, but we weren't sure what time we'd be arriving..."], "rating": [5, 5, 4], "TBscore": [0.32, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["lunch"], [], []]}
{"id": "TbCkExg5kFy5Kp1T6RI7aw", "text": ["Super convenient location in Carnelian Bay. Super easy place to eat with kids (when you have been rejected from Gar Wood just across the street). We enjoyed...", "CHECK YOUR BILL!\n\nOur waiter tried four different ways to over bill us. Each time, we caught it - he laughingly apologized for his mistake. \n\nThe service...", "\"Ehh\" is my reaction to this place. I've come here when doing laundry to kill time and the ambiance is low light and grungy. The food is your typical..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "kzMy2d0O-wwiJbuoCabeDg", "text": ["We were looking for a place to grab a drink before heading to dinner and this place has been on my friends list.  \n\nLocated at the lake side heading over...", "Nice service and nice patio, but we both felt the beer tasted flat and musky, like its not turned over frequently enough or maybe they need to sanitize the...", "So there I was, hungry, alone, wearing a tie, and on my way home over Kingsbury from Lake Tahoe.... Where do I eat?  Do I wait and get back over the hill..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["dinner"], [], []]}
{"id": "zedtiorJSVxjpqMKdyp9TA", "text": ["My fiancé and I came here a couple weeks ago when we had to pick up one of our cars from a friend. We split their special, the Hawaiian Chicken Sliders and...", "Service AWESOME,  attentive. Pricing decent, lots of locals.\n\n Lots of local and other brews to choose from. Screens aplenty, cool music which did not...", "Bully's get the award for most improved.  Service was great and the food came out fast.  Great experience."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken"], [], []]}
{"id": "tUPDa5p8cGhmotMlR6o8pA", "text": ["Service was awesome! Steve our server was very friendly and accommodating to our party of 15. The sweet potato fries were delicious. I also had the Buffalo...", "This place is a joke, the bar is open maybe 3 days a week. Close randomly. If ur lucky it's open till 8:30PM\nDoes not warrant a mention. The owner Pam is on...", "Qazi from Clever Programmer here. So, went to this pizza place. The atmosphere and everything is pretty epic. Fireplace is pretty lit  as well. We ordered a..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["bar"], ["pizza"]]}
{"id": "wqKo9_YvEkmnj26sTnS4Yw", "text": ["Excellent water hole, we stopped after riding around Lake Tahoe. Great service and drinks.", "Mediocre all around. I ordered a french dip sandwich. It had a skimpy amount of overcooked roast beef and the fries were lukewarm at best. The crab avocado...", "Lonnnng wait for a late lunch (2pm) and my meal (basic chicken quesadilla) was nothing special. Even the salsa that came with it was plain."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], ["sandwich", "beef"], ["chicken", "lunch"]]}
{"id": "cVBGcfEQneTjPuoBS_-jQg", "text": ["A local recommended Overland to us and we were glad we went. The food was delivered on time and the ribeye was good, as was the salmon my wife ordered....", "I made a to go order over the phone about a month ago. I ordered the bison burger. When I got there there manager cashed out my order, they had made a house...", "Party of 40 In dining room. No biggie \nOh but hey... if you're a local and you're date or family there's an  hour and half wait.  Turned away at least 40..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], ["burger"], []]}
{"id": "s5PZLRAI1w5vi2TenzR01g", "text": ["Bar of America is located in the central hub of truckee at a hard corner stop as you either are coming into or leaving towards Northstar Ski Resort. I have...", "Yes, Bar of America is aimed at tourists so prices are a bit high. (I learned later that Bar of America is under the same ownership as Garwood's, and I have...", "This bar has an old school feel to it. It's a big place wit many seating options including sitting at the bar. We had always heard of this place so wanted..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "8xnjJ7ogLzHkartk4m2GEQ", "text": ["Great service at the bar. Bar appetizers were cooked from frozen but cooked good. The fish and chips were good and the frys were very good. Great atmosphere.", "This is a locals place just off the main road. It's kind of tucked back in a shopping plaza. The food is good. I had the turkey ole sandwich which was on...", "I hadn't been in for a while. I've always enjoyed the food here. The service was good. My friend ordered a soda but had to send it back as something was..."], "rating": [4, 4, 4], "TBscore": [0.78, 0.37, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["bar"], ["sandwich", "turkey"], []]}
{"id": "hRj4MQ18ShBoKnk8ieoTIQ", "text": ["While on our recent trip Me and my husband had a great experience at Jason's. This lace was right next to out hotel and we could walk to it. Went in for...", "I've been here several times with different groups of friends (no more than 3 people) I manage to get Audrey every single time!! I try avoiding the bar so...", "my husband and i were on our honeymoon in north lake tahoe and this establishment ruined our trip. i have to admit they have great views of the lake but..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], ["bar"], []]}
{"id": "Gw763Xo4cGRTUORNIrUyRA", "text": ["Fun, very casual place with good lobster rolls.\nIf you like your lobster plain with butter, ask for\nConnecticut style lobster roll.\nOutside seating is nice...", "Fish n chips, claim chowder and crab Louie! Believe the review and believe the hype! \n\nThe claim chowder definitely is better than Monterey and Bodega, it...", "Classic lobster roll $21\nFresh and their coleslaw doesn't seem processed\nCame with kettle chips by Kirkland ( saw them come in with a few bags)\nFood comes..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "qrRE9TDw78oS1eKuK0Qe0A", "text": ["Got the grilled chicken and was terribly dry, probably from sitting out too long. The boyfriend said their original chicken was good though. Cashier was...", "I'm a loyal and regular customer and I always get the 10 dollar share chicken 3 legs three thighs but the cashier I didn't get his name but he tried to jack...", "Was ignored by multiple people.   Waiting 10 minutes after being told by everybody that they would be right with us.  No chicken for us tonight.  We left...."], "rating": [2, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, -0.6], "keywords": [["chicken"], ["chicken"], ["chicken"]]}
{"id": "0GNBZTCy2Wn0ZeNZWYH1tw", "text": ["i came in to a not at all busy jack on the box. no cars in the drive thru, nothing. waited at the counter for 30 minutes, while the guy was packing sauce...", "I came here with my friend just for onion rings after we had coffee near by. \n\nWhen we came in, there was none in line. We were standing in front of the...", "This place sucks!!! I went there at 9:30 to get some munche meals. Logan the manager taking my order was rude and speedy so much i had to go through it..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "EUM3XFj4hTILAtDGPh1ilQ", "text": ["This place is insanely good. Excellent flavor and some of the best guacamole I've ever had. The chips are made to order, what other place does that? If...", "This place is a nondescript storefront in a strip mall but don't let that stop you! There was a line out the door almost the whole time we were there. \n\nWe...", "With a name like Golden Rotisserie, you'd think they would have the rotisserie chicken at 6 pm.  We stopped in specifically for this, and waited in line for..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], ["chicken"]]}
{"id": "aCDKOumLWS9jDQ0cr48Ojg", "text": ["How can the Costco meat department only have one review?  Simply put, everybody I know that is looking for really thick rib eyes, a great consistent price...", "I agree. The meat department is the best here. Everyone is ready to answer your questions and help you out. The selection is good too. I like the way larger...", "I come here when I need ALOT OF MEAT.  Usually this involves a camping trip in which I'm responsible for feeding hungry outdoorsy folks or if I'm doing yet..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "TnQ3IFcnux1sEonqfWnuKg", "text": ["This was a hidden gem that we've been missing for as long as we can remember. It's right next to the Marriott hotel right in the middle of heavenly village...", "Oh heavenly roll! I wish I could pack you up in my bag and take you with me...along with Tiger Shrimp, Sea Bass and lava cake. \n\nMaybe MaiTai can come too!", "Glad I got this place off my bookmark! We strolled in here and it was Happy Hour! At the bar area only. \n\nFound a seat at the bar and I swear we must've..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.54], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["cake"], ["bar"]]}
{"id": "y35eyFBlRueMu_7OGxGutg", "text": ["The food was really good. Everything was pretty fresh and the taste was excellent. The foods that tend to dry out over time had sauces to keep them moist....", "Solid option for buffet dinner in the Carson City area. Depending on the night, the selection may vary, but we came on a Prime Rib night. $20 plus tax per...", "Are you looking for the best buffet in the area? Are you looking for the best bang for your buck? Small town friendly appeal to you?\n\nThen look no further...."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["dinner"], []]}
{"id": "Y8mal8yO-22pZMJTjs4RqA", "text": ["Really awesome local brewery! We love coming here to unwind after skiing - there are so many great beers to try and the bartenders are very friendly as...", "November 2018 - heads up, no longer dog friendly!\n\nStill a great spot, fun that they have games and many yummy beers just know if you bring your pup they're...", "Really cool brewery! With having Celiac, I unfortunately cannot try any of the beers...but they do have a Rose Cider on tape (along with some wines and a..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "CI_ZQ3yzBtVd5qpABj7u8A", "text": ["Oyster Bar was definitely worth the wait. It was my first time here so I've only heard good things about it. Located in The Hard Rock Casino is a small...", "We came here to dine before going to the club.  First, please understand that this is a bar. It is not a sit-in restaurant.  The bar seats about 20 people....", "I've been to this Bar 2x already and I love it. I always have to come here when in Tahoe. It can get packed for dinner, the only seating is in the bar area...."], "rating": [5, 4, 5], "TBscore": [0.0, 0.25, 0.25], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], ["bar"], ["dinner", "bar"]]}
{"id": "XKk9pWfjxXwefhbdG6Xeow", "text": ["I recently hired Starkey's Food Truck for my wedding celebration in the Tahoe area.  The pizza was top notch and the team was very friendly and responsive....", "Hit the food truck out at Tesla. I was kind of in a daze and did not know what I ordered. I was surprised when the guy was poring honey on my pizza and my...", "We had Starkey's come out and supply lunch for some really hard workers during Kelly Brother's Paint if Forward. Dave was on time, quick, and the pizza was..."], "rating": [5, 5, 5], "TBscore": [0.33, 0.35, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza", "lunch"]]}
{"id": "aKbscam58QuIsuzzfaOPtg", "text": ["My friend recommended this place and I wish I had discovered it long ago. I now come each month with her and prepare my dinners for the month. I have them...", "I finally got around to seeing what this place was. It's such a great idea. Unfortunately, I was too late. Looks as though dream dinners is no longer open...", "When you have a family to feed.  And they need to be fed Every.Single.Night, here are the options I've come up with:  \n1. Restaurant (cons:  expensive &..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "lfdeg-UGs4hpFDI57fiamA", "text": ["Raley's pharmacy is the best in town!! I so appreciate their excellent customer service!", "The Pharmacy is horrible, they wait to fill prescriptions knowing when people need them. Its total BS", "A bit too expensive in comparison to what I'm used to. They have decent produce but it's not rotated enough. End result is a lot of damaged grapes,..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "H1PJkBR_6rAjavvrQdR9mA", "text": ["For some reason, when a location closes, Yelp likes to move reviews to another, nearby location. I've never been to this particular store, although I can't...", "The WORST Subway I have ever had the frustration of ordering at.  First the two guys just didn't seem to give a crap... about working there or even making a...", "There needs to be an option for 0 stars! I am fully convinced after reading all the other reviews this place needs to shut down and either be closed for..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "3oPg8SU2yUcZ2LMfigtE8w", "text": ["A funky, funny little place that has something for everyone. \n\nI decided to make a detour through Genoa on my way home. It was  lunch time and I was feeling...", "So very very disappointing. I am a regular as a Reno resident and frequent cyclists in that area. I was so looking forward to large simple salad. \nFor $8 I...", "Had the chance to visit the town of Genoa the other day, the oldest settlement in Nevada. Loved this place from the get go. It has such a historic feel..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["lunch"], [], []]}
{"id": "qR_pfjxTuohUfO3N90Q3LA", "text": ["Oh this was a sweet find!   This is a real deli with some unique foods.  We spoke with one of the owners and she said she used to be the executive chef @...", "Wow! We had the pleasure of working with Bella Tahoe catering at Regan Beach in South Lake Tahoe recently.  Candace and her team are absolutely amazing!...", "Sent in an online order for Tahoe club and smoked roast beef sandwiches. They were ready when we got there. Both were above the usually bland sandwiches at..."], "rating": [5, 5, 5], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["deli"], [], ["sandwich", "beef"]]}
{"id": "p6CrThga1Jf1sx3zRdm2kg", "text": ["While we were up in the Tahoe area enjoying the weekend, we ended up having dinner AND lunch here at the 1862 Wally's Hot Springs Resort. Only dinner and...", "Harriet's Cafe is located in a far corner if the 1862 property. When Gayle and I are visiting her Mom in Genoa, we sometimes come to David Walley's to hear...", "6/18/2018:  Yup-The linguiça-I spell linguiça the Portuguese way-okay (?) grilled skillet was da bomb . . . Guess what?  I inhaled it forgetting taking a..."], "rating": [5, 4, 5], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["dinner", "lunch"], [], []]}
{"id": "C5KQhkc-f_u1tB37H_ZSdw", "text": ["I've been her twice and both times I enjoyed every bite!\n\n\nI shared a\nAçaí Bowl With my aunt and I enjoyed a sloth Joe!", "Came here with my family for breakfast. There was only one person taking care of the registry and kitchen, therefore we waited like 15 or 20 minutes for all...", "While on the road with my band through Reno and Tahoe and eating some less than healthy food I ran into this place.  I am so happy to have found it.  I am..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["breakfast"], []]}
{"id": "Cm8kELxjGucOpNkzMq7UHg", "text": ["This place is in a tucked away location but is totally worth it. I have been here 3 times now and every time I have liked what I've ordered. Even the coffee...", "Finally got around to visiting this breakfast/lunch restaurant within walking distance of my house.  YAY!\nLocated on Wedge Parkway and Mt Rose Highway, not...", "Absolutley the worst place I have ever had the unpleasure of eating. Where the hell do I start !!!\n\nLet's see.... when we first sat down the utensils were..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "JLumGKzGu9kqGTdwYF41CA", "text": ["Wow. Okay. This place made me a believer in breakfast! \nUsually I don't like to go out to breakfast. It's my least favorite meal of the day, so I find going...", "As a breakfast lover, I've been wanting to try The Cup Cafe for a while, especially because of the cute exterior. While this cafe looks cozy and quaint on...", "I have been an instagram follow of place for some tome now. After getting my car worked on I decided to stop by for a quick breakfast before heading to the..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["breakfast"], ["breakfast"], ["breakfast"]]}
{"id": "T5XDGOcQK3trQ17qiiPhAw", "text": ["Very good breakfast. Huge portions. We got the linguisa hash, the pavement scraper, and a pancake to share. Everything was excellent and we left with a ton...", "I'm still a fan, and this is an updated review.  Woodett's has emerged as our go-to for breakfast.  Today I had the three-egg chili rellano omelet and it...", "My all time favorite breakfast place! I've never had lunch here, I'd love to try it. Its ana amazing business and I've always loved their food! My dad used..."], "rating": [4, 5, 5], "TBscore": [0.58, 0.0, 0.65], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["breakfast"], ["breakfast"], ["breakfast", "lunch"]]}
{"id": "68hk9M0T5ha9LOlMgWzxTA", "text": ["Welcome to The Morning After!  In Tahoe it's actually a feel-good thing, not a hazy, head-pounding, what-the-heck-happened-last-night feeling!  Actually if...", "New coffee spot a couple shops down from Sprouts. Just opened in late June 2018, this stylish place reminds me of cafes back in SF. \n\nIn the morning, they...", "Staff is very friendly. Chill music for studying or just good background to keep you awake for paperwork/job stuff I had to do. This place is cool bc it's..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "mqKz51qAxfcBaUhNCGcysg", "text": ["Just as good as the original. The servers are sweethearts, the coffee is perfect, the atmosphere is bright and cheerful and the food...\n\nListen, when it...", "One of the best brunches in Reno, it is a little on the pricey side but the ingredients are typically local and organic if possible which makes up for the...", "What a great little gem in the city of Reno that literally caters to all dietary needs, if you are vegetarian...they got you, vegan? they got you too!..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "P6ud6vukerhdIqpoejMFqg", "text": ["The service was amazing, and our waitress was super friendly and was catering to our every need. To add on, the food was amazing (Ribeye Steak) was very...", "Dinner should always be an experience. From simple porcini ravioli to beef rib, this place delivers.\n\nFriday night hungers brought us here whilst visiting...", "We were visiting this past weekend and asked our pet sitter for recommendations for a great place to eat. He highly recommended Twisted Fork and since it..."], "rating": [5, 5, 4], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["steak"], ["beef", "dinner"], []]}
{"id": "LaBw3YJXSZReUYpOtRMAxA", "text": ["This place truly makes my heart happy. Walking in and instantly feeling the old small town and cozy vibes. This place is precious! \nWe came here two days in...", "We had high hopes after reading the Yelp reviews but this was a big disappointment. We went for breakfast on a Sunday. They were busy and we sat at an...", "Great service. Quaint place with quality reasonably priced food. The rueben and pastrami sandwiches were excellent. Service was excellent."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.75], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["breakfast"], ["sandwich"]]}
{"id": "loPLdi8Zr1CgS-cPho0Qkw", "text": ["Stopped by on a whim and I think I might have found one of my new favorite spots in Tahoe. \n\nWe went for the French onion soup and stayed for the INCREDIBLE...", "Spent all week in town. Saved this place for our last night b/c they're the only place in town that does karaoke pretty consistently. Called to confirm the...", "I organized a private event at RoJos. The owner was super nice and easy to work with before the event.\n\nDuring the event, the food and service was..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "s2738R27hZ7rl4idS79pMw", "text": ["This was the first place we found to go after getting checked into our hotel.  When we found it online we didn't realize it was part of the golf course and...", "Don't go here unless you're able to extend your hotel reservation. Seriously, the service was that slow, we could have done the 2 hr drive home and eaten...", "This restaurant came highly recommended by a Tahoe resident. I was excited to check it out with my family. The restaurant was lovely and is right next to a..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "WlgIK6pXkDAab1XVshL3uA", "text": ["Rich thick soft serve ice cream.  \n\nWho can pass up ice cream on a hot afternoon?  We both had swirled chocolate and vanilla. The chocolate was very rich....", "Going through Yelp filling out my reviews from my latest trip to Lake Tahoe and was wondering what I would find out about our spontaneous pitstop at the...", "listen sno flake \n\n\nremember your roots.\n\nlocals.\n\nif you mistreat us-\n\n\n\n\ni have nothing further yelp.\nthe rest will understand and \nunderstand."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "d5GHxhyZgGDr13pdIh_YNg", "text": ["This is a cute little ice cream shop located right in the strip of restaurants and shops.  The other reviews mention it is dirty, but I think it is just...", "Cute/old time-y store located in downtown Truckee.  The store threw me back to when I was a kid. We got ourselves the strawberry milkshake with some...", "Wonderful ice cream here! I got the chocolate peanut butter and it's literally one of the best ice creams I've ever had. I'm a total sucker for peanut..."], "rating": [3, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 1.0], "keywords": [[], ["milk shake"], []]}
{"id": "MwTVg1Esta1PJLGfqTUs1w", "text": ["I'm lactose intolerant and I still chose to torture my stomach by coming here! I can't help it I just love their ice cream too much!!! I'll always try the...", "Wish I could give it no stars! Ordered 2 blizzards, I was told they were out of vanilla ice cream so I got chocolate instead. By the time I got to the...", "Takes sooooo long every time. Not fast food at all. You have to wait in the lot for your food unless you luck out."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "R9JIaPyYJF01Ar-J3Fwn3Q", "text": ["Ice cream here is the bizomb, finally this location nailed it, my new spot when coming to town\nGet some freshie tacos, killer ice cream, these guys murder'd...", "This was a great ice cream shop in South Lake Tahoe. \nThere was parking in the lot (a big plus - especially on a Sunday afternoon). This place is cash only,...", "I stop here every time I'm up here. Some times multiple visits. Love this place though this time their ice cream didn't seem as solid. It was very soft in..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["tacos"], [], []]}
{"id": "IueYz9gWCFGCNFx3I_SYbw", "text": ["This happens to be directly across from Mourelatos resort.  I have stayed there and would visit the ice cream parlor!  Try the Hawaiin delight!!!", "Nice treat on a hot day! We had the brown cow (root beer with vanilla ice cream blended) and a S'mores Sundae. The Sundae had a generous portion of ice...", "This is the perfect spot to grab a treat after spending a few hours at the beach across the street. My best friend and I brought our two little girls for a..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "WtrYR6zp29NAvfw8sY_IwA", "text": ["Did you know Baskin Robbins 31 flavors was created to represent a different ice cream flavor for each day of the month?! Baskin Robbins is a classic in the...", "The customer service at this place has come quite far since I used to visit. These days they are on point with the customer service.\n\nThe flavors have...", "Brought my lil one at this location, very busy but very fast service even tho they're just two staff. Awesome service !"], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "Ko4i2UqtpH95NVgkydrmeQ", "text": ["It was my first time at a Coldstone ever. I was pleasantly surprised with the customer service here. They are talented and kind enough to entertain our...", "This is the only ice cream place in heavenly so had no choice but to come here. Ordered the strawberry cake batter. Very sweet and creamy.\nFast and good...", "Very busy\nLong lines\nOne lady brought her ice cream back because they didn't put but 8-10 chocolate chips in her ice cream\nThe server didn't say sorry or..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.34, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], ["cake"], []]}
{"id": "56fS9GJ5to3vNIaR4OSaBQ", "text": ["Love this place! We love our food every time we come, no matter what we get. My usual is the monster burrito bowl, super good and there's an even amount of...", "Sucks bad!!!!!\nI would rather go next door to Safeway and eat something out of a can. It's overpriced and you would expect way more that the bland food that...", "Totally blown away by this place. Can not believe it's taken me two years since moving here to try it. I was really craving mozzarella sticks and buffalo..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "MlW6HlXSJAc1vIiH2Nueow", "text": ["A sweet family owned business that not only has a great selection of frozen yogurt flavors and toppings but also has smoothies and can make shakes. With...", "This is a great yogurt place and I can never seem to get enough of this place! The thing I love most is that they change their flavors quite often so...", "Holy Moly, this fro yo shop is fantastic!   Jack Johnson and The Beach Boys on the speakers, surf videos on the video screens and surfboards for tables...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "UuuBYchJI23ddIoKl8fPfA", "text": ["Being a virgin to this chain, thought it was a fast food place like In n out, but its actually more of a diner specializing in hamburger, shakes and skinny...", "UDPATE: I originally gave this place 4 stars. Service is eh, cajun fries were great, food was acceptable. \n\nAfter this last time earlier this month, I have...", "2 stars because I cannot say anything about the food, but we went because we were craving a shake and were disappointed.\n\nThe shake was nothing special..."], "rating": [4, 2, 2], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [["hamburger"], [], []]}
{"id": "h8yf2LX-UxXUBkroIXkT6g", "text": ["We haven't been down this way in a while, so this was a nice treat! \n\nHubby had the hot turkey dinner and I got Sunday's special ( chandler fried chicken...", "Four stars....it makes you wonder.  Why?  Katie's is what it is, and what it is is not bad.  Like all restaurants, your expectations are the key to your...", "I have always had a good at Katie's.  The staff is always friendly and very professional.\n\nRich Hoskins"], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["chicken", "turkey", "dinner"], [], []]}
{"id": "V42pczU1SVcfgwn3Ms7_KA", "text": ["Simple and convenient dessert shop near the lake! They have snacks, hot dogs, smoothies, ice cream, etc.! My brother got the single scoop strawberry ice...", "No flavor to the ice cream. Since I was disappointed with the flavor,  I asked several other people about how their ice cream tasted, and they all agreed...", "I have been getting the fish tacos every Thursday night during the concerts. The fish is very fresh, love the sauce. The pizza is good, and the chicken..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["snack"], [], ["chicken", "tacos", "pizza"]]}
{"id": "GkO44faWo_gsN0tDd1-0bA", "text": ["We loved our dinner for four on Friday night after Thanksgiving.  We had a reservation and were seated right in the window.\n\nOur server, Christian, was...", "It was an enjoyable place, but it's absolutely NOT worth the price. I can get on board with a more expensive restaurant, but $9 for a tea and $5 for a soda...", "The breakdown:\n4 for the food (selection, flavor, quality of ingredients, and presentation)\n4.5 for the service (friendly and engaging, honest..."], "rating": [5, 3, 2], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["dinner"], [], []]}
{"id": "dEHHpeN5XDXLhMBGNzrl8g", "text": ["In-N-Out Burger has all the right ingredients for late night cravings! Came here on a Monday night at around 9:30 p.m. and there were twelve cars in line...", "In-N-Out! I remember when I was living in Hawai'i and tasted my first In-N-Out burger, it was one of the most fresh tasting burgers I've had compared to...", "This Location is always busy. \nTables were dirty and service was slow.\nFood is always was delicious, fresh and fairly priced."], "rating": [5, 5, 3], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["burger"], ["burger"], []]}
{"id": "W68NomPfP3g-y04qeis1ow", "text": ["The only thing I do not like is the some style food quality. Everything else is good!\n\nMy friends and I visited Lake Tahoe during Thanksgiving time. I am...", "Came here after the Spa as it was right across the courtyard. Not sure if we came at an off hour because it was basically completely empty but we grabbed...", "I love coming here.  Its nice to eat out on the patio,  they have a decent wine list and good beers.   Today Savannah is our server and she has been..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "nOtdiTtUD7gUieJGa3Q7mw", "text": ["We had a great experience here for lunch on a Saturday. It was not too busy so we were able to get a seat quick then the rush shortly followed.\n\nThe staff...", "Awful. I ordered a San Francisco Burger that contains bacon, avocado, grilled onions, and thousand island (which was missing). Despite the normally...", "Mel's is pretty much Mel's no matter where you go. \n\nThe servers are either cranky and rude or sweet like some kind of weird southern pie.\n\nThe Damonte..."], "rating": [4, 1, 4], "TBscore": [0.35, -0.35, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["lunch"], ["burger"], []]}
{"id": "n1W5X6Tnom5bDsreLjgDkA", "text": ["This was a great place for a late lunch/early dinner. It was crisp outside and inside was cozy. We had a table by the window to watch the sunset.  \n\nWE all...", "I am a local and this is my absolute favorite place to eat here in Tahoe. \n\nThe restaurant changed hands some years ago and since then, it has been a home...", "I don't like the coffee cups. It's some kind of souvenir coffee cup with a weird lip on the edge. But, whaddya gonna do.\n\nNon-remarkable breakfast but good..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["dinner"], [], ["breakfast"]]}
{"id": "2fzPoRHFRww0FqsHiKQhDQ", "text": ["I remembered there was a Nestle Toll House in Lake Tahoe since I went 2 years ago. I went back for a visit this time around as I was in the south side of...", "Seems like a popular hang out for people waiting for tables for local restaurants.   Has no where near enough seating for the amount of customers.  There...", "Ok, who doesn't love a good cookie and ice cream? I was looking forward to having dessert to satisfy my sweet tooth. We came in last Thursday afternoon..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "unMY2Q4R6u4J3Hu8M_X1aw", "text": ["Great deli and food options \n\nThis is our new go-to since the pdq changed so drastically.\n\nGo here!", "Everything on Yelp seems to be over-rated by at least 1 star in this entire area due to people being enamored in the beauty of Lake Tahoe.   Yes, Lake Tahoe...", "Great place - always busy however, and with that comes the attitudes of its employees, management and owners. \n\nI get it, customer service is rough and..."], "rating": [5, 3, 2], "TBscore": [0.49, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["deli"], [], []]}
{"id": "QPtuuu1OHARkS2l2_pWvRw", "text": ["Did you know that they have really good bakery items??\nYes, we tried the cinnamon roll in the display case!\nWe also ordered a chocolate birthday cake that...", "I believe  this is the second time I've dined here.\nIf you're local you know that casinos only run restaurants to get people in to gamble, so they can...", "We came for the pancakes but were met with a warm smile and a nice seat. Although there were only two of us (as we werw .eeting to discuss some drawings) we..."], "rating": [4, 5, 4], "TBscore": [0.88, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["cake"], [], []]}
{"id": "ryaL2IocGXel_HgOyEIilw", "text": ["Came here bc one of my cousin's children eats only soft serve due to severe nut allergies.  Hadn't been to DQ in forever.  Typical fast food environment....", "A 2 Strictly for the customer service . Ordered a hot fudge Sunday with extra nuts and a blizzard with m&m's. What we received was the poorest excuse for a...", "Will definitely come here for a stop in Truckee. Good food and affordable menu items for family. Friendly staff. Blizzard is amazing!"], "rating": [3, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "CovS0pN4e-5Ou0pHOESpmA", "text": ["Came here on a Holiday, so as expected, it was busy, and for a grp of 7, we waited about 20mins to get seated..\nOur waitress's name was Brandy and she was...", "Had a horrible experience. The first thing I noticed is this was the dirtiest restaurant I had been in. The carpet was completely covered in food that the...", "We stopped in for a quick breakfast before we headed home. I've been to my fair share of Denny's, and this one was the worst! \nI'll give the one star for..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["breakfast"]]}
{"id": "GqOYK5lqr6VMtmr1t6nysQ", "text": ["My boyfriend used to come here as a little kid when he lived in South Lake Tahoe and recommended that us and my parents come here instead of IHOP. We got...", "Best breakfast I've had in a long time. Food was great, service was even better.  Sam our server is AWESOME! Definately be back soon.", "First morning in Tahoe and my husband and I were looking for a great breakfast spot. We were steered to Erinie's by the hotel staff and they weren't wrong!..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.54, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["breakfast"], ["breakfast"]]}
{"id": "RH56f3ZJErcEgWDJ82nNog", "text": ["I'm going to preface this review by stating the counter and curbside employees appear to be doing the best they can. They are the only reason I'm not rating...", "I'm not sure what is going on at this McD's. We use to come here back in college before snowboarding and I don't remember being this horrible.\n\nI ran in to...", "Slowest service ever. We waited for about 40 minutes to get our food. They didn't even apologize or offer any explanations, they don't care. \n\nIt is not..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "MNEFDua0Illoos34rWE8WQ", "text": ["The food and wine was fabulous.  We started with the crab cakes, which had a wonderful, light horseradish sauce that really enhanced the taste.  Then I had...", "There were good and bad parts for us, but they took care of the negatives, so giving it 4 stars. \n\nValet parking is free here if you eat at the restaurant....", "\"Garwood's South\" is exactly like their spot on the North shore...\n\nFriendly and accommodating service and it's nice having a familiar place to grab a..."], "rating": [5, 4, 3], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["cake"], [], []]}
{"id": "7pNqlKQa5EgfXxWJchyS8g", "text": ["FOOD: I had the French dip and it was pretty good, the horseradish sauce to go with it, was absolutely to die for!!! \n\nDRINKS: We had Jameson shots with...", "Good food, good prices. Family friendly pub with a cool retro vibe. Decor of old ski gear. Super fun for skier of decades. My kids loved the food and so did...", "Ratchets in the snow,\nTrekked up north to sled,\nBecame a lil girl's hoe,\nDown the hill she led,\nHeaded to the pub,\nOrdered beer and wings,\nWas shorted on..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "686pdrRoZi5fcpPyxfM4rA", "text": ["Doughnuts are fresh and a decent selection for this location.  The prices are reasonable as well, under a dollar for each doughnut.  They have a menu...", "Extremely pleased with how yummy these donuts are, this will be my go to place for donuts. I suggest it to try, you will be pleasantly pleased. Excellent...", "Fantastic, privately owned bakery.  The donuts were top notch.  I would say they were the same quality and fanciness you would find in any NYC doughnut..."], "rating": [5, 5, 5], "TBscore": [0.22, 0.67, 0.23], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "dYqci6W0cmV75IOIKN0O2g", "text": ["I consider myself a donut connoisseur. I worked at a donut shop in high school and more recently worked as a deputy sheriff-so clearly I know donuts! Kim's...", "When I called to see if they offer vegan donuts (without eggs or dairy) they told me they use a powder to make the donuts (so not from scratch) and that...", "After about a month and a half break from buying Kims donuts (because I felt the quality dropped off considerably) I tried them again. Unfortunately they..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["donut"], ["donut", "egg"], ["donut"]]}
{"id": "rncZirFO0DmWEz4mUg2NrQ", "text": ["You have donuts and then you have REAL donuts.  \n\nDoughboy is the real MVP.  Doughboys doesn't have any crazy, off the wall or super unique donuts, but they...", "We were around near Walmart and saw this donut shop. This was my first time visiting d this place. \n\nThe blonde young girl asked me, \"How many dozen?\" I...", "I can totally understand why a lot of people might really enjoy these donuts: they have the expectation of what a donut should taste like.  They're sweet,..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "99i-2tretE6McBqaukV-UQ", "text": ["This is a very handy location for me after visiting my dad's house. I drop by here on the way out of town to load up on snacks and drinks for the...", "FULL DISCLOSURE - Well I have now had to move this review 2x due to the 1st time I placed this at the wrong Jacksons Food Store location (Rand Ave) and now...", "Staff is always friendly no matter the time of day or which shift is working. Shelves and coolers are always stocked and store always seems clean. Never a..."], "rating": [5, 5, 5], "TBscore": [0.78, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["snack"], [], []]}
{"id": "dTlBDbBtL2GMP5xccm5IGQ", "text": ["Yummy donuts, friendly service. Mmmmmmmmmm....", "Quality and service has gone to an all time low. Use to be good donuts and service was excellent, but the more you learn about a place the less you want to...", "So my mother and I tried this place, after driving by for the last 6 months or so. We go there around 9:20am. Tons of donuts left, we pick out an apple..."], "rating": [4, 1, 2], "TBscore": [0.38, 0.41, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "WPL7EEeD0e_vvUD1XVpkvg", "text": ["We grabbed a hot dog at Job's Perk coffee stop/convenience store. It's a little hole in the wall coffee stop and was very busy so I cared not to stay very...", "I had a bear claw and it was great. The smoothies are good also, had peach and mango. young lady was kind and considerate to my needs. \nAlso had coffee and...", "This nice little coffee shop has quite a bit of punch in small places. It has your sandwiches, fresh baked goods, coffee, expresso, and wine bar. If you..."], "rating": [3, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [[], [], ["sandwich", "bar"]]}
{"id": "GblxxJyRrwN5WlRUGGeTdw", "text": ["This isn't your NY bagel.  This is Tahoe's homemade bagel \n\nAmazing local bakery.   Now I know where to go when I visit Tahoe", "I came here on my friend's recommendation and was not disappointed. I heard she makes them from scratch every morning. The gentleman behind the counter was...", "Checked this place out on my way back home from Tahoe, and it was one of the best bagels I have ever had! It is hard to find because it is inside a cafe and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "_GGq0vYmwMP5gk-81m5OVg", "text": ["I have been wanting to go to a baked bear foreverrrrr but I never seem to be around one when it's a good time. Well tonight worked out perfect. After...", "I've been wanting to try this place for a while now and was excited to go see what they hd going on.\nThe concept is pretty simple, picks some cookies and...", "I love all things sweets and the baked bear fills any sweet tooth I have! They have so many options for dessert + icecream combos. They always have great..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "mi3Q6Ue7qj0ljMQXyn_-Ig", "text": ["January 1, 2017 Sunday - 10:15 AM for a drink\n2 Adult and a kid\n\nAtmosphere - 4 stars\nDrink - 5 stars\nService - 5 stars\n\nBackground - I needed some coffee....", "I was literally on the search for a doughnut I went three different places and I saw this cute little coffee shop heading right behind 7-Eleven .. Lucky me...", "Welcoming interior with fireplace, comfy chairs, and a few booths to work at. Friendly service. Great coffee. Terrific prices. Worth the stop. Conveniently..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["donut"], []]}
{"id": "2lI5ViWUYYIuoif-0or6HQ", "text": ["Incredible food!  But the experience was such fun!  The girls waiting on us were fab, fun & funny!  \n\nBUT - the food!!  Fresh & Delish!!\n\nHighly recommend!", "After taking a few bites of my food, I was already in the works of writing this review due to the rude service my sister received while picking up our to go...", "Holy crap this place is amazing. We came here on a whim and I'm really glad that we did. I almost expected Frescana to be the first victim of rotating..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "zqZ8WDr_SdlTTx6muFmQ7w", "text": ["The cashier was a racist asshole and thought I was stealing and of course he didn't do the same to the white people that were shopping there.He kept...", "Very pleasant and clean 7/11. It is located where the highway and Pioneer Trail fork off from one another. I grew up near one of these types of stores and...", "Quick in and out stop when I visit South Lake Tahoe.  I get my lotto tickets here.  Maybe grab a soda or some candy.  Easy in and out.  Sometimes the main..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "yHxDZ1mW2DVE_OkkYPDosA", "text": ["Strawberry smoothie\nBreakfast sandwich - egg, cheese, sausage (good, but nothing special)\nBreakfast burrito - egg, cheese, sausage, hash browns - my regular...", "Food was great I definitely recommend the tacos or huevos rancheros! They also offer a pretty wide selection of drinks (coffee, bottled drinks, fresh orange...", "Decent hot cocoa.  Offered milk alternatives.  Hot. Light on the cocoa \n\nLooks like a decent sandwich shop"], "rating": [4, 5, 3], "TBscore": [0.35, 0.25, 0.25], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["sandwich", "egg"], ["tacos"], ["sandwich"]]}
{"id": "WmJ-u71S0ne1826hVFUCNw", "text": ["CLIFF NOTES VERSION: Small farmer's market located on Ski Run Blvd, but definitely had some quality businesses with good food!\n\nSUMMARY\nVisited here per...", "Cute, small farmers market. The fruit and veggies looked good. I bought peanut butter chocolate chip cookies from the upper crust bakery and they were...", "My favorite farmers market! Love to walk here from home and enjoy in all the goodies. From fresh organic produce, to street vendor styled faire, baked..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "_Fj1uDQPDpJ4zUYDIF3XdA", "text": ["This 7-11 has a very conveinient location for me, otherwise I would avoid it. \n\nThe people who work here are rude. \n\nThere are no restrooms. \n\nThey make you...", "Let me start by saying that its obviously very hard for a convenience store to get 1 star. This 7-11  Has everything you need, all the time. It's perfect....", "We always seem to forget to load up on alcohol and snacks before arriving at The Resort at Squaw Creek, so this place is our save-all!\n\n$14.99 is fair for..."], "rating": [1, 1, 4], "TBscore": [0.0, 0.0, 0.7], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], [], ["snack"]]}
{"id": "Mr0Ph0NoO7l-r8uXReUOwQ", "text": ["At first taste, the words ''Gourmet'' and \"Chopped\" came to mind. It seemed as if the creator of these flavors was given mystery basket ingredients and made...", "Review #368 - 2018\n\nAfter my disappointment at KRĒM being closed, I decided to give Icecycle a call just to make sure that they were open.\n\nThe eight of us...", "Cool concept with a lot of unique homemade flavors...but a hot and muggy store that will have you asking for your scoops to-go. \n\nWhile I was finishing up..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "CVgkCE1n_0aflZN5gD7A_A", "text": ["This is one of the restaurants available at Northstar Lodge Village, Truckee CA.  \n\nWas delighted to find a decent Barbera on their Happy Hour Menu (Wed to...", "Food was decent, but the experience was lacking for the price.  We ordered the fried calamari for an appetizer which never came.  My daughter's Chicken...", "My family has been coming to Northstar for decades and this was one of the best meals we have had in ANY of the restaurants in the village. We had the..."], "rating": [4, 3, 5], "TBscore": [0.0, -0.22, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "ylk4PTiA57lvElmKFi7Tdg", "text": ["I had us on the waiting list for Squeeze Inn, which is always a safe bet - but not unique to the area. There were 10 of us in our party so the wait was...", "Pros -\nFriendly staff\nQuick service\n\nCons -\nWay overpriced mediocre food \nDirty cutlery - several settings \n\nI came here decades ago when the diner was a...", "The wife and I had a little too much to drink in Reno on Sunday night and had to drive home very early Monday morning to get to work by 8 AM. \n\nAlong the..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "1ezXzPlVYf_lp5gWzRiVEw", "text": ["I have lived up the street for years but never thought to stop in for a bite to eat. The shop feels more like a sandwich shop, but it's clean and large...", "November 9, 2018 Friday - 12:30 PM for lunch\n1 Adult\n\nAtmosphere - 2 stars\nFood - 3 stars\nService - 4 stars\n\nBackground - A cold day feeling like pho to...", "Came here before a movie and was thinking pho with donuts is an interesting combo. Unfortunately the donuts were the best part of this place. \n\nThe pho..."], "rating": [5, 3, 2], "TBscore": [0.36, 0.0, 0.33], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["sandwich"], [], ["donut"]]}
{"id": "q-PhP-d5gg7Ya5FQSPz-og", "text": ["This place is great!!!\n\nThe food, the service, and the staff is all soo friendly. Well worth the penny and always a great experience for fine dining. The...", "Great food, creative seasonal menu, nice space (they are moving).  \n\nThe highs: food, drinks, ambiance\n\nThe lows: kitchen was slow but that was in large...", "Absolutely delicious! We built our own tasting menu (and the chef gladly split the main entree for us - awesome) since there was a lot we wanted to try, but..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "at3m97MaAnE7do55Q40i7A", "text": ["I'm a sucker for cheap coffee.\n\nI don't care as long as it contains caffeine, so I'll go make myself a handy half/half.  This means half coffee and half of...", "Came in on my birthday to get gas and a drink after a long day on the mountain. None of the drinks in the store have prices on them, so when I saw the price...", "Dashed into Chevron for some final road supplies before our drive home yesterday afternoon. Had a great few days in the fresh snow, and wanted to beat the..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "6dDC5PSmPEoJYuM8r8dN_A", "text": ["Floral: \nIf you're looking for designer style flowers with a budget in mind look no further!! We hired them to provide all of the flowers for our wedding on...", "Came by today to pick up special frozen dog food for the spoiled ones. I always seem to also buy things I don't need but are interesting.\n\nCan't wait to try...", "We don't buy a lot at Whole Foods but if we are looking for something special or hard to find this is our go to place.  On this particular Saturday we had..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "yk1HXZMYFeWxDgyOmp8jOg", "text": ["Pulling up starving and looking for a late Friday night dinner we stopped here at the start of our Tahoe weekend.   Everyone was hungry and tired and 3 of...", "I want to like this place but...\n\nGreat restaurant set up and decor. \n\nVery good service. \n\nGreat bartenders. \n\nFood is way too rich.\n\nEverything. Steaks....", "Great ambiance and excellent food! If we come back to Tahoe, this will be a must stop place for dinner."], "rating": [4, 3, 5], "TBscore": [-0.35, 0.72, 0.6], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["dinner"], ["steak"], ["dinner"]]}
{"id": "-D9awwBR__QcWat1KBLNSw", "text": ["Just went here for a rehearsal dinner for a large wedding party & immediate family. The bride made a reservation. \nThe place was packed! I don't remember...", "Disgusting place with staff that could care less. We were here Wed. night while visiting family in town. A customer who was in front of us as we waited over...", "This restaurant is an annual event for us.  The food is exceptional.  It is served family style, starting with a vegetable soup with fresh bread, followed..."], "rating": [5, 2, 5], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["dinner"], [], []]}
{"id": "mNicSVwV_t1KMJZkYERKEw", "text": ["What a gem of a spot!!!  Pizza amazing, homemade ranch, homemade bbq sauce and the BEST Banana Bread Pudding w/ Homemade Whipped Cream!!  \nDon't wait til...", "The view is amazing but the pizza seemed like they were trying to hard and the dough wasn't favorable. Service was good and my wine was a good portion. \n\nWe...", "Accessibility (Parking / Wait Time)\n\n1/1 Star: no wait to get a seat. \n\n_____\n\nService (Waiter / Cleanness / Ambiance)\n\n0/1 Star: Horrable service from the..."], "rating": [5, 3, 2], "TBscore": [0.8, 0.43, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["pizza"], ["pizza"], []]}
{"id": "4xqwCmTGqwiexhdK-A58Rg", "text": ["As a native NYer, i am very judgmental about pizza (naturally). I have been so impressed with Steamers recipe over the last few years! I am so happy they...", "Great little pizza place in King's Beach. The staff is friendly (almost too friendly!) when you walk in, and the service is prompt and helpful. I ordered...", "We were hungry after a walk, day at the beach, swimming and jet ski...we stuck our head in here. \nWe were WELCOMED!! (See my prior review of pizza place..."], "rating": [5, 4, 5], "TBscore": [0.31, 0.36, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "kMHZHBIACChEOB20t0075w", "text": ["I love this Papa John's location! I have been ordering once a week pretty consistently since they opened and when they first opened things were a bit...", "Called in an order, person who answered the phone was unable to use the computer.  When I arrived I had to remind them the pizza wasn't paid for.  Got home...", "I order about three times a month, sometimes I pick up or I have it delivered. Most deliveries were fine but on this occasion the driver harassed my kids..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.5, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["pizza"], []]}
{"id": "g37RFP1EmluwCiqQF24ozw", "text": ["The pizza is good but I recommend pickup. Delivery seems to be backed up constantly or atleast that's what is said over the phone. If you do make the bad...", "Delivery although friendly is just horrible! Nothing gets to you on time nor do you get your whole order! Breadsticks ( Parmesan twists) were under cooked...", "I ordered a Skinny pepperoni well done.  It was soft when I ate it.  Maybe empoloyees need to be re trained??   I say this because there usually is a few..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["pizza"], [], []]}
{"id": "OR7VJQ3Nk1wCcIbPN4TCQQ", "text": ["They bill themselves as having classic NY pizza, I've never been to NY so I can't say but I can tell you it's damn tasty.  Like, super yummy good.  Thin...", "Classic NY pizza is probably one of the best I've had.  Price is worth it. \n\nWe tried the Sicilian and it was too mushy. Did not enjoy it at all. Minus one...", "I would give this place 10 stars if I could! The people, pizza and vibe were AMAZING! \nWe ordered a Sicilian with pepperoni! And it came with those little..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.23, 0.38], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "eiaA_fjeM1OrVy0mveVnuQ", "text": ["Their pizza is... orgasmic.\nHits the SPOT for sure! \nWould I slap my momma for a slice?  I'd say so lol jk\n\nNo, but seriously...I've lived in NY for a...", "New York style pizza?? Have these guys ever been to New York because if so then they wouldn't call this pizza New York style. It is shameful to call this...", "I figured voted best pizza it has to be good! Right?\nLet me start with there is no way this pizza is voted best in the Raleys center! Salad bar has so few..."], "rating": [5, 1, 2], "TBscore": [0.71, 0.0, 0.47], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["pizza"], ["pizza"], ["bar", "pizza"]]}
{"id": "2fq2kLDy6_YBGywHwORIBw", "text": ["Awesome pizza! We stopped here for a late lunch on our way home from the lake, and it did not disappoint. We ordered the 12\" supreme with no onions, and it...", "My friend and I came here for dinner one night while we were in Tahoe on vacation for some pizza and ice cream. The slices here were huge so we each only...", "The ice cream was okay. The customer service was great. I didn't like that the guys didn't use gloves to serve the ice cream or touch my cone:/"], "rating": [5, 4, 3], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["lunch", "pizza"], ["dinner", "pizza"], []]}
{"id": "pEdhduFQLOhmlmd5y8iheQ", "text": ["That was a great pizza ! Wonderful cheese and fantastic crust. We enjoyed the salad bar. Staff is young and friendly\nNew favorite in Lake Tahoe \nBack again...", "Decided to check this place out after reading the reviews and am having a hard time understanding how this place has 4 out of 5 stars. The place inside is...", "Racist people. At first I gave them benefit of the doubt but then the next worker was the same way. \n\nThey make there money on tourist \nSo they should be on..."], "rating": [5, 1, 1], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["bar", "pizza"], [], []]}
{"id": "Rn-jUhScIUBhMA2xoGt1JA", "text": ["I came here on a whim with no booking or knowledge of anything about this spot, other than thinking mmm cocktails & it had a cute logo. From the second I...", "They get extra stars for being open later. But this is a loud bar and the tables are close to one another. Not a place for good conversation. \n\nCome for...", "Loved it. Finding the need to eat solo and to feed my cocktail urge, stopped in here. It is very busy, 6 weeks after opening, tons of locals, and it's..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["bar"], []]}
{"id": "7zCndv5LmuuD5TcABi25Ng", "text": ["If you don't care much about quality and are looking for sub-par bake it yourself pizza, then Papa Murphy's is the place.  Not for everyone.", "this place has gone downhill, pizza and customer service. quality not what it used to be, that's ok plenty of other places to eat!", "Something has happened here in the past several months. I don't scrutinize my pizza that closely, but the last few times I got a pizza here I noticed the..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "kQmv3mK7Y8ufkjARNWA7Lg", "text": ["Glad to see an enthusiastic owner of a new place to eat in Dayton. Pizza is pizza typically it's good or bad. I like it, I thought the toppings were very...", "EDIT: I have to update my review after last night's experience. I've bumped my review up to 4 stars even though our order was 30 min late. They were slammed...", "This is their first day, and like all new restaurants that come to Dayton; they were swamped.   The owners are friendly and the facility is clean. I decided..."], "rating": [4, 4, 4], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["pizza"], [], []]}
{"id": "TlvnDLrM4p2udHfeUwL82A", "text": ["Yum. The pizza was so good I don't have the energy to write more than that. \n\nIf you are in Reno. Go here. Unless you don't like pizza, then why are you on...", "Very impressed. \n*vegetarian wood fired pizzas were excellent... nomad, margherita\n*kids cheese pizza was a generous hand made margherita (they didn't...", "It's 2018 and why has it taken so long for me to come here?!\n\nA friend was visiting town and she wanted Pizza. Chose SouthCreek Pizza as it was very close..."], "rating": [5, 5, 5], "TBscore": [0.6, 1.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "1rq5RQrT0g0V7gMsbzSUSQ", "text": ["On the 25th of October and 3rd of November, we visited Virginia City; more specifically, the Washoe Club for their Millionaire's Club Tour and Bats in the...", "1st restaurant hubby & I are trying here in Reno (Virginia City). We ordered Tommy knocker & sweet heat wings absolutely the best. The thin crust is...", "Virginia City, is a great spot to spend a day. There are a handful of food options. Some of which are really good and some of which are not.\nUnfortunately..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], ["wings"], []]}
{"id": "XwcJA2L0ws2cQdxjPH-oNA", "text": ["Excellent pizza by the slice.\n\nWhen it's slow I enjoy sitting on the deck and watching the people float by.\n\nFor some reason quality went down when I...", "Took kids on cold November outdoor lunch on their patio. Ordered slices that fit each family members dream slice for about $5 a person. A and W root beer on...", "I had an amazing slice of BLTA pizza last night! Can't wait to come back and try other slices! My boyfriend had the Thai chicken that was also delicious...."], "rating": [4, 5, 5], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["pizza"], ["lunch"], ["chicken", "pizza"]]}
{"id": "LqCi3zBXDW-G3SzN2B_A7Q", "text": ["Come here every year! Good pizza, crust chewy, good amount of toppings. Sausage is great. Price for the amount of side salad a little much....\n\nThe pizza...", "This little restaurant has become our favorite lunch spot on our way to Nevada. It's on Donner Pass Road, just off Hwy 80. They have pizza, tacos, salads...", "Nice staff, pleasant atmosphere.  But the pizza was pretty awful - just bland/flavorless.  Sauce, cheese, even the meat toppings just had very little..."], "rating": [5, 5, 2], "TBscore": [0.44, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["pizza"], ["tacos", "pizza", "lunch"], ["pizza"]]}
{"id": "7HwdJ-Du_KGULOkvoRWHzw", "text": ["This \"by invitation only\" fine dining experience is par excellence! Nestled into a hillside in a lovely and private area overlooking the \"lake\" one has all...", "Best Pizza in the country - by invite only, so good luck!", "Outstanding food, terrific wine, amazing after-dinner drinks, and great company all around. Our gracious hosts kept the wine and conversation flowing. All..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.62, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["pizza"], []]}
{"id": "bgNodkkjarASFfMWS5g-ig", "text": ["Three words: smoked pork ribs. These weren't the typical overcooked ribs drowning in sauce meant to hide the shortcomings of the meat. No, good-To-Go had...", "This place is the best. Called in for a pie during a thunderstorm, perused their DVD's for rent, grabbed a sixer, read the Valley Horse News at the bar...", "Tiny little mom and pop place in Washoe. Was taking lunch to my husband and I ordered two tri tip sandwiches, deli and dip style. I'm not a fan of tri tip,..."], "rating": [5, 5, 5], "TBscore": [0.0, 1.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["bar"], ["deli", "sandwich", "lunch"]]}
{"id": "TF3qNGUBUgIYp6u0j79JHQ", "text": ["BJ's Nevada Barbecue Company is so good, I could run out of superlatives describing just how passionate I am about this place.  While I've tried many of the...", "BJ's is a local institution. Food quality is really high and the recipes are fun and flavorful.\nWe went for breakfast today and I can honestly say it's the...", "I was up in Reno on a business trip and a friend from the Reno area suggested BJ's when I asked about good places to eat. So I stopped in for lunch last..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.27, 0.35], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["breakfast"], ["lunch"]]}
{"id": "a3N9erjaLER_cH9rhsADEA", "text": ["Great location for a date night or happy hour with friends. I give the staff 5 stars, even the manager walks around and makes sure everything is going...", "I was looking for the best place to eat in Reno with a group, and this seemed top-notch.  And did not disappoint!!  I made a reservation for seven people...", "Bistro Napa is the best happy hour ... line forms fast and the tables fill up quickly. Getting wine a food half off is a great deal. I do recommend dragging..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "8SlHynYA-QN3UYRpKvNDgA", "text": ["We love BJ's as a rule. Great food, amazing craft beer... their Jeremiah Red is my favorite non-seasonal craft beer. \n\nAnd their pumpkin ale is like...", "Got off work, took the puppy to the Vet and wife and I didn't feel like making anything. So we head to BJ's which is close to where we live, and easy to get...", "I visited BJ's today for lunch and i had an exceptional experience. \n\nWe sat ourselves at the bar area to avoid the short 5-10 minute wait. We were..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["bar", "lunch"]]}
{"id": "dnVmTNsukTOXmAUue0pncQ", "text": ["Great outdoor seating during warmer months. Good service overall. Can't go wrong with the pepperoni pizza. It's simple but delicious. Pear and Gorgonzola...", "I REALLY want to give 5 stars because the food is great. A high note: the gluten free pizza crust! But the service staff both times we've been there........", "Would highly recommend Fireside Pizza in Squaw Village. The atmosphere in the summer was very chill and weather was perfect. \n\nStart the meal with friendly..."], "rating": [5, 3, 5], "TBscore": [0.33, 0.41, 0.43], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["pizza"], ["gluten", "pizza"], ["pizza"]]}
{"id": "wbydX0AlY5acB94DISSuFw", "text": ["Had delicious take out from this restaurant. Chicken parm sando, chicken piccata entree, cheesy garlic bread, and kids meal pasta were all delicious. The...", "I don't normally go one star for a place I have been to multiple times. Unfortunately the last 2 time we have had this pizza it was under cooked and not...", "I was craving pasta so I hit up GC.  The vibe is like a dive bar meets a family restaurant from the late 1970's.  The padding in the booths is deader than..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, -0.3], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["chicken", "pasta"], ["pizza"], ["pasta", "bar"]]}
{"id": "PtsVpLThcxeTBnaRC3wY2g", "text": ["I'm Harrah's casino. The food prices at all the food places at Harrah's are shamefully jacked up higher then normal to gouge the captive audience. Shameful...", "I stopped in for a late lunch and had the pizza. Overall it was a good experience, except for the bill.  \n\nThe slices are about 1/4 of a pizza each but boy...", "Im from fresno ca,came here to harrahs for a company annual party OMG let tell u guys this italian place is great,my coworker had a slice pizza which he..."], "rating": [3, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [[], ["pizza", "lunch"], ["italian", "pizza"]]}
{"id": "-mhW_lp-SjCqVEJlSOk6Rw", "text": ["I love this place! I'm a sucker for fill your own drink type bars, but the pizza was so good too. I don't rememeber the exact pizza I had but it had sausage...", "We're so disappointed . The last couple of times we've been there the dough was cooked but not enough and sent it back to get the true wood fired  brick...", "One of the best places I've been in a long time..great food, love the outdoor seating,  service was exceptional... \nHappy hour was a bonus.\nHighly recommend..."], "rating": [5, 3, 5], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["pizza", "bar"], [], []]}
{"id": "9Oqvn-Yz8AiF8jfWQnBsHw", "text": ["What a pleasant surprise !   Montana just reopened two days ago ... with a brilliant new menu and new chef - Honestly it was such a fabulous meal and all 9...", "Best Authentic Italian in the Valley\nCame in with our 2yr old nephew, Brother and Sister in Law from Washington and had the greatest time. \nJohn Parker and...", "Served me a hot tap beer and made true the meme that white people cant handle spice: this was the most bland and boring shrimp and grits I have ever had...."], "rating": [5, 5, 1], "TBscore": [0.0, 0.52, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["italian"], []]}
{"id": "jwr8JqQJx0dRzAvbhQwDYQ", "text": ["Picked up two pizzas today. Clerk behind register was fast and friendly. Saw the best supreme pizza I've ever seen in my life. Very happy today. Thank you!", "Tried the stuffed crest Pizza for a 2nd time. It's like they  made it on a  cracker. Wafer thin and for 16 dollars. No better than the last time I tried it...", "I have never really been a fan of any Pizza Hut chains. This one is not the best lol. I have been here quite a few times and while the prices are amazing..."], "rating": [5, 1, 2], "TBscore": [0.43, 0.0, 0.42], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "NwREa7ud-W6bgCNteM6Y5g", "text": ["Have been in Carson for almost 3 years and always wanted to try this place but it usually looked closed whenever I drove by.  Well the good news is they are...", "This place has recently reopened, and from what I understand has gone through some revamping, with different coffee, candy and pastries as well as adding...", "Very cute place, nice selection of coffees and sweets, and a very kind barista.  My coffee was good and made exactly the way I requested it.  They have a..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "RzkhgBtzSYyHESuJitP_vA", "text": ["Met the gentleman here who is clearly the owner. Wish I had gotten his name\n Extremely personable, knowledgeable and professional! Wish we had time to sit...", "For a very long time, I have had an unfortunate affliction for Starbucks... but is today is a turning point in my Career as a Coffee shop snob! The charming...", "Friendly and fast service. Delicious muffins and tastey drinks. I really enjoyes the option of fresh fruit available. \nI would like to see the use of..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "t6C0uVCeRsV3FldV1vpr2A", "text": ["Don't know why everyone is trippin, this Starbucks was super fast. We went at 9am on a weekday which I would assume is a busy time.\nOrdered, rolled up to...", "I have gone here for many years and I don't know if it is the location or the help but they are fantastic.  I would come back again and again.", "No coffee on latte. Only milk and syrup. No yogurt at 9 am.  Poor over the counter service. Everyone working hard for drive-thru traffic.  10 minutes to..."], "rating": [4, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "rRnGlS_KOzIKHQ-NeCk-5Q", "text": ["AMBIENCE 4/5\nPlenty of parking outside. And five tables inside and a little coffee table in the corner; great for working, studying, or playing games. There...", "Came here for a quick coffee on my way into town to run some errands. Ordered a soy iced mocha and half of my drink was just chocolate syrup. No coffee...", "We stopped here on the 4th of July to kick-start our holiday. I would describe the decor as cluttered-cabin-hippie. Despite the fact that there were only 10..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "92dl8GQfp0qtSNViILMedg", "text": ["Oh my goodness, I am so glad I found this wonderful coffee shop. During our recent trip to South Lake Tahoe, my husband and I were looking for a coffee shop...", "Delicious hidden gem.\n\nI prefer to hit a local coffee spot instead of national chains and this was the perfect solution. My wife doesn't like coffee but she...", "Screw Starbucks, visit here!\n\nStopped by on a whim while walking around the area looking for coffee. Walked in around 0900 and was pleasantly greeted by..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "saduW06qJPGGOTCphMGWvQ", "text": ["What a lovely locals coffee spot right in the middle of town. Easy location, right off the main road in a private parking lot with a drive-thru and walk-up...", "Love this place. Best local coffee spot! Love their cold brew and white mocha chillers!!! Also love that they have a stamp card!!", "Coffee is good. But it's not that good. A little overpriced for my liking. Was trying not to pay Starbucks prices, but if I have to, then I'm definitely..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "3saC88QNlxHI96XumdY9FA", "text": ["This place is AMAZING. From the moment you walk it, it's such a cool, welcoming environment. They have lounging spaces with books for you to read, and...", "I must say that I am pretty disappointed in this place. We came in to order a bagel sandwich and egg added on. The cashier was also the cook and the server....", "Great sandwiches and salads! My favorites are the Caesar salad and the Waldorf sandwich!"], "rating": [5, 2, 5], "TBscore": [0.0, -0.25, 1.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["sandwich", "egg"], ["sandwich"]]}
{"id": "rrDIIUPKmmqx3jDDkqI-1Q", "text": ["Excellent coffee and scones. Service was top notch and the place is awesome! \n\nDid a great job with the design and I will be back!", "Cute, cozy, well lit, comfortable. We love the decor the atmosphere. \nCelebrating local Nevada places, with a simple menu and inviting room. \nWe both were...", "DST coffee is a great, locally owned coffee shop that really understands what it means to run a small town business. The baristas are incredibly..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Yy2RSJxofs4dPUvIXlpXrw", "text": ["This establishment,, Wonderful Restaurant is long over due for my reviews. And I'm sorry. \nThank You for being a great restaurant with great food. \nThe food...", "Tacos: a solid 3/10 due to the fact that the tacos are super dry. The \"steak\" tacos are half meat half cartilage. The chicken tacos are even more dry, but...", "These were literally inedible. My gf and I ordered 2 asada, 2 pollo and 2 al pastor tacos. The asada was grey, tasted weird, and had no sear on it..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, -0.28], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["chicken", "tacos", "steak"], ["tacos"]]}
{"id": "M1zuGWd9vtbnhCpVYDc4Xg", "text": ["SPECTACULAR MEXICAN FOOD! I'm hesitant to give Tejaro a shoutout because I want it all to myself! This place looks modest, but it packs a huge punch,...", "I am so happy for these guys!  They had a little trouble establishing a spot, but now that they have it I am so glad.  Stop here about once a week.  I love...", "Love the food and the family! Their food is amazing and their service is awesome too. Everything is priced just right and is by far some of the best Mexican..."], "rating": [5, 5, 5], "TBscore": [0.28, 0.0, 0.52], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["mexican"], [], ["mexican"]]}
{"id": "_J8Xf6qMZxVwtKzqvJsmdQ", "text": ["This place wasn't bad.  $1.50 tacos. Quesadillas were very cheesy and was really cheap as well. \n\nDon't expect Mexican food that will blow your mind. For...", "This is a cute little mom and pop shop owned by a chef with 16 years of experience! They have a small menu but every tasted great. I specifically got the...", "Taco trucks and hole in the wall\nMexican fare is what I seek out when on the road. I've been to a few in South Lake, but in my opinion, Taqueria Jimenez is..."], "rating": [4, 5, 5], "TBscore": [-0.24, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["tacos", "mexican"], [], []]}
{"id": "sWy31TLzFLpqtKojQvUq6w", "text": ["Stopped here before heading back to Reno and it's actually the best Taco Bell meal we've had in awhile. The nacho fries where hot and crispy, the tacos were...", "I used to love this Taco Bell, but it seems to be falling apart. I've given up on getting breakfast there (apparently, despite signage, no one is in before...", "Drive through service is so slow. Been waiting 15 minutes at lunch hour and still 3 cars ahead of me. I only came to this location as I'm driving to Reno, I..."], "rating": [5, 1, 1], "TBscore": [0.31, 0.28, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["tacos"], ["breakfast"], ["lunch"]]}
{"id": "6kUeJFDi39I5ZRYVU0ILWw", "text": ["Are you KIDDING ME? I haven't eaten authentic Mexican food in YEARS. I kind of swore it off. For some reason today I was dying for it. Went here, got the...", "Huge props to this place for making such authentic and inexpensive Mexican food in an otherwise spotty area. South Lake have every reason to cater to the...", "I will share a secret....get the Chile relleno burrito. OMG.  Its one of the best things I've eaten.... ever. Add the red sauce to it for an added little..."], "rating": [5, 5, 5], "TBscore": [0.37, 0.23, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["mexican"], ["mexican"], []]}
{"id": "uklk_dvCjJzQw8ZQonuEZw", "text": ["Pepper's is my go to in Tahoe City when I don't get a chance to pack lunch. The burritos are massive, I can never finish one in a sitting. Marty(the chef)...", "So the owner who says he's the manager is an Asshole.  There's jus' no other way around it.  He never cracked a smile, and really made you feel like he...", "Went here with my girlfriend recently. The place looks a bit better than decent, though it's in a crummy location and the outside doesn't look like much...."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["lunch"], [], []]}
{"id": "jBPKUWmDBys-QBRGGgwpbw", "text": ["Went through the drive-thru about 10:30pm. They not only got the order wrong, but the food was very poorly made. Pictured is what was supposed to be a...", "Really appreciate the increased effort of a Vegetarian menu at Taco Bell- I come here all the time for lunch and aside from the occasional long drive they...", "Customer service is the worst, take to long not only that but they never have Sh**t. Sucks it's the only closest near me. Taco Bell what happened?!!"], "rating": [1, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.2], "keywords": [[], ["lunch"], []]}
{"id": "5EP-nKDRdHiqhLMiSBZpkQ", "text": ["The charming and welcoming little restaurant in Virginia City has been making changes in hours of operation and menu selections. In addition to their...", "Not impressed...this is Denny's disguised as a small independent restaurant.  Charging a premium for mediocre food.  Honestly, I should have just bought...", "This place has potential to be very charming but..... the service was non existent! I literally had to get up twice and ask for coffee. Our server never..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "p8ae0LDzZk2ksN4wvxEAFQ", "text": ["Husband and I stopped in on our way home, we always pass this place but have never been inside--we were missing out! \nIt's very clear that everything is...", "Stopped here to grab a bite. I had a Patty Melt. I think the cook was new. All that was on it was hamburger patty and sour dough bread. With very greasy bread.", "Overall good. Busy when I got there, not the quietest place, not the cleanest or quickest but very friendly and tasty."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["hamburger"], []]}
{"id": "qY3gtK-H9RYFEMIyFv1a2g", "text": ["Before or after you hike or bike the trail, this is a great lunch spot for yummy bites likes sandwiches and salads. Grab a beer or drink sized wine from the...", "In many years of coming to IV, we had never stopped at Tunnel Creek Cafe. Finally made it on a late October afternoon. \n\nAlthough it was a bit on the cool...", "General description:\nThis is the only restaurant in the lot. Small and cozy. \n\nThe good:\n- Friendly staff.\n\nThe mediocre:\n- The food was decent. \n- The..."], "rating": [5, 4, 3], "TBscore": [0.8, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["sandwich", "lunch"], [], []]}
{"id": "5jYu2qVcMJLJ0bCQLVyKjQ", "text": ["They have a breakfast/ brunch menu and lunch/dinner menu.\nWhen we stayed around the area we had almost all our meals here. The staff is super friendly, the...", "Excellent restaurant & hidden gem in TC. I went for lunch & had the chicken Pho; it was delicious. I've been looking for a Pho in town & im so happy this...", "I was pleasantly suprised. What a diamond in the \"rough\" lol(golf punn) Suzanne, the owner, is quite pleasant and was helping out behind the bar. Drinks are..."], "rating": [5, 5, 5], "TBscore": [0.35, 0.41, 0.24], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["brunch", "breakfast"], ["chicken", "lunch"], ["bar"]]}
{"id": "oFgIuSB7ATcujtHaV2zDaQ", "text": ["Hands down the best breakfast I have ever had. \n\nThat's all you need to know, bye!\n\nJK, I will tell you more. \n\nHusband and I went on a Tuesday morning at...", "This is a locals spot, and maybe only the baclava French toast is where it's at. \n\nI had the eggs Benedict, and my husband had the American breakfast....", "I've been wanting to come check this place out for a bit but the reviews about bad service and over priced food kept me away. I am glad I gave it a shot..."], "rating": [5, 3, 5], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["breakfast"], ["american", "breakfast", "egg"], []]}
{"id": "nnVCFeMRLDDluZtabg9piA", "text": ["Had dinner here on our last day in Lake Tahoe, we both had the five course dinner (this can be customized, you can select different courses from a list),...", "Do not let let the fact that this restaurant is in a mini mall,  or that most of the chairs are slightly different styles bother you, this was hands down...", "I haven't reviewed this place yet? Oh man! Seriously some of the best food in all of northern NV. The chef, Jean Paul I think, trained under some famous 3..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner"], [], []]}
{"id": "HwyrQMT4JRmGUWZejMSsNw", "text": ["A new entry to the premium snack basket on Delta's domestic premium cabin, I grabbed two of these as it was a morning flight with no real meal. They're...", "I'm very pleased with the Nature's Bakery products. I personally am not GF; though my significant other is. I have tried both the GF and non-GF products,...", "Their fig bars are loaded with sugar and canola oil, two foods associated with heart disease, cancer and other diseases per Jesse Cannon's book \"The End of..."], "rating": [3, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, -0.6], "keywords": [["snack"], [], ["bar"]]}
{"id": "-kyBOtge3t9JhZVxkvipcg", "text": ["Never a dull moment. Every time I show up for my drink or a few for coworkers the staff is always on point. I know it's the job to ask how my day is going...", "I love Dutch bros and the staff is always friendly. However, today I pull up at 8:30 and I'm the 3 rd car back. I see the car in front of me had a Dutch...", "This place makes the wife happy...therefore resulting in happiness for everyone. \n\nEcellent customer service on all criteria. They were 6 cars deep on each..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "eVL8QRCUYnz49qQ1NO8_Jw", "text": ["Best Chai ever!  It was such a relief to find this little gem of a shop away from the hustle and bustle of South Lake! \n\nMy son had a smoothie and he drank...", "So happy we found this random little spot! Great coffee, super food bowls, and pastries! Best part? They were playing NeYo's \"Yo (Excuse Me Miss)\"  Highly...", "My favorite place to get chai in tahoe \nI always buy a big of homemade chai and bring.it home"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "ouVTnhJ1uW-qA9G3NS9W8g", "text": ["Have not been a fan of Jerky Junction.  I found their jerky to be less than average quality.  I'm referring to their brand of jerky sold in other stores,...", "Seriously best jerky I've had! I am addicted... The clear bag slab jerky is very different from their other choices. I would not recommend it. I love their...", "Only 4 stars because they were running out or completely of an awful lot of items, which my hubby wanted--otherwise fantastic place to get jerky or nuts...."], "rating": [2, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "I-7noYWupkmXYWkL_YbSnQ", "text": ["I always stock pile my jerky here and you can order online. Fun to taste test first though.", "This shop was a hoot.   In case you just got lucky at the Hard Rock Casino just down the street and won a trillion $$$ then you should not be concerned...", "First time here. Really an unbelievable establishment. Lobby is simple and to the point. You are not here to dilly dally, you're here to purchase PREMIUM..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "6SYG6M05gIwaj3doas6X9Q", "text": ["The Hawaiian Honey Pork Sandwich is absolutely delicious. The pork was tasty and tender. Bread is fluffy and toasted warm. The only thing I would have...", "I was very excited to try Tealeaf after seeing my friends posting about it on social media. I really wanted to like it and even gave it a shot 3 different...", "THE best boba place in Reno. It's run by an awesome Viet family who also own the nail salon next door. I moved to Reno from Southern California so I'm picky..."], "rating": [5, 2, 5], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["sandwich"], [], []]}
{"id": "7lHXPbEGcdbEF9ektynMtA", "text": ["I was fortunate enough to try Empanash tonight at South Lake Brewing Company. You could truly tell how homemade their food is. Everything from scratch. WOW....", "If there was a way to give no stars I would. Bitch at the register at live at lakeview was the rudest person I've met. Didn't think they would turn away any...", "I had the opportunity to try their Empanadas, and they're da bomb!\nAuthentic argentinian, and soooo delish!\n\nKeep up the good work, cannot wait to catch up..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "84hVjK5VQe7Ma5thYYqOqw", "text": ["Fast solo service with pleasant smile and conversation.  Nice multi-tasking skills!  Good job Candace!\n\nOnly problem was finding this place. No signage...", "This location should be called Slowbucks. \nThe slowest Starbucks in the history of coffee making. Do not make a pit stop here for a quick coffee. It took no...", "The ladies that run this Starbucks are the best baristas ever! They remember my exact drink every time! Candace and lupe are awesome! Thanks for making..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "q_vfu3RY17Q6NpeLA1OW2w", "text": ["This has easily become my favorite coffee shop in South Tahoe. The only downfall is that I've only been when it's bone-chillingly cold outside, so I haven't...", "This is an updated review.  Upped to 3 stars, I don't recommend it if you're seeking outdoor dining and won't be back.\n\nThe yard is now a mess.  I picked up...", "Great coffee shop in South Lake. They are using Old World Coffee out of Reno. The employees were all great and the patio in the back is beautiful...."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "3BgkYo1o1P38v77EYblTQg", "text": ["Red's Old Fashioned Candies is one of those special candy stores located on the main drag in Virginia City. This popular shop is near the center of C Street...", "OMGoodies! A wide new delicious array of ice cream flavors I have never experienced! 5* for the variety!! Cleanliness as well. Customer service was decent...", "This is your hole in the wall restaurant. We ordered the hot pastrami and roast beef sandwich. It was really delicious! Staff was friendly and we will..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.54], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["sandwich", "beef"]]}
{"id": "Y7bD8sGE5IsworWLXrU3Gg", "text": ["If you are bike riding clockwise around Lake Tahoe, 72 miles, and start at Heavenly Village in South Lake Tahoe, then Emerald Bay, this 7-eleven is pretty...", "Will I ever find a 7-Eleven that deserves more than 2 Stars?? The quest continues. \n\nThe Benadryl I obtained here was by far the best package of Benadryl...", "My family and I come here a lot whenever we need a soda or slurpee fix. Staff isn't overly friendly but they are quick at ringing you up and they keep the..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "uXmK_Xtdt9IjE7b82oMVbg", "text": ["Not the cheapest candy store but you're in a tourist trap town so it's expected. \n\nThe staff has always been nice every time I've visited and I appreciate...", "Fun shop and brings back memories of being a kid and my dad taking me to Old Nevada. Anybody remember the old cigarette candies!  Great little shop to...", "This place has so much taffy in barrels, all kinds of different flavors. The selection of nostalgic candy, the stuff you had when you were a kid but have..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "hgufQMEwGMg_m18JnRP0vA", "text": ["I have been wanting to try an Açaí bowl so I talked a co-worker into checking it out with me. It is so good!! I got the regular size berry bowl, which was...", "Since my son is encouraging us to work out and eat healthy, we had to try it. \nJust finished a work out at Double Diamond, and this was next.\n\nWe both got...", "Disappointed. Was visiting from California and was looking for a Nekter juice bar.  Reno doesn't have one so I went to Jus.  I tried their charcoal..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, -0.75], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], ["bar"]]}
{"id": "t-rYY1hDy7v7IHRoOr8rOA", "text": ["Of the couple Northstar Village food places we tried, Copper Lane Cafe was my favorite. We even went back later in the week.\n\nI don't normally order salads...", "Cool little deli and convenience store at Northstar. If you happen to forget something at home like toothpaste, butter, wine or fruit this is the place to...", "Cute little shop with a cafe and a grocery selection. Good for a quick bite to eat or if you forgot something while at the nearby Safeway. Would recommend..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["deli"], []]}
{"id": "UuSLNx1tVaIlQUTG8FBpSw", "text": ["These lady was so rude and disrespectful. We came here to get gas and snacks and use the restroom. It was all going great but when we asked if there was a...", "Gas is pretty cheap here. We should have filled up our Explorer while we were there, but only ran inside the store to grab some drinks and snacks before...", "Be careful when using a credit card to get gas.  They put a $100 hold in addition to the amount of the gas.  The hold is still on my card 10 days after..."], "rating": [1, 3, 1], "TBscore": [0.25, 0.26, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [["snack"], ["snack"], []]}
{"id": "ZhFxKH_xZytJDMpDOwpgcQ", "text": ["Clientele is interesting to say the least but its our go to spot from the cabin. Staff are always friendly and crackin jokes! \n\nThey are always on point...", "I was approached by an employee about my service dog. She made the assumption my service animal was an ESA after asking the 2 questions, I wasn't allowed in...", "The employees here are dumb as fuck! (Excuse my language). Talking to each other and on the phone in the middle of helping customers and no \"Thank Yous\"!..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "4P2BALQPrfT-kDHhjsAUMw", "text": ["DO NOT GIVE THIS DOUCHE BAG YOUR MONEY!!!!Screw the douche bag bald old man who runs this place! Extremely rude and unprofessional! You need to provide a...", "Worst 7eleven! The older bald man w/beard is extremely rude! After customer apologized he continued to yell & cuss in front of customers. It was very...", "Be carful with your money at this store!... they like to pocket money!  A few months ago I bought a pack of cigs and they over charged me one dollar and..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "FEs86djFYIm3-7S3Q5qvsA", "text": ["McKenna is amazing. I was in here a month ago debating the merits of an Apple Watch. I come back a month later and she's like, \"What'd ya decide on that...", "What a unique find.   Thus is where the locals go to hang out and have some refreshing adult beverages.   And there's an eclectic collection of beers and...", "Love this bar. Clean and friendly. They grow their own herbs for drinks like the strawberry basil margarita. We always have fin here. Best part...no smoking..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.57], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "_kf_2Nf429S5u8Ahc91EHw", "text": ["My friends and I are in town as a sort of reunion and the owners at the Feisty Goat were so friendly and welcoming. Full disclosure: when they chatted with...", "What a great place to stop for a cocktail. Great selection of beers and spirts. Danica is the best.  She does a great job.  Will definitely recommend this...", "Great beer selection, friendly bartender, great pricing. This is a bar where you'll feel welcome as soon as you walk in the door. The beer prices are very..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.6], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "EsON1AXSRjibfQgwCPhL9Q", "text": ["Great bloody Mary's and service too. Body Parts Band #bobbyparksband rocked it today! Aka Bobby Parks Band", "Wow last call at 940. I'm so done with this place. There are cheaper bars that are open normal hours. Don't waste your time or money here.", "EWW this place has gone down hill.. it's so smelly and they way it's set up. The people are kinda rude if your not a regular. It can be nicer..Like how it..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["bar"], []]}
{"id": "bgWbSmjZtkZ1-JRZqluI4Q", "text": ["Remedy's is a standard local bar.  Homey, friendly staff, there is also darts, pool tables (that are kept up), a jukebox, cigarette machine, popcorn, and...", "This bar was ok in side. The service was poor at best. I sat at the bar for 5 mins without even seeing an employee. Then was told I would be helped after...", "Perfect Dive! Pool tables darts ladies drink for $2.00 cran's plus slots and awesome DJ!! Triple trouble and smoking s welcome ... Bar tenderness and..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.37, 0.65], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "NdKOzOXSDivSqZVb0Lp_xQ", "text": ["Found this place came in with a buddy we put 150+ into their gaming machines and they still hand us a tab!  They did not comp 1 drink for us! We are out and...", "Julie was the best bartender! Great personality! We stopped in for a beer to watch the final four. We will be back for bloody Mary's tomorrow!", "Dinging a bar because it allows smoking seems unfair, as most of Nevada's bars that don't serve food allow it. If you aren't comfortable around smoke, then..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "9JJfoYODZSTTMFLOUobhUg", "text": ["Old school bar that I remember hitting when I turned 21 back in the day. Not really into drinking like I was back then but I hit the way back machine when I...", "If you're not one of the regular low-lifes that act like you own this place, no-mannered jack-offs, or that guy that has to work here jerk, then you may...", "I had never been to this bar, but my husband had. Thought that Id like it. Small bar with a few tables & plenty of seats at the bar. Older bartender, very..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "IhmH2Xb4QohwYy-qXT9_Bg", "text": ["My First Time and Last Time\n\nCame in on a Monday night around 9p. \n\nAtmosphere\n\nThe temperature inside the bar was cold.  Outside the weather must have been...", "I'm only reviewing Jimmy G's as a place to show art rather then a bar, as I don't drink and was only there during Carson City's Downtown Art Project/Wine...", "The only \"club\" in carson. If you wanna get extremely drunk for cheap and dance your ass off... this is your place. It smells bad (you can smoke indoors)..."], "rating": [2, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "kJVa8ywvSCVpAeEsK--gMA", "text": ["Before I even got there I had people tell me I had to try the espresso martini. We got there it was pretty busy got a cigar sat at the bar and ordered one....", "First visit was at 8pm on a Wednesday night. Ladies night. Half off drinks. My friend and I each ordered an espresso Martini. Yum! I found the selection of...", "Four stars, mainly because I like their selection of Scotch.\nThe cigar choices are modest and the prices seem a tad high, but probably not out of line for a..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["bar"], [], []]}
{"id": "rxuG_8p3qbfJ6eyj3376Zw", "text": ["The motto of this bar should be, \"Cheer up, or go home!\"... This is not a good place to go if you want to be pathetic and cry into your beer... The juke box...", "not so bad small neighorhood bar, with real nice bartenderesses?  They got the juke turned up loud and the pool table is never still !  Nice people when...", "Great neighborhood bar.  The bartenders are great, always friendly.  Ed, the owner is very personable.  Drinks are probably the cheapest in town with a..."], "rating": [5, 4, 4], "TBscore": [-0.68, 0.0, 0.54], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "rCNSp4E3oIquze5VSUrIRg", "text": ["On our way back to our hotel, Dean and I stopped at Genoa Bar!!   What an amazing experience....so much history in such a little bar!    \n\nOur bar tender...", "Took a bike ride with some friends to have a beer at the oldest bar in Nevada. What a great place. Checks so many boxes:\n\n-Historic Old West\n-Great dive...", "They say it's the oldest bar in Nevada,  so here we go, it's so old and dusty as hell!!  But the beer is cold and the staff is nice....\nThank you Genoa.."], "rating": [5, 5, 5], "TBscore": [0.0, 0.44, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "AwoTgo1kDVmqUaqU9DkGgQ", "text": ["This is my bar of choice! I saw a review that said, \"... Not for middle class or above...\". This person has no clue about the 'neighborhood bar' concept! If...", "The Y-Not has always been a place for extreme locals. Some people have stated that the place is a dive bar. Wow. Tell you what, YOU run a bar, help out the...", "Stopped into this place for a quick evening cocktail due to location. This place is a dive. Smells of years worth of collected ashtrays. People starting..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "sJt7xfDWoaG-Nbn3wBsJFA", "text": ["Great food a bit pricey but will go there every once in a while when we can afford it lol", "I used to go here a lot when I was little before it was loui's. And I really miss the old Mandarin gourmet. I thought when the owner changed it would be the...", "I have a love for cheep asian cuisine that is insatiable! Louie's is a great example of why. They have great food and decent prices. The atmosphere is nice..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "Vzb6-w0haIoECboNsQt45A", "text": ["Second time eating there, first time with take out. Hostess was very helpful with the menu and food was cooked quickly. Great portions and taste was great....", "Very affordable and good..\nChow fun was very good, maybe my favorite. Hot and sour soup was okay, I read a lot of good reviews about the soup but it was...", "This is the best Chinese restaurant I've ever been at. Get the luncheon special they offer plain rice or fried rice, fried wonton, egg drop soup, egg roll..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["chineese", "egg"]]}
{"id": "Z6qXlQiVBA5Ur7586oK8bg", "text": ["Huge portions! Order half of what you normally would \nIn the photo is a small tray... he said it feeds 4-6 people clearly it feeds 20 \nThe \"small\" trays...", "We had dinner delivered to our hotel.  They were right on time. Everything was hot and fresh.  Excellent appetizers of Pot Stickers and sliced BBQ Pork.So...", "One of the worst Chinese food I've ever had\nBoth my friend and I felt ill the next day and we think it's from the food"], "rating": [4, 5, 1], "TBscore": [0.0, 0.46, -0.38], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["dinner"], ["chineese"]]}
{"id": "dH2lLpBFfm5o5kEVkTl2Ew", "text": ["The restaurant is cleaner, foods are better with the new owner.  The portion for the dishes are very generous, the service was better then the first time...", "The food is better with the new owner but service is not something you should expect here. Get your food to go!!!", "I arrived at my booth in the rear of the restaurant and ordered the House Chow Fun and a beer, the beer arrived shortly after ordering.  Beer was cold and..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "CW05hbsQSzHkYlRXbRvCTg", "text": ["Excellent Thai restaurant in incline village!\nWas seated right away, with a party of 8, and had quick and efficient service! All the food was delicious,...", "Tried to call in an order about a month ago but everything I wanted was not on the \"new menu\" but the menu is not available to view online. Tried to come in...", "First time here! ,\n Not to sure what to order. Scanning through Yelp pics. And not many good reviews.  \nChecked in at 6:50 pm , seated in 10 minutes. Placed..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "ocmromwdoEmsO3jO95ipOw", "text": ["Great food great service. So glad to have authentic Vietnamese food in Gardnerville \n\nLove cold noodle dishes and rare beef and tendon pho. Going there...", "I have eaten here 5 times in 5 months and each time I have not been disappointed.  I usually order pho since it's not available in any other restaurant in...", "This is our favorite place to go to for Pho!! Their ingredients are always fresh and the flavors are spot on! Their calamari appetizer is amazing as well...."], "rating": [5, 5, 5], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["beef"], [], []]}
{"id": "RsDUfhQl2R0H2moGv81Uaw", "text": ["We made a late entry tonight after a busy evening of holiday happenings.  We stepped in at 8:30 with our tired 5 year old in tow, we were greeted with...", "Finally getting around to trying some of the new places that recently opened up. Today we went to An Asian Kitchen and Bar occupying the space that was once...", "I'm sorry I may just be really picky. I'm Vietnamese and know what good Vietnamese food is. For appetizer we ordered the grill pork spring rolls. For some..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["bar"], []]}
{"id": "RL804KamSokz19cUZElSXQ", "text": ["Not the best food, bit also not the worst. I used to work next door and it was a cheap place to eat when I was on my break. They have wonderful eggdrop...", "I have been going here so i was an infant and i absolutely love it. Friendly staff, great food. This is the first place I want to go when I go out to eat.", "If we are limited on time, we come here for lunch since we can control the speed of getting our food at the buffet. This time it worked out perfect. The..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.0, 0.46], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "Nwpj59ey_Jk3N2gA3r32HQ", "text": ["Ours was a vegan order. The food was great and hit the spot.\n\nThe highlight was the sweet energetic young waitress who was running around getting food to...", "Chicken skewers: delicious, good dipping peanut sauce, not too thick, not too watery. can't go wrong with this appetizer.\n\nPad Thai: average pad Thai,...", "My friends and I were in town touring the lake.  We stopped here because it was close by and we were hungry.\n\nThe place was crowded the day after..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], ["chicken"], []]}
{"id": "bRuG5UloYAqR1ojQ0VKArg", "text": ["This is my new favorite Chinese restaurant!  The owner has a secret menu of authentic Shanghai dishes which are amazing!  We will definitely go there very...", "My order was a take out, we only live 2 miles away.\nFood was so dry and over cook and no taste, soup was water down.\nFirst Time, last time.", "I went with my parents and ordered off the family dinner menu. Starting at $12.95 per person you get an entree, soup and (one per person) spring rolls, crab..."], "rating": [5, 1, 2], "TBscore": [0.21, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["chineese"], [], ["dinner"]]}
{"id": "tVTMeplDBOFAa5ayvEcwGw", "text": ["I was craving dumplings and this was the only place I saw dumplings on the menu. I probably ordered too much food  and I did. The portions were very big....", "I have no idea how these guys are still in business.  We forgot that this restaurant had made us sick before, so we ordered from them again.  The food is...", "I'm disappointed. The restaurant name enticed me to try their place. Neither my friend or I ordered anything exotic. Our lemon chicken and vegetable fried..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, -0.28], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], ["chicken"]]}
{"id": "803R5d7y9OSg6NTDucSKmg", "text": ["Absolutely love this place. Hands down the best customer service in town! I arrived about 30 minutes until closing and just expected to eat whatever they...", "3 stars and no more. Nothing special but not bad. Service was fast and staff was friendly. The place was packed and the food was freshly cooked and rotated...", "Such a bummer! I used to come here all the time! Best pot stickers in town!' No more though! Stopped selling pot stickers! So now I go to wongs garden!..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "QjqYimHUyYBWqvGSyb8c1w", "text": ["Good food, generous portions at reasonable prices.  I especially liked the salt and pepper prawns and the tofu and double mushroom vegetable dish.", "Hey keith! Your review for Golden Dragon 2 is almost complete:\n  \"poor service. food sux. food came out too fast. waitress did not check how is the food,...", "Service was okay. The food on the other hand is why i rate it at 1 star. This is by far the nastiest tasting Chinese food my family and i have ever had. So..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["chineese"]]}
{"id": "D7I9FUIOAzVMv1Wtp-TIYA", "text": ["We were visiting Reno and found this restaurant by chance.     It's in a bit of an industrial park.  Maria was very helpful and suggested the $6.95 combo...", "Awful. My wife & I have reviewed this sad excuse for a restaurant on our other social media accounts because to neglect to do so would be a disservice to...", "February 2, 2018 Friday - 12:30 PM for lunch\n1 Adult\n\nAtmosphere - 4 stars\nFood - 3 stars\nService - 4 stars\n\nBackground - I wanted some Mongolian beef and..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], ["beef"]]}
{"id": "tbJ6-dnGISr2AuEZ49HhZA", "text": ["Love it \nFood is wonderful\nService is great\nBeen there for many years \nWould recommend it to all our friends", "We are staying in Minden, Nevada, tonight and this Thai place came up in a Yelp search as somewhere that might have tasty vegan options. \n\nIt's located in a...", "Great service.  Food comes out fast.  Good selection of lunch special for $8.95.  My basil chicken meat was a bit dry but good flavor.  Green curry was..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["chicken", "lunch"]]}
{"id": "uMon0Qy1SsI7J1iyDwYc3A", "text": ["The food was nothing spectacular but satisfied our craving for Thai food.\n\nCame on a Friday night around 7PM and was seated immediately. There were around...", "Overall food quality was a 4 stars. \nTook one star off for the the grimy Looking dishes and service was so so. \nAvocado roll: 3.5 stars. not much avocado...", "Found this amazing little lunch spot on Donner pass road.  Their food is so delicious, I was completely surprised. A lot of the places in truckee are kind..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.42], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "qsC8XU0reKGoLWchkBR-dQ", "text": ["Still sub standard to what the food and service use to be! The waitress has been here for years, and you'd think that she'd be motivated to step up her...", "It's OK, but really more a two star then 3.\n\nI had eaten here one other time and I remember it being good. I always am happy to find a quality eating...", "Food excellent!  Kid screaming for grandma to seat us?  What a rude brat, 12 to 14 year old screaming at the top of his lungs, very very loud. What an..."], "rating": [1, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "eATfl3gF5K_SUYvphhJpuQ", "text": ["Waited 30 mins for them to open during dinner hours and it was well worth it! Food was amazing and satisfied my cravings. Aside from the food the real MVP...", "Came in here on a Tuesday afternoon and found it to be very busy. (Which is a good sign)\nI will easily give 5 stars and say that this is the best thai food...", "I've been coming here or getting takeout for 20 years, it's still delicious, authentic, and at a good price. \n\nBut they are about to loose me over the..."], "rating": [5, 5, 3], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["dinner"], [], []]}
{"id": "jX8yq37QZdLpC9sI0ySISg", "text": ["Surprisingly good Thai food snuck into Truckee. We typically don't expect solid Asian food in the Truckee area, but were pretty impressed by Thai Delicacy....", "They have decent Thai food here. The taste of the majority of the dishes are off. You will not have an authentic Thai food experience here. Nevertheless,...", "If your looking for authentic Thai better try the other one by Donner Pass rd. This thai by brockway place serve's commercialize style of cooking. Putting..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "kuERJjiYr9zjFSduEWNvKg", "text": ["Is it weird the best Thai I've ever had is inside a casino? Yes. Could I eat at this place everyday? Yes. \n\nBest pad Thai and green curry I've had ever....", "Got some Thai fried rice with chicken.. asked for it thai extra spicy.. apparently they thought i was joking because they didn't put any spice.. so I had to...", "The food is border line okay. I ordered Pad Thai and it didn't look or taste appealing compared to other Thai restaurants I've visited. It's just too pricey..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], ["chicken"], []]}
{"id": "62MYCW9JQASxL7HyHQTkOQ", "text": ["This is our new fave spot in Tahoe.  The poke bowls are on point.  Great variety of fresh fish and toppings- all made by a Japanese chef!  I really hope her...", "Yuuuuum! Super delicious, create-your-own poke bowls with fresh fish and tasty add ons. What a great new addition for Tahoe City!", "Well when I need a poke bowl fix this place will have to do. The fish was yummy but the rice was terrible and dry. Its kinda cool how its in the liquor shop..."], "rating": [5, 5, 3], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["japanese"], [], []]}
{"id": "18TjCEXtzb6d5REbBLEm4A", "text": ["I really enjoy Bab cafe. A solid 4 stars in my book for fresh ingredients and a variety of options. However, the 5th star was earned this week when I tried...", "We've been to the other location several times, and it's always good, so I was excited to try this location one evening after my kids' swimming lesson. We...", "These bowls are so flavorful, I highly recommend the traditional bowl, it's full of veggies and your choice of meat. Also love the wings!\n\nFriendly staff..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "xDSBnv5odEXN1NFa3nFXBA", "text": ["Think Mongolian BBQ meets American buffet and you're coming close to describing Fire + Ice. Throw some pasta, veggies, meat, and sauces in a bowl and hand...", "Really fun place! The cooks are great. The food goes whichever way you want it too. It's all you can eat Mongolian BBQ style. You load up with starch...", "Dan (the cook) was awesome. We had 8 people in for lunch and as usual we had a huge variety of stuff. I think each person had 4 runs at the buffet. Read the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["american", "pasta"], [], ["lunch"]]}
{"id": "_NlfRNc6tpsTd15gx_ughA", "text": ["I've eaten from this truck enough times to try everything on the menu, and I love them all. The last thing I had was the Spanish Sliders. They were so good....", "I seriously LOVE their Thai Noodle Salad, the best I've ever had! The portions are really generous, definitely filling.\n I definitely recommend this food...", "The London Style Tri Tip is delicious! Served with seasoned potatoes, it hit the spot when I visited the WF truck at Red Bus in Folsom a few weeks ago. My..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "EgKysxi3XrdZY3_nEuuHJA", "text": ["One of the best Indian food restaurant.\nKarahi paneer, vegetable korma are yummy.\nGreat place for take out.\nMust try in South Lake Tahoe, if u want great...", "This is easily my favorite place to get a meal in South Lake Tahoe. I've been here many tens of times and am rarely disappointed with the freshness and...", "Love this place!  We always order the combo specials listed on the wall.  We choose mild spiciness which is a cop-out but still tastes great.  Food is..."], "rating": [5, 5, 5], "TBscore": [0.87, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["indian"], [], []]}
{"id": "zGoloe9jHln9GCzMKLPfHQ", "text": ["Definitely a go to spot for great Indian food!!!\n\nIt's a family run restaurant with friendly staff.\nThe chef came out to greet us, an talk story, after...", "I had initially ordered from them after having smelled the spices coming from the kitchen quite a while ago, and craving good Indian food- I had been very...", "Pros:\nClean restaurant overall, with clean restroom.\nHelpful and polite server\n\nCons: \nI ordered the Tandoori Mixed Grill, hoping to enjoy a dish of..."], "rating": [5, 1, 2], "TBscore": [0.46, 0.3, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["indian"], ["indian"], []]}
{"id": "6Oc21-Wy-vO2YFSkvk-8mA", "text": ["Heard a lot about this place and it DID NOT disappoint.\n\nOrdered the following for our family to try;\nNaanwich w/ Adana Pork.  More like a naan wrap, the...", "Delicious food with great variety! Everything is fresh and super satisfying. The naanwich and burrito with the coconut curry lamb is my go to (add bacon to...", "A nice variety of health conscious items but unfortunately the food is overrated, underseasoned and bland. This is good food.... For an airport, a and if I..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "Iq7xiQ4onk0qm3o3EY7cqg", "text": ["I am as so shocked to find a vegan place in Tahoe this place is very gd the only complaint was my order was wrong had to be sent back on both orders, I...", "This restaurant always has incredible food, a great vibe, happy workers. \nThey have plenty of vegan, vegetarian options and meat options too. \nEverything...", "Still a 5.... went today for lunch with friends, and our experience was similar to my last visit. Tasty food, awesome service!\n\nI know the owner reads..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "-YCJ_x_ASWJbxBGSsgTHzA", "text": ["Pros: beef brisket was very juicy and delicious. Cole slaw too. Desert station was also yummy. Price was fair $24.\nCons: as in most of these buffets, most...", "This was hands down THE worst buffet ever.  I'd rather go to Sizzler!  The food tasted like frozen food. The fried chicken tasted like Banquet frozen...", "We had brunch here on a Sunday. \nThey have the usual breakfast items and an omelet station. The omelet had several toppings to choose from with three eggs...."], "rating": [3, 1, 3], "TBscore": [0.58, -0.59, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [["beef"], ["chicken"], ["brunch", "breakfast", "egg"]]}
{"id": "CASalwrQNha30SD7oM98TA", "text": ["I just found out about this place after had a lunch at our local mexican restaurant and i asked for cha mango and the guy told me about this place.\nThis...", "Worst service ever. I came to exchange some boots that I bought for my son and they don't refund money plus I can't see if other boots would feet him .....", "The worst shopping experience of my life.  Looking for wedding dresses and they had the perfect one priced at $120 but they suddenly upped the price to $880..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["mexican", "lunch"], [], []]}
{"id": "9ezJ6Xaj-VJonry05NfXmA", "text": ["This review is more about customer service than it is about the food.  The food was solid.  This is not a fancy restaurant; but it is a decent neighborhood...", "After a summer day kayaking on Lake Tahoe, we were in the mood for Mexican food. (August 2018) Unfortunately, our party of six left hungry and disappointed...", "3 1/2 Stars. \nVery relaxed place. Maybe too relaxed. Service was nice but not that speedy...we had no napkins or silverware for awhile. Outside seating was..."], "rating": [5, 1, 4], "TBscore": [0.0, -0.31, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["mexican"], []]}
{"id": "KlZsJ4e-NHL3lQOEvEb2wQ", "text": ["Going to Costco hungry is a bad bad thing, and that's what we did today.  Staring at my wife after packing the car, searching her face for a solution that...", "I've been wanting to update my review for sometime since my initial review on opening day.  The staff here is very welcoming and attentive.  The food has...", "Was super excited that Chipotle had come to town!  Have been a few times and would say that it is your average Chipotle.\n\nRestaurant is decent, food is..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "vQtNJJQrMzTGaU34yN6Vmw", "text": ["Tried this place yesterday & LOVED it! The food was fantastic. My husband got a combo plate (burrito & chalupa with shredded beef). They had to bring his...", "So I went here for the first time, because everyone was raving about it. I found it to have horrible service and the food wasn't even good. I also thought...", "6/18/2018:  The Restaurant Owners hail from Guadalajara, Mexico:  If, you're aware of the cuisine made in this region, the food tends to be on the mild..."], "rating": [5, 1, 1], "TBscore": [0.64, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["beef"], [], []]}
{"id": "ncRv-FOrtWcF9DJZYfhi1g", "text": ["Sat at the bar this morning. Let's talk about these bartenders. Holy hell. Smoking hot. Boingggg! Chris and Erin what friggen babes. Whoever owns this place...", "The food is good & tasty. But the rating is regarding the customer service.\n\n\nWe came here on the weekend, in the afternoon... we got seated quickly. And we...", "Yes Steve your restaurant is very disappointing. The food is really really bad my friend. Next to us that was a couple seating they left ,they haven't touch..."], "rating": [5, 2, 1], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["bar"], [], []]}
{"id": "vf2jZDw6-9njI6X6YniRqA", "text": ["Excellent food. \nLots of flavor. \nConstant service. \nVery friendly. \nDefinitely will recommend. \nWill be back for sure.", "We love Francisco's! Great food for those who indulge and for those who want a lighter dish. Never disappointed. Complementary salsa, beans and chips. \n\nNew...", "Yum. Yum. YUMMY!!!  This is our new \"go to \" place in our town to eat, everything was fantastic.\n\nThis restaurant has a bar area, two separate dining areas..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "kuuty6s4ichtyqwdKGCysA", "text": ["Bunch of bullshit.  Never seen a casino shut every macine down when changing cash box out.    30 minutes later i get o. A machine and they Tell   me they...", "The girls here are so friendly, so awesome!!! Chelsea, Tanya, Melvin, Mouse that's not her real name but that's her nickname. Lol. So much love, great...", "Still sort of a weak slow motion stab at Mexican food by a local restaurant called Juan's...This restaurant location is inside the Comstock Casino in Carson..."], "rating": [1, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [[], [], ["mexican"]]}
{"id": "B5Plz-x4pGEr2j2KeTcEFA", "text": ["The BEST salsa I have EVER had!!!!!\nI would drive to Tahoe from Sacramento for the salsa alone however, the food is amazing! \nFat chimichanga filled with...", "I came in late last night for dinner with my sister and brother-in-law. \nWe were sat immediately because we were able to choose our own spot, which was...", "The food was great. However,  the hot sauce is awesome!  I asked if they had anything spicy and they brought me a hot sauce they make and it was amazing...."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["dinner"], []]}
{"id": "Csnfvthhg-NLqXTd5ZcNew", "text": ["Don't understand why 3 stars, this place is awesome. \nTry the 3 Amigos!! A very large HOT plate with plenty of food left over for the dog.\nService was...", "TERRIBLE!  Worst service I have ever experienced in a restaurant. The only thing more disappointing than the service was the food. It took an hour & a half...", "Wonderful place for large groups. My Red Hat Society Chapter had our Luncheon here. We were seated in Banquet Room immediately. There were 13 of us. They..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "-DfnYmS3S0gw0SoUYyXmzw", "text": ["Love this cozy little brewery.\nAlways a pleasant experience!\nBrews to please all tastes.", "We ate at Sassafras next door and decided to come over to Shoe Tree Brewing for a few beers after dinner.  We have eaten at sassafras before  and commented...", "Great little brewery off the beaten path. It is clean, there is a great variety of board and video games, and the beer is delicious! There are also..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["dinner"], []]}
{"id": "XRJ35xeILPCvv5QN4jxmSw", "text": ["Been here a few times now! We love it! Hot fresh for reasonable prices. I get my orders to go so I can't say anything about customer service except that...", "I've heard this place is good, but every time I try to eat here they're either closed or not responsive. I've tried calling and the phone just rings, I...", "This was the best pizza I have had in the Carson City, Reno area. The crust was awesome, no too much tomato sauce, It's was so good. Can't wait to try the..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.73], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["pizza"]]}
{"id": "TOmzkbUoQcgw9oRnSMcNeQ", "text": ["We stopped on our way back from camping to the Bay Area. It was perfect for us as we were looking for something light to eat around 4:30pm and everywhere...", "My friend, daughter and I had never been here so we decided to give it a try. We happened to go on Wednesday trivia night. We were asked if we had come in...", "What a great little place. Great drinks and good pizza. Best lemon drops ever. Charity our server was the best great service and super friendly. A must go..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.62], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["pizza"]]}
{"id": "0zxq_PXNW1DbIqWHhUyJWQ", "text": ["A family member ordered a cake from here, and it was too good to not review! We celebrated a 30th anniversary with a small, vanilla cake with fresh...", "Grace and her team were so friendly and efficient during our wedding planning process! Her cakes, cupcakes, s'mores pop are all to die for!!! My mother in...", "AMAZING!!! It is the best cake you will ever have. We got 2 smash cakes & a party cake for our sons first birthday, everyone raved how amazing it was! Will..."], "rating": [5, 5, 5], "TBscore": [0.32, 0.92, 0.75], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "jXCfVYeYBrmzcYJbQ8bX7w", "text": ["Couldn't be happier with my experience with Happy Tiers! Like another reviewer, we were in Tahoe and I was seeking a birthday cake for my mom's 60th....", "Cannot say enough how appreciative I am to this bakery for the most amazing birthday cake. I called on short notice and mentioned my fiancé was a fan of...", "Andrea was absolutely fabulous to work with throughout the process! I live in the Bay Area and wanted a cake for my husbands birthday while we were in Tahoe..."], "rating": [5, 5, 5], "TBscore": [1.0, 0.34, 0.32], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "JdzR72aN8wQen7c8rwLooA", "text": ["Flour girl wedding cakes made the most amazing, beautiful and tasty cake for our wedding! Our guests loved it so much they enjoyed a slice of each of our...", "Flour Girl was a lucky find for our wedding cakes!!\n\nI researched all the options in the Tahoe area for our destination wedding. Based on reviews and lovely...", "To everyone who wants a proessional, tasty, inventive creative cake..\nThis is the right cake women for you!! She not only did the cake of my dreams but..."], "rating": [5, 5, 5], "TBscore": [0.58, 0.0, 0.33], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], [], ["cake"]]}
{"id": "nGhC_H9vq4ExUoIalFIWfQ", "text": ["Everyone raved about the fried chicken, so once while I was in this neck of the woods, I popped in to take some on the way home.  It wudn't no KFC, but...", "I'm in the North Carson store 3-4 times per week. I have been going there for several years. The store is always clean and well stocked. People are very...", "Love shopping at the Sav Mart in Carson City. Very clean, organized, discovered today they have good pre made sandwiches that actually taste like they were..."], "rating": [4, 4, 4], "TBscore": [-0.6, 0.0, 0.42], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["chicken"], [], ["sandwich"]]}
{"id": "u1NjcDXBGCfHu7p07TDQVw", "text": ["I am so thrilled that I chose Lake Tahoe Cakes as one of my vendors for our wedding! \n\nI live in Orange County CA and we had our wedding in Incline Village,...", "Allison was the easiest and most pleasant vendor we worked with for our wedding. She was professional, flexible, responsive, and makes the BEST desserts....", "Allison was efficient, communicative and reasonably priced. \n\nShe exceeded expectations (so rare these days) and was a pleasure to work with!\n\nI ordered 1..."], "rating": [5, 5, 5], "TBscore": [0.44, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], [], []]}
{"id": "5K7PM7kp5-No_7qeNP_avg", "text": ["Great cookies! They look beautiful and taste even better! Way better than anything you can get at the store, if you need any baked goods, this is the place!", "Not only are the cookies super yummy they are amazingly cute! I was fortunate to have some adorable Galentines day cookies sent to me. They were so pretty I...", "Annie is the best!!  She made a cake, cupcakes, and cookies for my bridal shower and not only were they beautiful, but they were delicious!  On top of the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.67], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["cake"]]}
{"id": "lptcOzB_H22tO5ddGwV6Gw", "text": ["My mom normally comes here to go grocery shopping, since she has the rewards card. It actually gives her plenty of discount when it comes to gas. She also...", "I almost never shop anywhere else. Prices are the best, good selection, although I prefer to buy my beef on base because I have that option and it's less...", "I love to go shopping at Smith's. The main reason I love shopping there because they give discount points reward for the gas & they have some good deals too..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["beef"], []]}
{"id": "epGYPbjD6EAG598QQK0ObQ", "text": ["We knew we wanted a wedding cake because my husband loves wedding cake. (No, seriously, that was the only reason I could drag him to weddings as my date...", "We used cake you happy for our wedding cake.  Cheryl was wonderful to work with and really listened to what we wanted. The cake was everything we could have...", "Always delicious and the designs consistently come out exactly how I planned in my head. She does a great job at bringing your vision to life. Prices are..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.67, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], []]}
{"id": "hs_X62cmcG1I9u3HY71P5g", "text": ["We got in to town a bit late on a Friday and headed over to get some food. Of course, there was a wait everywhere, but we were glad with stuck with this...", "I went here tonight after walking by it during Truckee Thursday. The food here is excellent ; the pulled pork is not too spicy and very sweet. The onion...", "Came with a large group, kids and adults. They do not have fans or air conditioning so it was hot! Old building so I get it. We couldn't sit out back since..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "w0uhIrMuLz0EeZtDnhzHLw", "text": ["We had our wedding reception here 4 years ago, so this review is long overdue...Everything came out beautiful, the food was absolutely delicious and the...", "Enjoyed this location off the busy main road. We just kind of stumbled across this place and when we found that my dog could sit with us in the outside...", "Fun menu and easy parking.   Friendly staff.  \n\nLoved the Thai chili pizza!"], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["pizza"]]}
{"id": "oldRHrMQRJHuBHjYUedcgQ", "text": ["Rob went above and beyond for our wedding! I am so glad that we found him! The pig was awesome and juicy  (I have had whole roast pig before but none as...", "When Vesta and I lived in New Zealand, we had a Japanese girl named Shino, who was on sort of an exchange program with Kiwi girls, living with us for a...", "Another outstanding meal from Rob Barats and his crew!  Thank You for making that 60th Birthday special!  Mmmmmm pork belly!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["japanese"], []]}
{"id": "ADtgbZAE9AV_Bjx7-MxZtQ", "text": ["Best taste of a town event I've been to and I've gone to several. There were unique offerings with creative flavor combinations. The music was also delightful!", "This is a fundraiser for a great cause. Instead of paying $25 for a sub par buffet, come to downtown and for $35 you get amazing food and help out a great...", "June 2013 We had good times attending this event. Second Saturday in June.  I will mark on my next year  calendar- I want to be there again. The bands were..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "2qpXxFamrsB0V05hgwG92g", "text": ["Second time to Himmel Haus yesterday and it lived up to the awesome memory I've had.  Friendly and helpful staff, comfortable and down to earth atmosphere....", "This is a great spot to eat off the well-traveled path. It feels like it's in the middle of nowhere which gives it a cozy feeling. This place truly has a...", "We went on a Thursday night. It was quiet in the main dining room.\nEvery single thing that we ordered was great! Great quality, huge portions, and tasty!..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "2W7-upG0GmJM4D7sAXWFoA", "text": ["Food was delicious!  Pulled pork sandwiches the perfect combination of sweet and spicy on soft bun.  Steak sandwich was a great serving size on a yummy...", "Cool place to stop for a snack or quick lunch.  The couple who served us are super nice and friendly.", "Excellent chili dogs. A must try in Virginia City. \nWill be exploring the rest of the menu on our next trip here!"], "rating": [4, 4, 5], "TBscore": [0.65, 0.4, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["sandwich", "steak"], ["lunch", "snack"], []]}
{"id": "Pj34NJWp5jeWIO7N2cSVjQ", "text": ["Had an incredible experience at Moody's Bistro in Truckee.  In town on business and landed at this spot.  Best place in town.  Felt like I was in a 5 Star...", "I dined here with 4 girlfriends. On a Saturday afternoon, we were able to make reservations for 7 no problem. It was a chilly September day but we sat on...", "Walking in early evening the restaurant has a great buzz and vibe.  Lots of happy chatter about.  There is a small outdoor seating and is even dog friendly...."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "RnICNMHCLawF_cuuD_f9vQ", "text": ["We went there today for dinner....we had 3 different people ask us what we wanted to drink. Took 15 minutes to get our drinks which were just fountain...", "Doesn't give you enough free play even if you gamble there frequently", "This casino has definitely seen better days, you definitely can tell walking in this place has been here for awhile. OK selection of slot machines, most are..."], "rating": [3, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "fTIZiYWd-nx0lgO5b8qgFQ", "text": ["This was by far the most AMAZING display of pure hospitality I have ever encountered when checking into a hotel. There was a snafu one night prior to our...", "Pros: 1-Hotel is close to restaurants and some       casinos. \n2- clean rooms and bathrooms. \n3- comfortable beds. \n4- Great customer service.\n\nCons: 1-Can...", "It's not great!  Run down hotel with dirty rooms.  It looks nice online and there are a lot of good reviews so I was shocked when I arrived.  I am used to..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "f0H-Q0sDwZpLrvkGIXl4Jg", "text": ["Very happy with our visit. We're not big eaters so we ordered the surf & turf fondue to split (shrimp for her, beef for me, 6 pieces of each), and shared...", "Despite being overwhelmed with customers, the staff did everything they could to provide great service on a Sunday night. The food reminded me of LA Fondue...", "This was such an unexpected experience here in Incline Village. This will be our new tradition every time we visit. Family owned for 40 years with wonderful..."], "rating": [4, 4, 5], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["beef"], [], []]}
{"id": "rj5QX997azpAoV_toE1pag", "text": ["American style bar, open until midnight.\nFrench onion Soup：taste good.\nAngus beef burger: one burger, also includes a small salad. Taste good.", "Cold $9 Chili & $19 Mini Martini's\nOnly go if wealthy and lonely \n1 star is generous", "Family ate here couple times, staying in Hyatt. \nFish n chips and pizza best bet based on what we had Pizza unless you're starving wont finish it. Coleslaw..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 1.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["american", "beef", "burger", "bar"], [], ["pizza"]]}
{"id": "JJ-LfdKyuxa9pRMHFUf9Gw", "text": ["Due to a recommendation by a Facebook friend we drove down and checked out their Friday Seafood Buffet. At just under 20 bucks it compared to our local...", "Horrible Casino !! Walked in so nice, great lights ,clean and  great fantastic music!! Till we hit the guess services and we asked if we can get change. The...", "Fresh and bright but small, friendly locals casino in Carson City. Its alive unlike the spooky, haunted Ormsby House of yeteryear - a great, convenient stop..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "8QxCd0q7AbL01K-t1CaHnA", "text": ["Given I was raised in Tahoe city, I often get people asking me for recommendations and Jake's is at the top of my list for a variety of reasons. It's...", "I've been here 3-4 times and feel I can write a comprehensive review. First off the view of Lake Tahoe is excellent, especially from the outside seating....", "The prime attraction is definitely location. Sit outside and look out at the boats and the lake. I was pleasantly surprised by the food. My friend got the..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "nG2qLE__i1Sv9DBevCWDNw", "text": ["The smallest casino I have ever been too in my life!!! But the bartender was a cool guy and made sure my drinks came fast. There was a hot dog or burger...", "We ate burgers here 8/2/17 and the three girls working there were amazing. It started pouring rain right after we ordered, so I feared it wouldn't be a good...", "So yummy! An unexpected find with really good burgers. I got the teriyaki burger with a half order of cheese and jalapeño fries, the other people in my..."], "rating": [4, 5, 5], "TBscore": [0.33, 0.53, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["burger"], ["burger"], ["burger"]]}
{"id": "G-p4c4MRyLRXi4D4XEKFLg", "text": ["This place is awesome all the way around! \nI love eating and playing all the games ! The Service is the best, !!!\nIt's a happy invited pleasure, \nA big...", "This has been always a nice restaurant close to home. \nThank goodness we had a reservation. Otherwise a two hour wait.  Waiter was attentive and genuine....", "We recently visited the Steakhouse to celebrate my MIL's 77th BDay.  She loved prime rib, so after reading some reviews, we were glad the Steakhouse was..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "YIyMMlUz8bYzyXkV_AUcsg", "text": ["Good Basque food and lunch specials are very reasonable. There is a special menu served in the bar on weekdays!", "Honestly, the County Health Department should be notified of this place.  The \"drapes\" hanging from the ceiling's were filthy and the air ducts were so...", "We came through here on a Sunday after a day at Apple Hill. The main restaurant with the Basque feast was sadly not open on sundays but we were able to..."], "rating": [4, 1, 4], "TBscore": [0.47, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["bar", "lunch"], [], []]}
{"id": "awNwKHQb5fGzzBaBznylJw", "text": ["The food was pretty good for a small town casino restaurant. The service was one of the worst experiences I've ever had. It wasn't very busy but everything...", "We've been coming here for years and this experience has made it so we never come back. I will gladly let everyone I know not to too. Food came out at...", "Typically the best restaurant in this small town, but so incredibly disappointed with the quality of both service and food.\nOur waitress Sarah, was helpful..."], "rating": [2, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "FDPot5-TmvWIwroNNxKjLQ", "text": ["We came to the Beacon after checking into our room at the Beachside Inn just steps away on a crisp fall night in early November.\n\nThe setting is fabulous,...", "I've been visiting Lake Tahoe all my life.  It had been a while since I was in the Camp Richardson area and forgot how nice it was.  \n\nMy friend and I...", "On a scouting mission to find a view and a great Bloody Mary score! great little pub !\nAwesome views of Lake Tahoe!\nLoved the steamers and clam chowder,..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
