{"id": "w8JzZ1rWzTZ7-66cjVi91Q", "text": ["I suspect management at this Arby's is a problem as it is constantly hiring. Every time I have gone through the drive-thru, something is wrong or missing....", "Not sure what is wrong with the management of this restaurant, but they need to be fired.\nFor the second time in as many months they ignored my request, I...", "No iced tea, they were out\nNo roast beef, they were out!\nWhere's the beef?  \n\nI get that things happen, not beef?  Really?\n\nThis is right off the interstate..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], ["beef"]]}
{"id": "eoDNkTKmcn6quCzw-KnZhg", "text": ["Great friendly service. Very clean restaurant, bar and restrooms. Really enjoyed the French onion soup. My rib eye was absolutely perfect. This was a great...", "GREAT steaks! Staff was very friendly & welcoming. Exactly what you would expect a Cheyenne steakhouse to be!", "After several years in Cheyenne, I've decided that for both food and service T-Joe's Steakhouse is the best restaurant I've experienced.\nThe food is nearly..."], "rating": [4, 4, 5], "TBscore": [0.56, 0.6, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["bar"], ["steak"], []]}
{"id": "aCUbMBnFA454eJcfHsR2JA", "text": ["This review is for the train only.  We didn't stay in the campground or eat in the restaurant.\n\nIt's a tourist trap, but a fun tourist trap.  The Bison...", "Is it possible to give it zero stars??\n\nCampground was a dump.  Trash all over, grass was knee high and campers were almost on top of one another.\nWe had...", "What a fun experience on the Wyoming/Colorado border!! Plenty of things to see and do! We had a party of 7 and really enjoyed our time at Terry Bison Ranch!..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "oTaVl-vJckcRvuztbUkJ6Q", "text": ["One of the only healthy places we found driving through Wyoming on our way home to Denver. Healthy wholsome choices. Fresh food. Vegan and vegetarian...", "One of the freshest places in downtown Cheyenne, Rubyjuice is my go to spot for such treats as the wellness shot and wheatgrass juice. The staff is friendly...", "This place is the bomb diggity! Probably the healthiest place in town, they offer fresh juices, smoothies, wraps and salads. Their Thai rice soup is a..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "a5h9meZ4mhYuSdf9otP8DQ", "text": ["So, I have been here 3 times now. Only 1 time have I been actually able to get sandwiches here. The last two times, they have run out of bread 3 hours...", "This subway has a drive thru. No quite sure why, because it seems to always be broken. I sat at the window for over 10 min with no acknowledgement of my...", "Two words: drive thru!!! The only Subway I've seen with a touch screen drive-thru! Pretty much guarantees they get it right, with a More or Less option on..."], "rating": [1, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 0.6], "keywords": [["sandwich"], [], []]}
{"id": "cCHrHo09uxKYpMmepqHKJQ", "text": ["Ordered the Gargantuan sub to eat during the Broncos game, I never had a sub that had too much meat, and I'm not complaining, its just a nice suprise, now I...", "I may not like anything other than the tuna, but it's the best damn tuna. Everyone is always always always so friendly. I love this place.", "These guys helped me feed a bunch of colleagues on Thursday - large group worked out great to get their box of 1/2 sandwiches. A good selection of..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.57], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["sandwich"]]}
{"id": "XzmSzo4huzrtENz0621PUw", "text": ["This location is close to my work. Always fast and friendly service. I enjoy all the fresh veggies you want on your sandwich. The bread is so soft at this...", "I won't be coming back to this location any time soon! Both the guys working the counter were rude! Ordered a salad and the kid stormed off, came back a...", "I also just signed up to wright a review for this subway. Female working the front was rude, and for some reason would not charge us the correct amount for..."], "rating": [4, 1, 1], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["sandwich"], [], []]}
{"id": "fdS6gSI51JLE1Epw0-CKSA", "text": ["This is one of the best ice cream places I've ever been. The variety of flavors is always changing.  I love the originality of this place.  The ice cream is...", "Ice cream?!! Yes, please. Even though we were very full from a delicious meal, we found a way to squeeze in some ice cream. This was thicker and creamier...", "One of my favorite places. Plenty of parking, good prices, never too crowded, plenty of options, can sample flavors ahead of time, a good view, and perfect..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "cVb6Vw8lOEO9gHRhjT7knw", "text": ["This place sucks.   They can never get your order right no matter whether you go through the drive through or inside at the counter.   I guess they have...", "Sometimes hit or miss but today not. A guy named Andrew in the drive thru line actually asked for ID when our card said see ID. First time in a long time....", "Tried the new creme brulee milkshake.  Omg so good best milkshake I've ever had. So thick and delicious.  I would recommend everyone try this. To die for! !..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.0, 0.51], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], [], ["milk shake"]]}
{"id": "WiOVRF0JJT1gJjRymt90qA", "text": ["This is the best malt shop in Wyoming! Don't believe the hype about Shoshone, if you want a malt this is the place to go. We always make a point of stopping...", "I was on a road trip with my siblings and we were hungry... We saw a sign for an original Soda Fountain in Chugwater and decided to stop... What a blast...", "We stopped here on the way from Buffalo Wyoming to Denver Colorado on 25 South. It was around 11 am and they were just starting lunch. There were three of..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "rm_6ZBIG7k6UDfrFIqdKFQ", "text": ["I stumbled upon Walrus Ice cream on a walk around Downtown Fort Collins. I always love to try mom and pop establishments when I'm in a new city because I...", "cute little ice cream shop in fort collins old town. very popular - line moved fast. we sat outside in the great weather\n\nwhat we loved:\ncappuccino chip,...", "Awesome ice cream! I get the salted caramel usually.... and wow!!! It's the best I have had. \nI would much prefer going to Walrus then Ben and Jerry's or..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "amQvIeAXd154tb74aw95Fg", "text": ["Their burgers were ginormous and delicious, the milkshakes were over the top too. A gluttons paradise.  They have every burger under the sun, some chicken...", "Pleasantly apeesing.. with great illumination and a cleansing odor this was a treat  indeed. The attention that this restroom is given only proves how their...", "Wowsers!  What can I say? We ordered the kids some milkshakes...a princess for the princess and a monster for the monster(see pics). Frosting was caked on..."], "rating": [5, 4, 4], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["milk shake", "burger", "chicken"], [], []]}
{"id": "3lWB3IWTcMgrNqynp0Jkug", "text": ["Love this place! very cool atmosphere and great service!\n\nCharles Sparks \nRE/MAX Alliance", "The fried chicken is not good. It's their Monday special I believe. Maybe Tuesday. Avoid the fried chicken. The chicken sandwich, on the other hand, was...", "Went here for happy hour with a group of 4.  We really enjoyed the atmosphere! \nWe enjoyed some cocktails (tequila) and bubbly! \nOur friend enjoyed the..."], "rating": [5, 4, 4], "TBscore": [0.0, -0.32, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["chicken", "sandwich"], []]}
{"id": "ySUausFV4AoYIKFXdXCGjw", "text": ["I am here from out of town and when I searched for gluten free and burgers- Larkburger popped up. I ordered online and have to say it was quick and easy. My...", "Always a joy going to see Doug and his crew\nGood food good price Great Service\nThank You Lark Burgerl", "Not sure what a lark is, but the burgers were great. This was the best burger joint I tried when I was in Colorado. \n\nThe burgers were very gourmet-looking...."], "rating": [5, 5, 5], "TBscore": [0.39, 0.0, 0.44], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["gluten", "burger"], [], ["burger"]]}
{"id": "8uRWHJ-jJNKCcPvAxqsIAQ", "text": ["First coffee stop in CO and we were so happy with The Human Bean. I'm very specific about Chai Tea and let me tell you, they had one of the best I've ever...", "I thought I would try this espresso drive-thru, but was very disappointed in the product. It tasted so bad I had to toss it out. That was a $5.35 loss for...", "Want real coffee? Want it done right? Want it NOT burnt and NOT overload with sugar like Starbuck$?\n\nYou got it! Added on top of all that - amazing..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "mU3zS9v3EJTfFT0GhoP6Kg", "text": ["We came in when they were just about to close and they were SUPER nice about it. We ordered three fries and they gave us a free drink while we waited. Then...", "I have to admit I owned a burger joint at one time so this may seem unfair. The fries were way overcooked..redropped in the fryer most likely and there was...", "We've eaten here a couple of times and I'm slacking on reviews. This place is what it is. Burgers, dogs and fries.  And dang good ones at that! They always..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.88], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["burger"], ["burger"]]}
{"id": "l0C7snofU6shpC57iJPFDQ", "text": ["Lots of options for cookies and cookie sandwiches. They also offer ice cream sandwiches, milkshakes and edible cookie dough.  All delicious! The staff is...", "These cookies are some of the best I've had! Snickerdoodle, peanut butter and Oreo were all divine", "Amazing selection of excellent cookies.  We wandered in after dinner and got a couple of butter cream filled cookie sandwiches.   I could not even eat all..."], "rating": [5, 5, 4], "TBscore": [1.0, 0.0, 0.67], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["milk shake", "sandwich"], [], ["dinner", "sandwich"]]}
{"id": "ChRMGMuf_XNQJdUP6pcJeA", "text": ["I ordered cheese fries and the chicken tenders with fries. the cheese fries were mediocre-- just american cheese melted on fries rather than the usual nacho...", "I'm a lover of sandwiches and these are amazing. So many combinations of SUBS. You can get em with chicken, with cheese, with beef or just put it all on one...", "The burger and fries where very good. But I ordered cheese fries an got regular. Also my friend ordered a burger from here a while ago he asked for there to..."], "rating": [4, 5, 3], "TBscore": [-0.34, 0.0, 0.45], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["american", "chicken"], ["beef", "chicken", "sandwich"], ["burger"]]}
{"id": "tToedDP4O6Hq55NAyeNrkw", "text": ["It's a good Ice creamery with good service, however they do not offer the elongated yellow fruit options that I crave. It took an army to be able to...", "They barely fill my cup... I feel like I get a small when I pay for the large. And I don't think I've ever seen an employee smile there.", "Went into get ice cream came out and my car was towed, less than 30 min.  DONT GO TO THIS LOCATION.  Not worth it !!! Totally predatory!!!!\nI will never..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "c12xlG_uGdR3GcvD_Poijg", "text": ["The owner Melanie reached out to both my husband and myself after our previous reviews and offered to make things right - we took her up on the offer and...", "Food was good, WAY over priced for what you get. A single Korean Style taco (flour tort) was $6.69. Almost three times more than a similar eat at Fuzzy's...", "Rally5 has a great concept and a really great location, and has a much nicer atmosphere than I expected from a \"street food\" restaurant. I was surprised to..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["korean"], []]}
{"id": "7Yrncl92WLce5d6X3CCr4w", "text": ["Love this spot. Lots of window seating, plants everywhere, cool artwork all over. Lots of cute dogs in here. Got the Chaibrid and it was ver good.\nI really...", "I love this place. It is the most comfortable coffee shop that I have ever been. \n\nCollege students, friends, and dogs alike are what you will find here....", "This place is great. My girlfriend and I were on an afternoon afternoon walk around town and I had some really bad diarrhea so we popped in for a sec. I..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "iy6otkEyH7lCIsr2ACSwmQ", "text": ["Best breakfast in Northern Colorado. Such a cute, cozy place with the friendliest people. Best country fried steak, gravy and country potatoes you will...", "What's not to love about Vern's?\n\nThe location:\nAcross the road from a beautiful mountain view. Find a seat on the porch or near a window and you won't be...", "Whatever you do, order the cinnamon roll. Again, order the cinnamon roll. You won't be sorry! Their skillets are to die for. Honesty my favorite breakfast..."], "rating": [5, 5, 5], "TBscore": [0.46, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["steak", "breakfast"], [], ["breakfast"]]}
{"id": "patEF_GVdII6FpDcwuUQPA", "text": ["I started coming to this location as it was the only one in town that accepted The Holiday Pass. I've grown to love this location. It is always clean and...", "Waiting 25 minutes for a to-go order of 2 cheeseburgers is ridiculous. Never again. And apparently I have to write more in order to make it a review. Well I...", "I doubt that the Colorado burger is for everyone, but for me, it's what changed my like of Smashburger into love.  For change, I had a side of onion rings...."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["burger"]]}
{"id": "G04Rs1pDQgV4Jg3arpXdbw", "text": ["I don't know why it's taken me so long to try Avogadro's Number - I guess I thought it was more of a nightspot than a great place for lunch. But we've been...", "I came here in high school in the 80's.\n\nUsed to be a great hang out.\n\nCame here when I studied History and Forensic Anthropology in College.\n\nWent away to...", "Have been wanting to check Avogadro's Number out for a while and we finally made it by today. I LOVE everything about this fun, funky, eclectic place! You..."], "rating": [5, 1, 4], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["lunch"], [], []]}
{"id": "3tYy_rgszOzjCmYXujSo8Q", "text": ["One of our favorite places to eat! The cinnamon rolls are worth the calories.  I had the cinnamon roll toast which was buttered and nicely browned on one...", "Best breakfast/brunch place in Fort Collins. They have amazing cinnamon rolls and an extensive menu. The restaurant is big and can be loud, but it doesn't...", "Today, because I'm allergic to soy oil, the kitchen made my breakfast using butter instead. So, so appreciative!\n\nGreat service from Lauren too!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.88], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "BBJGLsUvAFgu1SEAXV7o2A", "text": ["I have been to a few other Five Guys in the Denver metro area, and would say that this shop is one of the best!\n\nThe place was packed for 2pm on a Saturday...", "This was a real disappointment.  Bun so mushy it fell apart.  Grilled mushrooms were really slightly heated canned mushrooms - not grilled at all.   Grilled...", "A pretty standard burger joint. Conveniently placed near a lot of offices in the Front Range Village. Great spot to grab a quick bite before returning to..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.3], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["burger"]]}
{"id": "a6-bBmdlpnK2cyTAzflq3A", "text": ["love that its a chain so you know what to expect with your food choices. service is definitely hit and miss though at this location.", "The service was mediocre at best and the food was worse. Our appetizer never came out and our food was literally cold when it finally came out. We wont be...", "VERY CONCERNED *HEALTH INSPECTORS NEEDED*\n\nCame for dinner in a Sunday 10/30 at 7p. Wasn't very busy - looked like we arrived on the tail-end if dinner..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], ["dinner"]]}
{"id": "IKYgPDSda__j6CpQ28o4Uw", "text": ["My wife and I prefer low carb and weren't sure we could get it here, but they have 2 options: in a lettuce wrap or in a dish. We did the lettuce wrap and it...", "Very underwhelming burgers. I ordered a bacon cheeseburger with onions, mayo, and ketchup. The bacon was dried out and brittle, the cheese unmelted, and the...", "Called ahead for 2 burgers and small fry, they took forever and one had none of the toppings requested."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, -0.25], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], ["burger"], ["burger"]]}
{"id": "Cy3biTCqM5T_hjIjwzkEKg", "text": ["So the service could be much more organized. Food is good tho. Have has some issues using coupons thru the text. One employee says yea sure it works on...", "First of all- the manager of this place is seriously rude. \nThis is the second time (and LAST) that my husband and I have both become extremely sick after...", "This place was hoping, i pre-ordered online and the pizza was ready when i arrived. Although they had to search for my pizza since they were so busy. The..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], ["pizza"]]}
{"id": "EeySBzBfj44tTWlBz7AUsQ", "text": ["Hot and fresh, but not nutritious. If you want a pizza that made right in front of your eyes, go to Papa Murphy's.", "If you order anything from them stick to pepperoni.  The staff had no idea they offered a bestus veggie pizza until it was pointed out to them on the menu...", "Deep dish done right, the extra most bestest 1$ upgrade make a good pizza great! Yeah some time you have to wait for a pizza, but what is wrong with a fresh..."], "rating": [1, 2, 4], "TBscore": [0.28, 0.0, 0.29], "normalisedRating": [-0.6, -0.2, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "hPSRqJCIWhmMyKZCN6tUtA", "text": ["Just like every place I have been the coffee and hot chocolate is not on the right side. To many old ladies run the place that don't care about peoples health!", "Small coffee shops like this struggle against Starbucks and I try to give them my business whenever I can, but it would be nice to see one that actually...", "Stopped in at the library to get a library card..so on my way out I stopped at the Library Cafe. What a cute place! Staff is friendly, plenty of chairs and..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "TbRrmlZsPJNoOWSDc1IlFw", "text": ["Cool local joint! Gets quite a few folks who are regularly here. Darts and pool. It's a bar for Gods sake!! No food, but the bar servers are very nice, and...", "It's okay, but woo boy definitely small. Drink prices aren't too bad, and the staff is pretty pleasant. The restroom feels like time travel as it hasn't...", "Best little hole in the wall bar in Cheyenne. Live music on Friday's, and some of the nicest bar tenders in town! Try a Pershing Popper, you won't be..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["bar"], [], ["bar"]]}
{"id": "Ti6Gu9KpKanj-XgyJmFOtg", "text": ["Thumbs up! Great setting and atmosphere. Great beer deals. Friendly staff. I will be going regularly.", "I was here on vacation and stopped by on a whim since it said \" large selection of whiskeys\".  I Mi came in late afternoon on Sunday Labor Day weekend....", "Very busy during happy hour. Came here to celebrate my dad's retirement.  Great space in back room to have a small vet together with friends and family...."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "dwJt5wb2InAhQkQe3isVUA", "text": ["What is not to like, Cadillacs? HELL yes, ranches? HELL also yes! gimme gimme. them drinks are cheap as they get! It's amazing! Be sure to dress nice, it's...", "This is the absolute worst club this side of the Colorado river. The dj is obviously tone deaf, and thinks he's performing for a middle school dance ... in...", "It's very loud, there are very few places to sit, the service is horrible, and there are better quality places in town. Anyone who remembers the Cheydive..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "qs7pMpI52kEDFk7LTM2Pxg", "text": ["This is my absolute favorite bar in Cheyenne! It's a must for St. Patrick's Day and Frontier Days!", "It's a hole in the wall. I've gotten sick off a beer there. I won't be back after that. How do you mess beer up?", "Grab some popcorn and hang in the bar or liquor store - seating on both sides! Four Winds gets rockin'."], "rating": [5, 2, 5], "TBscore": [0.49, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["bar"], [], ["bar"]]}
{"id": "UR9Y9yqV4cpYM2_Wms-rzw", "text": ["Fabulous dive bar, if dive bars are your thing (but they really really need to be your thing for you to enjoy this place). People from all walks of life...", "The cops are always at The Lamp. It's not what a person would exactly call the \"safest\" place in town. The attached liquor store is way overpriced as well,...", "Lamp Lounge is the tits. Dive bar heaven. $2 shots, free condoms. \n\nThat's really all there is to say, but Yelp has a length requirement, like a pedantic..."], "rating": [4, 1, 5], "TBscore": [0.33, 0.0, 0.3], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["bar"], [], ["bar"]]}
{"id": "G8FZ5tQDOtKIm1t5NU2pEg", "text": ["Bought eclipse glasses from them and they were super awesome about it. They didn't overcharge and restricted how many they were selling so as to not sell...", "Traveling through ... Found this place...stopped for a drink....Rough place... Would not recommend if you want a more controlled atmosphere.......", "Never been here before, but they had an afternoon Comedy Show I wanted to see. The place smells and is not clean. It took over 15 minutes to get my bar..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["bar"]]}
{"id": "Uj9Xo16-RxViTi3sjyEreA", "text": ["This is the quintessential hole-in-the-wall bar! Fantastic people - great prices - plenty of room and service with a smile!  A sign on the back wall clearly...", "I guess I would put Alf's Pub in the dive-bar category, but you know how you have your favorite dive bars? Well, that's Alf's! This is a fairly small bar...", "Went there for St Patrick's Day and it was beyond bad. The blonde bartender was one of the worst I have ever seen in my life. Standing at the bar with a $20..."], "rating": [5, 4, 1], "TBscore": [0.34, 0.0, -0.57], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "8N9e6gxK9pLDVgzzCxJhTg", "text": ["The location is okay, but parking is wonky. After they renovated the place a few years back I thought it would improve, but it's still just a dive bar.", "Not even worth the one star. The bartender sucks", "Honestly the bartender was pretty rude. She barely made eye contact and it wasn't busy at all, but we couldn't get the time of day from her. Food is..."], "rating": [2, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.2], "keywords": [["bar"], [], []]}
{"id": "mXHge75GolrGDj14c32T0A", "text": ["It was a lot of fun back in the day, but anymore it's surley and you can just smell the alcoholism and broken promises when you enter.", "I like hanging out here. It's a smaller local bar.  Has 2 pool tables, dart boards, a golf game, a bowling game, and a jujebox. A few tvs to watch the game...", "Dt's bar isn't quite what it used to be I don't like how they changed it. The staff and the clientele aren't as friendly anymore. It just isn't as lively. I..."], "rating": [2, 5, 2], "TBscore": [0.0, -0.23, 0.26], "normalisedRating": [-0.2, 1.0, -0.2], "keywords": [[], ["bar"], ["bar"]]}
{"id": "eiU_N2ca_SjPbsVYZhM2yw", "text": ["Fun place to have dinner!  Very large selection of veggies and meats. They have flavor selections and some recommended recipes, or you can make your own.", "Yum!!! Great food great service!!! Fill your bowl as full of all the great vegetables and noodles. If u eat meat it's there too!!!", "This place is quickly becoming one of my favorites in town. \"But wait.\" You say. \"What do they offer that other Mongolian grills don't?\" Some of the..."], "rating": [4, 5, 5], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["dinner"], [], []]}
{"id": "yLvlFJU2H3va0F5KNwQd9Q", "text": ["Quality sushi in Laramie!  The style is simple preparation of fresh fish. This restaurant although small puts together great sushi and many other Japanese...", "Perfect for a girls' night out before going downtown. Not a lot of seating, but they were able to get a large group of us in quickly (for it being a...", "It is a nice place in general. Good for a quick bite of Asian food when you stop by. But the food needs more work."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["sushi", "japanese"], [], []]}
{"id": "yZm6xlZri6KintQSuDLoAg", "text": ["Amazing food!!! Every time that we crave Asian food we always come to Mizu's. The service is pretty good and the atmosphere is very relaxing. We always get...", "Nice ambience.   Food wasn't great and the nigiri sushi was tiny.  Service was rude and hurried.   The soy sauce was in particular very low quality.", "My favorite sushi place in Laramie- perfect for a date night or a large group. Nicely decorated, but always service was a little slow. My ex would usually..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.21, 0.23], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["sushi"], ["sushi"]]}
{"id": "NGx0FCSJVCX8GlF40zEpKA", "text": ["Woo place is fucking fire! \nTry the chum bucket! \nGood sushi.\nTry the Kim K. Ass so fat need a lap dance good!!!\nGood vibes. \nGood people!", "Fresh and well made rolls, good maki!  Nice atmosphere with great service!\n\nAlso had the chum bucket and it's tasty too!", "So a very interesting perspective to Sushi with funny names for there Sushi Rolls. Like OG SCOTTY-O-ROLL or TIE-DIE ROLL or OG MR ROGERS ROLLhis restaurant..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["sushi"]]}
{"id": "K7ZMZzddpmGBDnpyCYqzpw", "text": ["Sushi is my thing and i cant get enough of Nimo's.  I've been in Fort Collins since September for work and I make a habit of visiting Nimo's at least...", "Sushi purists will appreciate the intimate atmosphere of Nimos and the quality of the fish served.  If your style of sushi consists of lots of fried items...", "This is the weirdest experience I've had with sushi. As I entered I headed for the sushi bar the sushi chef scolded me to wait for the waitress. I promptly..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["sushi"], ["sushi"], ["sushi", "bar"]]}
{"id": "8cJT98lMR3l9-1hjfKe75A", "text": ["Great place for sushi in southeast Fort Collins. We had Connor as our server and I wish he could be my server at every restaurant I go to! Awesome service...", "This place is a joke. My credentials are that I work in a kitchen, I grew up on the coast (so I know what fresh seafood tastes like) in Los Angeles (a city...", "This has been one of our go-to sushi places in Fort Collins for quite a while. However, after last night meal I don't think we'll be back. The rice was not..."], "rating": [5, 1, 2], "TBscore": [1.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["sushi"], [], ["sushi"]]}
{"id": "plaZifvIWViEDGBm9ICcyw", "text": ["Order the FIESTA ROLL!!! It's the best roll there imo - crab, seared salmon, and striped bass w tomatoes, tempura, *jalapeño, *cilantro, masago and mayo...", "Went for lunch yesterday with my wife. It was awesome. Had the Tonkatsu bento box. Very good. We did not order sushi this visit, so the only insight on the...", "A cute place with super friendly staff. We got the lunch bento box specials which was so much food for very little cost. I will definitely do that again. In..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.64, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], ["sushi", "lunch"], ["lunch"]]}
{"id": "PToB3f_FKEmv8etTWB3Ufw", "text": ["Amazing food every time I've been here !!!!!\nThat staff is great also . It's a little costly but the fish taste very fresh .", "My 1st experience at a Poke bar.\n\nGot a sample while in line of their new seaweed salad. In the end ordered a bowl with tuna, seaweed salad, and various...", "So to start off, we loved the food. I had a small bowl with avocado, and my fiance had a large bowl with an extra salad and avocado. We had a free protein..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "N877dC_KmkGh0XgLLC3KTA", "text": ["Like the food and fun atmosphere!\nOwner is always there -very attentive staff. \nWe also have a nice evening!", "This is long but I want to give the good and the bad.\nWe sat on the restaurant side; so I can't speak to the hibachi experience.\nThere were definately some...", "Having traveled for a living, I've had the opportunity to try restaurants across the nation. To keep it brief I'll just say that this is one of the best..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "Fz44Cowa7oL57KV5fF6Zvw", "text": ["I love eating here with family! It's also super fun to sit with people you don't know and meet new people. The staff are accommodating and the chefs always...", "First  visit with a work group,  ordered shrimp and calamari the best I have had. As for the service out grill cook was funny and on point with the meals he...", "We went here at an odd time so the restaurant was completely empty. We were the only people there. Our server was shy but nice and attentive. We ordered a..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "EjGJZXngsBo3-QGSR3Dg5w", "text": ["I love this place!! The teriyaki bowls are awesome and the poke bowls are even better!! We've eaten here several times and always great!! The staff is very...", "Maggots in the edamame!  You have been warned.\n\nA few years ago, we tried this location and found live bugs crawling and burrowing in the broccoli.  After...", "Do not go here! I ordered sushi thinking it would be as good as king soopers... and it was more like gas station sushi...  my sushi was room temperature but..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.6], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["sushi"]]}
{"id": "k21eE99xKjMAu81whOTIyA", "text": ["We love this place, we go on Sunday nights and get the happy hr specials.  \n\nCharles Sparks \nRE/MAX Alliance", "My wife and I arrived at opening (11:00 AM) for lunch, and walked away very satisfied.  Now to be fair to the Yelp naysayers or Givers of 4 Stars, we're...", "This is pretty nice place to grab some seafood in Fort Collins. The service was excellent and the food was good. I do think they're a little bit unfocused..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.68, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "O_N9takvqDUODf8z8aPQLA", "text": ["Visited Asiana today with my two year old, who as of lately, never wants to eat anything more than a couple bites.  \n\nSam was so nice and even though there...", "Tasty food. I ordered the tonkatsu ramen to go. It was ready to in about three minutes. Very tasty rich broth and hearty serving of slow roasted pork. Under...", "We went to the soft opening today and were greeted warmly with smiles and samples! The favorite combo ended up being singapore noodles (with a hint of..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "mLHSib2Fmb1R69TRCSTzsg", "text": ["We love Thai and we definitely love Cafe De' Bangkok. The red curry and pad Thai were wonderful and the portions were good!\n\nThe curry had a nice rich...", "Sunday lunch and this place is busy.  Wooden benches and tables.  Not terribly comfy but perhaps that promotes a quick turnaround.  We were seated right...", "Pro-tip:  this is probably on the best Asian restaurants in Fort Collins, but don't come during peak times if you want good service. \n\nThe GOOD: food\n* Duck..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.24, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "rTHgmBYzeVDRJGEmdZR-wA", "text": ["I've gone to this location a ton because I work right down the street. I just wanted to shout out the taller guy with the inner forearm tattoo. I've also...", "Just ok, was hoping it would have been better.\n\nI came here for the first time and tried their poke bowl and yakitori bowl.\n\nThe poke was better than the...", "An extra star for the service which was friendly, patient and courteous. The food is fresh and the sauces are a delight. Fresh rolls are a welcome addition..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "f32UdKB33_2jScIvEUMykw", "text": ["Wok & Roll has great food! Definitely a healthier option than a lot of other places. Always great for a quick bite! Had an issue with an order only once and...", "The food is always good but the last couple of times I have eaten there the servings get smaller and smaller. I ordered the large combo and when I opened it...", "Best place to grab a quick meal!! Lots of healthy options, everything is made fresh on location. I never leave Yelp reviews but I felt like I needed to give..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "vuLffcwE-YlCyybXHOUarQ", "text": ["Sooooo slow. Should have given customers a heads up on the wait.\n\nI guess they understaffed here at this location. We planned to pick up just two rolls of...", "Went to Tokyo Joe's for the first time. I know it's like the fast food for Japanese food, so it's not supposed to be legit. But I really wasn't a fan. \nThe...", "I love Tokyo Joe's. That's just the way it is.\nBig bowls of noodles, veggies, meat and flavorful sauces. I typically get steak, noodles and a few veggies..."], "rating": [2, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 0.6], "keywords": [[], ["japanese"], ["steak"]]}
{"id": "6eqtFyGg0iN4JrXRbcAU-Q", "text": ["This little \"speakeasy\" in downtown Fort Collins was super cute. \n\nI went with a group of 6, and we were seated within 5 minutes of arriving, which was...", "Well the reviews definitely are accurate.\n\nTotally well-deserved 5 stars!\n\nMy friends and I just finished a hike and wanted some grub. We stumbled upon this...", "My wife and I are cocktail connoisseurs (we carve our own ice, make our own bitters and tinctures--just so you know what I mean by \"connoisseur\"). Visiting..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "M_ac9MaKb10AJ0vueqEyBw", "text": ["This place is really good- I think they are trying to do too much and should stick to Poke and boba, to keep things moving as things can get a bit bogged...", "Some background: I'm Asian, I cook Asian food at home, I was raised in SoCal in the largest Asian enclaves in the US eating the mix of things that Ye's...", "What a lovely new fast casual lunch or dinner spot right by Colorado State University. For those who are familiar with the area, Ye's is right next to Mugs..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["dinner", "lunch"]]}
{"id": "4pClvvcOaACaagQn9lF1gw", "text": ["I had dinner here with a group of coworkers and we all agreed that this is our new favorite place in Fort Collins. Nice atmosphere, great food, great...", "My wife and I went for dinner today. Both of us were quite unhappy with both the service and the food. We ordered Artisan Cheeseboard - it was really bad. I...", "Looked up this place on Yelp while on a short stay at Fort Collins. Walked about 20 minutes from downtown thinking it would be nice to build an appetite for..."], "rating": [5, 2, 1], "TBscore": [0.57, -0.65, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["dinner"], ["dinner"], []]}
{"id": "u2kxLxZQMmoCTCuMuelEpA", "text": ["I ate my meal inside the Bistro, the food was good the atmosphere was nice (other than the hostess yelling). I would return", "I had food delivered. Sweet and sour chicken for me and general tso for my husband. Both were bland and soggy. The sweet and sour tasted watered down and...", "Not sure why the reviews aren't so good. I have ordered from here several times now and each time as I wait for the order wonder what is going to be wrong..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "U-GSbFaEm03iT9HKE0gFKw", "text": ["Good food, friendly service and a decent experience for a chain restaurant.", "Actually extremely happy coming here my portion size was large and everything was cooked to perfection I got the steak stroganoff and boy was it delicious I...", "I'm not much for reviewing chains, especially for places that haven't gotten the greatest of reviews.  \n\nOne of the most impactful things any restaurant can..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.67, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], ["steak"], []]}
{"id": "JZWrMpXhEZPgbPP-XhEayA", "text": ["Went in again, for old times sake, and was disappointed again. Very little sauce and a half filled bowl. It's like they don't want satisfied customers.", "It was a terrible experience.   Several people walked out and I wish I would have done the same.  The food took forever, when it came it was cold.  I...", "I really enjoyed the food.  I had the Pesto Cavatappi and it was wonderful!  The manager, Greg, was very helpful and friendly in helping us with probable..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "1pqG8JA8pTU2RgY2nMAwXA", "text": ["This is  my favorite restaurant.  Lulu's chicken is my favorite dish. They have best curry and pad Thai.", "My friends ordered a lunch delivery and the item was wrong. My friend called in and check what is going on in good manner. The people in this restaurant...", "They have very delicious authentic Chinese food. Check it out. Also they have very good deal during lunch. 12 dollars for 3 rolls comes with soup and salad...."], "rating": [5, 1, 5], "TBscore": [0.35, 0.0, 0.6], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chicken"], ["lunch"], ["lunch", "chineese"]]}
{"id": "GK2qJOXtinXV8Sn4ewBVQQ", "text": ["I love noodles and company and there food but it has happened to me three times now where I have payed extra for meat on top of my noodles and they still...", "I had never been to a noodles & company in all the years I've lived in Denver until today. We walked in for an early dinner and we greeted right away. There...", "I love this Noodles &Company!  They remember my name when I come in and greet me with a smile.  Rebecca is a cashier and is always super friendly and..."], "rating": [3, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 1.0], "keywords": [[], ["dinner"], []]}
{"id": "zltVOtTw4IlPgyBGesVy1g", "text": ["This place is your typical Chinese food dive, nothing fancy by any means. The lady taking my order was actually pretty rude and chose to scroll through...", "Only giving one star because I cannot give zero! Customer service and delivery are horrible, attempted giving them a second chance a few months later,...", "Ordered $60 worth of food. These guys charged my card $400 and refused to correct it. It took 3 weeks to get my money back. If you go here. Absolutely do..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chineese"], [], []]}
{"id": "qSaWpBL-cQ78eVtR4YSJhQ", "text": ["Best Vietnamese noodles  in Fort Collins in my opinion!\n\nI really couldn't find anything wrong with this place so they deserved five stars with great...", "Pleasantly surprised by this little pho shop currently under major construction in the back of the Trader Joe's plaza.\n\nEach time I had the fatty pork and...", "Initially looks like a hole-in-the wall. But those usually are the best places to eat. This place is no exception. Average per person $10-$15. Great for..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "BT1viQkeCBUyhFIbzcYu1A", "text": ["Just saw this food truck in our local paper and luckily they were at the Fort Collins Food Truck rally at City Park tonight!!\n\nHubby & I were sampling...", "Ugh. My husband just paid $12 for meat-y water and a small bag of lays. Pretty crappy.", "I really like the smokey flavor on the meat from Big's and the sides are usually simple but spot on. My biggest issue is with them using cheap mashed..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "yJaHpDHUu3G0o6Qw5QuT5g", "text": ["You usually find me at the Buffalo Wild Wings in Loveland, but occasionally my path crosses with this one so I stop in for lunch at times.\n\nThis one has...", "Love this place and the many different sauces they have for you to pick from. Cooked well the staff is great and enough TVS to watch the games or fights!", "I'm not necessarily picking on this BDubs in particular. This goes for all of them. Let's face it they aren't what they used to be that's for sure but now..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["wings", "lunch"], [], []]}
{"id": "PAXYYTdmgBk68Jc9jQXfjA", "text": ["Excellent! Quite delicious and great vegan/veg options!! The lunch and dinner buffet is perfect to get a little bit of everything along with a salad.", "I visited this restaurant with my family based on my daughters recommendation and am now a believer! I was not disappointed! We ordered tandoori chicken for...", "Had been trying to find good Indian food since I moved here, and this place is delicious! \nI haven't had their buffet but dinner was exceptionally yummy...."], "rating": [5, 5, 5], "TBscore": [0.76, 0.0, 0.79], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner", "lunch"], ["chicken"], ["dinner", "indian"]]}
{"id": "O3KMUucS5PSmUGZxCGO3Hw", "text": ["Best Indian food in Fort Collins. Hands. Down. \n\nMy wife and I had dinner last night. The restaurant is bright and cheery, the staff are very hospitable and...", "Has been my first choice of Indian restaurant in fort Collins till today. Ordered a kadai paneer and it's the worst I ever tasted. Maybe my next visit is...", "This place has really good Indian food. They have excellent samosas, puri bread, chicken tikka masala, other assorted curries. They also deliver for free!"], "rating": [5, 2, 5], "TBscore": [0.41, -0.25, 0.3], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["dinner", "indian"], ["indian"], ["indian", "chicken"]]}
{"id": "Q5hM12IeW_WQwdVG54qM-g", "text": ["After god knows how long subsisting on basic everyday truck stop food I cannot muster words for how grateful I was to find real fresh made food.\n\nI nearly...", "Unexpected gem! Driving from Colorado to South Dakota and hoping to find somewhere for lunch and happened upon this little Punjabi and American restaurant...", "Amazing Indian food...Every time I drive by Wyoming I make it point to stop here...Samosa,Chai, sarso da saag and aloo paratha are to die for.Really..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.6], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["american", "lunch"], ["indian"]]}
{"id": "M2a9ML_cYBfjqwR9zxRYLg", "text": ["Fresh, good portions excellent rice. Seems like there's always a great lunch special.\n\nRecommended, you won't be disappointed unless you wanted a cheese...", "Very brightly lit dining area, reminiscent of those trendy yogurt shops that are popping up everywhere.\n\nFood took quite a while to come out, we were the...", "Amazing food, generous portions and friendly staff.  I left planning my next visit. Lots of vegetarian and vegan options. Spice level was perfect. The..."], "rating": [5, 4, 5], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch"], [], []]}
{"id": "Zh9aTlvyUJ4aUMiIXYIqaA", "text": ["I've been frequenting the first restaurant (The Mt. Everest Café) since Dawa opened it in 2004. \n\nI was thrilled to hear of his new venture. (Full...", "Finally got over to check them out. I love Indian (and regional) foods. It was a friend's birthday, so I treated her there before a movie at the Carmike on...", "We ate here last night with friends. We really enjoyed it. The coconut curry seemed to be the big winner of the night. My husband and daughter had that and..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["indian"], []]}
{"id": "gyJ6zp5yzCvbK_yVuObqqQ", "text": ["Amazing authentic (or so I'm told by my Indian friend) and delicious. So good. Buffet is cheap and all you can eat. Worth it. Can't say enough.", "I  have 2 stars only because the 2 dishes I had were hot and tasty We arrived at 12:45 for the buffet only to see them removing the dessert Most of the...", "I drove all the way here from Cheyenne craving authentic Indian food. I was greeted by the owner who is a native to Nepal. The lunch buffet showcases true..."], "rating": [5, 2, 5], "TBscore": [0.5, 0.0, 0.42], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["indian"], [], ["indian", "lunch"]]}
{"id": "lZJ3SS3z-BAsSDSW57MCKQ", "text": ["Delicious food, big potions, speedy service, and they even gave us a big rice pudding on the house. The Baingan Bharta is amazing. A wonderful experience!", "This is a new family favorite for us. The veggie korma and mushroom curry are awesome. In a day and age where good customer service is hard to find, it is...", "Delicious. I have ordered typical stuff like chicken tikka masala and garlic naan, but it's solid comfort food. And if you like your curry hot, they can..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["chicken"]]}
{"id": "VXagSQWvu9sKKtujh5S6Zw", "text": ["I was told this was a great place and people were not wrong! Absolutely wonderful! We had the cauliflower wings, the Cuban plate, and another dish I can't...", "This place was so good that after having lunch there for the first time, we went back for dinner too. The beat salad was out of this world. They had an...", "I just can't run out of good things to say about this restaurant \n\nVegetarian food that rivals and exceeds the other kind\n\nFirst Chill with the works and..."], "rating": [5, 4, 5], "TBscore": [0.7, 0.32, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["wings"], ["dinner", "lunch"], []]}
{"id": "ON-_-nOpxUUz2MSdYJp0ZQ", "text": ["What a great place for lunch! \n\nI've never been here, and it has been a very long time since I have had this style of food. \n\nWhen we walked in and walked...", "Decent made-from-scratch Afghan food at an affordable price. It's not life changing, but it is good, home-style food. Ingredients are clearly fresh and...", "One of my favs. Still amazed everyone doesn't know about this place. \n\nFound out that they intentionally cooked thier meat to death as Afghanis like it that..."], "rating": [5, 4, 5], "TBscore": [0.47, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch"], [], []]}
{"id": "d8GJ_MkuupWeCbSuFsuVww", "text": ["When I'm in Vegan Territory I say, 'Bring It! And, Day-Em, Ras Ka Did!\n\nI eat meat (please forgive) so I was skeptical about the menu. Ras Ka also offers...", "This is the most delicious Ethiopian restaurant I have ever been to! Hanna the owner is so sweet and accommodating, and the restaurant itself is cozy and...", "This is easily a 5-star restaurant. The food is phenomenal. It's so fresh and flavorful. Some of the best Ethiopian food I've ever had. If I was wealthy..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "L_S0P4JgC7JN7sfkPs2pmw", "text": ["Excellent ice cream!! I wish they carried that dark chocolate raspberry wonder woman ice cream all the time. I always get good service here.", "A wonderful treat!  The staff was so nice and the Icecream was delicious.  The store was clean and I was able to redeem my check in free waffle cone.", "Love this location. Even if I ask for an old recipe they look it up. They are great and always welcoming. Sometimes you may have to wait because of the long..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.64, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["waffle"], []]}
{"id": "CbHincyk_CMC9spe4Mss7w", "text": ["I've now been to Walmarts in 23 different states and that's given me a good opportunity to compare them. This one is quite good, though it has the standard...", "Pat in produce really went out of his way for me. I asked where something was and they were out of it and instead of just leaving it at that, he dug around...", "I came here looking for \"Cheyenne\" gear. They have an isle that is supposedly dedicated to Wyoming and Cheyenne gear. Sadly they didn' have any Cheyenne..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "nfGnzqupbwqej5DHbnWLsg", "text": ["You haven't had breakfast in any hotel that is better then this one. Chris does breakfast better than any Best Western hotel in the country.", "We haven't been here but was told it's a five star rating. And you also can stay if your traveling this is the best place to stay while in town visiting...", "Pet friendly. This place is awesome for the price and comfort. Beds great. Rooms clean. Facility nice. Breakfast buffet is awesome."], "rating": [5, 5, 4], "TBscore": [0.5, 0.0, 0.69], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["breakfast"], [], ["breakfast"]]}
{"id": "LwOtgg1vSOTZRD0BeDMnoQ", "text": ["We came on the last day. Make sure you come early to the indian village to watch the dancing. They are all a family and go to American Indian schools. Very...", "My neighbors would spend most nights in Cheyenne at the concerts. We arrived at Cheyenne Frontier Days early in the morning, parking a little ways away and...", "Love CFD. Go every year.  If there's someone you like and they're playing highly recommend you go.  One of my favorite venues next to Red Rocks."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["indian", "american"], [], []]}
