{"id": "zlXt4-Wn_1Xhs6r9U1nqSA", "text": ["This convenience store/gas station is clean and well stocked. It is not set up to be a full service restaurant, so any sandwiches and other food is pre-made...", "I was in a rush to buy a sandwich for lunch and since I haven't like Subway subs, I decided to buy a simple tuna fish sandwich from the refrigerated food...", "This Irving Gas Station/Circle K convenience store is located on Loudon Road, just west of the Steeplegate Mall. There are 8 self-serve gas pumps here (pay..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["sandwich"], ["sandwich", "lunch"], []]}
{"id": "8W7lJzuBVGThkWOehYuoSw", "text": ["I just went to purchase frozen yogurt. I had my therapy dog with me. They threw us out. Would not listen to rationale that she is a therapy dog. Never gave...", "I love the flavors and the hours!   I find they are short staffed much of the time and a little overpriced, but product very good.", "Everything is delicious. Place is clean. Some staff are superb. Others seem like they would rather do anything other than talk to a customer."], "rating": [1, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "sYcZJussk3lfQxoamk7TxA", "text": ["This is a great dealership.  I was in touch with someone from the service center about a piece of hanging metal from the bottom of my 2002 V70 Wagon, who...", "I would definitely urge you and your family to at the very least reconsider doing business with Lovering Volvo Cars Concord after hearing the ordeal they...", "The salesman was knowledgeable about the vehicles he was looking to sell. However, after I test drove two vehicles, trying to make a decision as to which I..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "BaQa3_yus6_BBcSBoCB4iw", "text": ["I stopped in to this recently opened Aroma Joe's in Concord this morning.  It's at the location of the former Kentucky Fried Chicken shop.\n\nThe interior is...", "Not very impressed with this Aroma Joe's drive-thru service. I originally tried to order a marshmallow square; they didn't have it and tried to order a...", "Aroma Joes more like Aroma TOES....I got a strong whiff of feet as soon as I walked in, and that was matched with a very surly look from the barista. But..."], "rating": [2, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, 0.6], "keywords": [["chicken"], [], []]}
{"id": "Jmjf72FC9Wm4iLnGr4aPlg", "text": ["Killer Northland and Langers berry juice. Almost gave up on Hungry Man deluxe fried chicken but they were good and $2.50! Snagged an under $5 strip steak...", "This older Market Basket is full of past-dated healthy food, or highly processed products that only contribute to health complications. Do yourself a favor...", "Always a fan of the customer service and prices for the quality. I am a daily shopper and enjoy it. Thanks employees of Market Basket!"], "rating": [5, 1, 4], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["chicken", "steak"], [], []]}
{"id": "y98p8jl1nxjrm7MzA0Ti8w", "text": ["Typically, employees at their work places are more trained than I, thus I consider them knowledgeable associates whose word I believe and trust...", "This is a very clean and well organized Shaw's store location.  Prices are a bit higher than elsewhere, but there's a wide variety of products to select...", "To be fair, Shaw's, overall, is a decent store.  They have the typical problems that supermarkets have these days, like long checkout lines on weekends with..."], "rating": [2, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "bKEsk7L22_krDG4nLaozuw", "text": ["A solid 4\n\nCons: If you buy dog bones there you either get bones for any dogs or bones which were taken from a T-Rex or giant killer whale and meant to be...", "Very friendly, great selection\nPrices are lower then anywhere else\nRecommend going to their restaurant as well", "A little off the beaten path but worth the trip. Doesn't look promising from the outside, but they have an excellent selection of hard to find items like..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "IF3fiPVIY7NIo1IZpcNPug", "text": ["I shop here all the time, but today a cashier named \"Marlene\" was trying to get my attention and shouted out at me \"Hey kid!\" to try to get me to use her...", "Terrible management. Rude attitude from them when a person cut another young lady in line. They should have solved issue with good customer service and...", "Knuckle dragging butchers really turn this mediocre grocery store into a place that should be passed up. If it's not in the display case that they can point..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "Nrf6ICD6IiBpP29CkKmgRw", "text": ["Such delicious chicken tenders! Had a great time with friends and amazing service from Tula.\n\nCame back with my mom and had great service and food again. Go...", "Ok food, ok service. The chicken fingers are pretty good and so is the bread. I liked the corn chowder. The waitress was clearly annoyed when we all asked...", "Great food, best chicken tenders around always have generous portions! Can get loud and busy feels somewhat crowded at times.\nService is always good"], "rating": [4, 3, 4], "TBscore": [0.35, 0.22, 0.33], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["chicken"], ["chicken", "corn"], ["chicken"]]}
{"id": "tD-THIam4OxhY5HD74YQTQ", "text": ["Dan set us up. Totally amazing food!! We felt like family eating there! This is authentic Mexican food totally worth every dollar they charged us! The...", "Just an FYI to any vegetarians who might order from here: their \"vegetarian burrito\" contains no veggies, only rice and beans that have MEAT IN THEM. Don't...", "Great food a great price. The owner Dan and his wife are great. Had great - authentic - tacos. And they make some pretty good pupusas. Everything is fresh -..."], "rating": [5, 1, 5], "TBscore": [0.47, 0.0, 0.62], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["mexican"], [], ["tacos"]]}
{"id": "HRAeBbrKDkF443FPx9kdMg", "text": ["Very few places can beat Five Guys for burgers and this place supports this conclusion.  Fresh made to order burgers with fresh cut fries that are...", "Fresh burgers. Maybe best Cajun fries ever ? Everything cooked to order. What's not to love ? The atmosphere isn't the best but it's part of what they are...", "Fresher than your average fast food burger. Faster than a burger joint. Clean and plentiful parking. Excellent customer service. Fair prices. Good taste and..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.7, 0.47], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["burger"], ["burger"], ["burger"]]}
{"id": "k42nO0sc1k6vJCL25j7Aow", "text": ["I'm a fan. \n\nEven though the hotel breakfast wouldn't have been bad, (though some are horrendous), I asked the front desk for a recommendation and they said...", "When I hear diner, I imagine a big spacious place. This place was surprisingly small. They don't take any advance reservation. Once you walk in there is a...", "Good coffee. Typical diner food. open 24/7. Staff works very hard. So tip your waitress well. \nAs for food: \nAffordable\nConvenient\nChili had tons of sugar..."], "rating": [5, 4, 3], "TBscore": [-0.7, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["breakfast"], [], []]}
{"id": "r8VlH2i6m_A_2UZiI69R_A", "text": ["Normally I would not review a fast food restaurant such as McDonald's, however this particular McDonald's deserves a review.\nA couple of weeks ago we had...", "u made my friend fall on the ice thanks a lot buttholes, 0/5 stars because this place suckedd", "Since the remodel the food is worse than ever. \nWe only use the drive-thru so don't know about the inside. A friend says since the remodel  \"it has lost all..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "AC86QVVkY7moCKotmB3pZg", "text": ["Always a treat to stop by for breakfast, lunch or dinner.  Traditional diner style with great food and attentive staff.  The Cadillac breakfast is huge - so...", "Pretty damn Delicious! Friend said this place was pretty quirky with the huge menu. I've been dieting so I needed some flexibility on what to eat. We were...", "I had the Cadillac breakfast with maple sausage which was good,  a lot of food I couldn't eat all of the pancakes and toast so I shared with my wife.  My..."], "rating": [5, 5, 4], "TBscore": [0.4, 0.0, 0.7], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["breakfast", "dinner", "lunch"], [], ["breakfast"]]}
{"id": "V8xkusf1DP5etHne1gQPMg", "text": ["\"When in Rome, do as the Romans do.\" Welp, my sources informed me that meant \"visiting a clam shack during the summah\" so of course I had to!\n\nSure they...", "Grabbed a late lunch here on the way to the white mountains during Labor Day weekend.  I got the scallop roll and was very satisfied.  Fried scallops were...", "Amazing and awesomeness in two lunch plates....sweet fried clams and sweet fish and chips.  It's clean, like sparkling clean.  We ate outside on the very..."], "rating": [3, 4, 5], "TBscore": [0.0, 0.0, 0.31], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [[], ["lunch"], ["lunch"]]}
{"id": "az6SNgmgSG-30JukSaOB1Q", "text": ["UPDATE: This Irving Circle K (no longer Bluecanoe) was remodeled, no more Quizno's counter here, but they now have nice soda fountain with lots of choices...", "Greatest gas station ever! Cheapest gas, amazing beer cave", "This is a good gas station always has next to the lowest pricing in town and the pumps are always working nicely.  Inside they have a very good mini-store..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "rM4VrOfIPU0_ksfSJXfUAQ", "text": ["I have heard plenty about red arrow but never gave it much thought. I recently finally went and oh my goodness it's some of the best food I've ever had....", "I don't know why I've come back 4 times \nAll 4 times I've had an awful experience \nIf they aren't forgetting to seat us they are mopping the floors while...", "Visited this place at about 1030 PM on a Thursday night. The location itself is somewhat off the beaten path as far as where you would normally expect find..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "s-K7kqR772SLk-06RtEuvw", "text": ["Came on our way down to a concert in Mansfield, MA, we stopped for a quick lunch. I was quite surprised by the negative reviews. The staff was friendly,...", "OMG why have I been sleeping on this place? We arrived right before closing, but we were seated and experienced great service (never felt rushed). We had...", "Thought I would give this place a second chance. The first time I was here was when it first opened and I did take out. The service stunk (I could use..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], [], []]}
{"id": "EkDLyFb5xrf9yIwTTBL-pg", "text": ["This place is a hidden gem. After our flight home was cancelled, we had to spend the night in Manchester. We ate here for a late dinner that night, already...", "The Airport Diner is a landmark, if you believe the hype. Unfortunately, this hype appears to be perpetuated by people lacking tastebuds.\n\nFood: Dry,...", "Yeah, great \"authentic\" NE diner. Dirty, very slow service. \nThe fish sandwich was bone dry and came without any sauce (the menu said tartar sauce)\nThe..."], "rating": [5, 1, 2], "TBscore": [-0.23, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["dinner"], [], ["sandwich"]]}
{"id": "IEslztG3cZ06ZVwbc7_Xyw", "text": ["I came in on a Thursday morning around 9am. The place only had a few other patrons. It was clean, well lit and welcoming. I ordered coffee and it was robust...", "We stopped in for breakfast yesterday with our toddler son.  There were only 4 tables that had people at them and 4 people at the bar so it was pretty quiet...", "The place was about half full, and it looked like a full wait staff in on a Wednesday. Took about an hour to get our food. Both of us got the Alexandra (2..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], ["breakfast", "bar"], []]}
{"id": "A19NFfiPi_6us6VxGNVYLQ", "text": ["UPDATE: \nIt's no longer a half hour away so now I go all the time. Still my absolute favorite Mexican restaurant in the US. Lately I've been going  for the...", "Closest to authentic we have found since Zocalo closed.  Stopped in after reading some of the reviews here and we were not disappointed!  The food was...", "My wife and I went here for dinner based on Yelp reviews. The place looks like a hole in the wall from the outside--but what you get is authentic Mexican..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["mexican"], [], ["mexican", "dinner"]]}
{"id": "Tj0X0Eo1tIme8Vhn4pJ2zg", "text": ["My Friend and I just went there Friday, August 3.  \nWe both had fried Clams, and he had the combo plate with clams and scallops!\n\nThey do come lightly...", "We finally decided to try this place tonight.  I honestly cannot figure out what makes this place so popular unless its the ice cream.  I can't review that...", "We to go down once a year for fried seafood. It's the freshest and best around. I wish they offered pumpkin ice cream but otherwise our meals have been very..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "NW3fgygFOFtFMxz7BbHWyg", "text": ["My husband & I visit this location from time to time. They have always been good about seating you right away . It's clean &  their staff are friendly and...", "How can you not love the 99? I've been to so many a thousand times so I was happy there was one in Manchester when we moved. As always, the food did not...", "I picked this place for a take-out dinner. I won't do it again.\n\nCalling and placing my order was quick and easy, although I wanted to do it online. No..."], "rating": [4, 5, 2], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [[], [], ["dinner"]]}
{"id": "af2N5moEoJq2_iRgEqcv9g", "text": ["Such a great experience! Apple  picking, warm donut  eating and mountain observation viewing!!! Love this place! Highly recommend coming!", "Some friends and I went to Carter Hill Orchard on Friday 15th - 2017 . We loaded up the handicapped van and went to Carter Hill Orchard to pick some mac...", "this is a fun place to go especially with young kids as they have a nice play area with toys etc.  The pumpkins are nicely priced and big! The apples were..."], "rating": [5, 5, 3], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["donut"], [], []]}
{"id": "S8hVycxvsF3asO90g75nGw", "text": ["Great customer service. Had crippling anxiety picking out a free donut on national donut day (June 2nd) and ended up picking a choice I immediately...", "Consistently poor service, long wait times, orders only partially filled, and the routinely can't make the more complex drinks because \"that machine is...", "The customer service was excellent. The clerk was awesome. Unfortunately I may not ever go back as the coffee was burnt badly and I waited at the drive..."], "rating": [5, 1, 1], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["donut"], [], []]}
{"id": "4orf5eZFivco81tuFiX9UQ", "text": ["Best place in town to get gas, iced coffee and has everything a convenience store should have! What I especially like about this gas station is the \"bar\"...", "This store has been recently remodeled and they've removed the Dunkin Donuts.  They have also installed brand new fuel dispensers.  The store looks great...", "This location has been newly renovated, dunkins trash has been taken out!! Woohoo. :-)"], "rating": [5, 4, 5], "TBscore": [0.5, 0.31, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], ["donut"], []]}
{"id": "VuMOxkrV6RllVF0MkarhVQ", "text": ["Off Main Pizzeria is a casual pizza shop located on Pleasant Street just west of Main Street, next door to Noodles & Pearls. They offer a decent variety of...", "Over priced for the size of the pizza. Not a very welcoming atmosphere. Other pizza options in the area that are similar priced but bigger size pizzas.", "I was ready to order but drove by and u are closed on a Saturday at 5 PM wow .on a holiday weekend"], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["pizza"], ["pizza"], []]}
{"id": "PG0M312x-O-_ikjLoF3KLw", "text": ["Stopped in in my way home ordered there two 5 topping pizza's came out fairly fast payed and drove home when it was time for dinner we open the boxes and...", "Solid pizza. Ordered on the app with a coupon code and it was ready in under 15 minutes. Spicy sausage topping isn't that spicy. Still pizza was very tasty....", "Ordered a small cheese pizza for 2 young children & a large sauage for my wife and myself.  Delivery was prompt & the pizza was hot.  One of the worst..."], "rating": [1, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 0.2], "keywords": [["dinner", "pizza"], ["pizza"], ["pizza"]]}
{"id": "meABwOMY6aV27r3dc-e2tQ", "text": ["Lunch is served!\n\nThe Route 106 Shell station in the Heights is our \"go to\" place for easy quick and convenient lunches. My coworkers and I stop in here...", "Ahhh the Shell station! I have come here anytime I am on my way to the Boston/NH area! 20 miles from 93 it makes a perfect fill up stop!\n\nThey always seem...", "Thats funny, I would never have thought of reviewing this place but others are right. I grabbed a quick slice of pizza here once with my teenage daughter..."], "rating": [4, 4, 4], "TBscore": [0.38, 0.0, 0.22], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["lunch"], [], ["pizza"]]}
{"id": "k0a7Nc4mQk8qa5vO-M0chw", "text": ["This was my first experience here.   I ordered prime strip steak @ 23.99/lb & can honestly say they were unimpressive.  There was a huge strip of fat on...", "This place is amazing! Great quality, superb service and always something new to try. We frequent the butcher weekly and are extremely satisified with their...", "This place is AMAZING!!!!!\nThe selections are great. If you need to grab something quick to cook you can just visit the cooler and grab something pre..."], "rating": [2, 5, 5], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [["steak"], [], []]}
{"id": "dAUSToPzfdhdE4V1P7XR1w", "text": ["I was in Concord for a work trip and was looking for a dive bar, dark, dingy, almost dirty, bar with cheap drinks and a good vibe.  This is that place....", "Penuches is filled with a bunch of townies located in an alleyway that has a smell of piss and an old school allure. Their specialty drink is Budweiser and...", "The best hole in the wall bar in Concord. They typically have a decent selection of taps w/ good specials on a regular basis. It is located in the basement..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.34], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "5dG90ExqeGuDdtdpMCPokA", "text": ["Came here on a Sunday night with my girlfriend and the guy she is dating around 8pm. Chi Cha is a hookah bar, pool lounge (which is free!), and has a full...", "Perfect spot just to relax and unwind. Free billiards and great prices on drinks. Great mix drinks TRY the Empty Glass the Liquid MJ", "I went in for Cigars, the selection was terrible! The guy behind the counter was very nice, although he new nothing about the world of Cigars.. The place is..."], "rating": [5, 5, 1], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["bar"], [], []]}
{"id": "SYC-hnWmY_xkuEYs8VIRgw", "text": ["I cannot praise the wonderful ushers and house manager highly enough. I am recovering from serious injuries and walk with a cane. They went out of their way...", "Best little theater around!! There isn't a bad seat in the whole place and music sounds incredible!! Parking can be difficult but if you have a handicap tag...", "I came here to see Bernie Sanders on his book tour.  The Center is gorgeous and organized.  There were plenty of ushers on hand for this sold out event, and..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "pwkq382djGqEC0oKWIHSMg", "text": ["It was perfect.  Mai Tai perfect.   Chicken wings not over done, fried dumplings to die for.  Hansberry beef, General S chicken and fried rice extra egg....", "I will say this. I have had amazing Chinese food in 4 different places...Chinatowns in Boston, NYC, LA, and San Francisco. Those places will have authentic...", "Really large space in dingy unkempt plaza\nThankfully inside does not match the ugly plaza\nVery good service\nWent there for dim sum and was very sad to see..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chicken", "beef", "wings", "egg"], ["chineese"], []]}
{"id": "7Q5-IlxFAycaMx6S2Gapsw", "text": ["I'm new to the area and I have ordered delivery twice now, including an array of different items from the menu. The delivery driver was extremely polite and...", "Stopped in Saturday for lunch and was very surprised how dirty the place had gotten they built a new counter in the main dining room added a ice cream...", "This is actually some pretty good food. The pricing is acceptable and the owner/chef/part time delivery driver is awesome. They will amend things according..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "YOP0IdBIxOd3fgW3PnSsUQ", "text": ["We dined here although small space and Morgan y \n\nExcellent food delivered fast \n\nwill visit again \n\nNice people", "I was never a fan of egg rolls until I tried theirs. Absolutely delicious. I'm also a big fan of their vegetable lo mein and crab rangoons. It's a small...", "It doesn't need to be fancy to be good. This place is very good food, great prices and generally they  don't charge you to substitute. \nFrom m the egg rolls..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.25, 0.61], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["egg"], ["egg"]]}
{"id": "WUfoNQG7Z4AIxE2vZwPNBw", "text": ["I will drive the 15 mins to go get food from them. Portions are great size. Always fresh and good price. They are the best around", "After reading some of the reviews here I hesitated to go try this place out.  This past week, though, my mom and dad and I decided to give it a try.  \n\nI...", "We stopped at Ming Du for take out this past Friday. \nWe went as many friends told us that it is better than the other local Chinese restaurant in town,..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], ["chineese"]]}
{"id": "_DH8qXWulBx-sEdHg6gLVA", "text": ["We ordered crab Rangoon's, chicken fingers, veggie lomein and sesame chicken for takeout tonight and it was delicious! I only wish the lomein was a touch...", "Yuck. We love Chinese food and we try most restaurants. This one had quick service but the rice had a funny flavor, and the 3 luncheon specials were...", "When we moved from East Hampstead, where we ate at Osaka almost every week, we knew we needed to find a new Chinese restaurant that would satisfy our Asian..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["chicken"], ["chineese"], ["chineese"]]}
{"id": "dcN1NLX2Sg5XzMfSkfDBPQ", "text": ["Highly recommend!!! Food was fresh and delicious. We don't live nearby, but would gladly make the drive to visit again.  Friendly, fast service. Restaurant...", "Love the food always good when i come in. Pretty good service and i havnt had a bad meal yet in the 2 years I've been going here.", "There really are no words.... actually there are, but few of them are good. I stopped in for lunch as my fav chinese place happened to be closed that day. I..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], ["chineese", "lunch"]]}
{"id": "kM27XtMUeVZt1lZUcxYqug", "text": ["Loyal customers for 25 years!\n\nMy wife and I have been coming here since before we married. Every great once and a while we end up eating Chinese from...", "I used to order from this place regularly about 2-3 years ago. I moved back into an area where they were convenient, so I decided to order as I remembered...", "Hands down my favorite place to eat in Manchester, NH!!\nLunches are great! Tons of food for a low price!\nThe szechuan green been are my #1 favorite thing..."], "rating": [5, 1, 5], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chineese"], [], []]}
{"id": "cTu5lL2zcXB9BxE8ky1ebQ", "text": ["I was again stunned that in small town New Hampshire that the Chinese food was so good. I enjoyed the food Egg Fu young, General Tso, Shrimp & Broccoli, Won...", "Ordered delivery at work and the food was good.  I have no complaints about the food, it had good flavor, I feel like sometimes Chinese food can be a little...", "Worst food ever no flavor put it this way even my dog didn't eat it horrible waste of money"], "rating": [4, 4, 1], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["chineese", "egg"], ["chineese"], []]}
{"id": "56H_S4CNWDmPk-4A-7_Bxw", "text": ["Lived in many cities and every time it is imperative that you find a go to pizza place, and a go to Chinese place.  After many tries in the Manchester area,...", "FOUND HAIR in the food.  Traveled all day from Vegas to Manchester and just wanted a quick and easy dinner. North Garden looked like it had some different...", "The food is always delicious! We typically order take out but we recently dined in.  The service is friendly and quick!  The items we have enjoyed include:..."], "rating": [4, 1, 5], "TBscore": [0.23, 0.26, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["chineese", "pizza"], ["dinner"], []]}
{"id": "zR0oV0RyLcO4cdDMxTrhUA", "text": ["Traditional 'chinese' menu, sincere young family operating it, about the best 'chinese' food for 40 miles (in my opinion, and I have tried 3 other 'chinese'...", "Had a delicious noodle meal last night. Rice noodles with pork, chicken, shrimp, and bacon. We were told the meal was gluten free. Fast forward a few hours...", "Cashew chicken was just gross.  No sauce, with celery and carrots instead of a well rounded vegetables, semi fried but soggy instead of crispy.  Rice was..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, -0.3], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["chineese"], ["chicken", "gluten"], ["chicken"]]}
{"id": "A5WpAii7ukmx0WDKyo5Erw", "text": ["This place is good\nIt is clean\nThe portions are huge\nPrices are very good\nDefinitely recommend for Chinese take out", "Not a bad choice for Chinese take-out. Great portion sizes, average food, and pretty low prices. Ordered delivery because I had a weird craving for...", "Not great. Large portions for the price but the food was lacking. Fried rice was crunchy and undercooked,  egg drop soup was thin and bland, everything was..."], "rating": [4, 3, 2], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["chineese"], ["chineese"], ["egg"]]}
{"id": "VZtXrE8-FCqsXsA90f-UQw", "text": ["Love this place best in Manchester by far! Good prices and bbq spareribs are excellent.", "Had lunch here, great beef and chicken teriyaki sticks, good boneless spare ribs, good chicken wings!\n\nTasteless pork fried rice (it was crazy, tried...", "The reviews really hyped this place up, but it was less than impressive. We ordered crab rangoon, sesame beef, shrimp and broccoli, and boneless spare ribs...."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.34], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], ["chicken", "beef", "lunch"], ["beef"]]}
{"id": "vCepYB64wnDRjVx1Bye1qg", "text": ["For local Chinese food takeout, Red Star was pretty good. The food seemed fresh and had good flavor.   It's hard to find good Chinese take out in small...", "I've visited Red Star several times and I've always been pleased with their service and their food.\n\nLast evening, I stopped in and ordered take out.  I...", "Red Star Chinese Restaurant is located at the end of a small strip plaza next door to Colonial Cleaners in Contoocook. This is only game in town for Chinese..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "V9AZVLS0lUa9XEPPV_-DmQ", "text": ["We have tried several high rated Chinese restaurants for delivery in the area over the 10 years we've lived here, and Bonsai is by far the best for takeout....", "Done just done wasting my money here ...way to hit or miss, beef teriyaki , dry like beef jerky, chicken fingers, soggy batter with grease. Just terrible,...", "The food is standard and mixed with Chinese or American food so if you have picky eaters it covers two relatively common dining cuisines. Prices are within..."], "rating": [5, 2, 3], "TBscore": [0.25, -0.56, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["chineese"], ["chicken", "beef"], ["american", "chineese"]]}
{"id": "09RqsMoUpD_l_sEUKLtDNA", "text": ["Great Hot and Sour Soup and solid Crab Rangoon's! Perfect on a cold rainy day. Thanks!", "Went here last night for the first time with my bf... The food was delicious... Their boneless spareribs were really tender and fresh, crab rangoon and beef...", "We live in the area and have tried all the Chinese take-out places nearby. This is the one we always go to now. Yes, it's a basic Chinese take out place,..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["beef"], ["chineese"]]}
{"id": "GC9E2XAD_1OmXgzAp186BQ", "text": ["Not bad! Consistently good and fresh takeout.  There is not much else around so happy this is good!\n\nOur weekly order:\n\nPeking ravioli (homemade?)\nBeef...", "I don't understand the obsession with this place. The food really isn't very good and always leaves me sick. It's overpriced for the quality you're getting...", "Pretty good local Resturant.  The food portions are large so think about splitting something.  It is not the facets place in town, but you will enjoy your..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "q6vtcnnX-VKo8fCIcuF1zw", "text": ["This is my favorite place to get chinese food in NH and beyond. Worth driving out of my way to order from here.", "I can't believe how good the food was yesterday!  I always order sweet and sour chicken when we get Chinese.  This was my first trip to May Garden and I...", "Awesome food and always friendly staff.  Highly recommend this place if you want good, tasty Chinese food. Portions are big and the prices are great.  A..."], "rating": [5, 5, 5], "TBscore": [0.27, 0.0, 0.43], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chineese"], ["chicken", "chineese"], ["chineese"]]}
{"id": "2BiZ_NyIXZFriOD8fggyoQ", "text": ["Best Chinese food in New Hampshire, greatest crab rangoons we've ever tasted! Very friendly either over the phone or in person for pick up, and always a...", "Amazing as usual! Crab Rangoon's are so good the vegetables were crisp and not overly greasy. Thank you for making such awesome food!", "I hadn't been in 10 years and I was excited to go back... It looked and smelled amazing. It was anything but. The chicken fingers tasted like they had been..."], "rating": [5, 5, 1], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["chineese"], [], ["chicken"]]}
{"id": "gIsSi-yP6C6llm7KI5mzcQ", "text": ["Singapore Mai Fun is very good usually but last time it had a lot of egg shells in it so we had to throw it out. My suggestion to the cook is to break the...", "I always eat here. Look for the coupon they send in the Value Coupon mailer every month. Food is great. Service has always been exceptional. Easy to get to...", "This place is great! \n\nI'm honestly shocked to see how many negative reviews it has received. I grew up in the suburbs or Boston and have lived in New..."], "rating": [4, 5, 5], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["egg"], [], []]}
{"id": "VCOI4ifo3XYOtDDRVI1C3Q", "text": ["Possibly the most historic and time tested Chinese food place in the Hillsborough west region. \n\nIt's fair prices and great service.\n\nChina gourmet puts the...", "I informed the staff of a food allergy and it didn't help. I don't believe they understand what a food allergy is there.  I was sick all weekend and won't...", "Zero insight into 'the customer experience'.  Aged dining room with well worn tables invites customers to go elsewhere.  Food looked great but had no taste...."], "rating": [5, 1, 2], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["chineese"], [], []]}
{"id": "pwvondL77jUu_ctF9_szAA", "text": ["Part 4 of the Goffstown area Chinese Review\n\nI saved this one for last. I had such low expectations for New Wa Toy - it just looks like such a hole from the...", "The food is good here but I find some of the dishes are a bit overpriced for the actual amount of food you get. $18 for steak kew and I finished it all in...", "My boyfriend and I got some late night take out. 2 stars only because of the hours and prices. Food was okay until I got a bite of pork fried rice that..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["chineese"], ["steak"], []]}
{"id": "uAqSlq3jQolESO-pV6tXTw", "text": ["FANTASTIC Fresh and deliciously cooked food!  Extremely clean restaurant and even better service!\nHIGHLY recommend $5 wing Wednesday's !!\nThe owner Mary is...", "You know you're in another state when you go order something that you normally order it comes out different. I ordered chow mein and which in Los Angeles...", "Ordered late night last weekend, they are the only place open at 11:30 at night in Alton Bay and we were craving \"something\" but didn't know what, and since..."], "rating": [5, 1, 3], "TBscore": [0.49, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["wings"], [], []]}
{"id": "2ufYAYkbdPysxrFfEyWdxQ", "text": ["We have recently moved to Derry and decided to give this little place a try.  Well, we are glad we did. Hong Kong Taste is a diamond in the rough. It does...", "I can't say how the food is because it never arrived! We ordered at 6:30, then called at 7:30 to see where it was. The woman brusquely said the driver had...", "WOW. I moved to NH recently and could not find a place that is good and than i found Hong Kong Taste and it's fantastic. Only place will be ordering from"], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "0vPlkWMHZY4waOw97Hci_A", "text": ["The best throw back asian american food around. The drinks are very good too. Another favorite in my personal book of go too places to eat", "Stop in for a late lunch service was good had the lunch special everything tasted great cooked like it should be no complaints here", "We just moved to the area and this is the WORST food ever! I got home and none of the food was fully cooked. The fried rice smelled and tasted like it was..."], "rating": [5, 5, 1], "TBscore": [0.34, 0.39, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["american"], ["lunch"], []]}
{"id": "1_cFV215bRR0DGkG8FA2Kw", "text": ["Yummy fried appetizers. The crab rangoon and fried shrimp are fabulous and really fresh. The house special rice was also very fresh and had a little bit of...", "The chicken wings were pure salt, the General Gau's was nasty and inedible.  Not ordering from them again.", "Felt like I was walking into an '80's bowling alley converted into a dining room!  Jungle green booth seating in the waiting area...green floors....well,..."], "rating": [4, 1, 3], "TBscore": [0.0, -0.33, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], ["chicken", "wings"], []]}
{"id": "IXT7JJM9bRBrhCwfL3Fb2w", "text": ["This is middle of the road Chinese food. Quick service and has been here forever. Also has great late hours. I guess not much more to say did not exceed...", "Food is mediocre but they give you so darn much of it you have double the amount and an extra meal for the next day- which is what keeps my husband and I...", "recently moved out of town and we will always travel here when we want chinese food. You certainly wont find a better price,amount,or quality.Over the years..."], "rating": [3, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 1.0], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "iDbdYqFhaccHYU6YgvIqcw", "text": ["this restaurant has under new management since 4/2014, foods are great, and the place are cleaned than previous owner, find out yourself to prove i am right.", "I've stopped in at the China Gold Cafe for dinner takeout on two visits over the past few months. This Chinese takeout restaurant is located in the Franklin...", "The General Gao's Chicken is top notch but this place is FILTHY. The salt and pepper shakers are so grimy they stick to your hands, and the bathrooms are..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, -0.21], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], ["chineese", "dinner"], ["chicken"]]}
{"id": "zi9AqYQkzxFfhr7roCVHCg", "text": ["Decided to grab takeout here on a whim after doing some grocery shopping. I ordered the beef with broccoli combination dinner with pork fried rice and an...", "Horrible delivery experience. I ordered online, wrote specific delivery directions, and even called the restaurant to make sure they understood where my...", "While their food may be good, their delivery service is so slow it wrecks everything that could be good.  The average time to get food delivered is 1.5-2.0..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["beef", "dinner"], [], []]}
{"id": "FLFweVJ3b_DlbMtr5rgNbA", "text": ["I really enjoy this restaurant. The food is tasty and you get a lot of it for what you pay. In addition the staff has always been very friendly to me. I...", "This is supposed to be \"fried shrimp\".........shrimp isn't gray. Called back and said that they'd give a single eggroll to make up for it. Then they hung up...", "I ordered delivery from China Wind a few weeks ago. The food was hot when I received it, and the delivery man was very nice. The food was delicious, I..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "7ruPPTb8UC4vT5tdoIa6sA", "text": ["Very quick when taking my order, I didn't have to repeat.  Food was ready on time.  Pretty inexpensive compared to other Chinese restaurants in the area....", "Terrible beyond belief!  Totally rude and rushing us out. Wanton soup was dish water. Greasy like no other. Would not feed leftovers to my dog!\nI'm...", "Order take-out 3;00 PM. Menu states clearly luncheon specials not available after 3:00. So I ask for 2 items from the 'Dinner Combination Specials'. pick up..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chineese"], [], ["dinner"]]}
{"id": "TtkFPyIB05OLd__tSu3yPQ", "text": ["Ok, let me me perfectly clear, if you love an amazing Asian soup, you will be hard pressed to beat Pho Golden Bowl!  There is no soup on the menu that will...", "This was a pretty good Pho place to stop and get dinner on the way back from hiking in NH. I am not really and expert on Pho but I feel like the Pho I used...", "I have never had Pho' before so I am a newbie and relied on the other review when choosing this place \nI was not disappointed. First of all there was enough..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["dinner"], []]}
{"id": "g7e4bRR3FJpfOEszFuVRYg", "text": ["They advertise the General Gau's Chicken as the best in the area- and I would definitely agree with that assessment. \n\nI went in at 2:30 on a Sunday, my...", "Huge issue with communication over the phone. They ended up calling us back three times for my boyfriend to read the credit card information over and over...", "Best General Gau's and egg rolls in Manchester. Ravioli is yummy too. They hand make their sauces instead of the packets. Good food."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.58], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [["chicken"], [], ["egg"]]}
{"id": "ASSbdi0R5F62TL9gxRIUqw", "text": ["Used to get lunch here often - hibachi noodles and miso soup specifically. \n\nWe've tried so many Japanese/Chinese restaurants in the area and this one wins...", "This was a great dining experience. The tea was great, not bitter.   Or too hot. The tempura veggies and shrimp were crispy and delicious. We also enjoyed...", "This place is always lit idc, even tho the service can be slow af in the sit down area. Either way i think this place is better than Masa (which is right..."], "rating": [5, 4, 5], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch"], [], []]}
{"id": "dBfupIKUH-PquF88SKKdWA", "text": ["This is some of the best sushi I have ever eaten. The quality and the variety are great! The service is prompt and friendly. I will definitely be back!", "Out of over 2000+ dining experiences, I have never been treated so poorly by a hostess. \nI was with friends and the female hostess told us it would be a...", "My 2 young daughters and I were excited for the all you can eat sushi. We walked in from the snow - were seated and started selecting our choices. My girls..."], "rating": [5, 1, 1], "TBscore": [0.59, 0.0, 0.24], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["sushi"], [], ["sushi"]]}
{"id": "9uq7-JcV9txvjQfdJunqlg", "text": ["First time bringing my son to this place. He really seemed to like it. He seems to really like the food and vibe of the place. Food was great (as always)...", "We ate here this past Saturday night with some friends.  We called ahead for the hibachi and we were seated within 15 minutes of arriving.\n\nEverything was...", "Have allergies? Avoid Analia!\n\nIt seems this is the only way to shed some light on some very important topics, so people with allergies (and Masa's..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "PHV0nEd0Gj0dXJS4baAMwA", "text": ["Terrible service!!!\nThe restaurant is operated by some rude guys.", "Bar far my favorite mall food court food! I know they have double meat (which I never get) I always ask for double veggies on my #1 white rice :) and extra...", "For mall food, you can do no wrong with this place. Food is fresh and made to order before your eyes. The Teriyaki chicken combo is their best seller and..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], ["bar"], ["chicken"]]}
{"id": "wnDt7P0Ih1170rfq_vIi4g", "text": ["We sat at the bar and enjoyed our time at Canoe a lot! Drink orders were immediately taken and were large fresh strong and perfectly made. An ultimate...", "Pink poodle, smothered and covered filet, cauliflower bake. Everything was well prepared however the service was slow, and our waitress seemed overwelmed by...", "Second visit in as many months, I can't believe I never came here sooner. Good beer list. Great wait staff food was great. Had calamari both times, will..."], "rating": [5, 2, 5], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["bar"], [], []]}
{"id": "G0Jm-GTQP1sVxoHul83x-w", "text": ["So here's an update. 2 years after my original review:\n\nWow! What a change! From giving this buffet a single star, mostly because you're not allowed to go...", "Huge selection.\nGreat as far as buffet food goes. \nWorth the price.\nPolite staff.\nNo complaints.\nEven if you're not too hungry, you won't feel robbed at...", "Half these reviews seem like they are from a completely different restaurant, I'm confused? \n\nNot sure why this place gets such a bad rap for what it is...."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "npqJcDHDX2EaLmPUlClSGQ", "text": ["I'm giving this place 5 stars because you have to look at restaurants contextually. The only slight gripe I have is the fact there's no bun bo hue on the...", "SPECIAL ANNOUNCEMENT \nAfter an amazing two and half years of serving you all, Saigon Noodles will be handing over the reigns to a new management starting...", "I arrived at this restaurant, checked-in, then noticed door was closed and found that the sign closed early. Hummm. Sometimes things happen and have to..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "ni_v5IOYwFfu59mYgbQYCg", "text": ["Our go to place for Korean food and never disappoints. Owner is super friendly. My default is bibimbap. There beef dishes are great too!!!", "Ahhh... once again! What a delicious lunch at the Garden House! Went there with a group of 10 people.\nWelcoming, smiling, very polite staff.\nAppetizers...", "This restaurant is one of the better Korean restaurants in Boston. It's a family run Korean Chinese restaurant with a vast variety of noodle soups, soups,..."], "rating": [5, 5, 5], "TBscore": [0.57, 0.6, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["korean", "beef"], ["lunch"], ["chineese", "korean"]]}
{"id": "2X28ilI-TQ2eFrxyhdbNEA", "text": ["This is my favorite goddam restaurant in New Hampshire, and that ain't hyperbole!  \n\nLet me explain.  Korean food is the best cuisine in the world, and you...", "This place really hot the spot for some good Korean food. The restaurant is not big, so be ready to see a line, but the wait will be worth it. Very good...", "A nice surprise in rural New Hampshire! Affordable, nice (though not amazing) Japanese food and sushi, and good service. The exterior is deteriorating and..."], "rating": [5, 5, 3], "TBscore": [0.56, 0.39, 0.25], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["korean"], ["korean"], ["japanese", "sushi"]]}
{"id": "4rS9ZH1oyTy9s5zS602aGQ", "text": ["Delicious food, best Korean food in the area. This hidden gem is tough to see from the street.\n\nIt's in the plaza directly across the street from the BMW...", "She's Korean Kitchen offers delicious, healthy, authentic Korean food. It is absolutely my favorite restaurant in the area. I literally go to sleep excited...", "This restaurant is a great place to nab your favorite Korean dishes. The menu is not extensive, but I think most of us are happy if we can eat bulgogi or..."], "rating": [5, 5, 5], "TBscore": [0.31, 0.5, 0.52], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["korean"], ["korean"], ["korean"]]}
{"id": "mZnwj9pvj315hKX5HLfGXA", "text": ["Amazing Korean food with a lovely family! Beef Bulgogi was perfectly cooked and seasoned, Pork Gui was tender, flavorful, exactly the amount of heat I...", "The service is extremely slow even after the lunch rush at 2:30 pm on a saturday. Kitchen and dining were having a hard time providing adequate service to 4...", "Horrible food that is overpriced for what it is. Weird interior. No atmosphere. My boyfriend got food poisoning after eating here. he had Udon and the broth..."], "rating": [5, 1, 1], "TBscore": [0.55, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["korean", "beef"], ["lunch"], []]}
{"id": "x-VFp6tPk1RnQDqLuefpMw", "text": ["Perfect!   I have been to many Korean BBQ restaurants all around the world!  And have to say our experience was awesome!  The owner was very attentive.  He...", "This visit was quite good. Maybe it was because there was no one else here on a Monday night. We were sat down and was offered drinks.. The open buffet food...", "Great service！ Great food！About $30 per person Korean BBQ buffet. It is really to find a parking spot. They have Chiness herbal tea call wong lao qi which..."], "rating": [5, 4, 5], "TBscore": [0.79, 0.0, 0.6], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["korean"], [], ["korean"]]}
{"id": "4dvgRlObAs6wt_ZApIAltg", "text": ["Wings, wings, wings......MUST TRY THE WINGS. Never a bad meal. The end.\nOh yeah, the owner is a class act and top-notch at what she does.... (hostess,...", "I learned of this restaurant in a local foodie Facebook group and a friend and I were in the area running errands so decided to try it. \n\nWe arrived via...", "Went in last night for the second time in three months. Both times, the service and food were very different than they had been in past visits over the last..."], "rating": [5, 4, 2], "TBscore": [0.67, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["wings"], [], []]}
{"id": "GXX6xbCK1EBH9X6zJf3wVA", "text": ["Very good lunch.  Salmon manic roll was excellent.   The gobdol bibimbap was great, the sushi was very good.  The veggie udon needed extra steamed veggies,...", "unbelievable slowness in serving for take-out. I almost waited an hour for one simple dish, no one explained that to me m, and saw other people get their...", "Arrived alone on a Thursday evening, the place was not busy yet no one greeted me until after a few minutes. Ok, so the expectation to service was lowered a..."], "rating": [4, 1, 1], "TBscore": [0.72, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["sushi", "lunch"], [], []]}
{"id": "SxbwVNe4eHv-Q4HUQmMJuA", "text": ["Hipster-ish noodles in a small town in Maine?  And they're really good?  That was unexpected.  It's been a while since my visit so I don't really remember...", "Perfect pit-stop between Portland & Boston! Highly recommend if you're looking for some dishes that'll warm you up\n\nVietnamese Caramel Maine Wings were a...", "This place was the Bomb! The Boa Buns were so yummy and soft! They have a great wine and beer section. My husband has the Spicy Miso Raman and it was..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.59, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["wings"], []]}
{"id": "F4L1py7ePcxBpaPedn9hXw", "text": ["Taste:5\nPresentation:5\nValue:3\nService:5\nOverall:4.5\n\nTaste- we ordered \nhalf and half wings \nOnion rings \n2 fries \nHalf and half Pot stickers \n3 Chicken...", "Not all Bonchons are created equally. You must internalize this and recognize that the Lowell one is DEFINITELY on a yummy class of its own! \n\nI've been to...", "They should call this magic chicken. Because I had an absolute magical experience with it. \nThe service was good from our waitress Jen. She was very..."], "rating": [5, 5, 4], "TBscore": [-0.25, 0.0, 0.25], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["wings", "chicken"], [], ["chicken"]]}
{"id": "TiQ35k1AxJsv6E--OYOjXg", "text": ["Wow! This was surprising! \nIt's a small place just outside of downtown. It seats about 30 comfortably. It almot has a hole in the wall type feel but is...", "Found this place and was very skeptical about it. Ordered Bibimpab which was great and flat noodles. Flat noodles were ok, not Asian though and not spicy at...", "So long story short was stuck in the area and was starving!!! \nStopped at this small 10 table spot, now we had some reservations mainly because of the..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "62IM6tjXVNq2vRB_2UOc0A", "text": ["Had a great sushi lunch here.  The platter was chefs choice and I felt like he/she gave me the most of his best stuff rather than offloading anything.  It...", "TL;DR\nStick to the Japanese cuisine and you cannot go wrong. I wish I ordered the tempura dinner. Be prepared to wait for your food. Customer service is...", "We have been eating here for over 20 years and this is one of our \"go to...\" restaurants. The food is really good and the service is excellent. My favorites..."], "rating": [5, 3, 5], "TBscore": [0.77, -0.25, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["lunch", "sushi"], ["japanese", "dinner"], []]}
{"id": "smtTgk8S5RLBxqQx59DHqw", "text": ["Nomads is amazing! What a great addition to Durham. The food is delicious, the price is great, and it's so easy to order quickly to go or get a bowl and a...", "Good beer list. Average food. If you are serving rice bowls, the sauce and vegetables should be warm. Cold veggies mixed with warm rice and chicken is not a...", "Nice addition to Durham's restaurants for vegans, vegetarians, and carnivores. It fills a gap for those who want fresh, tasty, and especially healthful at a..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "8AcB-Asg8c_AgpievMVe7Q", "text": ["Delicious, fresh sushi every time! We've never been disappointed by Yoshimama. While the restaurant itself is on the smaller side, we usually don't have any...", "I was a fan of this resturant but really disappointed with the service and treatment ... \n\nFood wise I would still give it a 5* . It's the service that was...", "Unimpressed\n\nThe low-carb menu is gone.\n\nThe dishes are extremely overpriced. His beef teriyaki plate was $21. \n\nThe \"service\" is ridiculous. We had our..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, -0.23], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["sushi"], [], ["beef"]]}
{"id": "k34gdsHgCq4QELQDydFSMg", "text": ["Spicy tuna roll was on point. Very friendly. Nice  dining room good atmosphere.  Would deffinately come back", "There is no other sushi for miles. This sushi is slightly above average. Perfect combination for a successful restaurant.", "I was slightly skeptical to try Japanese cuisine in Claremont but was so very pleasantly surprised after our recent experience with the Hibachi. We enjoyed..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.33, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["sushi"], ["japanese"]]}
{"id": "C0h84wEZV4vi_qrlxwD_3Q", "text": ["Crazy Noodle might be my favorite Asian restaurant in the area! I've been here a few times now, and I'm never disappointed! \n\nI've had their drunken noodles...", "I'm in love with this place. The people are kind and helpful. The food is amazing. Bird on a Wire appetizer is so fun and yummy. I had a coconut curry soup...", "I love their pho with beef. It's my favorite and hard to find good pho in NH. Their garlic noodles with chicken is also very good. Definitely worth giving..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["chicken", "beef"]]}
{"id": "jDfzTU6-bwI9DzltaModsw", "text": ["We enjoyed our meal & the price was right too. It's not really a Japanese Steakhouse, but the variety is good. I had grilled pork chops w apples & the pork...", "Iove the food here but there was  a huge issue at the bar tonite. DAWN the bartender And her co worker seemed miserable i watched,as,patron after patron...", "I went for my first time to the Bridgewater Inn and was so excited as I had heard good things about the food. My dinner companion had been there many times..."], "rating": [4, 1, 1], "TBscore": [0.37, -0.3, 0.46], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["japanese"], ["bar"], ["dinner"]]}
{"id": "p-sDdinIW6eWlROHww4wOQ", "text": ["Always an incredible experience at Shio. We came up from Boston to celebrate an anniversary on a Friday night. While we couldn't reserve a tatami room for...", "Best sushi on the NH Seacoast!!! For salmon lovers the Lanni Roll is a must and I am absolutely obsessed with the Tuna Avocado Salad!!\n\nYou may want to...", "This place is under new ownership \nThey have no clue\nI am a professional diner and I understand that sat at 645 can be tough \nNot until 745 did I finally..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["sushi"], []]}
{"id": "SE2hdJ5KV5aUtqhkbyJwYA", "text": ["Love this place.  The food, atmosphere and staff are amazing.  The place is very modern and the staff are always conversing with you.  Best Asian food in...", "Delicious & large menu. Great offerings and very attentive/good server. A little overpriced, but, hey it's Andover...\n\nThe sushi yacht was worth the experience!", "Great atmosphere, friendly, pleasant waitstaff, and good live entertainment. This was the first visit for my wife and I. We really enjoyed the Mongolian..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["sushi"], []]}
{"id": "j4zQeH1m7NtyWiRbk_dzog", "text": ["Always love coming here, they have great creative rolls and decent prices. NY roll is a favorite of mine because of the generous amount of fish. Rock shrimp...", "PROS: Small, quiet, pleasant ambiance with comfortable booths, low lighting. Location is easy access, right off Drum Hill Road. Free parking in restaurant...", "We have been coming here for few times now, they have such a nice ambience and low key atmosphere, a small restaurant but nice for family or couples that..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "3ZY2gpvYaoNWUm6MGxrXBg", "text": ["Tokyo Express is the best place for take out in town.  The absolute best avocado boat with salmon that consistently is fresh. They call this place \"express\"...", "I've dined at every restaurant in Keene now and this one stands above the rest. Absolutely delicious food and good prices. 5 star presentation and perfect...", "I am actually very impressed by this place. For Keene standard, it's basically 5 stars, everywhere else, 4. It's the only decent restaurant in Keene that I..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "3D3sb3MC78LDK1VAx2CJKg", "text": ["Do you ever find times when a DIAMOND can be found just about anywhere?  well this is one of those times.  Taking a stroll around the lake today the...", "Made a reservation for 7:15 with kind girl on the phone. Showed up 7 mins before res and were told to wait. Older couple comes in and looking to also get a...", "Stopped in for a late lunch yesterday around 2:00. The place was more crowded than usual for that hour, maybe because Canoe was closed. They were short..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "eCk3BWsOWJ5rU3abagZn1w", "text": ["Regarding Take-Out:\nWhat a hidden gem.  I limit myself to stopping once/week but between the wine, desserts and freshly made take home meals, it doesn't get...", "I have been driving by this place for years and had never stopped.  I heard somewhere that it was bit pretentious and over priced, but the parking lot was...", "Tripping published one of the most profound and paramount online articles known to man in May 2017: \"America The Beautiful Series: The Best Chocolate Chip..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "ItJqqH3bbZdoCkn4YSDZJQ", "text": ["This is by far the best sushi place in the area - if not within 30 miles.   I would give this 6 stars!!   They have a very extensive menu for sushi with a...", "This place is one of my all time favorites. The sushi is fresh and amazing. The soups are tasty and soul satisfying. Every dish I have had there has left me...", "Finally!!!!! I found good Korean food since moving to Andover from LA! The Bibimbap was so good. My husband said the sashimi was great. We found our new..."], "rating": [5, 5, 5], "TBscore": [0.37, 0.35, 0.5], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sushi"], ["sushi"], ["korean"]]}
{"id": "wHTuwK5kpVoAbw91kIB96Q", "text": ["Fantastic food. Pure and simple. Ordered the banh mi and curry fries. Both of them were delicious. \n\nI will be coming here for lunch anytime I'm in Portsmouth", "This is an amazing place. I have tried almost everything on the menu and EVERYTHING is sheer perfection.\nI love the comfortable and funky decor. This place...", "I have been to Street a couple of times; once for dinner and once for brunch. One of my favorite things about Street is that it is in a shopping plaza,..."], "rating": [5, 5, 4], "TBscore": [0.4, 0.0, 0.5], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["lunch"], [], ["brunch", "dinner"]]}
{"id": "NjgRAiIBIibt8F34KwlMgw", "text": ["The staff is amazing and work very diligently to make every order come out perfect! The atmosphere gives you that \" i don't want to leave, lets stay 5 more...", "4/5\n\nThe concept of this place is unique and I was very excited to come here based on the Yelp reviews. We got the 4 flavor eggroll sampler plate (Crab...", "Went here due to reviews but was disappointed. Ordered 2 salads, a soup, and an eggroll sampler. Egg roll sampler was okay, but super greasy. We ordered the..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], ["egg"]]}
{"id": "HimpcgiPCApYIP6i9LFwcw", "text": ["Good food good service cozy ambience!\nWe have been here twice and both times had a good experience. We ordered basil fried rice with chicken, green curry ,...", "I have been coming to this place for the last three years. It is progressively getting worse and worse.\n\nFirst of all, they have an HVAC problem that they...", "Delicious food and excellent service. This place literally brought us back to life after a seriously celebratory night before. I had Thai iced coffee, Tom..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["chicken"], [], []]}
{"id": "T_sEn9XIRhdCY4w_g5X3fw", "text": ["We came here for lunch and it was delicious. Four adults and two children - everyone was happy with their meals - we all left full! We ordered the vegetable...", "Update: My previous visits where I ordered from the kitchen menu was disappointing (only worth one star), but apparently this place has several...", "Everyone we interacted with were very nice. We had a great time watching the chef cook our hibachi dinner, he was very funny."], "rating": [4, 2, 4], "TBscore": [0.56, 0.0, 0.64], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["lunch"], [], ["dinner"]]}
{"id": "TE3cLR1V-hBn_a9vrr4suQ", "text": ["My first visit here was great.  For a Chinese dish i've  been making for years, I realized I'd been using the wrong hot bean paste, (Korean).  The woman...", "On 2 Nov I placed an order for 6 small bottles of Pantai sweet and sour sauce, which might be out of production and unavailable.  However, Lanna Asian...", "I've been meaning to check out Lanna Asian Market but they never seem to be open when I stop by...even when they are supposed to be open. I wrote them a..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["chineese", "korean"], [], []]}
{"id": "qxboz_9Zl5MNnw9btFNwjw", "text": ["This place has really great food! We asked the server what is good here and she said everything. I think all servers are supposed to say that; but she was...", "Sloooooow service but great diverse menu for pub fare and cuisine. Could use some more gluten free options like a roll to enjoy a non meat burger. \nAlso...", "The two stars is a gift... Willy's \"they way life shouldn't be\". \n\nThe server we had screwed up \"everything\" we ordered from the wrong margaritas to..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], ["gluten", "burger"], []]}
{"id": "eBz80K-aSKID-Cg3k7332Q", "text": ["I love their food so much! I ordered delivery 2 days in a row! Very authentic Thai dishes and very hard to come by in the area. A bit pricey but I don't...", "My friend and I drove by here while visiting the area looking at a potential condo, and decided we would give it a shot. When we entered, the restaurant was...", "Hokkaido has all the makings of being an awesome karaoke spot but there are definitely some kinks that need to get worked out. I'm not trying to be picky, I..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "Ue8tUM0Ny7PAvl2gkhYfDA", "text": ["I'm perplexed as to why a Japanese restaurant is called Thyme. As far as I know thyme isn't used in Japanese cuisine, but I digress.\n\nThis is a great place...", "Absolutely phenomenal! I order take out at least once a week for lunch and let me tell you, it's delicious. I'm a sushi lover and I've been to a lot of...", "Great spot in North Andover for sushi and all around Japanese food. One misstep I noticed was the salad that came with our meals was extremely dressed with..."], "rating": [4, 5, 4], "TBscore": [0.26, 0.44, 0.23], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["japanese"], ["sushi", "lunch"], ["japanese", "sushi"]]}
{"id": "8eszwdezrljG6ugj-MwRnQ", "text": ["Sakura Asian Bistro is an Asian Fusion restaurant that serves Chinese, Japanese, Korean, and Thai fare. We have witnessed that it's a great place to...", "High Error Rate and Poor Practices of Food Handling\n\nI was frustrated at the markably high level of errors that were made on orders.  Over half the time I...", "This place was a surprise find! Amazing inside decor and ambience. It was our first time visiting here. We ordered Mermaid roll and the OMG roll, as well as..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [["chineese", "korean", "japanese"], [], []]}
{"id": "euLNgTw2N0UKOBYOyku4zg", "text": ["I get to go at least once a month for sushi. The place is always clean and service is friendly. I have been going here for the last two years. It is the...", "I went in right at 11. The place was clean enough, it doesn't look like they did much since it was West Lake back in the day. The server looked to be the...", "We ordered take out on New Year's Day. Everyone was helpful. Price was fair as we're servings. Our order was ready in 30 minutes. As for complainer about..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["sushi"], [], []]}
{"id": "DtyvYlJSh3Oa5L3BwakB8Q", "text": ["YAAAASS, Wingstop has made it's way up to New Hampshire! Wingstop has always been my favorite place to get wings. I moved up here from the south almost a...", "I really wanted to like this place but booooo. \nWings are tiny, like where's the meat tiny, see picture. And the seasoning is just okay. I also don't like...", "So, we've gone about 5 times hoping it would get better. It has not. It's so disappointing. Especially, if you have such a small window for lunch sometimes...."], "rating": [3, 2, 1], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["wings"], [], ["lunch"]]}
{"id": "usP9czUkDGcyC7CSseiMdw", "text": ["As promised, I revisited the Shuck Truck to try some of their other offerings. This time I went with the Haddock Chowder and Fish and Chips.\n \nThe chowder...", "Julia did an exceptional job on my custom wedding cake- staying true to my vision of simple elegance! Thanks for everything! Xoxo-Lisa & Ray", "When days after your meal and you're still daydreaming about that lobster grilled cheese, then you know IT'S THAT GOOD!  \n\nSo, we were lucky enough to check..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], ["cake"], []]}
{"id": "8E5IFXZBoVjTU_UCq1C2og", "text": ["The food is good, better than many places, service is good... I love Thai food, and won't claim that it's the best Thai food I ever, but still better than...", "I am picky about Thai, very picky. The menu here is extensive, almost too extensive. Came here for lunch with 8 people (we had a reservation) and the...", "We ordered for the three of us tonight a variety of dishes containing vegetables and chicken--about $50 in entrees. Unfortunately, the vegetables used in..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], ["lunch"], []]}
{"id": "yApgAG1H1IX3p-MGcIeJaw", "text": ["Friendly, touch of and island in Mts of VT! Delicious Cajun sauce and crab cakes. Thank you, Chef Brad and staff!", "It is ok. Slightly overpriced. Nothing special though besides quirky school bus and ordering station outside.\n\nOverall not a bad experience but I won't come...", "Deliciousness outside. We had the Asian BBQ Pork with Coconut Slaw and Crab with Tartar - but you can have an assortment of \"crazy\" condiments to go with..."], "rating": [5, 2, 5], "TBscore": [0.73, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["cake"], [], []]}
{"id": "6K-SrwQgZKJ09qggPzvATg", "text": ["The food is great, and the scenery is beautiful.  There is a fish pond inside the restaurant which looks so cool.", "We have been going to Takumi for years and we loved it until past Sunday. I called to order to go which we have done many times. I warned a few times that...", "I came to this location very excited but left with much more disappointment than expected. The chef seemed to be in a rush and even kept food he cooked for..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "f8ac3S36RE-Rxefc2ugc0A", "text": ["Review for Take out : \n\nI typically avoid Chinese/Japanese restaurants in smaller town because by my experience the flavor is generally lacking and the...", "Alan Yang/Jade Palace was found guilty of serving alcohol to yet another minor yesterday at the Rockingham District Court. That 20 year old minor was my son...", "I used to LOVE this place. Sushi was good quality, service excellent. \nWe haven't ordered from them in probably 6-8 months and recently did. \nThe fish was..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.55], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["sushi"]]}
{"id": "pH9JaLak12-TOT7vUx1cvw", "text": ["One of my favorite sushi restaurants in the area. The staff is always so friendly and welcoming. \n\nMy friend and I grabbed a table for 2 sans reservation on...", "This place is so delicious! They have such great lunch deals and the menu has lots of variety. We started with the shrimp tempura which was so light and...", "What a pleasant surprise! Didn't quite know what to expect from this tiny restaurant tucked in this tiny shopping plaza but it was really really good!!!..."], "rating": [5, 5, 5], "TBscore": [0.44, 0.55, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sushi"], ["lunch"], []]}
{"id": "_cA42by_rHOuRjVVprV2zQ", "text": ["Came here with hubby for our belated valentines dinner.\ndesided to try out this hibachi style..for the first time\n we enjoyed it very much especially being...", "Very good food! Service was a little slow so order your drinks as your sitting. We had plenty of room to eat not all squished together! We recommend eating...", "Started with Sushi Appetizer Boston Roll It was Excellent. Our Cook was fantastic! Very entertaining and was Pak he best part of the meal. Talent humor good..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.77], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["sushi"]]}
{"id": "3v1Om6C9cSeSuYmC7U_74A", "text": ["My dad recommended this place because they have $7.99 buffet specials on Mondays and Wednesdays.  Sometimes, price isn't everything.  While the price is...", "If you want cold crappy buffet food this is the place to be. I came here a few years ago for lunch and it was decent.  Came in at 11:30am and you'd think...", "The food here is absolutely disgusting there food is cold and the manager is extremely rude i would rather eat in a fast food place then eat here if i could..."], "rating": [2, 2, 1], "TBscore": [0.0, -0.21, 0.0], "normalisedRating": [-0.2, -0.2, -0.6], "keywords": [[], ["lunch"], []]}
{"id": "kpXD19sNwvEumdYnzBESZQ", "text": ["We love Taj India. Never a bad experience. Get the samosa and chicken vindaloo!!", "Recently, I was at work and unable to leave my post so I decided to order dinner... I called Taj India to order... and they said \"use the website\" and hung...", "Very good and very easy to order on line. My wife and I love Indian and we both thought the food was terrific!"], "rating": [5, 3, 5], "TBscore": [0.0, -0.25, 0.49], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["chicken", "indian"], ["indian", "dinner"], ["indian"]]}
{"id": "eil99eF5vzKTdcwiYykdug", "text": ["We stopped here on the way back from hiking in the White mountains. \n\nI was driving so my S.O. picked a place and put in it Google maps and I just followed...", "Wow it was delicious!\nWe got 2 Nepal dishes, chicken bbq and goat curry. I really liked both, especially chicken with Masala sauce. Creamy, spicy, and fits...", "This place is pretty good. The lunch buffet is nice and the portion sizes in general are huge. A ton of great vegetarian options. Compared to other Indian..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["chicken"], ["indian", "lunch"]]}
{"id": "AuOJnyK2dDQn52nmPv4d6Q", "text": ["I finally tried this gem of a restaurant for takeout. The food is absolutely delicious! The portions are huge. I was unexpectedly blown away by the flavor...", "I really felt , the food here is more authentic than any other Indian restaurant around 50 miles. I am a vegetarian and this has variety of choices compared...", "I'm not indian or vegetarian, but my friends are and I'm not going to lie, I love this place. I really don't mind being vegetarian for the day. Of course..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.27, 0.35], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["indian"], ["indian"]]}
{"id": "ygNchPgHnpcxpgpLxGsTdg", "text": ["Wife and I on a few occasions a year we are in Manchester together sometimes stop in for Indian buffet lunch.  Manchester has at least three restaurants...", "Great food. Each and every time I eat in Royal India, I love their food, everything is homemade. You must try this restaurant authentic food. Hands down,...", "This was an excellent Indian restaurant. The food was amazing and full filling. The waiter was super kind. They gave us extra food for free. The food and..."], "rating": [5, 5, 5], "TBscore": [-0.25, 0.41, 0.47], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["indian", "lunch"], ["indian"], ["indian"]]}
{"id": "2-JG4Lm6J6tahe6_7tUPFw", "text": ["We ordered delivery and every single dish that we ordered was phenomenal. Incredible flavors, beautiful spices, and fresh ingredients. So impressed and this...", "This is a little nondescript spot that is also connected to a small ethnic grocery.  This initially was a cause for concern.\n\nThen I remembered, hey, I'm...", "A small family owned business with excellent middle eastern food/kabob.  Very pleased with the chicken tika masala. Will definitely be back for more"], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["chicken"]]}
{"id": "pUiRihZSfBCx9DdR4W5fqA", "text": ["This place was exemplary in the taste of food category. The place is kind of small. A very hometown small mountain town feel.  The lamb Momo and veggie Momo...", "A friend highly recommended the dumplings (or momos) here, so we had to check Cafe Momo out! I'm a huge dumpling fan, so I was excited to see if Cafe Momo...", "Sadly, this restaurant that I've raved about for years, left a five star review for in 2013, and have taken countless guests to over the years has taken a..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "3udYQq9sG1Z2E5q_N6nVZA", "text": ["I thought they closed last year, but they just moved over one unit in the complex and the store is a bit smaller.  Still a good selection, but much less...", "It was fun looking at all the Middle Eastern foods. I bought a bottle of orange blossom water, and I will be back.", "I would highly recommend this store for anyone looking to buy middle eastern food products! The selection is great, the location is convenient and the..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "shAco1CsEeuRLFKTgBM5Vg", "text": ["Went here on my 21st birthday last week after the first place we went to was not so fun! I went with my aunt and my cousin, and a couple friends who are...", "5 stars  \n\nFor their drinks. Never had a problem with their drinks here! Great place to hear drunk folks do karaoke", "I n a freind went aroud 8 pm for buffet gross gross dry food made us sick. Chicken wings only thing i liked wont go back"], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], ["chicken", "wings"]]}
{"id": "ehW0YrEKo-_NUn2Mh3Y7HQ", "text": ["We couldn't have been happier with Celebrations for our wedding catering. Fred and Becky were wonderful to work with and they worked so hard to find an...", "Celebrations catered our wedding recently - BBQ rehearsal dinner, passed apps for cocktail hour, and a buffet for the reception. They were really kind and...", "We had an Instant Buffet at our house for 25 guests and it was delicious and very easy to coordinate. Coordinating the menu was done by email. They were..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["dinner"], []]}
