{"id": "FL15KlncOdUVlaM9i4BuPg", "text": ["I stopped here on a whim, passing through town after getting gas for road trip. I was pleasantly surprised at how fun and good the sandwiches were! You walk...", "Ordered bahn mi, very good except for the very thick cut jalapenos which made it extremely spicey. The jalapenos need to be cut thinner!!! Fiance ordered...", "In the world of sandwiches, stalwarts like Potbelly's, Quiznos, Subway etc have a worthy competitor - Which Wich's. The location is nice and share parking..."], "rating": [5, 3, 4], "TBscore": [0.42, 0.0, 0.47], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["sandwich"], [], ["sandwich"]]}
{"id": "BrOS83SoNHiDzhN1BofkaA", "text": ["Of all the Jimmy John's in town, I would say this is one of my favorites. They really do live up to the standard of \"freaky fast\" at this location. And...", "I stop in here when I forget my lunch or just am craving a good sandwich! Especially the beach club!! They are super freaky fast here which is a plus since...", "I love Jimmy John's.  It serves some of the best cold subs around.  Prices for a slim are $3.79 if you don't like vegetables and regular subs are $4.79 for..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["lunch", "sandwich"], []]}
{"id": "zLn8f4ChnmKU_n5baKfbTQ", "text": ["We were here for patio drinks after dinner on a Sunday. They happen to be closing early, presumably for a staff meeting, so we felt a little rushed but the...", "I'm going to start this by emphasizing that I very rarely feel strong enough to write a negative review but I have hit my limit. I have been going to Saints...", "The meal was exquisite, one of the best burgers around town. However it was a little small for the price and I was not fully filled. Would recommend to a..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.39], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["dinner"], [], ["burger"]]}
{"id": "xTQ0GXKmogup1itvbTf_jQ", "text": ["The \"steak nachos\" were actually hamburger meat nachos and I'm not convinced the chips were house made as described. They covered it in processed nacho...", "We stayed at the Ramada hotel that this restaurant is located in...wrote a separate review for the hotel.   We did not have dinner here at castaways, only...", "We had great service here! Food was pretty good too, if you're staying at the hotel it's not a bad idea to give this place a try."], "rating": [3, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.2], "keywords": [["hamburger", "steak"], ["dinner"], []]}
{"id": "rnW7P5le2AJ4U2x3XkOc7w", "text": ["We came here thinking this was a self service type of establishment so we were pleasantly surprised to see a hostess and servers waiting on us to seat us...", "After a couple visits, I'd say this place is definitively worth trying out. The beef is high quality, just like the ones you can buy at Hy-Vee. Recipes are...", "Very fresh ingredients. Best burger pickles I've had. People have complained about price but they probably eat a lot of cheap McDonalds burgers so I..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.23, 0.37], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["beef"], ["burger"]]}
{"id": "auukq6uwCMLPeKNTgaBYVg", "text": ["First off, when I saw the truck with the name, Deez Greenz I thought oh boy big Dr. Dre fan.. Cool by me! As long as the food was nothing but a G thang...", "Wow, for $8, this salad was NO WHERE NEAR being worth it. It's not the worst salad I've ever had but for $8? No. I gave this place three stars for its use...", "Pretty decent food from a food truck.  The truffle fries were ok; the blue burger was tasty; the coleslaw was......coleslaw.  Overall they do a fine job."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["burger"]]}
{"id": "1KgiGFQbTOKTq8FhaCVztw", "text": ["This place is AWESOME! Would have never knew it existed if it wasn't for a friend who told me to pay attention to their random hotdog light on their front...", "Visit a late night hot dog place with a vegan menu? Yes ma'am! Don't mind if I do! It's located in the same space as Krunkwich Ramen Shop. It turns into the...", "Any place that plays Black Sabbath War Pigs can't be bad. \n\nWe didn't get here till around midnight.  Late for me, early for them. I had to wait around for..."], "rating": [5, 4, 4], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["hotdog"], [], []]}
{"id": "kXFaC4ZdnE1gOb-p37LJdQ", "text": ["George The Chili King is a Des Moines institution, but somehow one of the restaurants on our list that we never got around to visiting. That changed this...", "So... we were in town for the State Fair and we happened to pass by.  Since we knew it had been featured on Diners, Drive In's, and Dives we figured it must...", "Of course there was a crazy rain storm when we drove in!  We opted to eat at the counter inside and were thankful for the covered drive in spots to help us..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "nbginlHaROhSdQ5nOHUqqA", "text": ["Everything I tried was fantastic! Loved my Gyro. It was super fast too. A little pricey, but you get A LOT of food.", "The gf and I stopped by Ted's West yesterday for lunch the other day. She got the coney basket and I got the tenderloin with chili and cheese basket. \n\nWith...", "Since the Chicago Dog on Douglas closed and they only have the University location open now, I wanted to find a place closer that offered something like it...."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "xCzj0QmExd5H8OXxvvWkIA", "text": ["I used to come in once a week. The clam chowder I got tonight was very good, hot and fresh. Friendly staff. Very family friendly. Plenty of parking. Clean....", "One of my fondest memories as a child was my dad saying who wants to go to A&W so all six of us would pile into the '58 ford station wagon and a carhop...", "Terrible service. It took three people to take a three drink order. \n\nFirst person couldn't understand that the menu lists medium drinks as \"Regular\" size,..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "2Xyvn3C_QbtYifwWnT0aYQ", "text": ["The Duck Blind! This place needs to never go away!  Haven't been here in years and the bar tender treated me like a regular. Old school local bar, make your...", "Terrible! Just wanted to watch a game. Waitress couldnt be bothered with us. We were the only table there  she was busy sitting at the bar w her pal....", "It's an old-school shut a beer bar from the 70s I'm sure the sports thing is cool. it's okay with the TV and stuff. the bartender was great very nice polite..."], "rating": [5, 1, 3], "TBscore": [0.0, -0.32, 0.59], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "0E22-KFqGaSAacW3XlxEaw", "text": ["I am addicted to Culver frozen custard.\nI am happy every time we swing by. I have a chocolate cone each time. It's so easy and simple. \nIt's a quick trip...", "As usual the service was excellent and I didn't have to wait long for the food.  However, I found out why the food was out to our table so quickly!  The...", "The food is standard Culver's quality - yummy burgers and decadent desserts - and the store was nice and clean, but they struggle with customer service. It..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.32], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], ["burger"]]}
{"id": "C9sluC2XxCiqw5dPeScREg", "text": ["This place is so good. They have the quality of the ingersoll location with full bar service. They let us divide our toppings on the two topping pizza, so...", "Great place for lunch on a weekday, hard to find! It's where Limeys (?) used to be. Near the back door of the chicken coop. I had the Reuben my husband had...", "Tucked into the Hyvee strip center and occupying the old Limey's bar is Manhattan Grill.  Menu is diverse with some tweaks on the standard bar fare.  I had..."], "rating": [5, 4, 4], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar", "pizza"], ["lunch", "chicken"], ["bar"]]}
{"id": "jzz1Jst2-XF8HBubxLN4oQ", "text": ["Been going to DQ's my whole life and have so many found memories of summer fun, while traveling in Minnesota to DQ's..\nNow that I'm vegan maybe it's a bit...", "They have great Hot dogs and Ice Cream. Friendly service and always clean. A great young business person as operator.", "Came here for the free first day of spring ice cream cone!\nAwesome service every time we come here. \n\nWhen DQ gives free ice cream out, this location is..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "vDnwefHiV542wEvg-fEihw", "text": ["Went here for dinner and enjoyed the food. I got a salmon pesto burger with sweet potato fries. People in my party got the blazin burger, get fit cali wrap...", "Three of us went on Mother's Day for lunch - it was OK, but I really wanted to like it more. We often try to eat healthy and they do offer a number of...", "Grateful for a Whole 30 menu! We tried 2 of the bowls, salmon with sunflower seeds and green curry chicken. Both served over cauliflower rice. \n\nThe green..."], "rating": [4, 3, 3], "TBscore": [0.42, 0.42, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["dinner", "burger"], ["lunch"], ["chicken"]]}
{"id": "aAbU_7M3_zr7W7oSfORFvA", "text": ["Man I LOVE Culver's.\nIf I am in a town with one, I will always stop. \nI got the roast beef and the chopped steak dinners.\nBoth were just amazing for a fast...", "I've been to several Culver's locations and they are quite reliable and consistent and I have been to this location at least 3 separate times. But this...", "Two stars for food. Zero for service. \nGirl at window wouldn't listen to my order kept. Talked to others while I was ordering and very rude when i paid"], "rating": [5, 1, 2], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["beef", "steak"], [], []]}
{"id": "HLNxMNxKvBL7QDSXoQdnkw", "text": ["Service and guys have always been top of the line for me. Saw they had a low rating and don't agree with that at all. I would highly recommend the Ankeny...", "Five Guys is clean and moves like a well oiled machine. Place order, get receipt, wait for your number to be called. Here's my take. I love cheeseburgers...", "In my opinion, the best \"fast food\" burger place in Des Moines. \nThe \"little\" cheeseburger and fries are actually just normal sized. \nIt's a little more..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.21], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], ["burger"]]}
{"id": "jyzTm7YjbZ49LRW9tElFtg", "text": ["With this being 1 of 2 Sonics left in Iowa, it's kind of hard now to hold it high on a pedestal. LOVE the drink options!! Strawberry limeade is my favorite...", "I used to go to Sonic all the time when I lived in AZ, and they were every where! Finally was passing this area and stopped by! We sat outside at a table...", "I swung by during lunch as I had a text coupon for some breakfast burritos that I wanted to use. I decided to use the drive-thru. When I was explaining to..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["lunch", "breakfast"]]}
{"id": "o0Bo5oINGBd_MWLR3pA_2g", "text": ["For a fast food joint this place is awesome! Love the grilled chicken cashew chicken salad with French dressing ! The salad is huge and filling ! I also...", "Came in just shy of 9PM. We were the ONLY customers inside. We waited for over 5 min watching several staff sweeping, stocking, etc. I finally asked for...", "It should've been a red flag when my food was ready by the time I got to the pay window (there were no cars ahead of me). Burger was cold and sloppily made...."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chicken"], [], ["burger"]]}
{"id": "XRmvhAnMXMtGjFINf27a0g", "text": ["Food was good, I enjoyed every bite. But with the inflated and high priced for FAST food it should be perfect. Perfect it is not....", "Cait and I have never been here before, so after 2+ hours of grocery shopping, we decided to stop here and have lunch. If you've never been there, a little...", "Stopped in for first time Friday night about 9pm. Cashier was not friendly and seemed to be inconvenienced. Offered no sugesstions and just stared awkwardly..."], "rating": [3, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "4ujDwiek_48n2Q4NzJb6zA", "text": ["I tried their fish sandwich for the first time. I was not impressed. The little hoagie roll was a little sweet and who the heck puts pickles a batter dipped...", "Have always loved the batter-dipped fish here.  Not sure if its worth an eleven minute wait.  They have some kind of new rewards program...I asked the girl...", "Long John Silvers on Douglas in Urbandale should be attended by self-service kiosks.  I pulled up to the drive-thru and when it was my turn I told the order..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["sandwich"], [], []]}
{"id": "lO1CyasBCwKj6UtSD3F2IA", "text": ["This is a fantastic place!! I have eaten at \"B--Dubs\" across the country and we just moved to West Des Moines a couple weeks ago...this place had the best...", "I sadly keep returning to BWW locations like this one solely for convenience reasons: location and being open.\n\nFirst of all, I hate the separate food...", "Avoid this place. Absolutely horrible. I ordered from the Yelp app, delivery by GrubHub. I ordered at 5:16 PM, notice said 40-50 minutes, then estimated..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "i5BhFD2dTV2pkMT8ICnOWQ", "text": ["We stopped by here on a weekend  late afternoon. We had a table of 4 and were seated right away. Happily we had the bubbliest server in the place. He was...", "Wings are okay. Plenty of other wing places in Ankeny that are fresh not frozen. The service is good. Tons of tvs to watch games. They are usually super...", "I have ordered from this location a few times and mostly the service is pretty good. Occasionally, I will order from the app on my phone and it will give me..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.34, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["wings"], []]}
{"id": "GHQci1gNW-6r4rq6CbvhoQ", "text": ["Great pizza. Go on sundays and get the 2 for 20 deal..great party room. Rented it for me and my wife's 50th birthday party as well as my son's 18th...", "We enjoy going here every Tuesday  for karaoke night! It's like one big family coming in to eat, sing, and enjoy hearing others sing! The karaoke hostess is...", "Underwhelming to say the least.  Facility itself is not terrible, plenty of tvs and some bar games, but the food was terrible. Stopped in during the..."], "rating": [5, 5, 2], "TBscore": [0.8, 0.0, -0.27], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["pizza"], [], ["bar"]]}
{"id": "7r16GmV18Lkz9gWGSNuijA", "text": ["Typical Papa John's pizza, but I have always had good experiences with this Papa John's. They almost always give you extra garlic sauce, which is always a...", "I really enjoy Papa John's Pizza. The garlic dipping sauce is the best! Today that was the only good part. When I called the service was great, the employee...", "Floppy as FUCK. Said they be there in 30 min, and took a whole hour. To greasy to handle; also awkwardly services. Over priced to the limit. But i got to..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.58, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["pizza"], ["pizza"], []]}
{"id": "xSvObQaeJ4oeZW-TfcPRvg", "text": ["This is nice bar. I came here to meet some friends for a drink.\nIt is game night here and it's loud and every TV is on some sports channel.\nI ordered up a...", "This is a solid, local sports bar. TV screens are everywhere and it's packed during any sort of sporting event. The food isn't the best. The beer isn't the...", "Busy on a Friday night at 6:45pm. \nIt's find your own seating I guess. \nThe parking lot was packed and so we guessed it was going to be packed inside. It..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.33, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["bar"], ["bar"], []]}
{"id": "UniMZFOR1Fnl42_nLPLOsQ", "text": ["So, 1.5 weeks ago I returned, all you can eat Linguine & meatballs! It was awesome. Not marinara sauce, but a tangy and slightly spicy red sauce, and very...", "Got the chicken fingers and seafood nachos to start.  Checked fingers were the specialty.  \nI also like the meatball sandwich.  They have specialty Sicilian...", "This is quite the hidden little gem! I have been wanting to try this place for a while, and I'm just disappointed that I didn't come here sooner. The..."], "rating": [5, 3, 5], "TBscore": [0.0, -0.6, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["sandwich", "chicken"], []]}
{"id": "Lnp6YMqIkCOb5A5m3rLxUQ", "text": ["Haven't tried the food really, but as far as small bars are concerned, this place is GREAT!  Chelsea is wonderful, and Jay is awesome!!!  Decent prices as...", "This place will never get my money, the bartender was as rude as I think he could possibly be. \nExamples from one visit on a Sunday night:\n-Asked for my...", "Came in for a drink on a quiet night. Unfortunately we stayed for one drink due to the fact that I was rudely greeted, rudely told that \"no we don't have..."], "rating": [4, 1, 2], "TBscore": [0.46, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["bar"], [], []]}
{"id": "JFiBEqPOhZeKZZfav6n7Wg", "text": ["The food was ok.  My dinning partner and I each got the pick two appetizers. I had boneless wings and cheese sticks.  Both were just average. The service,...", "Had a great time at Applebee's this past Wednesday for dinner. Our waitress was Samantha and she was super attentive and super nice! We had coupon/gift...", "You may not want to visit Applebee's . Unfortunately, we found out they cook peppers and onions on the same side of the grill as shrimp!  How did we..."], "rating": [3, 4, 1], "TBscore": [0.0, 0.39, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [["wings"], ["dinner"], []]}
{"id": "7cdLGInORlk-4ZkhM39nYw", "text": ["The BK lounge is alive, well, and kicking. The fries here are crispy, hot, and delicious. The chicken fries are [insert description of regular fries]....", "BIGGEST FIVE-STAR REVIEW & HIGHEST PRAISE FOR THE SUPER \"BURGER KING\" RESTAURANT CUSTOMER SERVICE ASSOCIATE MISS KENESHA BRIGGS\n\nLet us be honest about the...", "Ok, I went for the onion rings, since there my fav, but not today baby!! The girl was runnin late, maybe for a very important date! I recieved my rings and..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.47, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["chicken"], ["burger"], []]}
{"id": "XOVifi1OfAe_j5FOdmOOCA", "text": ["It's fast food.  In my opinion, there are worse choices.  This is of course not  a place I will search out, but if I need something on the run, I'll...", "It is Burger King, nothing special about this location, no issues either. Wished they opened later for very late night cravings. I have eaten at this...", "In the maze of one way streets and right of ways comes the intersection of SE14th street and Court.   Kudos for this fine establishment to buck tradition..."], "rating": [3, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [[], ["burger"], []]}
{"id": "cFUnuYtMir-C4QY7lQt8Tw", "text": ["Went here for the 1st time since I was 8, 2 weeks ago. Very little has changed. Brought back so many fond memories.", "It's not the classiest place around and a bit pricey but it's consistent and for the type of food, it's good. Our total was around $17 and we ordered two...", "What do you say in America, \" **** on a stick\". Seriously this place is tasteless greasy spoon.  Not even close to be called comfort food your better off..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "4W4dhj11SnBRfcdRH4OLaQ", "text": ["This is a darn good Philly sandwich. Plenty of food, cooked to order, choice of steak or chicken, and a selection of toppings. Good spice to the sandwich,...", "The sandwiches here definitely lived up to the hype, but the service was pretty bad. There was one guy behind the counter who managed to do a great job, but...", "Pepperjax is the bomb, people. Being from the Midwest, I have no idea of course what a standard Philly-style pepper steak is supposed to taste like, but if..."], "rating": [5, 3, 4], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["sandwich", "chicken", "steak"], ["sandwich"], ["steak"]]}
{"id": "yjcbN9weQOynneRBgQGEUA", "text": ["I was very impressed by this eatexperience.  I set fairly low standards in my mind when I came in because it looked like a greasy fish house. I could not...", "I had the two fish taco combo today and it was very good. The fish was hot, crunchy and tasted good. The put coleslaw in the tacos and it was really good!...", "I get the craving for LJS fried fish from time to time..the one in Ankeny shut down so this location is my go to place. I like that it is paired with A&W...."], "rating": [5, 4, 4], "TBscore": [0.0, 0.68, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["tacos"], []]}
{"id": "Y9tw33Z7CeuzxtIjjwlitA", "text": ["It's quite slow at times. And they have forgotten some part of my order the last few times I've been there. Other then that I like the food even though...", "Came here occasionally to get \"fast food\" for my family. Food is very good, service is horrendous. Got in line for the drive-thru and the worker said there...", "Food is typical grease platters, good and salty...  the staff was horrid, if they weren't slow they were hiding...  and one of them cussed me out in the..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "y3rC7Ra5e3SvWIV6HzYHWQ", "text": ["This place is amazing! I don't know any other word to describe the food here. I ordered the rice plate with one grilled option and I chose the chicken...", "After a disappointing meal at Open Sesame, Lazize is a welcome hidden gem at Merle Hay mall. I'm a huge fan of Mediterranean food, so I was happy to see...", "It's been a busy past couple of weeks and an unexpected car repair put a little strain on my budget... We've all been there I'm guessing. So I really..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken"], [], []]}
{"id": "94dk0rB4NcrgoynBpcQIgA", "text": ["When you not wanting a long wait at the Drake Diner and the lot at Perkins is full, and you've GOT to get on the road south, set your GPS for the Village...", "Ive always enjoyed their food. I woke up craving their caramel iced coffee and an omelette. Pretty delicious. The waitress was nice as well as the front...", "OMG, the pumpkin pancakes !!!!  I have been a fan of the places from the start, never been to a bad Village Inn !!!"], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "nqPj3c88JDCM-dZoeySoVA", "text": ["Definitely rate it below average because the place was not clean, 50% of their sodas don't work in their drink machine, the person taking my order was not...", "Came here tonight and Michael was awesome! Super funny and helped me out with my complicated ass order!! Usually don't like coming to this location but...", "Probably the best Taco Bell in the Des Moines area. I went out of my way to go to this one because my order has never been messed up and the people have..."], "rating": [2, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "JVGfoCHgmk5j1h_60XMPyg", "text": ["Came into town for business and met a colleague for dinner here.  \n\nAtmosphere was nice and we were seated quickly.   I appreciated that the hostess didn't...", "We have eaten at the Waterfront Market in Des Moines and have enjoyed every meal.for lunch today, my husband had cod and fries I had halibut witch was...", "Not so great tonight.  My waitress is either new or simply does not care.  Either way I am not happy.  First, she brought the wrong wine, second she has no..."], "rating": [5, 1, 2], "TBscore": [0.4, 0.5, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["dinner"], ["lunch"], []]}
{"id": "z-axtaQCA3hUAJt966F4pQ", "text": ["It was the best day ever... La from Hoshi Sushi is now the sushi guy at this place.  La is my favorite sushi guy in town... if you want the best sushi in...", "This was my first time here.  We were greeted as soon as we walked in the door. The menu is very extensive.  Lots of different options from noodles to...", "Ive been tryin all the Pho joints in town and finally got way out west to try this. The pho was over priced and it didnt blow me away at all. The broth just..."], "rating": [5, 5, 4], "TBscore": [0.83, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["sushi"], [], []]}
{"id": "WfMhsrqlC_CbFXVZHtp7fg", "text": ["I loved this place! I was craving Thai food and decided to come here for lunch. The atmosphere was pleasant, and the server was extremely friendly. I...", "It got the craving taken care of. Great service, friendly staff. Very clean. Food was decent but sauce on dishes was a bit runnier than expected for sweet...", "The men's room toilet door has a coat hanging hook on it. This is rarer than it should be and I have to give them props for that. The toilet seat is wiggly..."], "rating": [5, 3, 4], "TBscore": [0.66, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["lunch"], [], []]}
{"id": "33M3JODLCQT0R5xHioeiAw", "text": ["You have to check this place out if you like Thai food! \n\nI love going to places where the staff makes you feel welcomed, important and valued. This is...", "I was really craving Pad Thai, and this name is amazing, so obviously we chose this place. The Crab Delights were SUCH a delight. We each had our own order....", "This place is amazing.  The Flossie's are spot on and the wait staff are very friendly, attentive and knowledgeable.  The food came out very quickly and it..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "YOHMaI7DfnGBMpTu5tEofw", "text": ["I love this Hy-Vee! The store layout is fantastic and routes the always-heavy traffic so efficiently. The staff is friendly, the items are easier to find...", "It was the best of times and the worst of times.  At times I have raved that hyvee Chinese is the best in town. Unfortunately I will have to eat crow which...", "Don't ever post anything negative on their Twitter, as they go in and block you. I did so in MN after meat bought there made me sick. They basically blow..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["chineese"], []]}
{"id": "9_IZK3Dj_SJ7RLRUsC1bHw", "text": ["Stopped back in and there was the typical Friday night wait, but we grabbed a couple of seats in the open seating area at the bar. We got our drink orders...", "I love this spot, consistently good food and service. On my most recent visit, I took my girlfriend here and we ordered the bang bang shrimp, crab cakes and...", "I've always seen this place but I never thought of stopping in until I attended the Yelp event here. \n\nThere's a lot to appreciate here aside from the great..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["bar"], ["cake"], []]}
{"id": "czXaQ_3E967Tp8hRzOYzlg", "text": ["Whole Foods has definitely become more of a staple for our weekly grocery hauls ever since Amazon took over. I know a lot of people are pretty peeved about...", "I once loved Whole Foods.  It was a company that treated its employees well and operated with with some ethical principles with respect to the environment...", "Whole Foods is a great place for finding organic foods and some healthier options.  But it comes at a price.  \n\nHowever, while I certainly couldn't do all..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "a1Ro5PJXzgW_Nh4zqEIr6Q", "text": ["Working Lunch, service was great, blackened catfish was really good. Food came out in reasonable time", "Me & My wife would have to agree that when came to eat last Sunday that we had the best service that we have ever received at Red Lobster. Alena was...", "Tasteless Swordfish, season less broccoli. Slow service. They never come back to check on you yet charge a premium price for the food. Probably would not..."], "rating": [4, 5, 1], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["lunch"], [], []]}
{"id": "xhjfzfx3oXAes_Do6MOWqA", "text": ["Perfect for tapas and good drinks with good friends!  I definitely recommend this to everyone!", "Trostel's Dish is my new neighborhood favorite. We couldn't decide what to do for dinner and then agreeed on Trostel's as it's down the street so \nwe ended...", "Came here for happy hour, which has excellent drink specials. The small dish menu selection for happy hour is a bit sparse, but has something for everyone...."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["dinner"], []]}
{"id": "d0KVB1_tLMG7uF1-03Z6GA", "text": ["New ownership really tuned this place up! Employees are friendly & fast! The location is ideal for Drake students and visitors alike. You can even hit the...", "This Subway is great! They are located by Drake University and their sandwiches here are extremely affordable. Service was fast and friendly. If you take...", "I know, your initial thoughts are questioning if I made a mistake. Subway is way too corporate to be recommended. Right?\n\nManagement Terry and Shawn run a..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.36, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["sandwich"], []]}
{"id": "GIwANT6MVZF5yjWuHWLfdQ", "text": ["Food was good.  I had the chicken enchilada melt.  The service was... not very friendly.  For example, instead of saying \"what kind of bread would you like\"...", "My family walked into this subway at around 8:50 pm on 7.26.18 and immediately heard \"this is the best subway in Des Moines.\"  My family and I could not...", "I never had a problem at this Subway location, nor have I had a problem at any Subway location in town. There is no Subway in town that stands out from the..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["chicken"], [], []]}
{"id": "40R39Cd4Gz-glq303O8zdA", "text": ["Delicious sandwiches (hot OR cold). Come with pickle and chips. Refreshing tea's too. Cool antique decor all around.", "This is my favorite lunch spot in Des Moines.  The service is excellent and the food is out of this world.  Wonderful, delicious soups - generally they have...", "Went for lunch.  They suggested a Reuben so that's what I got. Wow!  What a great sandwich.  If you want a quaint clean simple place with good food give it..."], "rating": [5, 5, 5], "TBscore": [0.3, 0.71, 0.4], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sandwich"], ["lunch"], ["lunch", "sandwich"]]}
{"id": "io0UORDz8tg7U4UZoY7Pxw", "text": ["The staff at this Subway are almost always nice.  The problem is the layout of the location.  There's a booth right in the aisle where you have to stand to...", "This is my favorite Subway location, hands down. I have been to plenty, good, bad, and ugly. What always makes the difference is the people. Every time I go...", "I never had a problem at this Subway location, nor have I had a problem at any Subway location in town. There is no Subway in town that stands out from the..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "lZY5DyK_2ge_qh-RNd36Ww", "text": ["Lately, it seems like the Jimmy John's locations I usually go to are either putting their drive through customers first or their catering orders first which...", "I love Jimmy Johns period. I am a Subway kind of guy, but I love changing it up to Jimmy Johns on occasion. Their food tastes a bit more premium than...", "My in laws were telling us about this sandwich place and how we had to try before going back to CA.  I've seen this chain in Chicago when I was there this..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["sandwich"]]}
{"id": "XeajRWpk-sqmHzDrqkVQog", "text": ["Ive had no beefs with this location so far.\n\nBeats Subway any day of the week\n\nNever shorted me on the ingredients like a couple other yelpers said either", "Worst Jimmy John's I've ever been to. I got 1- slice of turkey on my supposed Beach Club! Never again will I be returning!", "I love Jimmy Johns period. I am a Subway kind of guy, but I love changing it up to Jimmy Johns on occasion. Their food tastes a bit more premium than..."], "rating": [4, 1, 5], "TBscore": [0.0, -1.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["turkey"], []]}
{"id": "qIvSWVt07xheXl_3R9d8rQ", "text": ["Their lunch bags are adorable and they make THE best turkey, cream cheese and cranberry wrap!!! Awesome brownies too!!", "What a fun presentation! We brought some bagged lunches in for my office this week - I had a turkey sandwich with veggies - it comes with pasta salad, a...", "I've had great meals from In the Bag at parties or lunch and learns I've attended, just used them for the first time myself for an employee party I hosted..."], "rating": [5, 4, 5], "TBscore": [0.83, 0.38, 0.53], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["turkey", "lunch"], ["turkey", "sandwich", "pasta"], ["lunch"]]}
{"id": "D-ZN6Top2GaVh8bhR8u3kQ", "text": ["If you get dirty while here and have to scrub yourself, it's Scrubway.\n\nIt's not a bad Subway but not a particularly good one either. They have signs up (I...", "Ok Subway you know what I like about you! In a pinch your super fast, you pile on the veggies, and your sandwich artist almost take pride in how much stuff...", "I never had a problem at this Subway location, nor have I had a problem at any Subway location in town. There is no Subway in town that stands out from the..."], "rating": [2, 3, 5], "TBscore": [0.0, 0.34, 0.0], "normalisedRating": [-0.2, 0.2, 1.0], "keywords": [[], ["sandwich"], []]}
{"id": "6I51vvF-sB6VLvcZjpafuw", "text": ["Let me start my review by saying that I love Quiznos- it is my favorite sub shop. Unfortunately, I live in Illinois where they have all closed down. When I...", "This a fabulous Quiznos! Unfortunately all the Quiznos near me in Wisconsin have closed. I drive to/from Missouri a few times a year, so I always make a...", "I love Quiznos, the service is great, and the food is fresh !!!  This place is a little hidden but well worth it !"], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "d5-LDmqBAEi_7vUeubXe7w", "text": ["My meal was prepared with waaay over ripe and rotten avocado. It was of no fault of the waitress as it was underneath the eggs, but the kitchen should have...", "Perkins has a cranberry orange roll that I get a hankering for every now & then. If you like fruity mammoth muffins, try it. On this last visit, my intent...", "If I could give it zero stars I would. I ordered a simple omelette - Amber, the server, had to ask me 3 more times what I ordered over the next 30 minutes,..."], "rating": [2, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, -0.6], "keywords": [["egg"], [], []]}
{"id": "n_195_oyBO9ltiTgc1EZYg", "text": ["This is my favorite Perkins. They publish the nutritional​ facts in the menu for all the components and have a claw machine, what more do you need.", "THIS WAS TERRIBLE. the service was bad, the waitress was mean. she was very very rude. she wouldn't bring us water or take our order. then she wouldn't let...", "The potato pancakes at this Perkins are not like at it her Perkins! They are more like a pancake with a couple pieces of potatoes. Much better at other..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "qd2iV_7yKgoizXkfumYf5Q", "text": ["Ignore any negative reviews. Palates jaded by industrial strength, pasturized processed American cheese food or chi-chi, gluten-free, chickpea-flour-and...", "I hate writing bad reviews, but unfortunately, this restaurant has been very unresponsive to my attempts to rectify the situation.  Two posts on their...", "I've driven by this place for a long time now and finally decided to stop in this morning for breakfast. I was overwhelmed, in a good way, by the menu. So..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["american"], [], ["breakfast"]]}
{"id": "c8NAsNZL1nZBNIh84-LOcQ", "text": ["First off I just got to say how fantastic it was to work with the crew from Gastro Grub. We were holding an event open to the public and wanted an awesome...", "This food vendor has some pretty great burgers. The prices are good for both the burgers and fries. \n\nThey have several different sauces to use to dip the...", "This review is definitely overdue.  I visited this food truck during a Des Moines food truck festival.  I tried their truffle fries and they were SUPER..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["burger"], []]}
{"id": "tnkeWHbBhdWCn5O9k3hfjA", "text": ["Ate there with a party of 50.  Waiter was outstanding.  Food for all of us was very good, hot when served and super tasty.  Not really sure how our waiter...", "I recently gave this restaurant a second try and now I'm ready to review. The first time I went the food was good and the atmosphere was fun but the service...", "This is the second time we've been to the Machine Shed since they had their makeover but I'm a Davenport native and have been going to the Shed since I was..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "gt7QCP88ijMRmxJXZjy6HA", "text": ["Dairy Queen has really step up flavor game. The Royal Blizzards are my new favorites! Plus who doesn't feel special getting an golden spoon? But other then...", "I enjoyed this Dairy Queen there quick and efficient when taking your orders and making your treats. It has a limited food offering as it is a smaller...", "The service at this location really sucks! I stood at the counter for a good 15 minutes waiting to pay for a cake I was getting before anybody even..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], ["cake"]]}
{"id": "bBeI9WQkbdyhqWcKH1yozg", "text": ["Really fast service. Came in on thanksgiving day for lunch. There was a pretty good amount of people dining already. The waitress was very attentive. \n\nI...", "Good food, reasonable price. See pics. Clean. Ok staff. Family friendly. Lot parking. Many choices. I got the grandmas hash and it was very good....", "Oh my goodness, gracious, the perfect breakfast! And boy is my tummy slaphappy!!! Got the strawberry an cream cheeze crispers they are the bomb!!! Real huge..."], "rating": [4, 4, 5], "TBscore": [0.42, 0.0, 0.8], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["lunch"], [], ["breakfast"]]}
{"id": "bo0-5FvzllhG0Y_2IA97fQ", "text": ["A good Perkins!  Clean! Our coffee group met there. I had a $5 breakfast that was a special I received through my email. Everything was well done and I...", "Super staff:  always friendly and attentive to our orders.  Food is served very quickly.  Food is consistently great.  Not many places are consistent.  We...", "Truckers listen up. Don't miss out on a great opportunity to have an outstanding breakfast. This place is a short walk from the Flying J. So you will have a..."], "rating": [4, 5, 5], "TBscore": [0.56, 0.0, 0.43], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["breakfast"], [], ["breakfast"]]}
{"id": "aJBRjYfjT6AQ1C6JPUUbiw", "text": ["ABSOLUTELY A MUST! Their soft serve is faaaaantsastic! Talk about a cute little joint on the side of the road! I really had no clue what to order, because...", "This is a cute, little cash-only ice cream shop. It looks like many people enjoy walking to it for their ice cream treat. There is always a new flavor of...", "Cash only. Order at window and pick up at the window.\n\nI love the simple twist ice cream in a waffle cone. This place reminds me of the local mom and pop..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["waffle"]]}
{"id": "JtIid2cT9RRoEQFSiSmymQ", "text": ["we love i hop the wait staff the food prices and friendly sevice prices are cheap and food is delicious.....managers are friendly and always aknowledge us...", "We were here Saturday with an unruly 6 year old. See pic. The turkey dinner was ok. It had some 1.5\"x1.5\" pieces of turkey, which was slightly dry, a small...", "Staff here are great! Food is always delicious for a chain restaurant. You can't go wrong with all their breakfast creations. Pricing is solid!"], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["turkey", "dinner"], ["breakfast"]]}
{"id": "KEqNA0vU3OIaSFje06mzrA", "text": ["Go the extra mile. Seriously. The nearest DQ is just over a mile away and you'll get better service, a cleaner building, more generous portions, better...", "Definitely not a great DQ. It's a dirty location and they didn't have half of the items they advertised (like Reese's pieces for the new Reese Outrageous...", "Terrible service! The two teens working were more concerned with flirting with each other than actually serving customers which lead to long waits. One..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "tkxKizGqdoP0ydxbYV4HCQ", "text": ["My favorite village inn to come to.  Only thing that gives them a four instead of a five is the old cigarette smell that remains in the building even after...", "Today, 8/20/17, our service was inexcusable. \n\nMy mom, my 1 year old, my 4 year old, and I  were sat at 11:30 at a table right next to the expo. It was...", "Breakfast was very good. Just the right amount. We will be back. Our waitress Buffy was very nice and I would like to have her again when we come back. I..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], ["breakfast"]]}
{"id": "y1JnkK97RnSFvflTArJMKQ", "text": ["Definitely a great spot for a leisurely downtown breakfast.  \n\nAs others mentioned, the signage is very easy to miss. But once inside the lobby, BOS is...", "We have eaten many breakfasts at BOS, but were reluctant to try it for dinner. This time, we were staying at the hotel for several days, and needed a dinner...", "Very disappointed. This rating is based solely on service, as we were never able to even get food.\n\nStayed in the hotel and needed dinner around 5PM on a..."], "rating": [3, 4, 1], "TBscore": [0.68, 0.25, -0.61], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [["breakfast"], ["dinner"], ["dinner"]]}
{"id": "itQE4aRoyRosXkIIoiohEQ", "text": ["If you're looking for a thick, greasy burger with unique combinations on it...look no further! Zombie Burger offers wild flavor mixes on the burgers that...", "The three stars are more for the location and food delivery process than for the food itself which is a solid four stars. We had no idea that this was in a...", "If you are looking for a good burger, this isn't the place. It's average at best. Fries are also nothing special. Best feature is its location. \nWant a..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.58], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["burger"], [], ["burger"]]}
{"id": "hYsJ02M7Upe5larr9BcjAA", "text": ["First time eating at a Five Guys restaurant. I arrived around 12:30 on a Monday and they were busy with their lunch service. Lots of people dining in and...", "I'm a burger girl and I love these burgers. The fries are good to but I don't go here for the fries. The cheese ratio to burger and bun is perfect. The...", "This place is overpriced for the food. The girl who rang me up could barely put two words together. I asked for recommendations on toppings and she said, \"I..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.73, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["lunch"], ["burger"], []]}
{"id": "LUFZR0JQzStZEcW6fBQ1Zg", "text": ["I love their slushies. I get the blue one and then freeze it a little bit at home and then add Vodka and it makes for a tasty summer treat with a kick. BLTs...", "I have been here for their breakfast burritos filled with jalapenos and they are delicious. This was the first time I ordered anything else off their menu....", "I usually visit this Sonic twice a week with no complaints but my order on May 14 couldn't have been worse. My regular order of a mustard style cheeseburger..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.55, -0.22], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], ["breakfast"], ["burger"]]}
{"id": "c71yEcay9Qzt_CWT0qemPg", "text": ["I have to say that today, I have encountered my favorite and best IHOP experience EVER!  I know there are restaurants out there that are far more...", "We came here for the new advertised pancakes. I got the java and my friend got the double vanilla. See pics. Both were very good. We got short stacks. A bit...", "Horrible gross food not what I ordered and floating object in the water.  I won't EVER go to this I HOP ever again."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "vc18oMu6VJDQnzEHnqhFKA", "text": ["I'm always skeptical at eating at chains, but oh my....Red Robin was fantastic!  Our server, Dan, worked hard and was friendly and we never had to wait for...", "What a disappointment.  Took almost an hour to get a burnt burger and way over salted fries.  Granddaughter wanted McDonald's and I'm thinking it would have...", "Oh West Des Moines, so full of chain delights. \nI mean, it's an American food restaurant but they make it fancy. This location has great servers and with..."], "rating": [5, 1, 5], "TBscore": [0.0, -0.6, 0.21], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["burger"], ["american"]]}
{"id": "MEbZsRAG5s8l5s-OaxqahQ", "text": ["I have been to this restaurant a few times when visiting from out of town, and have had positive experiences each time.  The visit this week was no...", "Excellent ham and cheese omelet and Cobb salad. Friendly workers. Generous servings. Clean and reasonably priced", "Oh my gosh...oh so disappointed with my meal here! Giving them two stars only because the employees were friendly, but the coffee arrived with bonus..."], "rating": [4, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "ThpcpIbI8wudnoQdW603Zg", "text": ["We love Hurts Donuts. We have been to the Lincoln and Des MOINES Location several times. The donuts and cinnamon rolls are the best I've ever had and worth...", "Favorite go to donut spot. Been coming here for about a year now and it's always my favorite cheat meal/snack. Some suggestions of my favorite donuts..\n\n1....", "After hearing all of the hype about Hurts Donuts, I was pleased when I was able to make it to Des Moines while home for the summer. Hurts Donuts, open 25/8..."], "rating": [4, 5, 5], "TBscore": [0.45, 0.5, 0.33], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "Bce2OgsSpuPMZk7aHY-fhA", "text": ["I do not come to West Des Moines often, but when I do, I gotta come to Mahalo's. The coffee here is awesome. I think everytime that I have been here I have...", "Cute shop in West DSM off the path a little bit, tucked away in a strip mall. Absolutely incredible donuts, hands down! They are made fresh to order. An...", "Really wasn't a fan. Just thought we would try it as it was ranked the best donuts in Iowa. Coming from Dutch area of PA I guess it's hard to compete. It's..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.26, 0.3], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], ["donut"], ["donut"]]}
{"id": "LEz2bQ_qaa7OHLkyPpv8Yw", "text": ["It's very clean, organized, and well maintained store. To be frank donuts are not something I would commonly get my myself... I'm more a savory food person,...", "Who doesn't love Krispy Kreme?! When I was a kid, they had a location in Cedar Rapids. We always stopped when the sign was on that doesn't were being...", "I have been to many different Krispy Kremes in many different states and I must say, this one was the best. I was craving something sweet so I decided to..."], "rating": [4, 4, 5], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["donut"], [], []]}
{"id": "NkdZL_6tscYMhEEUoW0R2A", "text": ["This last visit here, I got my favorite egg and cheese wrap, but it was cold and watery in the middle!  Not good. All previous visits were 4 star. See pics....", "I'm running on Dunkin'! Star withheld bc I do expect more variety in kinds of donuts, and yet there were more than enough choices. Kids chose specialty...", "We had a craving for donuts and this was on our way home from the mall. Picked out 5 different donuts and a blended drink. So many yummy choices for the..."], "rating": [2, 4, 5], "TBscore": [0.0, 0.33, 0.25], "normalisedRating": [-0.2, 0.6, 1.0], "keywords": [["egg"], ["donut"], ["donut"]]}
{"id": "rR8IsYaqSiGRlQ69FS1M5A", "text": ["The cashier took a long time to take my order - and there was nobody in line but me! Luckily i was not in a hurry to work.  It seems they had the elderly...", "This place is a hit or miss...really nice employees but even if you come early they're out of bagels and certain donuts half the time.  But when they're not...", "**Military Discount offered\n\nI don't usually come here for the donuts. They are okay, but I prefer the other brand better. But their French Cruellers and..."], "rating": [3, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.2], "keywords": [[], ["donut"], ["donut"]]}
{"id": "kT2aqE81ILf8_DMjashHlA", "text": ["I stopped at Dunkin Donuts this morning on mg way to treatment. I asked if they had any Angel Cream filling. The gal told me they don't make those donuts....", "Who wouldn't love Dunkin Donuts? Manager on duty is nice. Store is and has always been very tidy! Comfortable seats. Products per se are 10 starts! Myself...", "My first and last time at this location. The cashier barely uttered a hello. No one thanked me. I only got a medium dark roast coffee with cream and..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.64, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [["donut"], ["donut"], []]}
{"id": "Zem_LIGih4wT25TnAPvNzQ", "text": ["There were only 2 employees on sight, but it seemed like they did their best to make the food as soon as possible, they were so friendly, smiled, gave great...", "My sandwich was sooo burnt no amount of ice was bringing it back!!  I opened my bag hungrily, I look inside and there was this black piece of charcoal with...", "Every experience has been a bad one. Tried so many times, so many chances.  If it wasn't burnt coffee it was they were out of everything (except black..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["sandwich"], []]}
{"id": "8_NiK6r-JbH8nG5kWcU3Sg", "text": ["We have been visiting the Des Moines Downtown Farmers' Market (DTFM) for years! It is one of our favorite things to do in the spring, summer, and fall...", "A friend and I stopped by the Farmers Market on our way to Pella. It was so fun and lively. There was so many booths with a variety of everything. It...", "My favorite DSM event is back and what a beautiful Saturday morning  to kick off the season. Timing is everything; from parking, to shopping and eating a d..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "n8ZxN5UOGPUh8crtmYiWFw", "text": ["I'm in grad school, and my weekend class tradition is to stop here for breakfast and a wake-me-up coffee. Don't be scared by the long drive-thru lines, it's...", "This is our morning coffee spot. I'm allergic to dairy, and some of the ingredients in regularly used soy milk brands, so I have to drink almond milk in my...", "I go to this Dunkin just about every day. It's ok, but nothing spectacular. I get the same thing on each trip - a medium iced coffee with caramel swirl and..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["breakfast"], [], []]}
{"id": "8t4K95_easkao8nPX-lqLA", "text": ["Good maple pecan coffee!  See pics. I was in here during a brief visit to Ankeny this week. Friendly staff. Family friendly.  Plenty of parking. Easy access...", "Love the location of this DD. I come here often, and service has usually been great. They participate in the happy hour (my favorite time to come) and more...", "Ok. Here it goes. We have come here a few times after church since my first review and gotten subpar service and food. They are always out of doughnuts by..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], ["donut"]]}
{"id": "rwBrbCAuzu08f0tXctErWw", "text": ["SOOOOOO SLOW. always end up stuck in line forever or just have to leave without anything because of the wait", "Love Dunkin Donuts but this store is a mess. I go about 1 x week and always different faces. Service is super slow. Most of the time, they are out of...", "Yuck. DD makes weird tasting donuts. No matter the location. \n\nThis is the last time I eat a DD donut. I've been here 5 other times and I am never satisfied..."], "rating": [1, 3, 1], "TBscore": [0.0, 0.0, -0.22], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [[], ["donut"], ["donut"]]}
{"id": "vuTd5qCkqSdPs8UXaCHSQw", "text": ["This review is for the drive through car wash!\n\nThis is the best place in my opinion to get a car wash unless you go to a manual car wash where you wash it...", "Terrible service tonight.  Ordered pizza online for pick up (3 hours ahead).  When arrived, noticed pizza attendant was sitting and looking at her phone.  I...", "Lost my order for 5 pizzas for an event I was hosting. Kept telling me it wasn't their fault because their printer just sometimes doesn't print the ticket..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.4, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "ctzYc6WPx3tvdW17FDroTw", "text": ["I love the bagel sandwiches and bagel bites! I wish they had at least one gluten free bagel though. My fiancé just got diagnosed with celiac and we used to...", "We stopped in CJ's on a Sunday morning and ordered two bagels with cream cheese and two coffees. It took 20 minutes to get our order. At that time their...", "They have some AWESOME breakfast sandwiches here. You really can't go wrong with anything you order. The food is always made to order and fresh. I would..."], "rating": [4, 1, 5], "TBscore": [0.24, 0.0, 0.27], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["sandwich", "gluten"], [], ["sandwich", "breakfast"]]}
{"id": "pz1PjNmJBXcTKJHpwlWz_g", "text": ["This review is just for pizza** \n\n\nOrdered a pizza (online) and confirmed it several times. Got here after waiting 15 minutes and they hadn't even made it...", "Caseys and QT are my favorite gas stations in Iowa. They are clean, safe, and have friendly staff. All Caseys have amazing hot pizza slices ready to eat at...", "Clean, convenient, and friendly. Competitively priced."], "rating": [1, 5, 4], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [["pizza"], ["pizza"], []]}
{"id": "l74dolEXT-u3p3eQgcJrdA", "text": ["I noticed that Wednesday is Senior day here.  Whereas my wife is over 60 (a senior) I am a couple months shy but was able to pull off getting the special....", "I been driving by this place for 3 years. I finally decided to give it a try. I didn't know it was a buffet until today after walking in. Heck yea! I was...", "Have come here a few times with my parents lately. I hadn't been here in many years prior. \n\nWe came around 7 PM on, I believe it was, a Tuesday night. We..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "OHoaHrB7FW8dqoQgndDqEw", "text": ["I don't get to Norwalk unless I'm working there, but when I do this is the place to eat. Great food, good service. The cooks know what they are doing. Food...", "Friday night fish special was DELISH! Fried cheese curds we're super yummy! Not our favorite pizza, but not horrible, we just like a bit crispier crust. The...", "The staff was awesome, I ordered a tenderloin, it was one of the best I've had in quite some time !\nThe place was very well lit, nice neutral colors, quiet,..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.47, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["pizza"], []]}
{"id": "G3uH1AvgTkjZ3cTkIRiv4g", "text": ["FANTASTIC! Made to order with fresh ingredients and very reasonably priced. They stand by their pizza if it's burnt or anything hung they remake it....", "Blaze Pizza was an experience I didn't predict. Was pleased to see they make their pizza dough daily and use fresh non chemical ingredients.\nI selected the...", "LOVE Blaze! The crust, sauce, and toppings are always fresh and well crafted. \nYou can't go wrong with wood fired pizza and in under 5 minutes?! *clapping*..."], "rating": [5, 5, 5], "TBscore": [0.35, 0.27, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "VU8wmoN2aeI8ahsnzws-MQ", "text": ["I wanted a quick slice of late night pizza and Big Tomato came through. It was around midnight on a weeknight, and there were several folks wandering in the...", "We were quoted 1hr 10min for delivery.  Pizza was ordered at 6:15pm CST, it was just delivered at 8:36pm CST.  The pizza looks good, but it's dry, the...", "Just visiting Iowa and my wife took me to what she says was the best pizza in all of Iowa. I had my doubts being from California where I found some of the..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.32, 1.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "dqWWQaWBRk4AbCUa_M4hxg", "text": ["Finally got a whole Vegan pie from here and wowie zowie it ruled! \nThey even put fresh arugula on it.. Which I thought might be strange but it was actually...", "Good pizza! There's a variety here that I want to try. \n\nSet up reminds me of the pizza shops in New York. A lot of nostalgia with the decals of the NY fire...", "This is one of the best pizza places we have been to. The garlic knots are to die for. We ordered the vegetable pizza and it was topped with arugula, a nice..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.51, 0.8], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "Tb2GCaAMhWQ0zIq7HY2CNA", "text": ["Good pizza and bread sticks! An old classic! Free delivery city wide is a good perk! I'll order again.", "This is the 3rd 're I've been to this location. The first two times were decent. Ordered pizza to pick up. We were told is would take about 20 mins. We got...", "Have had Paul Revere'd for years and love it! There hasn't been anything that I've tried that I didn't like. Only downside is they do not Open until later..."], "rating": [5, 1, 4], "TBscore": [0.39, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["pizza"], ["pizza"], []]}
{"id": "L8W35RrxjY7MmJKq-7A-Yg", "text": ["Imagine fresh, fast, fire cooked pizza made exactly the way you want it by friendly staff who seem to love their jobs.  Then walk into Blaze to experience...", "Who would have thought, after years of soggy mall pizza from Sbarro that there would actually good pizza available while you shop? Stopped in here yesterday...", "Out of gluten-free dough when I had a major pizza craving. I'd like to say that this review is strictly based on my being hangry right now but I've been..."], "rating": [5, 5, 2], "TBscore": [0.33, 0.55, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "19BX8ToOwdtSGz2J8GWUBA", "text": ["Growing up, Godfather's pizza used to be a treat! The closest one was in Worthington, MN ... about 20 miles north of my hometown! \nSometimes we ordered...", "Had a dine in experiance at Godfathers. We ordered a taco pizza and wings and a salad. Salad was good. The wings were the smallest wings I have ever seen,...", "Now I just want to say first off that I LOVE Godfather's Pizza.  Been eating there for 30 years.   Not very often than we have it delivered and I usually..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.7, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["pizza"], ["wings", "pizza"], ["pizza"]]}
{"id": "veq4TdbDPLaMvcl7tmS5qg", "text": ["The pizza is always great tasting and consistent.\n\nThe staff are very friendly and never treat my like an inconvenience. One time, I ordered pizza without...", "Too many bad customer service experiences to count. They screw up orders so often both for delivery and in store pick up, try to correct it and see what...", "Customer service is not good. Their delivery drivers are great though, considering how many times we've had food re-delivered because of messed up orders. I..."], "rating": [5, 1, 2], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["pizza"], [], []]}
{"id": "oM5dThr26RmS-fcJZnRA4g", "text": ["Pagliai's Pizza is an old family tradition of my S/O's. His family has been going to the Grinnell location since they were kids, and we frequently meet up...", "Although I guess this place has been open for ages, I had never been. It came up on my \"Suggested Places to Try\" and upon suggesting it to my favorite...", "Another excellent pizza in a city with lots of great pizza options.\n\nThis is a true old school pizzeria. Going on a Friday night, you will see 5 or 6 pizza..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.56], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "4zmdgCBYJr8cv_5F0Wo1xw", "text": ["We had just returned from a trip to Italy and were craving some authentic Italian pizza, RedRossa was exactly what we were looking for. The dough was...", "I've been wanting to check this place out forever and today I was able to go! \n\nI got the lunch special of a half pizza and small salad for $7.50. Decent...", "Ordered the prosciutto cheese bread and the spinach & artichoke pizza. The cheese bread was really delicious and perfectly baked. Neither me or my..."], "rating": [5, 4, 3], "TBscore": [0.25, 0.0, 1.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["pizza", "italian"], ["lunch", "pizza"], ["pizza"]]}
{"id": "JsYGVrL76hpPKbxPGxlMrw", "text": ["tastes great. but either i got a dry pizza this time or that's just their recipe. both my husband and i both agreed that it needed more sauce. i'll ask for...", "We arrived at Hometown Pizza right at noon on a Friday. They were serving their buffet, which looked fresh and well stocked.  But we'd purchased a pizza...", "Having grown up in the QCA, I'm a fan of 'Quad Cities Style' pizza. Hometown does hit the mark with a slightly spicy sausage pizza that is cut correctly in..."], "rating": [4, 4, 4], "TBscore": [0.41, 0.29, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "meAgL8anNoeQMaUJi0a3Zw", "text": ["Most has been covered by other reviewers. If you like flame cooked pizza, caramelized thick crust and tasty generous toppings, try this place out.\nI think...", "Best pizza in Des Moines. Not much else I need to say. Get the caramelized deep dish crust. \n\nEnjoy a beer. \n\nIt might take a minute but you won't regret it!", "I tried 7 Stone Pizza a few weeks ago when I was visiting some friends (and their kiddos) in Waukee. We wanted to get out of the house for dinner, and 7..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["pizza"], ["pizza"], ["dinner", "pizza"]]}
{"id": "mGVHbrjFmLngj8dqbQN9cw", "text": ["Wish I could give this 0 stars. To say the pizza was bad would be an understatement. It was a simple one topping pizza. The crust was like cardboard, in...", "Gotta say they make a good pizza at Army Post Road. Get the Brooklyn style crust for an even flavor experience that is not all dough. Also, don't get the...", "We sat down to sit and wait for our pizza. The worker started making the dough with no gloves on and then picked his ear and went back to making the pizza...."], "rating": [1, 4, 1], "TBscore": [-0.35, 0.7, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "4fMLQwZZ31VJxDOOy2wmYg", "text": ["Maybe a hair expensive for the small size on the orders but the quality and flavors were good. We ordered the Thai stirfry rice bowl with chicken which...", "Currently my obsession. \n\nI always order takeout and I've never had a bad experience. Food is ready within minutes and still hot by the time I get home. \n\nI...", "Very good, fresh, and tasty food at reasonable prices. We met our daughter and granddaughter there for lunch as it is very kid and adult friendly. Order at..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["chicken"], [], ["lunch"]]}
{"id": "XYxZ2PMSNdkGZK5o5Wohig", "text": ["We came here today for the first time.   I enjoyed my marinara bowl very much,  the noodles are perfect.  The marinara sauce is thick and tasty, and sticks...", "Very good selection of noodle and rice dishes. Also has some interesting soups. Service is friendly and is set up more for take out than dine in. The...", "Nice little local joint that is fast and good. Go here to get my teriyaki bowl fix usually with chicken, shrimp, or on occasion meatball. Mac & Cheese..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["chicken"]]}
{"id": "NQTVXw2ib54519u6lyM6DQ", "text": ["Service goes along way with me, and the waitress at Old Chicago was fantastic.. Any waitress who without thinking brings a 2 year old crackers right as he...", "I have been here twice. I won't ever return. HORRIBLE service. It took them even 10 to 15 minutes to notice that we even arrived waiting for a table. They...", "It has been nearly a year since my last visit to this location. Decided that their baked spaghetti with meatballs sounded good. I was promptly seated mid..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "edD-4QDExT7oz7qYNe8pBQ", "text": ["We got delivery tonight ahead of the long Memorial Day weekend. I've never had Dominos any better than tonight!! We ordered the Extravaganza pizza, combo,...", "Just tried to order pizza well before closing time. Almost an hour when I called. I was told they were closed and that it was after two. I said no. Tonight...", "i don't eat lots of pizza. When i want pizza, i order carry out. And buddy of mine asked if i wanted pizza. so we ordered from this location. We placed the..."], "rating": [5, 1, 2], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "DGB4AIqmLqr0bHzYg18I5g", "text": ["It's great bargain for a lunch buffet for z$6 including drinks. I found the cici's  just driving past by. I had eaten at cici's at other  location and...", "I got sick from their food. Bathrooms were awful and tables weren't cleaned well. I don't think I'll be returning here again. The only thing I did like was...", "It's just so-so. Been here a handful of times now and it's just not love for me. Been here with a group, for bday parties, and just as a family of 5. The..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["lunch"], [], []]}
{"id": "EC8ahdS1bUZMUVuvHPFlUA", "text": ["On the day I ordered, it was a weekday morning right after opening and my pizza was perfect.", "Oh Pizza Hut, you advertise great specials like 50% off your pizzas, but deliver total disappointment for those thinking and hoping for a great...", "We had extended family over and ordered 2 pizzas chicken a family size pasta smore pizza several things they were out of pretty much everything the first..."], "rating": [5, 1, 1], "TBscore": [0.64, 0.25, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza", "chicken", "pasta"]]}
{"id": "mQXOhe1ZoeWtVBF0tx4baA", "text": ["I can't believe I had never been here before. It's a charming little coffee shop across from a HyVee. The location has a drive thru area which was pretty...", "I'm never disappointed by anything I order here! Love that it has a drive thru, but doesn't have a huge corporate feel. The Mexican Mocha is one of my faves.", "Great local coffee shop with quality drinks. I like cafes like this a lot more than the corporate chains. Also, La Barista is a nice stop along the Jordan..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["mexican"], []]}
{"id": "Cgl-alwRSiRc3s6N03kBZw", "text": ["First time to Friedrichs and I'm not impressed. I like to frequent small local chains, mom and pop type places, etc, as a way to help support local...", "Always pick up a breakfast sandwich here when.am.on early morning flights. Have some varieties or choices of sandwiches. Wait time might be bit longer if...", "This is the only line you will ever really have to wait for at the DSM Airport. But it's worth it.. Nothing like always flying early in the morning and..."], "rating": [2, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 0.6], "keywords": [[], ["sandwich", "breakfast"], []]}
{"id": "Ma-kxcSsjQV0CIoPVsiy6w", "text": ["It's not cheap, but the food is some of the best I have ever had!  We had the 4 course taster menu and were totally blown away!  The scallops were amazing...", "I came here during a mother-daughter weekend as a special treat pour ma fille! We are Francophiles and love any chance to experience French culture! I saw a...", "Went to celebrate our anniversary with some great eats.  French chef knows his art. \nWe started with seared scallops with peach chutney and corn bread and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["corn"]]}
{"id": "b1zt28LJGceAAEvVCuMNKw", "text": ["I always get friendly and efficient customer service.  The drive-thru can get slowed down during busy times which is understandable.  The food options are...", "Barista Dana is the best barista I have ever met. She is quick & made my pink drink PERFECT. It made a perfect start to my Friday", "This is the only Starbucks anywhere near the south side so it's the one I go to! The employees are GREAT and I always have a fabulous experience with them!..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "HO19IfHMzqFfbj22BXvoXw", "text": ["Still visiting this family owned coffee shop on a regular basis. They are so very attentive here. They have a steady following as there is always locals...", "In all honesty this is not a real coffee shop. I'm sure for regular coffee it's fine but not by any means a good espresso spot. This place is owned by...", "Excellent flavor, excellent, friendly service.  Limited daily flavors. Military friendly, and only a few miles from Camp Dodge main gate. Indoor and outdoor..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "XEdJ0_DuAOx1GdJ7QpCGOA", "text": ["Friedrich's Coffee is always good, the staff is always nice and the locations are always clean! \nI love this little Des Moines chain with multiple...", "I stopped in here for a coffee the other morning, and was quite impressed. The prices were very reasonable, they had a great selection of different coffee...", "Today I stopped in to get a coffee after years of not having a cup at this location. I remember when this was a new shop and the baristas cared, not today!..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "bU_uXly9fa-2RMIMeOAsXA", "text": ["Update: went with a vanilla latte. I am a happy camper. (Because see, last time I got the toasted marshmallow and now I am happy.) BRB need more...", "I don't venture in often as I'm not usually in this part of town, but I stopped in because I had a hankering for my favorite orange cinnamon tea that I know...", "What a gem of a coffee shop. After a long drive from Breckenridge to Chicago, I was SO happy to have found a local coffee shop on our route. Really nice..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "EOl3buVjebvEK23giBoH8w", "text": ["The barristas here are so friendly!!! The lines get super long especially near morning rush and lunch, but they all work to try and get your order made as...", "One of the best run Starbucks I have seen in my travels across country. Though there is a set system in place and they all should be able to do the same....", "In many ways, all Starbucks locations are meant to feel indistinguishable. The music is the same, the comfy chairs, and obviously, the beverages being..."], "rating": [5, 5, 4], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["lunch"], [], []]}
{"id": "PFIOPzr_IKDH9N9cVQ4CNA", "text": ["This is my go to Starbucks! The baristas here are friendly and welcoming. Service is always amazing and quick!", "I love this starbucks! If you already dont have a shopper's high each time you step into Target, a drink from starbucks will definitely help get you there!...", "This Starbucks is great! The baristas are great and also its quite convenient when a trip to Target sparks the urge for some delicious coffee. Taylor, the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "EyHvEEz610sYYf3f2TCCFw", "text": ["When I was wanting to try a new cafe, I found this lovely spot (thanks to Yelp ). It is a charming little cafe serving up coffee drinks, muffins, and a...", "Cons: tables were all dirty, no baby changing station in the restroom, breakfast sandwich was small and looked like it was frozen and microwaved.\n\nPros:...", "I go here when I am meeting my coworker in Ankeny for coffee. \n\nNice cozy place and lots of seating. \n\nCinnamon rolls the size of your face, scones, and..."], "rating": [5, 4, 5], "TBscore": [0.0, -0.42, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["sandwich", "breakfast"], []]}
{"id": "x7-0wKfdLyhuRjBTqiBomg", "text": ["Tasty Tacos is one of our favorite chain restaurants in Des Moines! They fry their flour tortillas for the shell. Their meat filling has a lovely sauce with...", "My husband and I visited Tasty Tacos yesterday, as I hadn't been in probly 15+ years, and it's a place everyone rants and raves about, saying how amazing...", "Great flour tacos built this business. Be sure to try one if you are new to Des Moines. Fast service and clean. Fair prices."], "rating": [5, 1, 5], "TBscore": [0.56, 0.6, 0.45], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["tacos"], ["tacos"], ["tacos"]]}
{"id": "tyg3L9yIurjL8PCwzH6Udg", "text": ["\"Two tacos and a Schlitz\". \n\nHaving now been here a few times the bartender semi knows me.  I need these after Nova went off on me last night \n\n\"when I said...", "Love coming to the fu! Awesome bartenders that keep up with drink orders even when they're swamped. Covered patio is also a plus", "The best biker dive in Des Moines. Hang out with friends and admire the motorcycles. As Gomer noted, you are going to have to go to the bar for drinks. This..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 1.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["tacos"], [], ["bar"]]}
{"id": "LZ_KkgUY4YipVGvMw5v9RA", "text": ["Not super impressed after having street tacos from the east side. Additionally they are charging $8.00 for 3 street tacos. Service was fast and the staff...", "A camper looking food truck was this stop.\n\nThe look of this food truck from the outside is a little off-putting. It's bright yellow with food items painted...", "My friend and I grabbed their steak nachos for lunch and I was really disappointed. The chips were very salty, the cheese reminded me of what you get when..."], "rating": [3, 3, 2], "TBscore": [0.34, 0.0, -0.28], "normalisedRating": [0.2, 0.2, -0.2], "keywords": [["tacos"], [], ["lunch", "steak"]]}
{"id": "6y0c7VBbbs2ZkWgs1ENWbQ", "text": ["The BEST taco truck food I've ever had! My favorite spot to eat. Just tried the carnita/asada burrito for the 1st time tonight...AMAZING! The burrito was...", "Way off today. We have stopped here before and gotten good food but today was a total disappointment. Burnt meat in the traditional carne tacos. Dry dry...", "Not bad at all. Torta was on point, tacos delicious,  not to mention the price was very reasonable, and very polite staff. Will definitely be back."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["tacos"], ["tacos"]]}
{"id": "LzaLzKOa2MLraVxztxmy-A", "text": ["Their original flour taco is the tastiest taco I've had, hence the name \"Tasty Taco\". They now sell their taco seasoning, so you can season your homemade...", "Being away from Tasty Tacos for 10 years, I was very much let down at the quality I remembered....and the price has doubled in that time (if my memory...", "From Kentucky here and I think I would drive from Kentucky just for these tacos!! There is nothing on the planet like these original flour tacos!  The meat..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["tacos"], ["tacos"]]}
{"id": "oIBliKa50cnuVqtSbxjDOA", "text": ["Great addition to Prairie Trail and another good family option. The price point can get a little heavy at times. The tacos are good and there is a great...", "This was my first time visiting Taco Hangover, but it was the perfect spot for us to visit our friends with two young kids. They had an area in the back...", "Good food. Not so good service. Unfortunately our waitress was terrible. Right off the bat we were not welcomed, or greeted, but actually ignored. \n\n It was..."], "rating": [4, 4, 3], "TBscore": [0.44, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["tacos"], [], []]}
{"id": "dRUTGzcqkAbDdz73Km2SWw", "text": ["First food truck adventure! \nWalking distance for us is a plus. Not that a drive is a problem in any way but there is more sense of adventure when you walk...", "We stopped by this taco truck by accident.  We saw that  there were many EMT/Ambulance technicians eating here so we thought we had found something the...", "Top notch tacos, burritos, and quesadillas! I was happy to see a wide menu selection. I had the lengue quesadilla to start and it came out fast and piping..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["tacos"]]}
{"id": "hQ5qGvNY4xi_C2G1vdTDKg", "text": ["The best quick lunch!  Always full of hard  working men so you know it's good. I've only had the original tacos....best taco ever. A must try and use the sauce.", "I absolutely love the flour tacos!!! Why else would you go here? The tacos are an absolute must if you come here, it's why they are called Tasty Tacos. I...", "Food is pretty good but the salsa is old and fermented every time. I spent 60 dollars on food for my office and got old salsa that was sweet and looked..."], "rating": [5, 4, 2], "TBscore": [0.36, 0.59, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["lunch"], ["tacos"], []]}
{"id": "04vLkEEuVKfU4PHi1bx8pw", "text": ["I like this place. No complaints whatsoever! The pork belly tacos are my favorite. I also despise onions, but I love the pickled onions in some of the...", "Taco Hangover had been coming up on most of my social media feeds lately, so I was curious to see what it was all about. My husband and I went to the...", "My meal was fantastic! I had the burrito queso and it was so delicious. The black beans were like refried black beans, which were new to me but I highly..."], "rating": [3, 3, 4], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.6], "keywords": [["tacos"], [], []]}
{"id": "92zDDzLvIk142KJ6AiHHGw", "text": ["This is our favorite taco truck!  They have the best pupusas and tacos!!  My boys love the burritos and tortas.  We like to sit at the picnic tables when...", "Best Taco Truck around PLUS pupusas! Always consistent with great food and service both!", "Always gives us both sauces. Best papusas and comes with radish and cabbage salad. Takes a few minutes but well worth it."], "rating": [5, 5, 5], "TBscore": [0.71, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["tacos"], [], []]}
{"id": "nzkBeHUmjibkB8Gi1HV2xw", "text": ["Best Margaritas in town. They have lime and watermelon and the watermelon is the best in my opinion. They also have amazing tacos. So far my Favorite taco...", "Sigh, I had high hopes for this place. I've been a few times since they opened but today will probably be my last. \nDude taking my order could not have been...", "My husband and I dined here last Saturday for a quick lunch.The building is new and shiny so of course new and clean. We sat on the patio. The view of the..."], "rating": [5, 2, 3], "TBscore": [0.64, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["tacos"], [], []]}
{"id": "5zNUTR31qG5nJf5_kSa2DQ", "text": ["UPDATE: Decided to gove this place another try. WOW! Huge difference. Food was great. Manager Skip was supernice. Im changing my star rating from one\n\n(past...", "Been coming here since there was only bar stools. I LOVE the Ole's & churros. I have more recently began to enjoy the tacos more & more. The meat is moist &...", "The single best thing they have at Taco Johns are the tater tots. Get them with a side of nacho cheese and continue to drive north on SW 9th and make a left..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.34, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], ["bar", "tacos"], []]}
{"id": "_sHmsJmzsaLyvIkNUrlpSw", "text": ["Their hours changed since my last review...\nMon-fri breakfast from 6-11 lunch 11-2.\nSaturday and Sunday breakfast only 7-1", "Feeling adventurous today so we decided to try someplace different for breakfast while we were out running errands. After a quick look on Yelp, sorriso...", "Stopped on a rainy Saturday morning. We were able to sit right down. Service was slow and our yummy breakfast took a long time. I had chicken fried chicken..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["lunch", "breakfast"], ["breakfast"], ["breakfast", "chicken"]]}
{"id": "iOH27xGyFZJol2Wyv5RaWg", "text": ["Great place for home style breakfast and friendly service in a small intimate setting! The specials are very good, I loved the Butter Rum French Toast. The...", "Very fresh food and the best iced tea I've tasted!\nThe menu is very imaginative and short which I appreciate.  \nOrdered the taco salad and would get it...", "I would say this was solid food for a diner but will probably not be back. The breakfast Mac and cheese was almost all eggs and very minimal Mac and cheese...."], "rating": [5, 4, 3], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["breakfast"], [], ["breakfast", "egg"]]}
{"id": "PqGEw_0aBasViVp9sZvXHA", "text": ["Went here while in town for work because of the vegan menu I saw posted on here (I'm not vegan, but like to eat vegan when I can). I was surprised to find...", "Healthy, delicious, and such nice people!\n\nI stopped in here curious to try their new Acai bowls and ended up getting the Buffalo Chicken wrap that came...", "I've been meaning to try this place for awhile but the timing was never quite right when I was in that part of town. But today when we arrived to go grocery..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.24, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "zcl2NO_-_SZBDWP99RVRCw", "text": ["A classic food style diner nestled with in the Ramada Inn. This diner had several food options for breakfast that were fantastic. My family stayed in the...", "Stopped in for breakfast.  Friendly service, food came real quick.  The Gutbuster Omelette is definitely a gutbuster.  6 eggs.  Came with hash browns and...", "We were greeted with a huge smile and seating without wait.  It took a while for our server to show up.  I think they make malts and specialty ice cream..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["breakfast"], ["breakfast", "egg"], []]}
{"id": "dW9vUpLC2mk0Gs0qdxi6LQ", "text": ["UNDER NEW MANAGEMENT.....no longer serving food. BUT you can order food downstairs at the Happy Burrito and they will deliver it upstairs to you. \n\nThis is...", "I decided to come here with suggestion from a few friends for their grand opening, and Im glad I did! \n\nI have been to this specific location before when it...", "A group of 4 of us hiked up the stairs at 6:30 on a hot (+90) degree afternoon and were the only ones there for a while. The rooftop location is helped by a..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "33l-ZMt-mOehA3a3Oupn4g", "text": ["This is my favorite Sunday morning burrito place. The wait staff always hustles and always friendly. I haven't tried other menu items in the morning because...", "Really cool vibe and place to go for brunch! We had fast and friendly service and excellent food!\n\nMy date and I ordered the green burrito (which really is...", "Birthday breakfast morning.\nNot too early a table of five we invaded the pub.\nBreakfast was on our minds. The menu was easy to navigate and I found making..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.34, 0.27], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["brunch"], ["breakfast"]]}
{"id": "LY7ODhNFVZZkmj6oy2FAog", "text": ["I'm not sure what happened to poor Louise, but Thelma has decided to go it alone and bake up these delicious homemade yummy cookies in the trendy part of...", "This is a Des Moines staple. If you're in the East Village DEFINITELY stop in for a warm cookie. Any are good, but chocolate chip isn't favorite. Also, it's...", "YUM. We stumbled upon these cookie ice cream sandwiches while walking in downtown Des Moines and they were pretty amazing. My sister and I split the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.43], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["sandwich"]]}
{"id": "G93gL0mAG8a3YMovYStuig", "text": ["Absolutely my favorite chocolates and gourmet marshmallows in the Universe!\n\nYes, I said gourmet marshmallows! They truly are gourmet! Owner Tom Coleman...", "Cute tiny shop with lots of candy to choose from. All sorts of candy from old school commercial candy to homemade gourmet marshmallows. \nSmells AMAZING...", "Oh Candy, how I love you! I love this little shop! They ship their chocolates, camels, and marshmallows all over the world! They make all the old fashioned..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "lCPirkjKheVTAH5l9yrQdg", "text": ["Wow.  Not a place for the indecisive or easily intimidated.  Very patient professional and knowledgeable staff.  Great tea!", "This is the place to buy tea for your diehard tea loving friends and family.  The helpful counter associates are professional, knowledgeable, and there to...", "Located in the super hip East Village, Gong Fu Tea offers a wide variety of teas. The staff seem to be dedicated to their work and have a love of teas. I..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "jDtbGUIJwACO8PtM2m5REw", "text": ["This is still one of my fave spots in town to stop for a treat! \nI love the smoothies here! \nMy fave is the Peanut Butter and Banana lite! \nIt's mind...", "We were passing through Des Moines at breakfast time on a cross-country trip, and this was the only smoothie place that we could find open as early as we...", "Not sure what some of these bad reviews are about. This place is awesome! Granted, every time I've gone I've been about the only person there. So I have..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["breakfast"], []]}
{"id": "WfnQKTwpVI4R0KPUdjwjlA", "text": ["Drive thru experience:\nAll I wanted was an sweet tea. I had a coupon for a free cookie too. Got in line 4 cars deep. Waited 15 min for cars to move. I...", "Two years later and nothing has changed. Still long waits and screwed up orders every damn time.", "Restroom review: pretty design but only hand dryers, no paper towels. This would be ok except you can't leave the restroom without touching the handle...."], "rating": [2, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "Ccps1Fg07jk5GRQxp0L_AQ", "text": ["They really do have good customer service at this location. Food is always the same at this McDonald's.", "I hate McDonalds. I will not give this business my money. It is crap food for WAY too much money. People - stop eating here! \n\nWe were here for the Redox...", "Came here to grab a mango pineapple smoothie. I was waiting behind someone show was taking a while so another employee opened up her register to take my..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "uhoshE6gMIyKcQkBlcHOpw", "text": ["Maybe if the employees could stop arguing long enough to acknowledge a customer I wouldn't leave and go to Wendy's. They hire from the same pool of people...", "Fast and friendly. Hot. And right. Its fast food done right! \n\n\n\n\nThanks guys! Keep up the good work.", "The Big Mac & ice tea were perfect!  Fast friendly service in the drive thru today.  Well done!"], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "NJWQyhgrVmGPYD9sm1r5vQ", "text": ["Sadly my super bad craving for grilled chicken was not satisfied... \n\nSo I have to have protein as the main component of my diet. That being said I am so...", "I stopped at McDonalds on University yesterday on my way to work. I had never had the original chicken sandwich so I thought \"what the heck? It's only $3\"....", "This is not where to do! They can't get orders right, th fries are either cold or cooked a second time and overcooked, abs they are the highest prices of..."], "rating": [2, 3, 1], "TBscore": [-0.21, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, -0.6], "keywords": [["chicken"], ["sandwich", "chicken"], []]}
{"id": "uDptMfuhyi-ZmWmqD9-6UA", "text": ["This McDonald's is hit or miss. Sometimes we go and we get our order fast and it's hot and other times we go and the food is cold and we are missing half of...", "Not all Mc D's are created equal. This ones fresh remodel is impressive. They also have great outdoor seating! \nAlso new giant touch screens for self...", "Nice new remodel of this longtime location. Kiosks are up and running. Food delivered to my table in one minute after order. Great service. Hot and fresh...."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "BcWYX_vspPwnnZ0sufYBmQ", "text": ["This is the worst location. Always missing/wrong food. Long waits. Nasty dirty playplace.", "This is a mixed bag. Morning staff is more pleasant, but customers are slower and more confused in the morning.  Good value all the way around... including...", "This McDonalds usually provides good service and if there is a legit complaint usually amends the mistake. BEWARE if you order with mcdonalds mobile order..."], "rating": [1, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "JiU37kN_iHb_BedDX1d3oA", "text": ["Best smoothies in Ankeny. Tons of options to choose from and quick service. The staff is friendly and willing to explain anything you have questions on....", "Fresh fruit smoothies. I like that you can also get protein in 1 of the drinks too! \n\nThe prices are pretty reasonable from $4- $7 depending on how much you...", "Very delicious smoothie. I got a vanilla flavor with yogurt, banana and spinach and it had plenty of flavor without feeling too heavy in sugar."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "cUMcTAcC41KtrHLhHkBT5w", "text": ["Typical McDonald's.  Some of the staff at this location are great.  Some not as much.\n\nAlways double-check your orders before leaving the drive...", "For not being very busy when we got here the place was really not as clean as I thought it should be. My hands kept ending up with sticky stuff on them. The...", "This is the worst McDonald's I've ever been to! Every time I go there and try to give them another shot, they blow it. I've gone there several times and..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "4qIjaTMrTeQR7rduKNj28w", "text": ["Crack heads everywhere and super nasty! They had no beef patties? What the hell?!  Employees rude as heck and dirty", "This McDonalds is perfect for four things:\n1. Waiting forever\n2. Getting cold food\n3. Getting stabbed\n4. Buying drugs\n\nSo if you want any of those, this is...", "Unorganized, rude, and unprofessional workers. Worst service I've ever gotten at a McDonald's."], "rating": [1, 1, 1], "TBscore": [-0.39, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["beef"], [], []]}
{"id": "7BIW2fwrdUgfzEDREya0mg", "text": ["Rolled Ice Cream in Jordan Creek Mall! We actually stopped at the mall just for this because my friend insisted it was good and I had to try it. \n\nI've had...", "New rolled ice cream place that just opened at Jordan Creek Mall. They also serve sweet crepes too! Got a green tea rolled ice cream dessert and loved it! I...", "Located inside Jordan Creek mall on the first floor in the middle. It's a cute little stand that offers different kinds of rolled ice cream and crepes. I..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "W2jdN_thBpnLMOetkYOuwA", "text": ["I just love this store! I live in Florida and visit family each year and stock up on my pizza sauces and spices. It's a wonderful family owned business. My...", "If I could describe Graziano's in 3 words:  I   LOVE    YOU", "What a neat little store!\n\nIf you go to most Italian restaurants in the DSM metro, you'll see Graziano Bros sausage on the menu and for good reason. \n\nMy..."], "rating": [5, 5, 5], "TBscore": [0.59, 0.0, 0.24], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], [], ["italian"]]}
{"id": "REciFxCuGjOOAPq_1eTv6A", "text": ["..... we dont serve lunch for 8 minutes. Nope. Bye. I am not going to play bullshit games were we count down the minutes, you work for me, I dont work for you.", "Oh my gosh, i dont beleive it!!! They have Bisquits an Gravy now!! Wow!!! And its Super Delish!!!! I have been a big fan of there bisquits, having gone as...", "terribly slow. car 2 in front of me waited 15 min. before they moved. No apology what so ever."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [["lunch"], [], []]}
{"id": "PmiIB_6kMIC1JKFXC3N_ZA", "text": ["Awesome spot to grab some quick healthy meals. It's like meal prepping but with 0% of the work.\n\nWas somewhat skeptical that I would have to use the...", "I have been eyeing this place since it has opened and see that is open when I drive to work at 5 30 AM.\n\nThe day I decide to stop in it is closed, even...", "LOVE THIS FRESH + HEALTHY GRAB & GO!\nTraveling to Illinois w my 4 kids, this place was a beacon in a sea of gas stations & fast food restaurants. I love..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "lk6HrcQNbYGkkvWDal-gww", "text": ["Stopped in a ordered a few different dishes. A malt, a cone, a sundae and a cup. All were good soft serve. $12 for four desserts, not too bad.", "On a search for an ice cream treat on the 4th of July, we found this cute little shop. Everything you can expect from an ice cream shop can be found here....", "Holy Cow, Chilly Cow! I just discovered this awesome ice cream shop. They are SO friendly and have great customer service. I found out they not only make..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "LUrJ24ZwihAEmTtPfn35HQ", "text": ["My first time to visit The Basement was last Friday for \"The Jazz and Roots Happy Hour\" featuring The Feel Right. I was completely unsure of what to expect....", "The basement now takes credit cards... OH NO my tab just got bigger..", "I've been here many a time - even before it was officially The Basement. It's a good place you go for all kinds of different events, but it has its..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "csHwRCJBH31TKLtv9HL7AA", "text": ["Where do they find all these old arcade games? It's dark in the place, just like the old arcades when my mom wouldn't let me go because kids got kidnapped...", "Ok, so maybe this place is a guy thing?  I like games and classic video games and it was ok, but it was HOT HOT HOT in there.  The bathrooms were confusing,...", "OK, first of all, this place needs to be sued for FALSE ADVERTISING. The name clearly says \"UP/DOWN\", but it's located downstairs. So you have to go DOWN..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "Es_jRFy49emscwH156SL2A", "text": ["\"Where are we going tonight?\" \"To the Cup!\" My friends know my answer so well it's comical. It's two parts moscow mules one part 90s and all parts...", "Reading other reviews I expected this place to be significantly larger, but it was tiny!!  Either we missed a section somewhere, or something??  When we...", "I have never had a mule before, so our local friends asked if we wanted to try one. We got four different mules; two traditional, a berry and a sexy mule...."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "QS7xFHakrCNzQihh68Grsw", "text": ["Juniper Moon is fantastic! We moved here from Seattle and it has reminded us so much of home. There's comfy seating, good lighting, a pizza phone, and so...", "The hoob and I went to Juniper Moon this weekend because he wanted to check out their whisky selection and we wanted to have a nice date night. He got a...", "Nice place to grab drinks! We stopped by since we had about a half hour and each got some crafted drinks. The drink I had was tasty and consisted of..."], "rating": [5, 4, 4], "TBscore": [0.47, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["pizza"], [], []]}
{"id": "GzvdelFuekszXBmS8KjEZg", "text": ["Local art on the walls? Check.\nGreat drink deals? Check. \nChill environment? Check.\n\nWednesdays: 2 for 1 martinis, with a vast and creative martini menu....", "Serves really good martinis. A must visit bar in the heart of des moines downtown. We ordered easy fruit and manhattan. They were well made drinks.", "A gem of a venue slightly off the Court avenue headliners, the Lift is my go-to place to either start the night or to end it. Not having a prominent sign,..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.57, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["bar"], []]}
{"id": "QZ-A8Wo3U6GHdRfASwfjIQ", "text": ["The Red Monk is a sweet pub that serves Belgian beers that you probably would be hard-pressed to find elsewhere in the US. \n\nI love the decor and the warm,...", "Best beer. In town.because Belgian beer is outta this world. I just wish they had more of it!! The selection is usually good, but small- La Trappe,...", "Usually come here with my guys before we head over to Fong's for some pizza. \n\nHas always been a great place to grab drinks and just sit back to relax.\n\nCan..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["pizza"]]}
{"id": "lyt3-sp8pzrutv90ntCNeQ", "text": ["Great rooftop bar with a nice view of downtown! Stopped by here to grab a drink and enjoy being outside and felt right at home.  There is indoor and outdoor...", "Chill bar with a rooftop. Friendly and efficient servers, so you're never waiting endlessly at the bar for a drink or for a server to come by.\n\nJust...", "Hot town, summer on the city, going to the bar, gonna sit in the sun, on a roof and drink.\nYup, that's this bar.\nWe biked across town to hit this..."], "rating": [5, 4, 4], "TBscore": [0.45, 0.0, 0.25], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "s9Ye8K-s-kyD0hdF5Ep2vA", "text": ["Have a burning desire to live out your stripper career fantasies? Look no further. Carl's is a judgement free zone that encourages people to be themselves...", "This is a dive bar but everyone is always welcome.  It is a bar that is always busy and many nights they have live bands.  If you pull up to the bar you...", "Fun bar! Lots of TVs for watching football. The crowd is a great mix of young and old, white and blue collar. The bartenders do a great job of keeping the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.38, 0.31], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "Q-RQHUR9gOWQGVyZFKduSQ", "text": ["Really fun space for an event or hanging out with buds! I was here for a wedding reception. The reception was actually about 5 months after the wedding took...", "Great place to spend time with friends.  $10 cover charge and we brought all our own food and drink.  There are pool tables, ping pong tables, deck...", "Came here with friends and brought a huge cooler of beer.  $10 to get in and that's it.  They have bags, darts, ping pong, pool, n64 with 007 and Mario..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "GbjnwJBB5Xb_Qj9_8nFqKA", "text": ["My favorite bar in the city\n\nGreat aesthetic! Stiff drinks. Good music. Friendly locals. Mike the bartender - a true rockstar\n\nCan't beat it. Seems like all...", "Bar seemed cool, most of the people seemed cool, however we were harassed until we left seemingly because we weren't regulars. Probably won't go back", "This place is awesome! Not the best bar if you're with a big group of people, like how I was since it was my friend's birthday, but the atmosphere is fun...."], "rating": [5, 1, 4], "TBscore": [0.45, 0.24, 0.57], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "MPVVbTp81f3qGeIpfunJwg", "text": ["Inexplicably one of my favorite places to drink outside but least favorite to drink inside. The patio is rad and the outer aesthetic of the bar is right up...", "You know what really makes this place an all around great neighborhood bar? The patrons. I seriously have never met a more accepting and fun group of...", "Ok I usually love this bar. bUT... The bartender with the big beard at the bar was horrible tonight. Every other bartender has been great. Good music cheap..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.29, 0.22], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "iv3zHu4JjFnfZhYILB8lVw", "text": ["We rented a booth for the night and I gotta admit, that was the best idea all night. \n\nI worked with Joe on setting up the booth and he was awesome. I...", "Last night, the guy who checked the IDs apparently thought he was the fuckin detective off Law & Order. \"The N in Nebraska should be a centimeter to the...", "Great fun bar with good music. The concept is super fun and makes for a great night out. \nOn my birthday I called to inquire about bottle/table service but..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.54], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "CsmVHkP_9RlcmdETJvN21A", "text": ["Still a great place to see a show.. but come on those Tables Got to go! \nWhen the show is supposed to rock, make those tables go in to a \nlock-ed closet..\nI...", "I don't want to be gaslighted. But I don't mind being gaslamped.\n\nThe Gaslamp is in a pretty trendy part of town and has a lot of cool stuff going on. It's...", "very nice place...my exceptations visiting dsm were pretty low, but what a pleasant surprise\nservice great, martinis were perfect, and the tapas were to die..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "sGe96D__q529Ie9Fk5a8FQ", "text": ["I had to compromise with the rating on the Tipsy Crow.  For the physical attributes (location, design, tables, etc) I give it 5 stars.  What a great...", "Stay aware unless you're \"in the club.\" I've gone on multiple occasions and had to wait an inordinate amount of time to be greeted, let alone order while at...", "Frequently visit the farmer's market but didn't know this place was just around the corner. The bloody Mary bar and unlimited mojitos are great options for..."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "A6jIGNb-3jXGVMNVrKHg6Q", "text": ["Casey's the great nightclub nice mixed crowd coming on a Wednesday evening drag queen show happening around 10:30 great performance \n\nPeople in Desperate...", "The Garden is a great place that is a LGBTQIA+ friendly nightclub. The have regular drag shows and amazing drink specials.  Sometimes the have a drink...", "The best Nightclub in Des Moines, hands down. They always play the best music and dont get me started on their Drag Shows. \n\nI can honesly say that Jol,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "qOEKW7y8BFr5vdIeki8QSA", "text": ["Although I have previously enjoyed just drinks at Shorty's, I recently went and ordered food along with drinks. Along with two beers, I had ribeye skewers...", "Great little dive bar off the main drag.  If you looking for a dark atmosphere in a basement look no further. My husband, son and I stopped in for a beer...", "I dig shorty's for afternoon brews!  They have a great happy hour and always serve Schlitz in fancy goblet type glasses that make you feel like the happy..."], "rating": [1, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [[], ["bar"], []]}
{"id": "nLOm5Row04wj_yY46BP1Rg", "text": ["Great service!  We've been to the Ankeny one and the food was better there. \nWe ordered sausage nachos to  but got smoked chicken brought to us. It was good...", "I decided to give this location another try after all it has been a few months since they opened. I was hoping they had time to improve. Yeah, just avoid...", "A bad server can ruin past positive experiences. Until Saturday night, my wife and I really liked this spot. However, we had a server named Chance that was..."], "rating": [3, 1, 3], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [["chicken"], [], []]}
{"id": "Ndlvnjs68sRYEg6Vkt1bnQ", "text": ["I was on a business trip from out of town with a friend and we decided last minute to go out. Super last minute. We typed in hip hop bars and Lime Lounge...", "There this weekend. Weird vibe. I felt unsafe. Kinda rapey. Owner does not take safety seriously.", "I go to Lime Lounge on Thursday for salsa dancing. The music is good and so are the Latinos. What I have a problem with is that on more than two seperate..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["bar"], [], []]}
{"id": "TvtfVbSS0igoDxVxA5fEEg", "text": ["Pros: \n-the location. Ingersoll Tap is obviously on Ingersoll, and near lots of other bars and restaurants. \n-the space. The inside is a lot bigger than...", "The location is great But Unfortunately a short blonde bartender got too intoxicated while working and started screaming profanities at everyone. Probably...", "Ingersoll Tap is a great place to meet up with friends and play trivia on Thursday nights. The interior is newly updated with more private booths. Later in..."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [["bar"], [], []]}
{"id": "sOw4D0OvemlblP4n5RL-1w", "text": ["Best talent is there during happy hour after work when the beer is also cheap and cold..then the talent heads to other places. So I've heard.", "Had a bar crawl night checking out Des Moines area strip clubs, and stopped into Outer Limits. I'm not a drinker so I didn't check out the bar - I was...", "Came here on a Friday with two friends. There was a 4$ cover. The girls were varied ethnicity and all attractive. I liked Bree the best and had dances with..."], "rating": [3, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [[], ["bar"], []]}
{"id": "MVxlYrD7DI6e0b4qHFmrCg", "text": ["I like dive bars in general so naturally I enjoyed my visit to Yacht Club. Fun locals were pumping the jukebox with good tunes. The Busch Light was cold and...", "Just a typical dive bar. Very chill environment to get a beer and hang out. Don't come here if you hate old furniture, dim lights, and a loud crowd. Service...", "Nice dive bar on Ingersoll. Went in early on a Saturday night (6:30pm). Not busy and drinks were cheap and strong. Only downside was one of the people in..."], "rating": [4, 3, 4], "TBscore": [0.23, 0.0, 0.25], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "cAhDVatJM9VxyFjac-DA0w", "text": ["You kinda have to love a place where they still sell normal cans of cheap beer!  \nYou also have to  love a place where you say, to the bar tender..\"Does the...", "Best place ever. My sister and I started here in our 20s. We don't live in the state anymore, but when we are, have to stop in. Does Mike still own it??", "What's with the grumpy old bartenders?? Went in about 9pm, place was about 1/2 full. Waited several minutes to be served as he walked back & forth behind..."], "rating": [4, 5, 1], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["bar"], [], []]}
{"id": "CIcm5jTzxxzGAXDJbGOC-w", "text": ["The Blazing Saddle is about the only bar in town that might be packed on any given night.. I have been here a handful of times and ever time is been super...", "This is a nice bar to hangout while visiting this town.\nPeople seems friendly and pretty melow.\nYet i encountered some snoby gay guy in here but there are...", "For those who are visiting, you are probably aware that the LGBT scene in Des Moines is smaller compared to larger metropolitan areas.  The Saddle (never..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.41, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "_j6Yk9t_QyPPxaQ_ih2H6w", "text": ["Totally an old man bar, but an awesome neighborhood place to hangout. They have a semi - Irish pub vibe. About 7 beers on tap, a couple local. They also...", "Love the ambience and has so much fun on St. Patrick's day- heads up they are a cash only bar but the ATM gives out $5's so that's fun!", "Bathrooms are average to sub par. Strange smells abound. Lighting is poor. Redeeming quality is the list of Irish poets and their quotes above the urinal...."], "rating": [4, 4, 2], "TBscore": [0.28, 0.29, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["bar"], ["bar"], []]}
{"id": "K63jeGDGUbSd3S_OR8-INQ", "text": ["This place is far from fancy.  It is kinda boarders on a dive bar...  they do serve food and the have Karaoke on Thursday nights.  It is quite a hit to the...", "AJ's has a mixed diversity of customers, 21-99, all types of music can be heard! \nThey have karaoke 7 days a week! I have personally attended on a packed...", "TLDR: karaokes to killing in the name of. Drank some shots. Drank some water. Had some fun. What else matters at midnight on a Friday? \n\nSmallish bar with..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.3], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["bar"], [], ["bar"]]}
{"id": "pgl7fSM3q8642sGkdSiY4w", "text": ["Delicious food and excellent service. The drunken noodles are phenomenal...we added tofu and it was some of the best I've ever had!", "Looking for authentic Lao Food? Rolling Wok is definitely one of Des Moines' gems for amazing food and service! Located in a Mexican plaza on Grand, the...", "We were just passing through and wanted some authentic Laotian cuisine.  They had Kao Piek sen ( chicken noodle soup) with fresh noodles. The food was very..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["mexican"], ["chicken"]]}
{"id": "Ax0-ogVDYrIQpPppoM11Jw", "text": ["Shang is the best \"fast Chinese food\" in Des Moines metro. Their menu options are pretty traditional when comparing m to the other Chinese food places in...", "Went here with a peer for some Chinese food. First time visit. I was unimpressed. \n\nAmbience - gives you the fast food vibe. The seating arrangement with...", "Always pleasant, fast service especially for takeout. Generous portions for $8 entrees. My fave is their egg drop soup (Tues/Thurs/Sat), egg rolls and..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.31], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["chineese"], ["chineese"], ["egg"]]}
{"id": "NH3_zKNQJap9Dc0SeIL2ww", "text": ["I've eaten there twice in 2018 and enjoyed both visits. The staff was friendly & helpful, and the buffet was constantly maintained with fresh, tasty...", "I've had plenty of Chinese food that costs less and tastes 1,000% better than Hong Kong in Des Moines.  Sorry folks, but its true.\n\nWe had their Mongolian...", "The food is fine. Not top notch but I was craving crab rangoon and it did the trick. \nThe delivery service was awful and I won't be ordering from them..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], ["chineese"], []]}
{"id": "2O7WHGhtr6TIF3vlRAo6Kg", "text": ["This is by far the best Chinese takeout in all of DSM. Style and appearance might not be their specialty, because they focus all on the food. Beef lo mein...", "We decided to give them a try, despite mixed reviews. I checked Yelp and a few other reviews to figure out what to order and what to avoid. With this help,...", "there was no silverware or napkins when i got my food delievered wtf?!?! didnt know this was the caveman days!!!!!!!!!!!!!!!!!"], "rating": [5, 3, 1], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["beef", "chineese"], [], []]}
{"id": "N4N6PYL3Tfxv4bqlbgJEcA", "text": ["The most amazing Chinese food I've tried in a while, will definitely become my go to place to order from! Thank you for blessing my taste buds!", "This was flavorless. It tasted liked watered down nutmeg instead of curry. I won't order this again. Ended up tossing the entree and eating the white rice.", "We just ordered from Cheng's Garden on Merle Hay road and it was GREAT! \nWe will definitely be ordering again!!"], "rating": [5, 1, 5], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chineese"], [], []]}
{"id": "3ImWdpHABzxOf83k1raEQQ", "text": ["Different Chinese good than what we are used to having. The Wonton Soup is KILLER! The broth is so chickeny and rich! I've fallen head over heels for...", "Well as a huge fan of Chen's Garden's delivery from Merle Hay, I was excited to see there was a new Chen's Garden over by the airport, so I thought got to...", "This place comes across as very authentic with their menu selection and asking what my spicy and garlic tolerance is which tells you it is made to order...."], "rating": [5, 4, 5], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chineese"], [], []]}
{"id": "HjwivLt9JKBcSeu1aCmdBA", "text": ["The best there is besides Tsing Tsao South if you ask me. Service is fast, prices reasonable and always top quality food. We order from here quite a bit and...", "I went to Lucky Bamboo because I saw the good reviews, but was pretty disappointed overall.\n\nThere are some pros like large portions at an affordable price...", "Ankeny's best Chinese place... Which isn't saying much with how little of options Ankeny has. The food tastes decent but be warned they tend to be out of..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["chineese"]]}
{"id": "1PcjS8DhPZnwI_zTZIvdyw", "text": ["This place is close to my house, but I have never been - until today. \n\nThe food seemed fresh, it is not the longest buffet nor does it have a ridiculous...", "Awful. You know it's never a good sign when you're the ONLY patron at a Chinese buffet on a Saturday at 1:00 pm. There was a wide variety, but the food was...", "I had no idea this restaurant was still open but it is!  We thought they had crab legs during their dinner buffet but they only have it on Sundays.  This..."], "rating": [3, 1, 3], "TBscore": [0.0, -0.29, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [[], ["chineese"], ["dinner"]]}
{"id": "_Z7vBDrs8Hr7KTA0lHs18w", "text": ["Very good food and service. I had the pot stickers and he sesame chicken. Both were very good and were good sized portions.", "Good food, good service, decor doesn't match the price. Ordered the dinner for two with egg drop soup, crab Rangoon and Mongolian chicken, my wife had all...", "I only crave Chinese food on rare occasions and when I do, my boyfriend and I always choose the Iron Wok in West Des Moines. Not only is the food delicious,..."], "rating": [5, 4, 4], "TBscore": [0.48, 0.27, 0.26], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken"], ["dinner", "chicken", "egg"], ["chineese"]]}
{"id": "e2s7pE0MbTNb8hdmwe3qyw", "text": ["In town for military school and found this great place right down the road from Camp Dodge. \nSmall restaurant with great customer service \nExcellent lunch...", "So much no. The high reviews here blow my mind. If you like super gloopy, Americanized Chinese food with TONS of filler vegetables, look no further. At...", "Wonderful, authentic food. My husband and I were looking for somewhere with wonderful food and a quiet atmosphere. This place did not disappoint. We had the..."], "rating": [5, 1, 5], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["lunch"], ["chineese"], []]}
{"id": "l4qJEQiZzOANR3hBSqWabQ", "text": ["This restaurant is really nice for a quick sit down restaurant. The staff was very kind and in no rush to get me out. Not only was the staff nice, the food...", "I rarely go to Windsor heights because of the police state and their red light cameras, but I'm glad that I stopped here on my way through. It took about 6...", "This restaurant used to be China Star. The inside had been completely redone; new flooring, new paint, new art work, new tables, chairs and a fish tank has..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "-8Y60jXZlTDC3QFc09vkMQ", "text": ["In terms of just the food, this is one of my favorite spots for Thai food in Des Moines. This place does get a bad rap for their service. But I don't blame...", "New place to try Thai. Much bigger space than parking would lead you to believe. \n\nI ordered pad see ew with chicken level 2. I don't recommend the chicken...", "Best angry chicken in town!  Getting it for takeout once a week still feels like not enough!  \nTip: you can get a half order (3) of crab Rangoon. Their..."], "rating": [4, 3, 5], "TBscore": [0.0, -0.27, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["chicken"], ["chicken"]]}
{"id": "OyAVumPKa2sXPmiJin5Vgg", "text": ["For awhile I have been looking for good, consistent Chinese food that was on the west-side.  I stumbled upon Canton and OMG is it good!\n\nEverything is...", "Pretty middling - decent, not-terrible carryout, but could certainly be better. We sampled a wide variety off the menu and were underwhelmed.\n\nKung pao...", "Great local Chinese restaurant! Their food is consistently fresh, hot, and delicious. We typically order for carry out in the evenings and it is around 15..."], "rating": [5, 3, 5], "TBscore": [0.46, 0.0, 0.31], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "kR5hMt53SV0n103Robmelg", "text": ["The food on the steam tables was cold and I came on a Sunday around 1230.\nI deafly rank it the worst Chinese buffet I've ever been to and I used to think...", "The most of the food was too cold. They had really good soup and teriyaki marinated potatoes. The green beans and sugar buns were also yummy. Can't give...", "Unclean food,there was a hair in the steam corn .The food tasted very bad that I was about to vomit after just one plate of eating it. Also, the restaurant..."], "rating": [1, 2, 1], "TBscore": [-0.6, 0.0, -0.91], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [["chineese"], [], ["corn"]]}
{"id": "Hfz_SgyzW8hKfDpno_Zw9w", "text": ["Normally I don't come to Norwalk to eat unless I'm meeting my buddy who lives down here. This day my buddy and I wanted to try their Peking Duck because I...", "I was so excited to see the Pho sign on the window. Pho is my go to for comfort food and knowing I can have it delivered to my front door was awesome. So is...", "This located in a newer strip mall in Norwalk, Iowa. This business shares the parking lot with a bank so during non business hours they get the parking lot..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "i40WnHr2nMWq7nfNowl-UQ", "text": ["Very good-always ordered dinner when I worked late nearby. Friendly and fast. Love their sweet and sour chicken has the pineapple and peppers mixed in....", "I'm sorry but the food is just awful. I travel a bunch and get the craving for Chinese food quite a bit. I have come to expect the not so great Chinese food...", "In a pinch, dont be a grinch, give China moon a call, they come lickety plit an you will swoon ya'all!!! I had my daughter an her hubby stayin over, an we..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["dinner", "chicken"], ["chineese"], []]}
{"id": "GJDSDoz9csqBSGx1tmi1Zg", "text": ["Speedy delivery on a Sunday evening. Tons of food for $33. We ordered orange chicken, fried rice, Kung Pao Chicken, and chicken lo mein. Our \" fried rice\"...", "On Friday night we decided to try Asian Cuisine in Grimes (200 SE Gateway Dr).  It's not far East of Fortune Garden... Grimes' other Chinese restaurant.\n\nWe...", "My husband and I picked up takeout on Friday night and was amazed with how hard the workers were working to pump out food. They were incredibly busy but..."], "rating": [4, 4, 5], "TBscore": [-0.6, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["chicken"], ["chineese"], []]}
{"id": "Ad30NH-WtoNzxSnYWNbxEA", "text": ["I wonder who the Desiigner of this place was.\n\nPretty typical Americanized Chinese food which isn't really Chinese. Exactly what you would expect in a...", "I was disappointed when I ordered the big plate.  It is supposed to be 3 entrees and either rice or noodles for $8.80.  I ordered and my total with a...", "Pretty good Chinese fast food for a decent price.  You can get free samples to try out the different dishes which some people take advantage of so it might..."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "J-K2ArAaDy0szbR0JgbEqQ", "text": ["We have ordered Jade Garden \"to go\" many times with delivery. Our food was always hot and fresh with super speedy delivery. \n\nToday we chose to dine in and...", "The food at Jade Garden is closer to traditional Chinese food and is amazing! It is so much better than the Chinese fast food chains! It's fresh and made to...", "Placed order online... when delivered was missing the Eggrolls I ordered and paid for, instead it had a bag of what looked like styrofoam. I called to..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.26, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], ["chineese"], []]}
{"id": "E1KjjNGAP7-BAVogku3dqg", "text": ["Bottles of Tsing Tao less than $3.\nFortune cookies with lottery numbers (and they gave me 4 more to improve my luck!)\n\nService fast and reliable.\n\nFood was...", "I come here often because they have the best egg rolls in town. However the rest of the menu is over priced and tasteless. The atmosphere is outdated with...", "House of Hunan is good comfort Chinese food. The menu is more of your standard Chinese American fare but for some reason it's my go-to. I know that they do..."], "rating": [3, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 1.0], "keywords": [[], ["egg"], ["american", "chineese"]]}
{"id": "cFdQGLYxE59Q0zS-hke8fQ", "text": ["I've eaten here exactly twice now:  I ordered a \"meh\" Pad Thai first time around.   Yesterday I had a \"meh\" order of Rad Na.\n\n\"If you can't say nothing...", "Excellent Pad Thai. Food is always quick and good. The workers are all very pleasant. \nIf you're downtown for lunch time definitely stop by!", "I just moved downtown for work.  This was the first place I tried in the skywalk.  It's a fast food type of Thai joint with low prices, and for what you pay..."], "rating": [2, 5, 4], "TBscore": [0.0, 0.6, 0.0], "normalisedRating": [-0.2, 1.0, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "BXWX9R8zr1QI6Uh-ANeMWA", "text": ["This place is just bad.\nI went here over the lunch hour a few days ago and I'm still trying to forget it. \nI got the general tso's chicken with an egg roll...", "Pretty cheap.  Pretty gross.  \n\nWha? No chop sticks? How will I impress everyone with my worldly skills of dexterity?\n\nThis isn't the ubiquitous chain of...", "Not quite sure how this place stays in business to be honest.  It's very average food although it seems the quality has gone downhill.  Another major..."], "rating": [1, 2, 2], "TBscore": [-0.36, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.2], "keywords": [["lunch", "chicken", "egg"], [], []]}
{"id": "VSGAFA7io9m9XoPYi6Pq6g", "text": ["Took the kids to Tsing Tsao West/Urbandale for lunch a while back\n\nThis place used to be a solid go-to for me, but over the past year(ish) or so the food...", "Walk in: Say for here or to go, and then order. Your food will come out quickly, and it will be a huge pile of it. We chose to dine in. Much to my dismay,...", "Tsing Tsao allows you to order via their website and choose a time to pick up.  When I arrived it was ready, as expected.  The General Tso's chicken was..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["lunch"], [], ["chicken"]]}
{"id": "_mkzfuqkNSqO59FzVyBB1A", "text": ["I love the pad thai. It's super affordable and always consistent. Add ons and meals are definitely a good deal here.", "When you need to grab a quick bite that's pretty healthy but also filling...Noodles & Company! They fit a nice void and have a little bit of something for...", "I have never ate at this location, but was pleasantly taken by it!  It was packed at lunch, but ample seating still gave us options on sitting on the patio..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.92], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "HH82NPFqBEXDhO02FR6fuA", "text": ["One of the best mall food choices at Jordan Creek. I've had it all there and the teriyaki is the same flavor for each dish. Expect that. I like this...", "I know I shouldn't  expect much out of food court Chinese food, I had the special for\n$6.50 which was the chicken teriyaki with vegetable and rice.\nFirst...", "Expensive for just little food. I paid almost 10 bucks yet they give only little meat. What a rip off"], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], ["chicken", "chineese"], []]}
{"id": "VOtKVEDHPozjZHMbZ2GsYw", "text": ["I am in West Des Moines for work, and I asked my coworker to take me to his favorite Indian restaurant for dinner, my treat. He took me here. He said he...", "Went here first time after a disappointing Indian food with a competitor. Came for their lunch buffet. Loved the food. I used to love one of the bigger...", "Absolutely loved their Paneer Pakoras!!! Service was great and the food came out very quick. Didn't have to wait for too long. \n\nWould definitely come back."], "rating": [5, 4, 5], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["dinner", "indian"], ["lunch", "indian"], []]}
{"id": "4v0AJdTLG_dVvcc-j-dXRw", "text": ["So I was trying to remember the first time I ever had Indian food.  It must've been the early 80s because I don't remember much of the early, middle or even...", "I have been here multiple times and every time have truly LOVED the food. Today I ordered for pick up. \nChicken tikka masala, with paneer added... \nUpon...", "Located next to Mayhem Comics this place is under new mgmt and chef plus newly decorated. Despite the sparse decoration this restaurant has solid Indian.  I..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["indian"], [], ["indian"]]}
{"id": "8-oEtNtyuGP1r6oBlG9u9A", "text": ["I really want to love this place. The only Indian lunch place I know about in the skywalk. Mom and pop type of place. Low prices. Friendly gal at the cash...", "Ate here a couple of times for lunch and enjoy having an Indian option in downtown.  Food however is only okay. \n\nFor $10 you get two entrees, rice, naan,...", "Very tasty food.  Good quality.  Resonably priced.  Not an expert on Indian food, but, I thought it was authentic and better than I have had at many Indian..."], "rating": [3, 3, 5], "TBscore": [0.21, 0.3, 0.48], "normalisedRating": [0.2, 0.2, 1.0], "keywords": [["lunch", "indian"], ["lunch", "indian"], ["indian"]]}
{"id": "Qh3w6F5enrsW5XrrJE7scQ", "text": ["It had been awhile since my last visit. I was feeling a bit under the weather so I remembered the Chettinadu and the advice I'd received the last time I was...", "I asked my Indian colleague to take me back here again, because I really liked it the first time. Except it was Monday, and this place was closed per Yelp....", "After a few months hiatus, I decided to give this place another try for its lunch buffet. Taste-wise, I think Paradise really went downhill. They had more..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], ["indian"], ["lunch"]]}
{"id": "NNxhEPsOU1pFjzY_c2PNuQ", "text": ["It's a casual sit down Indian restaurant. You can specify the kind of naan you'd like. I got a temporary mini freakout because when the food first came out...", "Came here for lunch and were pleasantly surprise to find combo ( thali) options. Along with the menu there was the veg combo /chicken combo and goat combo....", "Wait more than 40 mins for a biriyani and it's much expensive than any Indian restaurant I have ever been"], "rating": [4, 5, 1], "TBscore": [0.0, 0.73, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["indian"], ["lunch", "chicken"], ["indian"]]}
{"id": "SJ95xH0eAadZSNiRWQAPGA", "text": ["We make it a point to set aside one meal here every year when we visit family in Urbandale. The grocery is complete and full of not only your expected foods...", "Speaking of the market only, they don't list the prices of hardly anything. They could charge you whatever they want. I can't keep asking how much on every...", "Just had lunch here today with a co-worker and found India Market by chance when reading up on Indian restaurants via Google. India Market is a Indian..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["lunch", "indian"]]}
{"id": "cUUTIKGjVv5ly4jkPV01Ig", "text": ["Love their complex, rich flavors! Located in the strips just south of the Homemakers corner, we ate here on our way downtown on a date. Great selection of...", "I don't think I can eat Indian food again. I was up all night with horrible stomach pains after eating this food. I have never had food poisoning like this...", "I had the lunch buffet. I was low in battery so I didn't take photos but there are plenty on the site. There were a lot of vegetarian options, like a paneer..."], "rating": [5, 1, 3], "TBscore": [0.0, -1.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], ["indian"], ["lunch"]]}
{"id": "xafgS5xj1vtK73V5H93HmA", "text": ["Super tiny hidden gem just south of downtown Des Moines, kiddie corner from Grazianos! I discovered this place about a month ago via word of mouth and...", "This is my favorite Mexican joint in all of Des Moines and surrounding areas! The food AND margs are top notch. Never disappointed. Traveled the country and...", "Delicious food and great service. Nice family friendly atmosphere for lunch on a Saturday. The owner is very friendly and cares about your experience. Check..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.34, 0.65], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["mexican"], ["lunch"]]}
{"id": "BRlC1BbjdnLcONqCT1NDXg", "text": ["We had the most incredible meal at El Patio! The salsa, the bean dip, the tacos and the fajitas--all so out of this world! The atmosphere is so comfy, you...", "We went there w high hopes. There is not a host/hostess to seat your party. Two wait staff came by us without acknowledging us. Another staff came to seat...", "This place is set in a cozy, little house. We loved it! It took us a minute to catch someone's attention to be seated. There needs to be a bell on the door..."], "rating": [5, 1, 2], "TBscore": [0.75, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["tacos"], [], []]}
{"id": "xB6xv6XNziWz5DDlAtAnpA", "text": ["Our favorite place and it is AMAZING! Always busy and the food and service is fantastic! The owners are great and everyone is very personable! We eat there...", "Old West serves amazing steak fajita quesadilla, flautas de pollo, and DELICIOUS large micheladas! Great service and AMAZING food! I would definitely...", "This wasn't my  first visit, but it had been a while.  It was just as I remembered.  The parking lot is always full which tends to be a good sign,  here not..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], ["steak"], []]}
{"id": "iP6Esf6iH8bfWQdLonZfEQ", "text": ["I've gone here on many occasions. Never left hungry. \nThe portions are huge, especially on the carnitas plate. My husband loves this plate, especially with...", "The salsa served at the beginning was really watered down and didn't have a lot of kick, but the chips were pretty good. Had ordered a strawberry mojito for...", "I've heard great things about their margaritas so when we had an hour to kill we decided to give them a try. \nMy daughter opted for a frozen strawberry..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "Uu93zwjGIKwitVNlhg9irg", "text": ["The freshest seafood for the best price in Des Moines! Absolutely love everything on the menu here. I don't know what else to say other than that I've never...", "Best Ceviche in town & Best Mexican Seafood.", "- Table was dirty\n- service was so so\n- Food was ok, but not to die for\n- Margarita SUCKED!"], "rating": [4, 5, 2], "TBscore": [0.0, 0.67, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [[], ["mexican"], []]}
{"id": "9CUuBuv-oiSe6NaF_ZWC1g", "text": ["Went back again and tried another dish which is another MUST-TRY!! \nTacos Tropicales 5/5-\nPork, Pineapple, Grilled Peppers And Onions, House Slaw, Corn...", "The food is fantastic. They make the tortillas fresh right in the front of the restaurant. I've had the fajitas, quesadillas, and the cheese dip on multiple...", "We got to the restaurant just before noon on Sunday. I was craving nachos and we had a gift certificate. It was pretty empty and we were seated right away...."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["corn"], [], []]}
{"id": "NeS0rVd6mecuhJL6fuedsQ", "text": ["My husband and I just discovered this Mexican restaurant off of Hickman. What a great find! The service is quick, and the food is wonderful. I had one of...", "Based on the other reviews, a group of 5 of us gave El Barco a try last night. Our food was pretty good, but the drinks and service were not up to par. We...", "Our new favorite Mexican restaurant. We've tried almost all of them.  We enjoyed fast, friendly service. They gladly prepared taquitos which were not on the..."], "rating": [5, 3, 5], "TBscore": [0.58, 0.0, 0.32], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["mexican"], [], ["mexican"]]}
{"id": "YANjW1ZnIqJHn3iXn-sx8w", "text": ["Favorite Mexican restaurant in Ankeny! Very good wait staff, food is wonderful!! If you are real good they will bring you a complimentary tequila shot at...", "Felt like Mexican for lunch and just happened by. Looked pretty authentic and was busy with local working people, usually a good sign.\nThey have a buffet...", "Beautiful weather calls for a patio!\nThis location has a patio. Guess what was full when we arrived.\nWe settled inside by the window over looking the..."], "rating": [5, 2, 4], "TBscore": [0.62, 0.26, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["mexican"], ["mexican", "lunch"], []]}
{"id": "Ws8knBvgp4mC_Kv63nSrtw", "text": ["Soooo, we never tried the tacos or Tortas here but we keep going back for the Mangonada De Nieve and Mangonada that's just the mangoes in a cup! Seriously,...", "Confused at this yelp address..it's definitely wrong as this is of off 14th..really needs to be changed since we drove all the way to this address only to...", "Small place, but you wont be disappointed. Everything is great! Their food is very authentic and made fresh. They have tacos, tortas, sopes, gorditas,..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["tacos"], [], ["tacos"]]}
{"id": "_YerpDXN88mZioVwIDUh_Q", "text": ["Ok Ill admit it. Ive got some pretty jacked up ideas of what's good and what's not. For example.  Bologna.  I hate the name brand bologna but I love HyVee...", "What industry is my abuelita in? She's in the tamales industry, of course. As are these guys, inside the Merle Hay Mall.\n\nI guess they're trying to make an...", "Iam originally from Arizona so when I saw this place I was excited tamales in Iowa. However when I walked up to the counter and saw the prices I was a..."], "rating": [2, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "jhPvzeTiG7sX69ByQSevzA", "text": ["My Favorite thing about El Rodeo, has to be the Chips and the Salsa. They have got it down there! \nI have gone here a few times and always dug my meals,...", "Listen. I love El Rodeo. SO. MUCH. I wrote a review on google last time I was here and I'm back tonight and I have even more things I want to say about this...", "The food came to the table cold! Tasted like caned Tex Mex from the store. When we complained to another waiter we were told because I had already taken a..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "QOrI8-hW5_k1YBW6NAbWcA", "text": ["I have been WAITING for this place to open since the one on Ingersoll closed.\nI can't name the dishes my other two guests had....but they LOVED them.\nI had...", "Came here on a Friday night about 5pm and were seated promptly and had our drink order taken immediately by the hostess. I ordered a piña colada ($4.50, and...", "I have always loved the food here! But it's even better now in the new building! The first building was tiny and cramped but cozy when not too crowded. The..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "Jj2-kd2Wvj_DCZgp8ykZKw", "text": ["Best Guacamole, chips and salsa! So glad they have whole black beans instead of only retried ones. The rice is great! My friend had the pollo loco and it...", "This restaurant just opened recently and we had heard mostly good things about it. We arrived on a Friday night around 6:30pm. The parking lot was packed so...", "El Maya Mexican restaurant has an extensive menu everything from individual tacos and enchiladas to full Mexican style meals.  Service was fast and the food..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["mexican", "tacos"]]}
{"id": "3uKMYpV3UKVW3VnnsQniug", "text": ["This place has been given some seriously unfair reviews. I absolutely love it. You walk in and, unlike a lot of their quick burrito competitors, they make...", "This is my third meal from the Burrito, and as much as I want to endorse the place - I'm a huge fan of their locally sourced ingredients and fresh...", "I had such high hopes for one of the few Chipotle-like offerings in DSM when I lived there. With only 2 Chipotles in the area, and a couple of Pancheros,..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "YEcfIAOzFfTeBeAaQps00g", "text": ["My new favorite tavern sports bar. Great food. Great prices. Nice patio on back. Under new ownership.", "Great lil spot. Love the outdoor patio and games for kids. Nice playlist and yummy food. Staff is really friendly and efficient. Fun Sunday afternoon! Will...", "Kelly's Little Nipper is a total dive, and an amazing find. From what I understand this place has been around since the '40's and is housed in a former..."], "rating": [5, 5, 5], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], [], []]}
{"id": "sIY5WA1scgALt78rl-fDtg", "text": ["Came in late on a Saturday night. Had karaoke. Good prices and felt friendly. Might be our new local stop.", "Oh south side of Des Moines, I have some really fond memories of your divey bars and this night was no different! \nDonna's Lounge has a massive gravel...", "Don't let the motorcycles parked out front worry you; this is more than a Harley bar. Donna's is a fun, dive bar south of the city on 14th SE. The decor is..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "FmDUbMIkVR0JokSwyrTk8w", "text": ["There is a lot of good Italian style food in Des Moines, so I was a bit skeptical since some of my other 'chain' experiences have not been so good, but had...", "Went with a group of twelve. We had two waitresses, but the one could've/should've done us all. Salad was good, though creamy Parmesan dressing was...", "Something has changed, for the worst. Bravo used to be our first choice in Italian. The menu has changed. Everything now tastes like its reheated processed,..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, -0.25], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["italian"], [], ["italian"]]}
{"id": "3EY8htLZjfnpMDNxf7evYw", "text": ["Breadeaux Pisa (Pizza per listing) has been in Altoona for decades, yet many people who are relatively new (a decade or less) to town have never even heard...", "This was really great pizza. Delivery was quick and our delivery guy was really pleasant.  I loved the crust of the pizza.", "We ordered a Taco pizza.  Took about 40 minutes to be delivered.  It was worth the weight!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.64, 0.38], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "8aI871lYcFQoUtapNvrZZw", "text": ["I didn't physically get to visit yet, but I will now.\n\nA very kind individual purchased our call center a dozen of the bundtlets. Yes, that's the right...", "First visit: I stopped in after work today and was pleasantly surprised they had samples for their pumpkin spice and chocolate chip Bundt cakes. After...", "Stopped by and picked up a mini sampler with assorted flavors for - $18.50. The flavors are listed on the side of the box. There are two samplers to choose..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["cake"], []]}
{"id": "xQt90PJMu-3sJicd2VrKZQ", "text": ["Favorite frozen yogurt place. They had a great selection of choices for both the group and the toppings. The lady who checked us out was super polite and...", "A yogurt bar, great for families and anybody that wants to satisfy your sweet tooth. Lots of flavors that change every day. Very tasty! I especially like...", "Well I have never been to Menchie's until this weekend. But I heard they had vegan options, so when Ashley wanted to go I said let's do it! \nWhen we walked..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["bar"], []]}
{"id": "ySY3boXIhF1YDvdRukWBjg", "text": ["What a cute little shop in waukee.  The cases were filled with amazing looking desserts.  There also bags of cookies that looked to amazing to eat....", "Super disappointed with the products we received tonight from Miss NiNis. Our cookies were wrapped nicely, but fell apart from being so old and weren't soft...", "Ok everyone! Such a cute place for dessert and date! The desserts are homemade at the place and it is super yummy! The macaroons have different flavors for..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "I-laBe7HcMzzL2KUBcLkSw", "text": ["The cupcakes are such a great treat. I bought some for a meeting and the attendees immediately knew it was Scratch! \n\nThe cupcakes are moist and has just...", "Apparently I was a real B years ago.  \n\nScratch is delicious, simply put.  Not only are their cupcakes loaded with flavor, they are also a great size.  Not...", "I love to stop in this place when I have a sweet tooth. Favorite cupcake is the Wedding Day one..love it. I also started getting their mini chocolate chip..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "uNddPBIe4G28G9tZDvEZcA", "text": ["For the traffic that this HyVee gets, I don't understand why the quality of its hot case food and its Chinese food is so subpar. Usually kind of old,...", "Just OK food. A little bit confusing now that they have a \"self-service\" and a \"full-service\" side.", "The food was large portioned. The food was your typical breakfast. For $18 we had a #3 breakfast 2 eggs, bacon, hash brown & toast and a pancake special 2..."], "rating": [2, 3, 3], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 0.2], "keywords": [["chineese"], [], ["breakfast", "egg"]]}
{"id": "XbmhsIBZTsjfGU_ObcWNdA", "text": ["Seems crazy such great food is at a food court in a mall but it's delicious. The fresh squeezed lemonade is literally fresh--as in, they cut and squeeze a...", "I had ribs and steak fries and drink for $12 at Stu's. Ive had the same meal for $25 at a sit in BBQ resturant many times. And guess which was better? Hands...", "We stopped here for a quick bite while we were Christmas shopping at the mall. The food sounded really good, so we decided to give it a try. My husband..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.33, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["steak"], []]}
{"id": "50RI8Pv2dEUSrFM-bPb43w", "text": ["Always great food any of the locations, food is on point! Beer flows like water, servers are on top of things, not pushy, but ready if you need anything!...", "I've tried to give the place more then a few chances. It's hit or miss with good service and food quality. I won't go back most likely.", "Wow!  Food was delicious. I ate the ribs and burnt tips. The tips were amazing, my first time to have these. Also enjoyed the baked beans (different bean..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "BMRa3FAFFItXph4S3rNtRw", "text": ["Iowa is no slouch when it comes to its state fair. I believe it's the biggest attraction in the entire state each year. And for good reason, as there's tons...", "When I think about the Iowa State Fair I think about two things. Food which pisses my cardiologist off because I eat it and it undoes all of her hard work...", "The BEST State Fair!! I've never been to others, but I assume ours is the best (obviously). The most fun place to party - Bud Tent after 9pm. Best Beer? 27..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "-5fWhkfOhEO4M7tPB7DedQ", "text": ["We had the wonderful experience of Curbin' Cuisine food cart at the Ankeny Farmers Market. One of the war and most filling breakfast burritos ever and...", "Curbin' Cuisine is a food cart ran by a local Des Moines Sous Chef. Gayle, my Son and I really enjoyed our Lunch thanks to them at Firetrucker Brewery in...", "Spotted Curbin at the Vintage and Made Fair. Shredded steak wrap was a great balance of super tender, savory steak and fresh slaw. Delicious lunch from..."], "rating": [5, 5, 5], "TBscore": [0.75, 0.23, 0.63], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["breakfast"], ["lunch"], ["lunch", "steak"]]}
{"id": "IeQ8bRQKGF4cd6tLQb_yNA", "text": ["We finally got around to trying this restaurant today & it's going on the favorites list!\n\nThe pulled pork, hornado con Mote, is ridiculously delicious. My...", "The food is NOT Ecuadorian. I had three dishes and here are my comments for each:\n\n1. Ceviche de Camarón: I asked the lady if it was truly an Ecuadorian...", "Decided to try this place and it was very good!  Not busy and quiet.  I got a chicken sand with fries. I like their fries better than McDonald's.  Crispy..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "GPATwT2r4l6UvjnycM_XCg", "text": ["ShortE's BBQ catered our Skybox at the Bucs game last night and we were not disappointed. I tried their sliced brisket, cheesy corn, and loaded potato bake....", "We met another couple who regularly frequent ShortE's to give it a try. The food was very good!\n\nWe went during the evening and seated ourselves at a table...", "I got a craving for BBQ for date night, and Yelp came through in a big way!  I have to ask a million Qs at new places because of my food sensitivities which..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["corn"], [], []]}
{"id": "5_XLoCmhdybaCRqKPBB1KQ", "text": ["I got a club sandwich for carry out so this is not a review for the typical experience.\n\nThat said, the club sandwich was awesome. Fresh ingredients, and...", "This review is for the lunch/dinner menu.  Did not try the breakfast menu.\n\n3 Stars is about right.  This is primarily a BBQ joint serving several different...", "I never know what to expect at this establishment its always hit or miss. Sorry Jethro but too many misses and not enough hits. Today we had an order of..."], "rating": [5, 3, 2], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["sandwich"], ["breakfast"], []]}
{"id": "_VVGw_Rf5WF8M2N7MstBhg", "text": ["We had a very, very bad experience here. The cleanliness of the establishment was the issue, not the food. We used to love going to this place until this...", "There is something beautiful about the history of Iowa as it relates to opening its doors to immigrants.  Part of the great diversity of Des Moines is due...", "This is always my go to for comfort asian/vietnamese food. I love the jumbo shrimp in spice with rice and betel wrapped beef. Roast pork is good here too...."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.6], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], [], ["beef"]]}
{"id": "75zt-YP_NEux9KpH4rts6Q", "text": ["This is an excellent, well-stocked, and large Asian grocery store. Does exceptionally well with ingredients from Southeast Asia as it has a strong...", "Your A and B are getting old, but you've managed to keep your C Fresh.\n\nWhat a cool grocery store! It has all kinds of businesses inside it, including a...", "Love this market!! This is the only place I have found that sells frog legs! They have all your Asian food needs! My son is in his third year as a Mandarin..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "wn-MmSfpCJoUhhW8KrmtGQ", "text": ["Seriously, Chick Fil-a is the gold standard in service in the fast food industry. Everyone else can only aspire to provide such service. It is a nice touch...", "The Target of all Food outlets.\n\nYou just want to give them your money. Maybe it's the alluring color of Red like Target but wowzas, when I enter a...", "I had the BEST experience at this Chick-Fil-A today. From the minute we walked in, the employees were very welcoming and energetic. We were not only greeted..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Ag-Ww8enOVkfLjLhaEn9pQ", "text": ["Food was hot and served quickly once I ordered.only 1 person working the counter so it took a while to order.\n\nChicken biscuit was very good.", "I like the grilled chicken sandwich from Chick-fil-A, but what I don't like is how chintzy the store has become. I have been noting they are removing more...", "We visit family here in Iowa from California where we dont have a one of these reaturants so of couse we had to stop and enjoy and man did we enjoy! We..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], ["sandwich", "chicken"], []]}
{"id": "UxrSio0T8cmUBwCnBjFrWQ", "text": ["Stopped by for lunch, and I was not impressed. The service was unfriendly and I didn't get ketchup packets at the drive through. The baconator was great tho.", "This place is a disaster.  My wife, daughter, and I stopped by here on our way to Wisconsin last weekend and it was a horrible experience.\n\nWe walk in and...", "I really have always enjoyed Wendy's. \nI really love dipping my fries into a chocolate frosty. \n----- That is, when the fries are fresh. -- \nI have been..."], "rating": [2, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [["lunch"], [], []]}
{"id": "krzfogznYHtzyoKNsc6fvw", "text": ["5 stars all around.  Great salad, very attentive service (since our 6 year-old son likes 3 butter cups for 2 pieces of bread).  The steaks were great, the...", "Great place for a steak and relaxing with a cold beer. Great staff that are pleasant and attentive. Management cares about their guests..great ran place....", "Oh Outback, I want you! I really enjoyed our waitress and food. I like lots of options and Outback provides that. I really like that they push the envelope..."], "rating": [5, 5, 4], "TBscore": [0.71, 0.43, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["steak"], ["steak"], []]}
{"id": "M6KLkrgdWdUDq7y_QdXPpA", "text": ["My family and I were in the area to visit our dog at the emergency pet hospital and to take my sister to get her student visa appointment. But after all of...", "I am broken-hearted to report that my parents went here Saturday night for their 45th Anniversary and had a terrible experience! Everything started out...", "My girlfriend and I went here for a Saturday lunch. It was my first time here so I was excited to try the place. We got there and it was fairly quiet - our..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.21], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "Ycb8OEM7RjHshbOmSXjsFw", "text": ["Food is solid. Drinks are fantastic. I recommend this as a pregame spot for a night out. They have heavy pour margaritas and tequila flights. The chef...", "Always start with the good! The service here was 10 out of 10 amazing. The margaritas were some of the best I have had here in Des Moines. I bet they...", "Margaritas were strong and loved the variety of flavors. The loaded queso was delish and the street tacos tasted great. I had the carnitas and also the..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.64], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], ["tacos"]]}
{"id": "HR5zXxfmoeThQuemaX4zpg", "text": ["Abdullah was our waiter and awesome in every way! Great experience thanks to his service and energy\n\nWanted to put a plug in for our waitress Julie S. Great...", "Every time we eat here it's a disaster.  Food poisoning for my mom the last time we ate here! I think it was the sour cream. This was 2 months ago.\nI have...", "It has been a couple years since I've been to an Outback.  When I used to go, I always had a few go to items like their Blooming Onions for an appetizer...."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "kZWrPS218p6atlsqydoVKw", "text": ["After last night..JACKPOT! Music makes one want to turn on TCM and watch Frankie.. Dirty Bird martini, cold, refreshing. Service OUTSTANDING..moved with...", "I ate dinner last night at 830 pm and it was worst dinner I have had since moving here.\nI ordered the crab stuffed snapper and the crab looked  like cat...", "We visited Johnny's steakhouse and the food as normal did not disappoint. Very good and our steaks were cooked to perfection. We also stopped in the bar for..."], "rating": [4, 1, 2], "TBscore": [0.0, -0.5, 0.53], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], ["dinner"], ["bar", "steak"]]}
