{"id": "qJwKDPoB2lnXV40XGfSXbg", "text": ["I talked to Deanna the manager today, I was given the wrong cigarettes earlier. Normal instead of 100's. Same price. At first I was disheartened because I...", "The buffalo chicken quesadilla was great, hence two stars. The customer service was not the best. None of the employees greet you when you come in. After...", "On my home from the beach, I reluctantly stopped at this Wawa to get a sandwich. The last Wawa sandwich I had eaten (in Maryland Wawa) was so mediocre that..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.4, -0.25], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["chicken"], ["sandwich"]]}
{"id": "Osz0Glh3ViSqKbwVt6dVQQ", "text": ["Well typical Wendy's. Coming home Dover International Speedway! Desided wanted something fast to eat. But was not fast. Waited 20 min for food. Like I...", "Long line of customers. Cashier is getting fries and complaining no one is making sandwiches. Griping employees.", "I'd give this place no stars if I could. It's filthy. Liquid cheese running down the side of a hastily wiped down table, and that was the best table in the..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], ["sandwich"], []]}
{"id": "Dn_9gVotS0B-JJDN_NnMWQ", "text": ["Horrible service and very rude, they don't wear gloves while making the sandwiches. The women smelled the cheese. The manager had an attitude with the...", "Had 2 Meat Lover's pizza\n2 Orders of Buffalo Wings\nChicken cheese sandwich\n\nAll times ordered, span of 2 months, excellent and melts in your mouth. Great...", "We've only eaten take out pizza here, but for the price, it was pretty good! Not too crusty or cheesy, just the right amount of each!"], "rating": [1, 5, 3], "TBscore": [-0.7, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 0.2], "keywords": [["sandwich"], [], ["pizza"]]}
{"id": "h0_u4etpOKdSd8SlNLPzbg", "text": ["This is a Charming little place. They have fantastic meats and pastries and cute little counters where you can get either hot or cold food. Everyone is so...", "85 years old. Its showing. Spences Bazaar is interesting but not for me. The flea market is dirty and run down selling mostly useless items and junk on...", "Come here hungry and with heavy pockets. Everything is reasonably priced, but it is all so good and there are so many options you may want to go on a little..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "kSgP9nx0lezrJmMLGSNAow", "text": ["Just stayed there for one night! Thank goodness!!  It smelled so bad we went and bought Febreze  that Work alittle the rooms window was leaking into the air...", "I asked for a no-smoking room but didn't get it. Had to find another hotel. The clerk was very helpful in finding me another place.", "My stay here was a very short one as I was just in town to run the Monster Mash Marathon over at the nearby Dover International Speedway. The location was..."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "0EMIzcRDDq_8hqHWDQbaLg", "text": ["Chef John Gale was the best. I booked this company to have a romantic evening with my boyfriend. Everything was so professional. Him & his team actually...", "Where to begin.  My son's Bar Mitzvah was just yesterday.  While the food was decent, the owner, and only contact I had the entire planning process, John...", "Was at a wedding last week. They were stingy with their food. Servers were not pleasant. Appetizers were not enough to go around. Food was not that great...."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["bar"], []]}
{"id": "-6uASRJZpIqITXv1Zx0hgw", "text": ["This is your typical bowling alley.  They have a small arcade for kids, a food court, a nice sized bar and the actual bowling area.  Here are all the things...", "The front desk is solid- friendly and they let you pick your lane. Bartender is nice and speedy. Some of the restaurant staff can't be bothered, but the...", "Food bar was changing the oil during dinner time. I never knew it took 2 hours to change the oil. Then, we got told we had to switch lanes because of the..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["bar"], [], ["dinner", "bar"]]}
{"id": "pUUmwy2_ar1MJabnk_QJPw", "text": ["On 6/24/18 at approximately 15:15 hrs +- we decided to give Camden, DE KFC another chance.  (We've had issues with the quality of the food served in the...", "They are terrible spent 30 dollars on chicken and it was raw Called and they said they wrote our name and number down not to worry we will replace the meal...", "Would not normally review a KFC.\nBut when I see ants on my food box a review is needed. Had a pot pie it had a few pieces of bone in it. Several tables..."], "rating": [1, 1, 1], "TBscore": [0.0, -0.42, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["chicken"], []]}
{"id": "BtRjZVoBJRMX1TN5FPpGTQ", "text": ["Wonderful selection of sushi here considering its a buffet. Wish they used jasmine rice though. You will often see workers checking and turning the food so...", "Went there on a late Tuesday after working in the yard.  The food was bland, cold, and poorly prepared.  Hot and Sour soup tasted like salted broth.  Sushi...", "Paid 14$ for half a plate of food haha and they offered for me to pay 6.99$/lb which would of made it even more... Rude staff. Bad food... Never going back..."], "rating": [4, 1, 1], "TBscore": [1.0, -0.23, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["sushi"], ["sushi"], []]}
{"id": "4swl1fJYT0Pds6x_uEbZ2A", "text": ["Best Chick-fil-A I have ever been to. Outstanding customer service. Even the manager is out on the floor, greeting guest, helping the diabled and offering...", "Extremely disappointed with the fact that I said \"thank you\" about four times and not one \"my pleasure\" back.", "I've stopped coming here and prefer the Camden location. The food especially the fries are sub par. They are too crispy and taste like the oil was days old...."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "pPlh77LU6C9DMuuCsUfArQ", "text": ["My first experience at a Dunkin' Donuts was complete with terrible customer service and an attitude that could service the entire greater Dover area. I went...", "Taylor P was very rude when taking our order. We felt rushed and her attitude was the worst i've ever heard when going through a drive through.", "If you want milk with a splash of coffee, go here. \n\nOrdered decaf, cream + sugar. Got cream, no sugar, hint of coffee."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [["donut"], [], []]}
{"id": "yYM2KwJ2pyrbbwp5EgJeVg", "text": ["Extremely rude employees. Are constantly taking your order with an attitude. Ah, excuse me be mad at your life choices not me! Also, Makenna is extremely...", "This location is great!  They open at 5:00 am the staff are always cheerful and get the order right the first time.  They are very consistent with good...", "Place sucks, everyone there obviously hates their job here, always an attitude, pushy in the drive thru even if you're the only car. Always catch them..."], "rating": [1, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "-uxCfvN23--TnsBTsScQSA", "text": ["A friend of mine referred me to this place as I was in search for a nice fresh whole fish. \n\nWhen you first walk in you are greeted with a hello by an...", "July 23, 2018. \nThe regular sign for the N.Y. Strip Steaks showed \"N/A\" for \"bone-in\", and $7.49/lb for boneless. But signs taped on the meat case and the...", "Still a great corner store for most things. Subs are best around and most deli items. I have been going there since it's was Franks. First purchase since..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.61], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], ["steak"], ["deli"]]}
{"id": "sYIwu4e8OBbW0QHioCZQLQ", "text": ["The food is always amazing.  The restaurant is nothing fancy but who cares?  Good pizza, amazing stromboli, yummy subs!  All in large portions.  The wait...", "This place is great.  I gave this place a couple more chances.  I must have just gone there on a bad night or something. Everything in the shop is hand...", "Great food. Don't let the outside appearance fool you. Excellent pizza; eggplant and zitis just like mom."], "rating": [5, 5, 4], "TBscore": [0.57, 0.0, 0.6], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "f1v3nL2VG2tG-L4gwHdPnQ", "text": ["Its Dominos while ouse not true pizza their prices are good and you can always get online deals or coupons. I enjoy the pasta bread bowls and the pan pizza...", "I don't know what they changed but the pepperoni they put on their pizza is horrible need to change that ASAP", "The pizzas generally taste good, although to be fair this is largely due to the generous amount of butter they must cake on the crust before baking. The..."], "rating": [5, 1, 3], "TBscore": [0.31, -1.0, 0.33], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["pizza", "pasta"], ["pizza"], ["cake", "pizza"]]}
{"id": "hMYNgZEVim6frOFJrAm8lg", "text": ["Great place for all day fun.  Arcade, moon bounces, slides/mazes and bowling alley all under one roof. Kids will have a great time but each section has a...", "It's crowded and dirty and loud. Big kids are not supervised so they will trample over the little ones. They run all over even on the ground. The bowling...", "The idea behind this place is great, unfortunately the reality is underwhelming. After crawling through the tunnels with my kids my feet were disgustingly..."], "rating": [3, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "_78_Dwyn2Srcwcf6DPudhQ", "text": ["So glad that I looked this place up on yelp. Patrons are so friendly!!! Served by Matt who is so lovely and patient, arrived a little hungover and...", "This establishment should be embarrassed for treating military families so poorly. Last night I went to the Golden Fleece with a few friends for the very...", "Moved to DE a year ago from CO was looking for a fun club and found this place. We have been multiple times but tonight's visit was awful. It was at their..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "-YOKC3vUaBIcY8ggGH981w", "text": ["Ok...if I could choose 2.5 stars for Irish Mike's I would, but 3 stars is cool too.  It's a \"benefit of the doubt\", kinda thing. I visited early evening on...", "I wouldn't even give them 1 star. I'm a regular that work in the restaurant business. I frequent this bar but tonight is a last straw to me. I was pulled...", "If any bar in Dover needs to be on the show Bar Rescue, its this dump. Went here with my Fiancée during a holiday festival back in December and it was a..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "V-fIFMC1JxtT11OHyE5dYw", "text": ["Nice small sports bar with a rather pushy bartender. Can I finish my drink before you keep asking if I want another? LoL\nFootball specials are golden and...", "I went to this location when they said they would be open and the whole thing was shut down. Planned my whole night around it", "Bartender at first made my drink weak because I look like a 12 year old with a fake ID. He had no problem adding more liquor to my drink when I said..."], "rating": [4, 1, 3], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["bar"], [], []]}
{"id": "Eu5_lp3nGGvPpNLYCtUWAg", "text": ["OMG! So IN LOVE with this place!! Super dope atmosphere, the back room is so cool! I mean, a Nintendo 64 and music system you can play your own music on...", "Love this place and the shop owners are super chill...hemp wraps all day...cbd supply is great if you're into that", "This is a beautiful shop! The owners are super friendly and knowledgeable. The vape lounge in the back is a must see! They carry all kinds of hemp products,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "qL5hgyKETn7bvAulZ9BQAA", "text": ["Drinks so cheap you can get drunk for $10. Lots of regulars. Good burger selection. Outdoor and indoor seating. FAIRLY good sized bar. 30s + crowd.", "Visited this place recently and did not find this place to be clean.  The floors were sticky and the drinks were not eventful.\n\nWe visited on a Saturday in...", "Really dropped in quality. I live close and used to like it here. Not so much any more.  Such a shame.  \nUPDATE: new owners!  Awesome again!!  Burgers are..."], "rating": [5, 1, 4], "TBscore": [0.32, 0.0, 0.32], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["bar", "burger"], [], ["burger"]]}
{"id": "DfvYGzg2BWuINFFETw7Z8A", "text": ["Great drinks and awesome bartender. Definitely would come back again. Apple driver and Buttered Pecan Old Fashioned are ridiculously good. Coming back again...", "When we arrived at the Painted Stave it was closed -- even though I'm SURE their web site said they would be open at the hour we arrived -- but it turned...", "RJ brought me here for the tasting and tour.  This place is a vodka lovers dream, it's like being in vodka heaven. RJ said we should get married here, and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "S9OrirZcISCZsMFR8jG9iw", "text": ["This simple and very nice bar has always been amazing place to getaway from Delaware spot within Delaware. Bowers is so laid back for me I hope to many...", "Cute little local bar opposite to JP's on the wharf.  We only had drinks here so can't comment on the food but nice little spot. Seems like all the patrons...", "The bayview inn is a fantastic place to go!    The friendliest staff and some awesome food and beverages.   I recommend it highly."], "rating": [5, 3, 5], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "YKb2ia5wNHHR5hwUjl6h0g", "text": ["Came in on a Thursday night, lots playing pool, 3 or 4 at the bar.  William the bartender was pleasant. Got a magic hat beer, good temp, but tap line needs...", "My son and I came here during our lunch date and he enjoyed his burger and said he would order it again. I ordered the fish and chips and it had NO flavor....", "This place is weird. I've overheard the owner yelling at employees about nonsense several times. It can be almost impossible to get service if you're at a..."], "rating": [3, 2, 1], "TBscore": [0.64, 0.5, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["bar"], ["lunch", "burger"], []]}
{"id": "8NwDtU0K9VP3JIbvynhjmg", "text": ["Tonight we tried Pearl Oyster Grill at Dover Downs.  At first we were a little hesitant because new restaurants usually have issues until they get the kinks...", "Had dinner on a Sunday night - stuffed shrimp and scallops.  Both dishes were very good though somewhat expensive.  A major complaint - entries served with...", "If you want a nearly empty oyster bar that serves a bountiful selection of two local oysters, warm beer and over cooked fish this is your spot!  Service is..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], ["dinner"], ["bar"]]}
{"id": "9hRzSduU8CQfwXwLRuBOzw", "text": ["Went to this ppace a few times in the past. Usually ok. I am now very disappointed. Seems they can't track the sequence of orders as they are placed. Waited...", "My daughter recently got a job nearby and has gone, twice now, to Jade Garden on her lunch break. Last week they accused her of stealing her credit card...", "We have been going to this place for years since it's the closest Chinese restaurant around. It will always be my favorite by far! I thought I was biased..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.21], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], ["lunch"], ["chineese"]]}
{"id": "9iVmqePQ1OwpY_XgDnUkrQ", "text": ["Not impressed.  I ordered the Kung Pao chicken which is a favorite of mine at Chinese restaurants.  I was absolutely NOT a fan and will not be returning nor...", "this place is great the staff are amazingly friendly I love the fact how they now know it's me calling and they get my two plates and two chop sticks ready...", "Probably the cleanest Chinese place in Smyrna right now. Good food, typical items in menu. Staff is courteous."], "rating": [1, 5, 2], "TBscore": [0.0, 0.0, 0.28], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [["chicken", "chineese"], [], ["chineese"]]}
{"id": "cQubwatJlnzS9pLihYGDPg", "text": ["We absolutely loved Yozu! Found this place on Yelp and was attracted by it's 4.5 stars! And the fact that they had fried sweet potato sushi. \n\nWe all...", "Based on the 4.5 stars on Yelp, I really expected the quality of the food and service for this place. Their sushi is still far way off from the good sushi....", "DO NOT EAT HERE. I visited based on the positive reviews. I never review unless its great or awful experience. This was TERRible. I ordered sushi and the..."], "rating": [5, 1, 1], "TBscore": [0.68, 0.23, -0.24], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["sushi"], ["sushi"], ["sushi"]]}
{"id": "n2Oa1APHah_XZwLGr-J4eg", "text": ["This place is great. Super clean, super friendly, drinks are good. Lots of good food. Tony was our chef and he was probably the most entertaining chef for...", "If you want great sushi this is a great place to go. I ordered the clear broth soup, seaweed salad, 5 salmon sushi and shrimp tempura sushi. It was all very...", "Food prepared well, good flavor. Hibachi is pricey. Don't recommend the Sake shots from the squirt bottles (a little sloppy). Pricey almost same as NYC. So..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.48, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["sushi"], []]}
{"id": "e4n50U5q01bjXK8-wY2SEg", "text": ["Not a ton of fish in each roll, but for the price tag it's complimentary. Can't beat their lunch special.. 2 rolls and soup of salad $7.50-8.50. Clean, nice...", "These ppl are never friendly.  The somewhat descent sushi lost a star from my last visit.  I will not return to this place any time soon.", "I went back for lunch. I posted new pictures. \nThe service is hit or miss but I think it's just a language barrier and not intentional.\nIt was so good. This..."], "rating": [4, 2, 5], "TBscore": [0.41, 0.0, 0.28], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [["lunch"], ["sushi"], ["lunch"]]}
{"id": "WgdfjXCpIhOLSWoJfJ2_Pg", "text": ["I went around noon for lunch. \nIt's really cute and clean. You can see the sushi made from your booth. \nService was friendly and fast.\nI ordered a shrimp...", "Three and a half stars. The Fish was fresh, and rolls were good. \nBut next time I will bring a flash light to read the menu. The small letters did not have...", "Some of the best sushi I have had period, and absolutely the best I have had in this area, I love the decor , and the food selection. The price is super..."], "rating": [5, 4, 5], "TBscore": [0.36, 0.0, 0.61], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sushi", "lunch"], [], ["sushi"]]}
{"id": "MwRlVnoTAxc_6LrMFO7H-w", "text": ["Exactly what you think it would be. \nTypical hibachi restaurant. \nI typically get sushi take out but I have eaten inside quite a bit. Sushi is fresh the...", "Ok Japanese Steakhouse with potential to be so much more. Soup served Luke Warm. Waiter and Hibachi Cooks  do a good job. Salad is just iceberg core chunks,...", "Well to start we get there and the ac unit Is dripping after on every single table and then when I talk to the manager she seem to tell me that that happens..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["sushi"], ["japanese"], []]}
{"id": "ZH5TC7jEBEboSIk-vXciRw", "text": ["My mother and I stopped here while on vacation and had a refreshing and enjoyable experience in their relaxing atmosphere.  I definitely recommend U Sushi...", "Great sushi with original rolls and fresh fish. We came late, there was only one other table. The service was fast. The special rolls variate was very...", "Sushi and sashimi for two. Incredible presentation and incredible taste. We have been here numerous times and never ever been disappointed. Great food,..."], "rating": [5, 5, 5], "TBscore": [0.33, 0.0, 0.37], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sushi"], ["sushi"], ["sushi"]]}
{"id": "4Apxjf44IFRNHYPsLTMBxg", "text": ["The best sushi in the area ! Always fresh as well. Love the customer service by the wait staff as well . You can always count on a consistent meal here and...", "This place is my favorite Asian restaurant to frequent while I'm down the shore during the summer. I highly recommend this place to anyone in the area! The...", "Murasaki never disappoints!  I love the fact you can order hibachi right from the menu. They offer the whole experience, including trucks but I'm so over..."], "rating": [5, 4, 4], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["sushi"], [], []]}
{"id": "4izKqsScCrjgL4dhx-BTbw", "text": ["The only choice in Middletown. Great staff. Great quality. Just love this place !!! Wish I could give them more stars!!!", "Pretty nice spot with pretty okay sushi. Came here after driving in town from Jersey to see my old college friend and her mom. Mom treated us to lunch......", "Horrible service. While taking our order the waiter was mopping the floor and then left mid order to answer the phone.\n\nThe salad was definitely washed but..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.34, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], ["sushi", "lunch"], []]}
{"id": "Hdvxe1jA3oSa_1fD1a9jeQ", "text": ["We were a group of 10. The gal that helped us was really patient and was on top of everything. \n\nWe were visiting St. Michaels area and this was one of the...", "We love to find new places to\neat on our way to our Delaware beach house.  We will add shogun Shashi to our list of yes's.   Are you the mood for fresh,...", "Decent teriyaki and sushi place here in the area. I didn't dine in so I can't comment on the service although I did get a helpful counter person to order my..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["sushi"]]}
{"id": "Oj-n9QAi6qb4EEM1cDYcGQ", "text": ["Outstanding across the board from the view to the service to the food!  Had dinner here last Sunday.  It was a very enjoyable experience!\n\nThe place is a...", "The sushi here is pretty good, but what's even better is the service. We didn't know the restaurant was BYOB, so we were very disappointed when we couldn't...", "The miso soup is good. The chicken teriyaki was loved by both our kids (with enough for leftovers!). The Dragon roll (eel and avocado was superb). The best..."], "rating": [5, 4, 4], "TBscore": [0.48, 0.0, 0.47], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["dinner"], ["sushi"], ["chicken"]]}
{"id": "cy5wRlEJJw-DXqwZlr3oxw", "text": ["Food with flavor that did not have to be fried. That alone was worth gold. We ordered sushi, hibachi, and udon noodles with veggies. It was all flavorful...", "Route 47 Roll is definitely a long time favorite. All the flavors just cause an explosion of deliciousness in your mouth. 10/10, I will forever recommend...", "Looking for a sushi place while shopping in the area, came across Momiji. We sat down at about 3:25pm, and wanted to order the hibachi lunch special, but..."], "rating": [5, 5, 3], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["sushi"], [], ["sushi", "lunch"]]}
{"id": "Aa-yFh8wxFOfAwJu4H9orA", "text": ["Staff are always super nice, accommodating and remember their regulars. Food is great and reasonably priced. Nice ambiance in the restaurant though I've...", "Not bad.  Had sashimi lunch combo 10-15-18.\n\nThe fish was OK.  Service was OK, as well.\n\nIt's good for a quick lunch stop and the only thing I had was the...", "Good little hole in the wall sushi place, workers are always very pleasant and the place is clean. They have a nice selection of sushi and every time we..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.4, 0.49], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["lunch"], ["sushi"]]}
{"id": "riwJWxj4850tGBhRahDt7g", "text": ["Been here several times and always a good experience. Calamari is crispy and light. Good selection of sake. Sushi is always beautifully presented and...", "Got bad sushi stomach after eating here :( Note: I have never had stomach problems after eating sushi, and I eat sushi or poke at least once a week. \n\nFood...", "This place is great especially for a sushi place in a strip mall! Attentive service and fresh sushi. We tried the salmon skin roll which was delicious. We..."], "rating": [5, 1, 5], "TBscore": [0.53, -0.58, 0.5], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["sushi"], ["sushi"], ["sushi"]]}
{"id": "5R6YO6K9PkthkTbXqV9slQ", "text": ["Tried this place for the first time last week and have been back twice since then in less than a week.\nLovely ambience, friendly servers and delicious sushi...", "I've been craving sushi for the longest time, so it came down to eating at this place or another sushi restaurant last night. Obviously, we ended up eating...", "All-you-can-order sushi is not all-you-can-eat. Every time you want more food, you have to place an order from the menu. The lunch menu is an abridged..."], "rating": [5, 5, 4], "TBscore": [0.28, 0.0, 0.3], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["sushi"], ["sushi"], ["sushi", "lunch"]]}
{"id": "fPJXQwbYyC8-cFR4y8vdmg", "text": ["First time order- Tokyo Moe burrito and a custom burrito.  I must say that the Tokyo Moe tastes great, I loved that it was tempura style.  The portion is...", "This is the best poke I've been able to find outside of Hawaii. I've had the real deal at Ono Seafood on Oahu and this a great mainland option. I've had...", "My go-to in PoBu is the PoBu burrito with cucumber instead of edamame, although I've tried other burritos and you can't go wrong with any of them! There is..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "HgYb_TY7PlffKLsr3jNpXg", "text": ["Hidden gem! This place wS recommenced and it turned out to be great. All the food was delicious and the sushi was super fresh. Looks ok from the outside,...", "The lines at the restaurants across the street were 1+ hour wait on a Saturday night. The friends we were visiting never \"did\" Sushi. We noted this place...", "I suggest happy hour $5 menu !!\nOrdered just about everything ... DELICIOUS !!\nStaff is friendly and very helpful !!! \nI will definitely be going back !!!!"], "rating": [5, 4, 4], "TBscore": [0.39, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["sushi"], ["sushi"], []]}
{"id": "aai6Rnj9W0NIiFoExYzRNQ", "text": ["I've been here a few times, but this is my first review.  First is like to say, what on earth inspired the owners to establish a sushi house in Perryville,...", "I was so disappointed, after my friends raved so much about Johnny's. On Saturday (9/29/18) I took my fiancée to dinner for her birthday. The waitress was...", "Honestly delicious. We placed a HUGE carry out order and had no issues at all. The sushi options are endless.. the only complaint I have is my friend has a..."], "rating": [5, 1, 4], "TBscore": [0.0, -0.28, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["sushi"], ["dinner"], ["sushi"]]}
{"id": "Xtm8TE7Clzjm3YuoFE5giQ", "text": ["As long as I taught and lived over here, I NEVER thought to visit. Hell, I didn't think that Kent Island would have a nice sushi place. It wasn't until I...", "I used to love this place. But unfortunately they jacked up the prices so so high when you don't get very much food. The prices seem unreasonable. Some of...", "Came here for a lunch with some friends. It was freezing inside. We sat down and ordered our sushi. They have some pretty decent prices for their lunch..."], "rating": [4, 3, 3], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["sushi"], [], ["sushi", "lunch"]]}
{"id": "8ANjPd5LtyPtja3h0QnXUw", "text": ["I am very hard on all of the sushi spots that I go to throughout the country who knew that this spot that is less than 15 minutes away from my current home...", "They do all you can eat, but rolls only.  \nThey do have some nice ones.  \nSpecial Naruto is our favorite.", "It's very difficult to find good sushi in Delaware! Although buffets are usually not the best place to get sushi, the sushi here is made to order. They also..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.34], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sushi"], [], ["sushi"]]}
{"id": "bO8EHhx11RSwJ4HHcwpLYw", "text": ["Surprise!  There is decent sushi at the Jersey Shore.  I had a sashimi platter and a special roll.  Everyone in my party enjoyed their meals.\n\nOne...", "This place was hands down the worst service I have had in a very long time. Super unprofessional and nonchalant servers. We just left the restaurant without...", "Their sushi is always fresh and they have a great menu."], "rating": [4, 1, 5], "TBscore": [0.34, 0.0, 0.55], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["sushi"], [], ["sushi"]]}
{"id": "DzBKbK7SvIi2lh0rsYUkhg", "text": ["This place was pretty good! Huge variety of rolls and appetizers, salads, soups, etc. they also have hibachi which I did not have this go around. First time...", "This place is fairly large and actually has both an actual sit down place as well as hibachi. I went with a friend to get sushi here, but there are a ton of...", "Sushi is very good. Maybe not the absolute best, but it's still delicious.  Prices being half off makes it even better. We went on a Saturday night and it..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.57], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["sushi"], ["sushi"]]}
{"id": "eaNbaxd9mEv_WBnsID35Vw", "text": ["Standard Hibachi show and food. Their steak is good as are their scallops. Everyone goes nuts for their YumYum sauce.\n\n----\n\nCame back at a later date just...", "place is awesome. the hibachi chef's are fun and full of life, they have yum yum sauce which is my favorite, the servings are very fulfilling. I have found...", "Amazing hibachi steakhouse with excellent service! My date and I were thrilled to indulge in some Japanese cuisine after hearing the reviews. My first..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.49], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["steak"], [], ["japanese"]]}
{"id": "5PcA9BkNswULr0BUDMHoBg", "text": ["What a beautiful restaurant and always a smile when I walk in. Customer service is important to me. But besides that, the sushi  rolls are delicious. I had...", "Lin's never disappoints. Although I don't eat sushi their main dishes are perfect not greasy or over spiced as requested. The restaurant is spotless the...", "We came here the day after we got married (at Vandiver Inn) and returned for our first anniversary. We  love this place! The food is delicious, the hibachi..."], "rating": [4, 5, 5], "TBscore": [0.64, 0.58, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["sushi"], ["sushi"], []]}
{"id": "5oEyGDeqeXeMfFXZdevtFg", "text": ["Stopped by the area and found this little gem  I've been craving sushi for a while & this place was so good! The sushi tastes super fresh, employees are...", "Okura catered the sushi bar at my husband's party at Hotel DuPont.\nNigiri were super fresh and included yellowtail, salmon, tuna and shrimp (all equally...", "Tried the orange chicken it was very good, very nice atmosphere the owner Kailon is a great guy to. The sushi was good as well, I'd recommend to get the..."], "rating": [4, 5, 5], "TBscore": [0.33, 0.21, 0.52], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["sushi"], ["sushi", "bar"], ["sushi", "chicken"]]}
{"id": "vz2q_p5FfzB-F2vJePi3tw", "text": ["I am leaving four stars once again, but wanted to update my review. \n\nThe Yakiudon noodles, this time shrimp, were as good as last time. Done to perfection,...", "This is the saddest excuse for a sushi place I've ever ordered from. The tuna a frozen, the salmon was like the salmon you buy from the frozen seafood area...", "It's clean. It's small. Nice place to dine in with the family. I've yet to see it crowded. I don't typically eat sushi but I see so many people ordering..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.21], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["sushi"], ["sushi"]]}
{"id": "oiFw8lJrYUZ4zrffWwWiBg", "text": ["My favorite place to get Sushi in Glassboro, since I moved here in June.\n\nI order mainly for pickup, and they get the food ready extremely fast.  Right next...", "HORRIBLE SERVICE !!! Waitresses have bad attitudes. Good food bad service. Lost the point of eating outside to enjoy. I recommend for a take out!!!", "Boyfriend and I came here for a late lunch early dinner, we were sat and asked what drinks we wanted before we even sat down. Right after we were asked what..."], "rating": [5, 1, 2], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["sushi"], [], ["lunch", "dinner"]]}
{"id": "vg5nkkwchEPASXDSQsNHwg", "text": ["I'm not a big fan of Japanese food but I go because my girlfriend loves it. Some of the nicest servers you'll ever meet and I really like the food. Feels...", "Y'ALLLLLLL this place is AWESOME. I work at SportClips (come get a haircut) but it's always my go to! SO SO SO GOOD!", "Took my son here for a belated birthday dinner.  He loves hibachi and we try somewhere new every year.   My husband ordered an unsweetened iced tea, but..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["japanese"], [], ["dinner"]]}
{"id": "k_1DC-bbY4lF2-3k2I4WMQ", "text": ["Fresh and flavorful.\n\nThe overall look and ambiance is very relaxing. A modest sized restaurant, very clean with modern decor. We ordered the Edamame...", "Very good, fresh sushi for this area.  Service is friendly, facility is very clean and modern. We liked this place a lot when it was Naruto's and it hasn't...", "Very nice experience! We had been here when it was under previous ownership as Naruto. We were a bit apprehensive when we drove up and it had a new name on..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.48, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["sushi"], []]}
{"id": "I72lHl1pf1tjp3b-sCH6KQ", "text": ["Nasi has by far become my boyfriend's and my favorite restaurant. We've been about a dozen times since discovering it, despite it being 30 minutes from our...", "Sushi is good. Prices are the best during their M-Thurs happy hour that lasts from 4pm to 7pm. All specialty rolls are priced at 10 dollars. Good thai...", "This place has lot of variety as they do have Malaysian and Thai both, so lots of options to choose from even in the lunch menu. \nTo start off, everything..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.8, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["sushi"], ["lunch"]]}
{"id": "6JUjcpo3juCSDuD9TDQpHA", "text": ["My husband and I used to go to Ohama's every other week. We stopped going when I got pregnant. When we went back after a year, the server not only...", "This place has potential.  Just not with current management style.  I have been here multiple times... its close.  Place needs an update and the sushi chef...", "Sushi was horrible. Definitely not fresh and that's probably because there is no \"turn over\" i.e. No customers. Place smells like an old house that hasn't..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, -0.35], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], ["sushi"], ["sushi"]]}
{"id": "Yri0meNkNjsqrMz10mVBDg", "text": ["great fresh sushi. byob. fast service. great location. \ncalm. quiet environment. music as well as tv fro entertainment", "You can't ask for a better experience here. 5 stars to keep the bar high!  No wonder Mike Trout eats here frequently (if that's true) and I'll be back again...", "This is meant to be more of a 3.5 than a 3 star review. We stopped here for lunch one afternoon and I didn't have much expectation since I have my few true..."], "rating": [5, 5, 3], "TBscore": [0.4, 0.23, 0.21], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["sushi"], ["bar"], ["lunch"]]}
{"id": "GlpChKlBjcC9chBcognxSA", "text": ["Our favorite sushi restaurant was closed so we opted to try Cafe Sado nearby. The service was excellent, which is why I rated it 2 stars, but the food was...", "Let it be known right now that before I write this review, it is worth noting my brother loves to get sushi from here, which is a really good thing because...", "This is still my favorite place for sushi.  It so so yummy!!  The service is always great and prices are unbeatable."], "rating": [2, 5, 4], "TBscore": [0.47, 0.43, 0.79], "normalisedRating": [-0.2, 1.0, 0.6], "keywords": [["sushi"], ["sushi"], ["sushi"]]}
{"id": "UgdwL5wCdaFe84wmXmwaFg", "text": ["Best fried rice in the city. It's your local Japanese spot that caters to the urban community. Yes, prices are a little steep, but it's a small business and...", "Love this place! Large portions of authentic Japanese food right in downtown Wilmington. It's a take out spot, so be prepared to eat elsewhere! Try to...", "Looking for something new in the downtown area I stopped into this little walk-in only shop. Come to find out they only offer different types of fried rice...."], "rating": [5, 5, 2], "TBscore": [0.0, 0.34, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["japanese"], ["japanese"], []]}
{"id": "Wt1W6qwCvna1KzIuJRJbwA", "text": ["I order the shrimp fried rice, shrimp tempura and California roll, everything was just \"PERFECTO\".\nMy shrimp rice was made with enough spicy that it was...", "The food here was good, not the best Chinese ive had. But its what I needed at 8pm. Place was vert nice inside and will come back to give it a chance to be...", "WORST SERVICE we have ever experienced!!! As we were walking to our table, our waiter, a Chinese man, around 45 years of age who had very poor customer..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.46, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], ["chineese"], ["chineese"]]}
{"id": "jU_lOditH0JgUGWAxWCriw", "text": ["My first time ordering with grub hub and I was definitely pleased with my food choice!  Dong Sin delivered early and hot!!  I would definitely do it again!!!", "Want to say better things. Tempura heavy batter instead of light.  Miso soup thin. California roll standard ok. Edamame standard.  \n\nNice ambience other...", "Really good quality Chinese food, just pricy. \n\nAlso open year round (and is one of few places you can find on grub hub / eat 24 off season). \n\nDelivery..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["chineese"]]}
{"id": "Q3mReFnTFLD9Fh3C5FV28Q", "text": ["Best Korean in the area, and I love the couple that runs the place. I've been during the lunch rush (wish they'd get at least another person to assist, but...", "My experience with Korean food has been spotty. I either get the potent, authentic kimchi or the Asian fusion which isn't very Korean. The gentleman asked...", "I ordered the bibimbap  and yachaejeon  and was not disappointed. Everything tasted fresh and great, like homemade. The service was very friendly! I am so..."], "rating": [5, 4, 5], "TBscore": [0.4, 0.3, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch", "korean"], ["korean"], []]}
{"id": "qJcmu67ZEQ4bd1m9Kh_T1w", "text": ["Overall: 3.6/5, rounded up \n\nWhile I am by no means a natural born Korean, I've certainly had the opportunities to taste really great Korean food from the...", "I couldn't ask for anything more. It's a small restaurant that serves Korean food in the area that does not really have anything.  I stopped by on my way to...", "We have eaten here twice both times we have been treated kindly and promptly served. Food is fresh and hot and even other customers may speak its just that..."], "rating": [4, 4, 4], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["korean"], ["korean"], []]}
{"id": "NE4Xmhjtvcmjal2mRkDTHw", "text": ["This place is THE BEST! The dining room is cozy, the staff are incredibly warm, and the food is simply amazing! My first meal - consisting of spicy chicken...", "You have to love this place. I was able to get a terrific meal at 3 PM sort of late lunch / early dinner. The potions was very generous and it was...", "This was my first visit but will definitely be back. Food was delicious, warm and vibrant. I'd encourage more people to stop in. Service was good too, the..."], "rating": [5, 4, 4], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken"], ["lunch", "dinner"], []]}
{"id": "CeaPlfDG_88J6j6vpkg-Xg", "text": ["I'm not an authority on Korean fare but it was clean and delicious and the mature woman who took my order was cute and courteous \nThe pictured meal is the...", "They are alright compared to others food wise. Gives a lot of food. But when I call they never pick up, I have to either call 4 times or wait for a while as...", "I can't believe I haven't reviewed this place.  I really like it.  As a person that has been to Korean; I can tell you the ruder the cooks \"appear\" the..."], "rating": [5, 3, 4], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["korean"], [], ["korean"]]}
{"id": "4KeDI6AarKx-kA-GSoADIQ", "text": ["Excited to try this place since it is the closest Korean restaurant near our house (and we don't have to drive all the way to Philly for it). I was...", "I have been coming here for years. This is where my mom and I love to go for our birthday dinner or just because. I have brought a few friends here and from...", "What's worse than 1 star? This place. First - no sushi.  Second, frozen fish in dishes.  Horrible odor. Tried to tell me the spicy sauce would heat up..."], "rating": [4, 5, 1], "TBscore": [0.24, 0.0, -0.29], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["korean"], ["dinner"], ["sushi"]]}
{"id": "ocY9iBSiwH7VvBIUanWz5g", "text": ["Best bbq hands down. The ribs were out of this world, and brisket is unbelievable as well. They do mostly takeout with picnic tables to eat outside but for...", "Didn't get to try the food but they are closed when they should be open, we planned dinner around getting their bbq but when we arrived at 7:45pm on a...", "My search for good food in the Bethany area continues and brought me to Charlie K's today.  We basically had the ribs and brisket.  Both were let downs...."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], ["dinner"], []]}
{"id": "52qmabyhy3NzzBD-6dBwWw", "text": ["I was very surprised to find this restaurant in Delaware. I'm not very familiar with the area but I was happy to have found someplace I can eat when it gets...", "Love this place. Super chill spot to grab individual hot pots and order a bunch of different items. I usually go with the spicy broth - it's not actually...", "Great food prices are ok service is great people there are great...\nNice place take your family or just hang out have a good time"], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "hdDIWqgGH-dg2Wx9ZUeq6A", "text": ["Cilantro Ruins Everything\n\nI've been here twice. The first time I ordered 1/4 white chicken, yellow rice, and green beans. Very good. They offered me 3...", "We drive by this place all the time and never got the chance to check them out. We wanted something different tonight and didn't want to go out. Saw them on...", "First time here, service and food are excellent. Not my first time with Peruvian food, but my best. 1/2 chicken + 1/2 rack ribs and 4 sides, 2 national..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "Z53I9xwy0aMRy577GuM1KQ", "text": ["The address provided is wrong & they are not answering calls. Update the address and answer calls. I wasted my time going in circles searching for the truck.", "I've known Chef Wit causally for years from when he was working at Ubon at the Riverfront in Wilmington. It's kind of cool to see his success unfolding...", "Great food! Ate the Sunset Shrimp Rice Bowl and it was delicious! Looking forward to eating there again. Also great spring rolls."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "u7bo1o8ry-fvb6PbvtZJzQ", "text": ["I can keep this review pretty short and sweet. If you like sushi you will like poke and you will like Poke Bros. In fact you will adore it because you can...", "Upon my recent visit today I'm not sure I will be back. I was just hungry and wanted something quick. Ordered the Johnny Utah, which apparently went up in...", "I've picked up lunch at Poke Bros many times and never had a bad experience. Maybe it's due to previous customers' yelp reviews that Poke Bros is where it's..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["sushi"], [], ["lunch"]]}
{"id": "SRg4QRR7xQrZ6cp9u8VX9g", "text": ["Nestled into a non descript strip mall near Christiana Hospital, is this little gem. We stumbled upon it looking for late night dining on a Saturday night....", "Update** we got the bubble guts and the poops**\n\nI can't even begin to describe how disappointed and upset I am. My husband and I came here for our wedding...", "The other reviews were right about prices - prices are steep (-1 star for that) and the portions are small (-1 Star) but everything we ordered was..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "6zZsSHwsKfEBOEJMS9Nc8A", "text": ["What a great addition to the Lewes area! And it's late night too! \nWe had the Fried Tofu appetizer, Bushi Roll, Lewes Roll and Lincoln Roll all of them were...", "Ah Lincoln roll -- what an incredible combination! I live close by and dropped in to pick up a roll for take-out and this roll sounded full of flavor and...", "This restaurant doesn't open until 5 pm and we showed up around 3 pm- so we went shopping and had wine elsewhere but we're so glad we waited to go back at 5..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "2zHcjEINfQRl0Jxrvh2aFw", "text": ["Never would have known this place was here if it wasn't for Yelp. Good number of beer options, enough the waitress asks what do you like and gave me a...", "Don't judge the book from its cover.  Clean little cozy place.   Food was fresh and satisfying and the staff was very friendly.  \nWhen a place has lots of...", "One of my favorite places for a burger or wings OR something different. I love the twist they sometimes add to ordinary cuisine that's always spectacular...."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["wings", "burger"]]}
{"id": "RYrtb9Ok3ZI7KTfe40rCCQ", "text": ["Clean.  CoZy place and conscience location and parking. I did not have any poke before so I can't tell it's good or not. But I really like it now.", "I love this place! Food is delicious and fresh. The staff is always pleasant and helpful.", "The bowls look small but they pack a big punch! I got sushi rice and half tuna and salmon with edamame onions and spicy sauce damn it was\nawesome! The best..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.32], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["sushi"]]}
{"id": "Za0b93lYiLQUUKTXewItAg", "text": ["SO good. Miss this place so much since I've graduated. The dumplings will have you craving them everyday. I just also love that it's a food truck.", "This food truck is ok. The quesadillas are pretty good, especially with the sauce they put on it. The people are always somewhat nice, but I find I get...", "This listing says it is called \"The Cart\" but it reads \"Dumpling Cart\" on the side of their cart. I went there for lunch today (around 2:30pm) I ordered..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["lunch"]]}
{"id": "mzFIAmpX1Ef83Djqs19vZQ", "text": ["PaperMill has been my favorite food truck in Philly since they started in 2017. They are in University City near 34th St & Market St a few days a week,...", "I'm a sucker for new food trucks popping up around where I work, and so as soon as I saw this intriguing \"spurrito\" truck pull up I knew I had to try it.\n\nI...", "I had the pleasure of indulging in an excellent bahn mi from Papermill Food Truck (a recent Australian transplant) at Love City Brewing a couple of weeks..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "W6kblVmN1dHKLkfXt6z2sw", "text": ["This was a much better option than the various seafood places lining Hwy 1 for those who want to skip the insanely long wait (nobody takes reservations) but...", "Worst buffet I've ever been to.  The place  is dirty and unsanitary. The  actually Chinese food all tasted the same. The beef, chicken and seafood were all...", "OK food nothing special about the Chinese food, get the hibachi you can go wrong there.   some of the other items are decent but not really Chinese menu..."], "rating": [4, 1, 3], "TBscore": [0.0, -0.44, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], ["beef", "chicken", "chineese"], ["chineese"]]}
{"id": "fjll-w0EfZZwfxAyLLw51w", "text": ["Amazing amazing amazing. \n\nSeriously I don't understand why this place has 3 1/2 stars. Food is excellent, vibes are awesome, and service was super friendly...", "The food is somewhere between good to very good, worthy of 4 stars.  However, the service has been spotty.  In fact, the service tonight was poor enough...", "I was here the other night for dinner with friends. We waited quite a while for drinks and then even longer for the food. Waitress was very curt and almost..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], ["dinner"]]}
{"id": "90SDeFz5ottLVLv-j2O5VA", "text": ["Our go to sushi place closed down in Newark Delaware and we found this place by accident. \n\nGREAT FIND!!!!\n\nSushi and sashimi are great and fresh. We always...", "I got the Kung Pao and my bf got some garlic chicken entree. They refused to substitute the rice with mai fun noodles. The flavor of sauce was fine for both...", "The crab rangoon were very sweet, more like a dessert than an appetizer. The California roll was underwhelming and very tough and chewy which makes me feel..."], "rating": [5, 1, 2], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["sushi"], ["chicken"], []]}
{"id": "1leOvyTGFWRwhcWNt9IO3Q", "text": ["We've had a rotation of food trucks all summer long at my job, and Wolo finally came out and blessed us with their presence.  Wolo was one of the food...", "Visited this food truck when they were at Black Flag Brewing Company in Columbia, MD. I tried to view their Facebook page and website to find an updated...", "Had wolo today at the food truck festival. I honestly was attracted to the logo which has a cute dog on it! I had a Korean BBQ pulled pork sandwich with..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.61], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], ["sandwich", "korean"]]}
{"id": "0pL-eq0ufX5jMDgVAvoHHw", "text": ["Awesome place, the food is really good and the staffs are all funny and put on an a great show. Its a little pricy but worth it.  I would recommend this...", "I'm an INSANELY huge hibachi fan. If there was a list of things I could eat every day, hibachi is probably in the top 5 on that list. Sakura is pretty good...", "Chef was funny, waiter was good, food was alright but definitely NOT worth the $$ .. better off going to Hibachi."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "5N9nJbymj9JtOAEx6ZMxpg", "text": ["If I could give Josh 6 stars, I would. He knows his burgers and it shows. When I tell my friends from out of town that my favorite burger in Philly comes...", "4+ stars for my first Spot Burger, the Charlie Brown.  Burger, Fried onions, Bacon, Whiz on what appears to be a potato roll.  VERY good burger, easily the...", "3.5 stars! These guys definitely serve up some great burgers in a tiny food truck. The burgers are flavored well, and they have a lot of different burgers..."], "rating": [5, 4, 3], "TBscore": [0.5, 0.53, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["burger"], ["burger"], ["burger"]]}
{"id": "TWfuxuJZS77lVtCICX1Gmw", "text": ["Stopped into the Whitebrier on a later Sunday afternoon on 6/10/18 after coming back from Sea Isle. Beautiful place and a fun atmosphere. There was a...", "Tough night for the Whitebrier.  We have a group of 11 and with reservation at 5:30 they had table ready and waiting.  Main issue was an order of loaded...", "We were looking for a place to eat and decided to check out Whitebrier. Let me tell you, we walked into a full blown party at 7pm. \n\nThis review really..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "-7AGjO0qnOld_GZK9dNNkQ", "text": ["I'm a big lover of wings, and I love to try different sauces and flavors so I've been curious to try this place out. \n\nOur server said they have 30 beers on...", "Walked in the server with dreads was there last time I came and when we said we wanted a booth he had a little attitude but nothing bad. This time he tried...", "Had a gift card so we decided to hit here since we were in the area....good thing we didn't actually pay for this. Thinking that arriving around 5 on..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["wings"], [], []]}
{"id": "xzFVtiYBMlAXukh0_WNxjA", "text": ["Had dinner at Indigo, 44 Rehoboth Ave. First time eating here and I will come back! Food was delicious.\nInstead of bread they start you off with this crispy...", "We absolutely loved this restaurant! It was a pleasant surprise to discover an authentic Indian restaurant in the Delaware Beach area. The food and service...", "Great place for Indian food in Slower Lower DE! I just moved here from NJ and I am indian so I was surprised that this restaurant hit the mark with their..."], "rating": [5, 5, 4], "TBscore": [0.42, 0.7, 0.55], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["dinner"], ["indian"], ["indian"]]}
{"id": "j7H59WcReyq5-yM9KnGZBw", "text": ["Really great Indian food in Cambridge? Who knew?! A true hidden delight, I wish it was near my home! Great selection of Indo-Chinese dishes and some Indian...", "This was my 1st time in dis restaurant \nN it was awesome.. food was great and delicious  the service boy was very nice to us n the manager  came personally...", "This is the best Indian food restaurant that I have ever been to. The food is so good! Just amazing. Lots of vegetarian options too! They even have a..."], "rating": [5, 5, 5], "TBscore": [0.42, 0.0, 0.88], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["indian"], [], ["indian"]]}
{"id": "AcRFbSG6LFA4SW8EGFP0wQ", "text": ["I found this little gem on a trip.\n\nThis will be a regular spot for me next time.\n\nI will be bringing friends.  \n\nGreat food, service was prompted, waitress...", "This place felt a bit dirty. Carpets were almost blackened in well traveled areas. \n\nPoppadom was a little stale and cold. Vegetable Samosa didn't taste...", "We felt a bit let down by the lunch buffet today. The tandoori is the whole reason my father likes to go, and it was almost non-existent. Only a few pieces..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], ["lunch"]]}
{"id": "IvXT9CcGRRzFTeeRrn50PQ", "text": ["Awesome service, food and awesome experience!  Will definitely come back when we're in town again!  Keep up the great work!!  \n\nC.C. Walker", "Went here for the lunch buffet.\n\nUnderseasoned (my wife has to take the cap off the salt shaker), not enough meat options, sauces were thin.\n\nOverall, It...", "This is my favorite local Indian restaurant. The buffet is great and well worth the $. Ordering from the menu is equally good and portions are generous. The..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.46], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["lunch"], ["indian"]]}
{"id": "JEpsrFGIH4ixJJ4q2yUb_A", "text": ["Godavari has paneer to die for! I got take out from here and the palak paneer was PERFECT. Sometimes palak paneer is really bitter or oily, but this was...", "Very good lunch buffet! \nGreat value... \nAmazing staff...", "I went to Godavari for a team lunch during the week and I only have great things to say about their lunch buffet. The restaurant is seat yourself and their..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.8, 0.4], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["lunch"], ["lunch"]]}
{"id": "7wpeaSptmmDCXzzL5rvjsQ", "text": ["Food was good, service is good. A bit pricey but we were glad to find a different type of food in the area.", "This was not the best Indian food I've had. My samosa were cold and raw in the middle and were not the most flavorful. The dough was literally ice cold and...", "Sign on door and Yelp says they are open. They are closed. Wasted my time driving here."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], ["indian"], []]}
{"id": "yDiWYpuzRxcTgSi_O4JZpQ", "text": ["This is an amazing little place located inside of the New Castle Farmers market. After walking the whole circle around the market and finally locating the...", "By looking at the rating here, I had high expectations from this place but if you go by the reviews, I would say it's way over rated. Not that the food is...", "Enter the market via entrance 3 or 4. \nThe deconstructed samosa is excellent as is the vada pav."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "GABa_C0I4PTTa_-aLUo0aQ", "text": ["I love Indian food and Spicy Affair makes the grade. I had a vegetarian curry HOT, it was perfection. Service was great, my server was attentive and...", "I have given this restaurant three tries and each time I was more and more disappointed. I kept going back because I wanted to like it as I love Indian food...", "Drove all the way here to find out that the time listed was wrong.  So call to check before heading there.  Lesson learned.  Next time.\n\n\nMy pass review has..."], "rating": [5, 1, 3], "TBscore": [0.49, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["indian"], ["indian"], []]}
{"id": "_-OXe_vQnPRZp7-JBqXmbA", "text": ["Well, as long as you're not a stickler for plating and you know how to back-in park, you, like me will fall madly for this place! \n\nI went for lunch by...", "Was really hoping this was going to be a diamond in the rough.  It truly disappointed.  Ordered daal makhani and it had way too much turmeric/haaldi in it....", "Pleasantly surprised by how incredible the food was. Our extremely friendly and welcoming server informed us that this is the first Indian Restaurant in the..."], "rating": [5, 3, 5], "TBscore": [-0.42, 0.0, 0.41], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["lunch"], [], ["indian"]]}
{"id": "W6S482dRQ_9nCcLjfv8VNg", "text": ["Best Indian sitdown restaurant in Wilmington and on par with those in Manhattan and Queens. Prices reasonable. Love the one guy that works there. Short on...", "This is the first time here and enjoyed it very much!  We had the Dosa, Tiki Chicken Marsala, and more.  The place is small and modest, food came out...", "This is probably the most casual restaurant I've ever been to. It's a sit down restaurant, but you literally do everything yourself except cook the food...."], "rating": [5, 5, 3], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["indian"], ["chicken"], []]}
{"id": "R36Rhjk95Jh70scUravEQw", "text": ["The chicken tikka masala was good, but their naan was disappointing... For the record, Biryani City does NOT have a location in Newark. The 270 University...", "Restaurant opens at 11:30 so I when they opened the doors I tried to order but they told me the food wouldn't be ready until 12:00. If you open at 11:30 one...", "Shrimp Apollo so good!\nRestaurant is small but clean, friendly wait staff..\n\nFood felt like close to home-like meals"], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["chicken"], [], []]}
{"id": "BpWDokvNxKeZ7xDsh5cKOw", "text": ["Excellent and authentic Indian/Pakistani food! Chicken samosas were crispy and offered with a spicy sauce and a cooling creamy yogurt sauce. Butter chicken...", "We found Mera Khana in circuitous manner. We were going to a Mexican restaurant nearby and when we arrived, they advised us that they were closing early...", "Love this restaurant! Today was our first visit, we had chicken tikka masala, beef samosas, chicken byrani and chicken Karahi chicken. All was delicious!..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chicken"], ["mexican"], ["beef", "chicken"]]}
{"id": "gtOVX8hGKKIryQs0lGPt3w", "text": ["We were shopping in the Delaware mall and found this place on Yelp and we really enjoyed the food ! Their Biryani and Manchurian were good so was their...", "Let me start this review by saying that I love Indian food, particularly southern Indian food! My wife works in the area where this is, and she, knowing how...", "Manager do not have even a Basic courtsey and ettiquettes"], "rating": [4, 5, 1], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["indian"], []]}
{"id": "oQcV39W4ApVURMAXd7qhzw", "text": ["Good food, cheap and friendly workers. Call in for a quick pick up if you can't wait 7-15 minutes because they cook when food is ordered. \n\nI recommend the...", "Went for lunch on a weekday w a friend. Nice modern ambiance.  It's a small restaurant. Order at counter and are asked whether it's for eating in or take...", "My dosa was almost burnt and smelled like smoke.  Instead of making another one they tried to pass it off..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], ["lunch"], []]}
{"id": "NTlF55qiq2TCxR_2Kr4NAA", "text": ["Yummy Yummy yummy! A hidden gem! Don't be fooled by the ambience or outer looks - the food is delicious and the service really good. We have eaten there as...", "So disappointed recently.  I was craving some decent paneer tikka masala and so I went here Bc I loved their chicken tikka masala.  Sadly it just didn't...", "Stop reading and order the Samosa right now. I have had Samosa's all over India, the US, 4am on the streets of Barcelona...pretty much all over the world. I..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["chicken"], ["indian"]]}
{"id": "LJr34giEs_j1FcOfMmo2ow", "text": ["We visited Indian Sizzler on the recommendation of our cashier in the Oxford Redner's Market, who is apparently an Indian food aficionado. It's tucked in a...", "We came in late for dinner take out! Amazing fresh food prepared to order! My husband order the shrimp tandora and i had the lamb chops the onions and green...", "I usually don't leave reviews but I ordered 2x chicken tikka masala, 2x garlic naan, chef special biryani delivered for a total of 61$. Each chicken tikka..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, -0.22], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["indian"], ["dinner"], ["chicken"]]}
{"id": "OpUoLGa5NwOzuPutIAa1vA", "text": ["Love this place. A better​ place for spice lovers...", "I've been on the hunt for great Indian food since I moved to the area... and the search continues.\n\nAfter I placed the takeout order, my first concern was...", "Although the food comes in halal in this spot but upon callin and talking she said its halal however when we went to the restaurant the Indian (tamli or..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["indian"], ["indian"]]}
{"id": "g1whZv-jaeW0LyekGEJHag", "text": ["Ran in to order a togo order. They did not make what I usually order in other Indian restaurants so the waiter helped me pick some new things to try....", "My family and I went to Maharaja on Mother's Day. It was us and one other family in the restaurant. They had a special buffet for the holiday, so my family...", "Consistently great food and service. Vegetarian and vegan friendly. The following are vegan or can be made vegan:\nAppetizers:\nSamosa\nVegetable..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["indian"], [], []]}
{"id": "0_xBmn2q5WQyRq8No4zbBg", "text": ["Ordered the chicken curry with rice combo. Seemed decent then I bit down on a piece of chicken and though I chewed a bone. Spit out a piece of metal about a...", "Delicious. Came in here on a whim and I'm glad I did. The staff was nice and helpful in recommending dishes. Prices are very reasonable and seating is...", "When I started going to this place two years ago the food was INCREDIBLY seasoned with the best naan bread and butter chicken. I've gone twice in the past..."], "rating": [1, 5, 2], "TBscore": [-0.3, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "i-Td9gDwz4xLLYv5soGp9g", "text": ["Food is really good. Faves are the saag tofu and tikka masala tofu.", "What a great idea! Indian food cart. I love Indian food and decided to try after my dentist appointment nearby. They have popular Indian dishes , samosa for...", "Not my favorite food cart by far. The chicken tika masala was like tomato soup, very little chicken and lacked spice and flavor, the nan was chewy....first..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.7, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["indian"], ["chicken"]]}
{"id": "AVYuQ6DTqpqsB141r3lH4w", "text": ["This place is above average on the scale of Chinese restaurants. Lots of choices and variety. My favorite is the udon beef noodle soup and mini clams in...", "Went there last week for dinner with friends. What was supposed to be hot was cold and what was supposed to be chilled was warm including the sushi. The...", "Please save yourself and don't go. Food is flavorless and cold. All the meat at the hibachi station looked old or spoiled. They just keep stirring the old..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["beef", "chineese"], ["sushi", "dinner"], []]}
{"id": "ZzCcljlsQco6WsRDGaV8mQ", "text": ["Pretty decent/affordable food. I usually get take out...if you call ahead, your food is ready when you get there. The people working there are pretty...", "Spicy chicken  over rice really good! I've eaten here the last 4 days while working near by !!!!!", "I have definitely had better - this place is a mix of Halal, Fried CHicken, Pizza and Indian dishes and seems to get none of them quite right.  Very cheap -..."], "rating": [4, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [[], ["chicken"], ["indian", "chicken", "pizza"]]}
{"id": "hqZnhC1U7qGpKAqPZAXNUw", "text": ["I'm updating my previous review. I've been twice this month, and it seems Home Grown may be back. Service was fantastic, food was solid, and decor/menus...", "Awesome place for healthy, vegan, vegetarian, but also fatty and indulging food (aka the crab dip and pot of fries)! Not only is the food solid, but also...", "I came here with my family right when they opened for brunch on Sunday morning (9:30am). The venue is pretty spacious with an eclectic feel to it. Our..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], ["brunch"]]}
{"id": "gFeHqamBYW0qfxdkeAUvcA", "text": ["Okay, I will be honest, this place is a greasy hole-in-the-wall restaurant. The decor leaves a lot to be desired. That's the bad part. The good part is the...", "Was that a roach? Dam thing was big enough to put a leash on it and name it spot. Don't think the stuff they served me classifies as food. Wait staff...", "This Restaurant is Closed it has been remodeled and renamed to a New Improved Family Restaurant \n\nDiamond State Grill..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "2V5Ojt71AYfexwyVot7R9A", "text": ["Cute little ice cream shop with so many flavors to choose from.  My kids always choose cotton candy but I love the better brownie batter, it's very creamy...", "Such a cute place and so many flavors I didn't know how to choose! Luckily if you ask they will give you samples :)\n\nThe salted caramel truffle was...", "We love this place! It's around the corner from our house and it's our favorite place to take the kids for a treat! Even better they're building a family..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "9wxS_ZwR7cqQN4dDDDdeRg", "text": ["This is an average Pizza Hut no complaints here. I appreciated that my order was ready for pickup in the quoted time they gave me over the phone. I will...", "Ordered my pizza online at 8:15pm come 9pm my pizza still wasn't here. We called spoke with Taylor he said he has no orders in the last 45 mins, so we asked...", "I understand it's Pizza Hut and we know what to expect.But damm for the third time I ordered pizza from here to find the doors locked at 11.45 am .I am..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "7mWiZqi_5v87YooFKFiKqQ", "text": ["Terrible! I strongly recommend no one to purchase a customized cake from Classic Cakes!!!!!  I requested a customized 8in Mickey Mouse theme cake for my...", "I bake and decorate gluten-free cookies and cakes as a hobby and for free for military functions and my AF husband's coworkers. We were finally able to stop...", "I wish I could write a good review but I can't. While the decorations are beautiful, it's evident that the cupcake baking isn't done everyday. The cupcakes..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [["cake"], ["cake"], []]}
{"id": "RkAUyfAodXPtWkgdbpXPbw", "text": ["The best ice cream cake is good costumer service nice crew everyone was happy I really enjoyed being here", "This place closed 40 minutes early today which is Monday. Supposed to close at 10 and I came in at 920 and they were closed. I'm extremely upset and they...", "This is the worst ice cream I ever had it's spoiled or something.Stuff is very rude and place is nasty.Don't go there"], "rating": [5, 1, 1], "TBscore": [0.72, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["cake"], [], []]}
{"id": "uAuWvOej29IB64tiCbuOXQ", "text": ["I have visited five times since they opened last year- I have seen improvement in service, the building is beautiful and the food is very good At extremely...", "We stopped by for a casual meal and left the establishment very impressed. The server promptly greeted us and told us to take a seat anywhere. Surprisingly,...", "I'm pretty picky about restaurants and I found my visit here to be quite pleasant. Courteous staff. Really great food!!!!!! The BBQ was excellent. I tried..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "xtcAPAFrMlLTIbK_N2vi_Q", "text": ["Tried this place for the first time today - really loved the bartenders , ambiance , and the drinks ! Great service and drink options", "Got their 2 flights and growler for half price Groupon and so glad I did! The growler logo is well done, we enjoyed the beer we sampled and even stumbled...", "We came to town intending to visit another establishment but it was closed when we arrived. A local couple arrived about the same time we did (because their..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "RlR8Rs1x9mmmsMRosVJfAQ", "text": ["I think most people fawn over food that they don't regularly have access to.  While the locals may disagree (because they could stop there every day if they...", "They get my sandwich order wrong about one time in five. Patrons leave cars parked at pumps while ordering their Sizzlis, so pumps are often full with...", "My wife and I come to this WaWa all the time at night. Especially when we get off of work and want some food. Three months ago it was a fantastic WaWa. It..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], ["sandwich"], []]}
{"id": "wdTQ-zaAoeSgjQHQNq43KQ", "text": ["Pleasantly surprised by this little restaurant in Smyrna. Always have a hard time finding any type of Greek fair in this area and was quite surprised by the...", "Oh the smells!  As I walked in I was overcome by the intoxicating aromas wafting from the kitchen.  My expectations were automatically extremely high based...", "My comparisons are incredibly good kabob places in the D.C./VA area so I'm a little critical.  Overall good food at good prices. The beans were good, the..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
