{"id": "-Zx51WpS4FL8_7PtglJWkg", "text": ["This store is definitely clean...  the people are really friendly, although some look a little over worked... there's hiring signs so I get it. \nEverything...", "When it comes to shopping options in Frankfort, there aren't many. I enjoy shopping at one of our 2 Kroger stores because they are always cleaning and...", "Kroger carries fresh produce and it is our go-to place for grocery shopping. While some generic items are a little over priced, the range and quality of..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "jVzVOpVTJmoFrkeI05gtPQ", "text": ["Tony is a solid guy.  My wife and I wandered in to his place on a Sunday afternoon.  We had both just decided a cup of coffee would be good and bam, Tony's...", "If you're in need of a uniquely Kentucky crafted gift stop by Kentucky Knows or visit their website.  Tony is a Master Crafter of a multitude of coffee...", "This place was a super cool find. Tony the owner and afficianoto of coffee was so patient,  passionate,  and knowledgeable about his product. It was..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "I_iCGjQFIuW0np5B9hRL-A", "text": ["If you want to get a top notch limo with awesome drivers,they are very helpful,courteous and caring. I think you will be happy with Thoroughbred Limo. The...", "This is a top notch Limousine company. Staff was kind, courteous and through when I made the reservation. Limo van was very clean and beautiful inside....", "Extremely disappointed in the service we received, and the customer service we received following. We booked the Wine Tour South Trail as described on their..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "vyMVZPN6R2ZL3pwESzGBlg", "text": ["A round of applause to the manager at this location.  Best KFC I've ever been to.  Restaurant was nice and clean with a friendly, pleasant atmosphere....", "I'm not from Versailles but happened to be in town today.  I had about 45 minutes to kill so I thought I would grab an early dinner.  KFC was close by so I...", "Absolute worst fast food experience ever!  This location NEVER gets my order correct.  I finally had enough of wasting my money and called to complain about..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["dinner"], []]}
{"id": "yRlOGkaWawgg1xOBSl63yg", "text": ["I really needed to check out the Farmer's Market sooner. There's a great selection of local produce and other local products all at reasonable prices. You...", "The Franklin County Farmers Market is still a great place to get local produce, plants and flowers, herbs, bread, meat, eggs, cornmeal, grits, honey and...", "This is a great place to find fresh local products, fruits, vegetables, meats, cheese, honey, jams, preserves, beer cheese, barbecue sauce, & some plants &..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["egg"], []]}
{"id": "sdngDjH9J1aYJvK6H6YXkg", "text": ["The Vortex is a healthy shake bar serving the Herbalife brand protein shakes and teas. I love this stuff. The shakes are like meal replacements and help you...", "The vortex is a healthease smoothie bar that specializes in the shakes, teas, and \"donut shot\". The teas and donut shot are meant to give you intense...", "Fantastic place for a shake and a quick 'massage.' $10 for neck massage and $7 for a good shake. Quite a few flavors available. The women that work there..."], "rating": [5, 5, 5], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], ["donut", "bar"], []]}
{"id": "afYcHOlQqzqtR-Mlq0bIYA", "text": ["Hands down my favorite location. I have always had a good experience with this team!\n\nFirst of all I love how when you call this location they're focused on...", "I will never ever ever order from them again!  2 hours to deliver one pizza.  2 hours!  One pizza!  I would give them negative stars if I could.  Do not...", "I understand they have problems keeping employees but the business is definitely slipping.   Called tonight to make an order and was put on hold.   10..."], "rating": [5, 1, 2], "TBscore": [0.0, -0.3, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], ["pizza"], []]}
{"id": "nkbd07qu8ErAtLK0-eOGYw", "text": ["It's $5 Pizza! Is it the most delicious pizza I have ever eaten? Nope. But if I'm in a hurry and it's been a 16 hour day, then I love being able to go...", "I am crazy for crazy bread, but their pizza is pretty terrible. Everytime I eat it I think \"why am I doing this to myself?\" Spend a little more money and go...", "As far as a five dollar pizza goes, I think LC has the best I always get a bacon and pepperoni so it is made fresh and the cheesy bread is awesome. They add..."], "rating": [3, 2, 4], "TBscore": [0.62, -0.27, 0.38], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "Gt6ipLoSTTGp0bL2DAko2Q", "text": ["The help wanted sign in the window advertising openings for all positions should have sent up a glaring red flare warning. Based on the quality of service...", "I love their pizza! We have been here several times with good service and excellent food. We have only had the breadsticks and pizza, so I can't speak for...", "I first want to say that the food was pretty good. The serving was kind of small for a dinner portion. I ordered spaghetti with meat sauce. It came with..."], "rating": [1, 5, 2], "TBscore": [0.0, 0.47, 0.31], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [[], ["pizza"], ["dinner"]]}
{"id": "7-AoPkQ4_KdRcYZfIvEOoQ", "text": ["Pizza was great as was service even tho I saw nothing but teens...they were working nonstop. I think I saw an inspection posted at 100%!", "Awful. Nothing ever ready. Always a huge wait. Waited 20 minutes for a hot n ready at 6pm come on.", "Filthy store and pizza had obviously been sitting in a warmer for a very long time. Crust was hard as a rock. Both workers looked like they hadn't bathed in..."], "rating": [5, 1, 1], "TBscore": [1.0, 0.0, -0.29], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "3uhbeYRoB7ExqhpyROJMVw", "text": ["While in the Frankfort area, I checked on-line for some dining choices and came across the town of Midway and the number of unique restaurants there. On...", "We had visited Heirlooms a while back with some friends and saw the quaint little town and thought we needed to come back for lunch in this barn/silo...", "The food is fantastic and the menu has plenty of options. We did not have the cobbler as we were full. The service was very slow and the kitchen was backed..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "fHqgnFoNtCjn9x_kRxXmCw", "text": ["So I was walking my 1 year old German Shepherd downtown and was jonesing for a cold beer. I stopped by the Brick Alley, and Mike and his friends could have...", "Stopped in for a couple beers after touring Buffalo Trace Distillery.  Mike the bartender was awesome.  Made us feel at home.  Introduced us to all the...", "Just cold cheap beer with a friendly welcoming bartender. Yay!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "E0NCZr1Q-uVplhoi_AX49g", "text": ["Awesome drinks and atmosphere and one of the best bourbon selections I have seen! You have to try Logan's smoked old fashion!", "Our local - rarely miss Tuesday night trivia.  Gorgeous atmosphere, excellent staff, unequaled bourbon selection.  Logan the Bartender ROCKS!", "Incredible place. Almost seems too cool for a place like Versailles. Great atmosphere, wonderful drinks, and a huge selection of spirits. Very excited to..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "GFQnU9NKaHwzBtscMtNS4w", "text": ["I was here recently to listen to my dad's band play on a perfect Saturday evening.  It's just an hour away from Louisville and not hard to find at all....", "It was a hot sunny day and we brought our dog with us. They stopped me and said that \"the board of health doesn't want animals inside\". Outside would be...", "There are a number of reasons I like this winery. \n\nFirst, everyone there is super nice. Everytime I have gone there I have had great, knowledgeable staff..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "jgJxDvQ2MYZLfG1NvFpaFg", "text": ["This is Americanized Chinese. The Szechuan beef has no Szechuan pepper. The Hunan beef has no screaming hot chilis. However they are open to suggestions....", "Food is very good, and price is fair for the quality.\nBut I would only carry out because the seats are uncomfortable and it is a little warm", "This is my new favorite for Chinese takeout.  I sampled several items and there wasn't anything I didn't like.  I especially liked the dumplings.  Portions..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chineese", "beef"], [], ["chineese"]]}
{"id": "7PqlyDRg3Ry4WjdoSJy-Ow", "text": ["A decent family-run small-town Chinese restaurant.\n\nIt's basically like countless others across the country, roughly the same dishes and such.  The portion...", "We've been looking for good local Chinese food....we found it!!! The food here is excellent! Very fresh and full of flavor. The presentation of the food was...", "Whoa, it's easy to miss this place when you drive by. I know, because I never realized this was here until we joined some friends for dinner earlier this..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.41, 0.22], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["chineese"], ["chineese"], ["dinner"]]}
{"id": "kifQRiSXAQLlS7IB0BPs7g", "text": ["We are picky Chinese eaters and Cheng's is the best in Lexington. Don't tell anyone though! They have a small dining room, but our favorite style is...", "Cheng's does their genre of food right. It's your basic \"take-out\" style of Chinese food; but it is fresh and tasty. Certainly the best in Lexington, and my...", "Always have had a very good experience here and the food is very good. Extremely easy to call up for a to go order and use their drive thru window to pick..."], "rating": [5, 5, 4], "TBscore": [0.31, 0.3, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chineese"], ["chineese"], []]}
{"id": "6p3fWLFh7fp6bgMNpuBAkg", "text": ["-Worst Chinese Food Ever-\n\nIf you check out my reviews, you will see that I never write bad reviews. In general, the vast majority are four- and...", "We were rather disappointed in the buffet. Everything was hot and stirred constantly, the cabbage dish was great, and the dessert cakes and ice cream were...", "This is an incredible little buffet!  It has authentic Asian foods, a great variety of food, crazily cheap prices, as well as it is exceptionally clean..."], "rating": [1, 3, 5], "TBscore": [-0.33, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 1.0], "keywords": [["chineese"], ["cake"], []]}
{"id": "R3AJJS7JVd-Ez_SSNXKfVQ", "text": ["Rolled in at peak rush hour for dinner.  The staff was very attentive in spite of being slammed and kept out drinks filled as we waited for our food.  The...", "Located in the Lex Apartment complex close to UK campus, I decided to try a carry out dish one night after a late night meeting.  I had high expectations...", "I was in Lexington on business and decided to stop for a late dinner. The menu had great options and authentic dishes. I got a flat rice noodle dishes that..."], "rating": [5, 3, 5], "TBscore": [0.46, 0.0, 0.24], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["dinner"], [], ["dinner"]]}
{"id": "MPg-hDjlP0X8hcTsczupJg", "text": ["Sesame chicken and egg drop soup were good! Large portions, so I had plenty left for another meal. Will definitely go again and try something else!", "Second time i been here staff goes out of there way to make you feel at home food was great abd hot will be back", "My favorite place in Gtown to eat.  Tony will take care of your needs. I eat there regularly."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["chicken", "egg"], [], []]}
{"id": "4nNF_wQIxwZ0dX_cIrrttA", "text": ["Very good food , very clean place. Mostly carryout but 3-4 tables.", "I used to really enjoy this place but I feel within the last year or so it has declined. You really can't beat the price for the amount of food you get but...", "This place once was decent, but I guess providing quality food was not the objective for Chen Garden. \nLooks like they're putting pre cooked chicken or some..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], ["chicken"]]}
{"id": "Qm-rgOQOuBSiRi6aaQXUCA", "text": ["My favorite 10 minute takeout in LEXINGTON. I've had other people recommend others but there is no comparison. Quick efficient and you get solid customer...", "I must admit I was very pleasantly surprised that Chinese delivery could be this good. Delighted actually. \nCrab rangoon had a generous tasty filling that...", "The chicken was of questionable consistency and the rest tasted awful. The peas in my husband's fried rice were like half frozen or something. I don't know..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.3, -0.57], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], ["chineese"], ["chicken"]]}
{"id": "YkxPLgc3O4b8ymTbg1LYcQ", "text": ["Late night dinner spots in Madison, Indiana are few and far between. My father and I went to Hong Kong Kitchen at 7:30pm for dinner mid week. It's a walk-up...", "Very nice staff, a clean dining area, and convenient location.   The food was served promptly, was piping hot, and standard.   Unfortunately not amazing,...", "In town visiting for the day. Great place!  Excellent food, friendly and fast service. Very clean establishment.  Highly recommended!  I had the chicken lo..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["dinner"], [], ["chicken"]]}
{"id": "x9tWuKmPYxN9T_WNoHVuoA", "text": ["The food here is a quality that is rare in a local Chinese restaurant.  My family all had high quality dishes.  \nThe wife had cashew chicken. Cashew chicken...", "I have driven by this place several times and I finally decided to come check it out. At first I thought this was a buffet but was seated to a table and...", "Good Chinese restaurant on the south side. \n\nThe ingredients are fresh. The meals are tasty. Only problem is you can't get it spicy. For me, that's an..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["chicken", "chineese"], [], ["chineese"]]}
{"id": "1Jo4IsnbVv8qEa2ByBs39g", "text": ["If you haven't tried Oriental House on Shelbyville Road, you are missing the experience of dining in a local institution. It is the longest operating...", "Finding a really good (more than one would be awesome), consistent chinese restaurant in the Kentuckiana area has been challenging for me. It's a cuisine...", "I have been wanting to try Oriental House for a while.  So on a whim, my friend and I decided to stop there on a Saturday evening.  Not too crowded, but..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.49, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], ["chineese"], []]}
{"id": "zCMUxBFXLqLXLbg_j9yukw", "text": ["Great fast service. Met my expectations exactly. They are a typical Chinese restaurant delivery/takeout, but also have a sit down area. Hot and sour soup...", "Second visit today; we've now tried the fried rice, the lemon chicken, and chow mein, plus egg rolls & spring rolls. The egg rolls are nice; crisp and...", "This has become our goto Chinese place in Winchester. Its an unassuming little strip mall kinda place with about 7 tables. A lot of take out from here. So..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["chineese"], ["chicken", "egg"], ["chineese"]]}
{"id": "09gnnHQ2kqYMs3NRaueltQ", "text": ["Panda Cuisine is the OG authentic Chinese food in lex and still my favorite by far. I have a palate for spicy food and Sichuan cuisine is one of my...", "It is very hard for me to count how many times I have been there as I have lots of business trip in Lexington during these recent couple of years.\n\nIt is...", "Best Chinese in town. This is the higher end Chinese that is for a sit down meal at the restaurant. Being that portions are usually large and options are..."], "rating": [4, 5, 5], "TBscore": [0.28, 0.0, 0.22], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "39HAM4szoCVfY6Xgzsl_yg", "text": ["Well last night I ordered from this place for the first time, delivery and I was super super pleased. I got SO MUCH FOOD for a low price and delivery was...", "I ordered the steamed dumplings and the beef with broccoli.  On a Friday night I have to say my delivery came faster than I thought it would. \nThe dumplings...", "Awesome people and they always make great food with low amounts of excess oil and proper amounts of sauce and heat.\n\nWe have ordered several things off the..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["beef"], []]}
{"id": "wuoyhD4nzHBH75sRtK7tPg", "text": ["I live right down the street from this place and thank goodness for it. It is pretty standard American Chinese takeout but it tastes great and is priced...", "Yes, it's a pretty typical Chinese takeout type of place. Actually, I'd say this place is a bit above average. It's located in Tates Creek Center, beside...", "The lady is always so polite and knowledgeable. The food is amazing and fresh. I love how they have the pictures on the wall to give ppl a visual of what..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["american", "chineese"], ["chineese"], []]}
{"id": "ohbeHDRr-dmUo4xe2xeMzw", "text": ["My go-to Chinese food restaurant in Richmond. The cashier and cooks speak Chinese. Voted best Chinese food in Richmond for 3 years. I get the pork fried...", "I love this place! The best Chinese restaurant in Richmond! I just wish they Delivered!", "I ate here last week and never again. This was the worst Chinese food that I have ever had. Bland tasting and quite unappealing on their cheap take out..."], "rating": [4, 5, 1], "TBscore": [0.25, 0.54, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["chineese"], ["chineese"], ["chineese"]]}
{"id": "CUqixf-Hz4GWe29Oi339Ew", "text": ["The best Chinese place around. They are so good they put the other place out of business. Portions are large and the food is fresh and fast. Mainly...", "You really don't want my opinion, and I don't want to be disparaging with my words....However: Food safety and cleanliness or the lack thereof are very...", "Average at best. As i walk to the counter noticed the chicken sitting in a bowl unrefrigerated. Wasn't impressed with the meal, your average chinese if..."], "rating": [5, 2, 3], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["chineese"], [], ["chicken", "chineese"]]}
{"id": "USxAeS7pJY1Gk2VihA8BCQ", "text": ["Best Chinese food in Richmond. It's not fancy, not innovative, not particularly exciting. What it is: consistent, well seasoned, and solid on the tried and...", "This place is well worth your money.  The food is great and fast.  Do not expect a great dining experience this place is take out only.  Don't expect great...", "When the food is good, it is great.  You can tell when they just cooked it.  But I think they reheat food that had been cooked earlier, hence the food can..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["chineese"], [], []]}
{"id": "_qM3H-YHh9FD77nYbXeI5g", "text": ["Pete has always treated me well! They're always willing to make something vegetarian if I ask. No extra charges for a vegetable egg roll.  \n\nI'm a fanatic...", "Two stars for their portions and when they get an entree right. One star lost for the service and the raggedy interior, including the bathroom that doubles...", "The guy at the register recommended the General Tso lunch combo. It was tso-tso.\n\nWhat was good about it? The price was reasonable at about $6, which..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.32], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [["egg"], [], ["lunch"]]}
{"id": "voGbnN7oYOSWLOwK69aVHQ", "text": ["In our search for a favorite Chinese restaurant, Peking City Bistro wins.\n\nSet back off of Shelbyville road in a retail strip, the place doesn't jump at...", "I have had this place bookmarked for some time based on the reviews and the fact that I read that their Mongolian beef was really good here. Mongolian beef...", "I was in need of another lunch spot to try at work, and Peking City Bistro did not disappoint. It's not your average Chinese food, it has more upscale..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.7, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chineese"], ["beef"], ["chineese", "lunch"]]}
{"id": "2C_qKzTvTqERWC2oC-MQ0g", "text": ["For anyone looking for a Chinese cuisine in a small town, this place is not bad at all.  Food is comparable to any small Chinese restaurants that you...", "I dont know why but I really like this Chinese place. It's great for take out. My absolute favorite thing to order are the dumplings. They are thick and...", "I've had many chinese restaurants' hot and sour soups and this place has the best one! It is perfect in combination of spicy and saltiness."], "rating": [3, 4, 4], "TBscore": [0.0, 0.23, 0.43], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["chineese"], ["chineese"], ["chineese"]]}
{"id": "dDttEy3x2cOJxlZfE46m8g", "text": ["I got takeout from here when visiting Lexington. They were so wonderful to deliver to our hotel. I had a really wonderful Buddhist's delight (the tofu is...", "Wong Wong place to order from. \n\nSzechuan chicken Combo. Small sweet and sour chicken with white rice. Small plain Lo Mien noodles. \n\nDelivered timely. They...", "This is our \"go to\" restaurant at work.  Normally we all get Coconut Shrimp but I got the Pork Egg Foo Young this time....added Crab Rangoon with it!..."], "rating": [4, 1, 5], "TBscore": [0.0, -0.21, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["chicken"], ["egg"]]}
{"id": "CRL2y7BTGBdxaFXP5DK8gw", "text": ["I don't know HOW IN THE WORLD this place got 5 stars! Worst Chinese food I've ever had. I ordered the lo mein, egg roll, and pork fried rice. The lo mein...", "Great food... fabulous teas. They bring the teas in mini strained tea carafes you can pour over ice or hot in a mug. My favorite non- buffet Asian diner....", "My first visit to this little Chinese Cafe.  Table cloths, curtains, and plates and glassware were little unexpected surprises.  Service was very kind.  The..."], "rating": [1, 4, 5], "TBscore": [-0.5, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [["chineese", "egg"], [], ["chineese"]]}
{"id": "lVHrZqE0H5NYvc5L7S5twA", "text": ["So I was trying to go to another Chinese restaurant but ended up here by default. This is a good place. Sooooooo much better than Panda Express \n\nWe tried...", "Really good place to get beef and vegetables and a lot more. It's my favorite Chinese place for pick up.", "Typical fast food Chinese (reminds me of the ones in mall food courts) but overall it was good, standard Chinese fast food. Nothing spectacular but nothing..."], "rating": [4, 4, 4], "TBscore": [0.4, 0.42, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["chineese"], ["chineese", "beef"], ["chineese"]]}
{"id": "3v_WPa3XzRZzoBV1aieExQ", "text": ["China 1 is great! Me and my husband love coming here for dinner all the time. It's a casual clean restaurant with fun techno music. We usually come for...", "I have been wanting to try this oriental restaurant in my new home town for a few months now. Today was my day off, Tony had to work. He's not a huge fan of...", "We eat here about once a week. Food is always fresh and plenty of it that we usually make 2 meals out of it.  The owners are always friendly and great at..."], "rating": [5, 1, 5], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["dinner"], [], []]}
{"id": "ZyLCU5HD4ecyiQf4VHD58A", "text": ["Cool to find a nice family sit down American Chinese restaurant in Madison.  My litmus test for Chinese restaurants is how they cook their fried rice.  Is...", "For Chinese food this is the best bar none\nI have been a customer for 35 years. First the one in Louisville and now this one in Madison \nThe food is always...", "Very Solid Chinese fair.  I am partial to sesame anything here, especially the beef.   Great egg rolls and wontons.  We order about once or twice a month,..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.42, 0.23], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["american", "chineese"], ["chineese", "bar"], ["chineese", "beef", "egg"]]}
{"id": "zJx3BaOsThf1rYxRXD0sKg", "text": ["Hunan's is the very best Chinese food in the Bardstown area. I have lived in many areas of our country. Reflecting on my travels Hunan's is one of the top...", "If you could give it a 0 I would give it that. It used to be very good. We use to eat there all the time. It been a while so we got the house lo mein. It...", "I'll keep it short and simple. This place is garbage. Another review stated that the food is authentic, and that would only be possible if you count the..."], "rating": [5, 1, 1], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["chineese"], [], []]}
{"id": "znGwpx6a-uex_YW_DwXeqA", "text": ["This place has it all......5 different bars with food, plus dessert & sushi. Food is always hot and fresh and the prices are very reasonable. A waitress...", "Typical Chinese buffet decor.  Greeted immediately upon entering.  Staff is very friendly. This buffet has a sushi bar that is very good.  You can often see...", "This place greets you immediately with a smile. The service is awesome and your drink never runs low. The food selection is great and the food is so good...."], "rating": [4, 4, 5], "TBscore": [0.0, 0.31, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["sushi", "bar"], ["bar", "chineese", "sushi"], []]}
{"id": "NDApDPbQ75MYnZNr216u-w", "text": ["Just awful. My wife and I ordered the chicken lo mein combo, it came with pork fried rice, and eggroll, and a generous portion of(very bad) lo mein. We...", "What can I say? This is your standard strip mall Chinese restaurant. It was very clean and had a large menu with a lot of American offerings (buffalo...", "My favorite Chinese in Bardstown. Large menu so I am always trying new dishes. \n\nCall in, take out, or dine in....good is always served hot and fresh. I..."], "rating": [1, 4, 4], "TBscore": [-0.77, 0.0, 0.23], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [["chicken"], ["american", "chineese"], ["chineese"]]}
{"id": "G5jzo60DQUMzV9taWmiBuw", "text": ["Panda China is amazing Chinese food. Tried it tonight for the first time. Had Moo Sho Pork, Orange chicken, Pork in Garlic sauce, crab ragoons, hot & sour...", "Don't look just eat.\n\nIf I had seen the inside of Panda China before I ordered, I wouldn't have ordered.  The lobby needs to be cleaned and the small part...", "Excellent food and fairly quick service usually ready in 20 to 25 minutes from ordering. He is rather brisk and abrupt on the phone but the food is..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chicken", "chineese"], [], []]}
{"id": "GWIG5WHzBSnNNs2EUsCJMA", "text": ["This place may not look like much but the woman that runs it is a treasure and the food is some of the best Asian takeout in town! I was wearing a pride...", "This is not my favorite \"Chinese\" food restaurant in town, it is however the closest to my house and they deliver to the East End. (Gotta love that!).\n\nI...", "Very courteous delivery guy. \nWe greatly enjoyed our Singapore Noodles (usually done with pork, chicken and shrimp but they were happy to exchange our meat..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.38, 0.25], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["chineese"], ["chicken"]]}
{"id": "m8KDHASV5dw3wpwvU0uZrA", "text": ["Great place to get some Chinese food!  Good sized portions, and the folks there are friendly. Some speak English better than others!  \nDining area is small,...", "The first thing you will notice when you walk in the door is how clean this restaurant is. The proprietors are friendly and efficient. The food is always...", "Found Ming Moon with Apple maps as I was working in Kentucky. Yelp reviews are accurate when it comes to this small town eatery! Great food! ( I had the..."], "rating": [5, 4, 5], "TBscore": [0.32, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chineese"], [], []]}
{"id": "g5LqsvIL8qR0xKM_z1II2Q", "text": ["Happy Dragon is a great lunch spot. The price is right, the food is good (pepper chicken combo!), the service is fast, and the restaurant clean. What you...", "Hong Kong noodles were really good, a nice mixture of flavors and actually spicy. However the rest of items we orders, fried rice and orange chicken, were...", "I have eaten here in store and today I placed a pick up order. I was on a time crunch so I called in an order from their lunch menu. I ordered the pepper..."], "rating": [4, 4, 3], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["chicken", "lunch"], ["chicken"], ["lunch"]]}
{"id": "Las9QGKBVaoN5hmZTCdipA", "text": ["This is my favorite take out Chinese ever! The family is awesome. The prices are good and the food taste amazing. They make it fresh to order every time....", "I enjoy dragons and I definitely enjoy doubling my dragons. This makes me think of the Nintendo game back in the day Double Dragons. However that game was...", "I moved to Louisville from San Francisco so I'm pretty spoiled when it comes to food. I ordered the beef broccoli with chicken fried rice combo. The beef..."], "rating": [5, 3, 5], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["chineese"], [], ["chicken", "beef"]]}
{"id": "MunpLl2cRCmg3zb4G7oEIw", "text": ["The worst delivery option in Lexington. Not only that, it's the worst Chinese delivery and customer service I've ever experienced. \n\nLast night when we...", "Ordered lunch online for my employees at 12:56.  Have ordered here from the past online with no issues.  This time however after 45 minutes of waiting we...", "I was thoroughly disappointed with this Chinese restaurant. Food came hot and smelled really good; but there are too many complaints to make it worth a 4..."], "rating": [1, 1, 1], "TBscore": [0.0, -0.25, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["chineese"], ["lunch"], ["chineese"]]}
{"id": "h2PxU2hQdS3dtaBLTfd_mg", "text": ["China King is one of our family favorites in Nicholasville! Having tried many appetizers & entrees over the years, we've not found anything we haven't...", "It's alright. About on par with any other Chinese place in town. The bourbon chicken is fine... just fine nothing to go out of the way for and really only...", "This is my go to place for \"on the way home\" general tso's pick up.  The egg rolls are average but their rangoons are surprisingly good.  I keep going back..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["chicken", "chineese"], ["egg"]]}
{"id": "LNIb-d1cEnXFRLG8LEuDTg", "text": ["Good prices for typical Chinese food.  The portions aren't huge (like some takeout places), but I had enough for two meals from one combination dinner.  The...", "Tried this restaurant for the first time, and needless to say, we weren't impressed! The meats were thin and very dry. Didn't receive much food, except...", "This has been my go to Chinese food delivery restaurant for several year. Food is always hot and delivery is usually under or around 30mins."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["chineese", "dinner"], [], ["chineese"]]}
{"id": "qAahGjSYP2_giMJ4dYKkMA", "text": ["When our old offices used to be near to this restaurant in Prospect, I probably showed up here once a week. Even after our offices had moved, I still came...", "Our favorite Chinese takeout for sure! Every single item on the menu is delicious. Orders are ready quickly, portions are generous and the quality is great!", "I thought it was one of the better places I've been to around here. I got the wonton soup which was good, the shrimp Lo Mein with crab Rangoon. All items..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.45, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["chineese"], []]}
{"id": "lJsvOhmQQiQQHYVzTBm5Ow", "text": ["Had lunch there for the first time. The gentleman serving me was very friendly and attentive, my water never got below half-full.\n\nI had the lunch special...", "My wife and I had lunch here before heading to Costco. I really think they deserve 3.5 Stars as the lunch portions and prices are good. \nFirst and foremost,...", "Second time visiting this location. Glad they were open on Sunday evening as my pregnant wife was craving Asian food. We got the pork belly stew and my wife..."], "rating": [5, 3, 4], "TBscore": [0.37, 0.38, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["lunch"], ["lunch"], []]}
{"id": "P80TA6XPGJZ0Um_Fw5BnaA", "text": ["I agree it's typical Chinese carryout food. Happy Panda is located in Townley Center, just a few doors down from El Marachi. It's been open for a few years,...", "This is the only Chinese place we go to. Moved here 7 years ago and tried some others but found this little gem tucked in the Towne Center. The best I have...", "Our favorite gi to. Soooo good. Nice n clean. And yummy.\n\n\n\nVery yummy. We like dinner special. 7.99 soup rice n meal. Very good."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.52], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["chineese"], ["chineese"], ["dinner"]]}
{"id": "BEdbSZKbIo4h_Guxoxf9eQ", "text": ["Very good sushi.  The LaGrange is a favorite. The owner and staff are all very welcoming and friendly. I enjoy the atmosphere there.", "Love this place! The sushi is delicious and you won't have to wait long for it to be delivered to your table. The staff is incredibly nice and I think it is...", "The food is very good at Rikishi, their challenge is being able to delivery that food timely.  This is just one of many times that, what should have take..."], "rating": [5, 5, 1], "TBscore": [0.48, 0.54, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["sushi"], ["sushi"], []]}
{"id": "NXGM3_lxYqV41AnLI4VEHQ", "text": ["We've been to this restaurant a handful of times now and each time has been a great experience. If you like the hibachi style atmosphere then this is the...", "My husband and I just got out of the movies and were craving Asuka. We were immediately seated upon arrival by the kind host. We waited a while for our...", "I get the amazing tuna roll, the avocado roll and the veggie tempura.   Have to say they have a good ambiance.  The food is good. If your looking to get..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "qn6buWFlB2ysUh1USmNXsA", "text": ["Can't think of a better place for a 10yr old birthday dinner when the birthday girl wants teppanyaki. All said, we had three adults and three kiddos (10, 7...", "I use to eat at Miyako all the time years ago. I stop going because the quality of their sushi went down in my opinion. I did have some delivered tonight....", "I love this place! We go there for lunchtime. Which makes the meal around 14 dollars cheaper depending on what you get. The cooking was so fun to watch,..."], "rating": [4, 4, 5], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["dinner"], ["sushi"], []]}
{"id": "PBW-XowXzBMKakQVEErwkg", "text": ["LOVE LOVE LOVE this place!!!!  Henry is wonderful and have always had nothing but great service and great food and of course entertainment.I would highly...", "Not all the food we order was bad, the crab Rangoon was. It wasn't good at all, so we talked to the manager and he was so rude and not even apologizing...", "As someone who frequents Japanese steakhouses, I enjoyed this dinner! It was very clean. We went on a Thursday night and had NO wait. I also liked that we..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.43], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["japanese", "dinner"]]}
{"id": "t9H6vAxYUeMpgSwDd6J9uQ", "text": ["Tasha was great she brought our food out n a timely fashion and gave great service! Even though it wasn't cooked in front of us the experience was pleasant.", "We are a military family and well traveled. We were in town for the Chautauqua Festival. The sushi was some of the best I've ever had. The prices were...", "Some of the best sushi ever... their tofu is awesome and extremely reasonably priced \n\nThe bento box's and sushi rolls are very fresh and taste great....."], "rating": [5, 5, 5], "TBscore": [0.0, 0.45, 0.68], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["sushi"], ["sushi"]]}
{"id": "5-uhvsFWteigE-Cxw1g_IQ", "text": ["My sons and I thought we would try this on a whim and we were pleasantly surprised!Amazing, fresh sushi! Reasonably priced, garden shrimp salad was very...", "Update: hours aren't consistent and store front not accurate. Call ahead before going. \n\nWe stopped in on a whim because we wanted sushi but didn't want to...", "Had the nabeyaki udon; it was okay at best.  Very disappointed that they did not serve any ramen.  When I asked if they served it there, they looked at me..."], "rating": [5, 4, 2], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["sushi"], ["sushi"], []]}
{"id": "JHm2HAD59JA-CSLTWkdJkQ", "text": ["Simple, delicious and fresh. Excellent value. Owner seemed very nice. The included drinks were a plus, actually seemed excessive. Smart marketing. I will be...", "Khin's is our Go-to place for sushi in the Richmond/Berea area. To be honest, it's not the best sushi I've ever had and the dining area is small and doubles...", "Seriously, our favorite place to eat in Richmond! It's so cheap and you get a lot with it. My husband always gets the small roll ($7) but comes with 20..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.45, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["sushi"], []]}
{"id": "tgjh3cE-7WJQEIxXVNxs-Q", "text": ["Are Japanese restaurants becoming mainstream America?\n\nYou know how there seems to be a Chinese restaurant in every small town in America? And how it seems...", "I'm here to give an out-of-towner's perspective. We eat sushi.... a lot. We ordered cucumber rolls for our daughter, gyoza, a spicy tuna roll and a bento...", "Went for lunch. The food was good. The bento box is a great deal\nThe service was what brought the score down\nThere were only two tables a total of four..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["chineese", "japanese"], ["sushi"], ["lunch"]]}
{"id": "CBMKrRLK46mfeFPM4F4ieg", "text": ["I was home for Thanksgiving, and I was looking for something new to try in Louisville. I came across Bento Asian Kitchen, and I was immediately intrigued....", "I've had a four-star visit and a two-star one, so I'm averaging. On the better visit I ordered the poke bowl, which was fresh, tasty, and nicely presented,...", "I tried the pick 2 meat combo with steak and chicken teriyaki and fried rice. An ample amount of food including a small spring roll, bit of edamame and a..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, -0.42], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["chicken", "steak"]]}
{"id": "KKvSQyHQ-Zao8m8HUMbYiw", "text": ["This location has not closed as reported on Yelp. It's open and awesome. Need more accountability on Yelp!", "Quick lunch decision based on time and location.  Had the hibachi steak meal and it was fast and fresh and exactly as advertised!  Would definitely...", "I love the vegetarian noodles: the veggies are fresh and it's loaded with mushrooms, zucchini, cabbage, broccoli, onions, and mixed between house noodles...."], "rating": [5, 4, 4], "TBscore": [0.0, 0.23, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["steak", "lunch"], []]}
{"id": "_kp19jY4iJIz3AZZ1WKwTw", "text": ["Quiet atmosphere, fast service, and great food. We love the Yum Yum roll and Spicy Tuna roll!\n\nThe crowd definitely picks up in the evening and even with...", "My roommate and I have visited this place a few times and the staff was always friendly.  I was not impressed with the ramen, but I have had apps and other...", "The first Japanese restaurant in Louisville I absolutely fell in love with. When I lived in Middletown it was my number one go-to place for Sushi. The place..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], ["japanese", "sushi"]]}
{"id": "fGJRoY7LjeXrh9JceqE6tQ", "text": ["Had the 3 fish roll and Philadelphia roll.  Also had Sake , Maguro, Kani andTako. Portions were generous and quality was high.  Presentation was a little...", "Excellent Japanese food. They cook the food in front of you and also entertain you while they do it. The food is steak and chicken. Rice and veggies...", "Great Japanese cuisine in Georgetown! I ordered chicken teriyaki which came with miso soup, salad, and white rice. Portions were very large and I had plenty..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["chicken", "steak", "japanese"], ["chicken", "japanese"]]}
{"id": "tGGIXXhTbTWm4Fb1EwarAg", "text": ["This place is awesome there rolls are so big you can hardly pick them up. I will definitely be back  (right) crunch munch 10/10 bottom 2 in 1 roll 10/10...", "Oishii is the best sushi in town, full stop. They've got a wide selection of sushi, maki, etc. as well as hot entrees like teriyaki, katsu, soups, and...", "Again with the 5 stars. My family and I are very picky about the restaurants we frequent. Oishi is definitely one of our favorites. If you like sashimi this..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["sushi"], []]}
{"id": "ZzwMP5PltYe0EaOwdx66IA", "text": ["Love eating here. a bit expensive but so yummy. The service isn't always on point but the roof makes up for that. Their sushi is awesome", "We were in the area on a Wednesday evening and decided to stop here for some sushi. I ordered the Chirashi which is usually a nice assortment of sashimi...", "We have always found the food to be good however the service is not. After rushing to get to the restaurant before the 2:30pm lunch closing, and arriving at..."], "rating": [4, 3, 2], "TBscore": [0.33, 0.6, 0.7], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["sushi"], ["sushi"], ["lunch"]]}
{"id": "3VRpYwFDwvt5iUZgJvgPDA", "text": ["Fantastic Chinese take out at a reasonable price!  They make fantastic meals that are simply delicious.  You can call ahead to get your take out, or use the...", "King's Wok is your typical fast food take-out style Chinese spot. We were staying in Lawrenceburg with friends and needed a quick and easy dinner option, so...", "Pulled pen out of container to sign credit card receipt and bug came crawling out. Nothing else to say."], "rating": [5, 3, 1], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["chineese"], ["chineese", "dinner"], []]}
{"id": "sT4LGehzyyHDsSdsorS_rQ", "text": ["What to get: sashimi\nTime seated: 0 mins (Thursday 1:30PM for 1)\nTime food arrived: less than 5 mins\nAmbiance: casual sit-down\nParking: small shared lot in...", "We went here on Friday night with a group of people and had a good experience! There was no wait and we were seated promptly.  We ordered wine and my...", "I've had sushi several places and this one ties for first place with Oishii Sushi on Taylorsville Rd. I like the cozy feel of this restaurant. It would be a..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["sushi"]]}
{"id": "FWOa7gMrA6Q3P6aZjpYtVA", "text": ["I can't say enough great things about this restaurant. As a newby to trying Sushi this place did not disappoint. I recommend the Ceviche appetizer and the...", "I love this chain! I went to the Denver location quite a bit when I lived there, so I was ecstatic when I heard this location was opening up!\n\nMenu wise,...", "Ambiance of the restaurant is nice and restaurant has plentiful of seating! I was looking forward to trying this place because of all the great reviews but..."], "rating": [5, 4, 3], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["sushi"], [], []]}
{"id": "HmSdkOKh_S3ASQ8P4wiRUg", "text": ["My daughter and I came here for lunch and we were the only two in the restaurant. The place was spotless, and service was fast so I was apprehensive when...", "Of all the sushi I've tried in East and West Louisville, these guys beat all. Def recommend the Sushi Master roll and 007 (lime and eel sauce yum!)  If it's...", "I had some really good sushi tonight! This spot in norton Commons should be on every sushi loves must- list. They have a great selection of sushi and other..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.52], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], ["sushi"], ["sushi"]]}
{"id": "s-GEcI_PIhewfJdlKYUuwg", "text": ["Hibachi express is FIRE. They load up your to-go box, I can usually split it into two meals. It's delicious and their yum-yum sauce just hits different than...", "I was a creature of habit in college and always ordered the same thing.\n\nIt was right across from the business college so I came here on occasion for...", "The fried rice is really good but I ordered steak and it was quite gristly. Prices are reasonable. I much prefer Sakura 12 for fast hibachi."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.32], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], ["steak"]]}
{"id": "8Kdq2OAneJEnwEFeEZh0HA", "text": ["My first time here and I am satisfied!  Very good. Friendly, fast service. \nI love crab salad and they have a spicy option..delicious \nI also ordered the...", "I love a quick Sushi restaurant Red Bang Bang sushi always pleases. Its quick and convenient I can get in and out with out taking up half of my day and the...", "This is such a unique concept in which you can build your own sushi! This is awesome because I can't stand avocado(don't judge me haha). They also have a..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["sushi"], ["sushi"]]}
{"id": "7Cwsv09BZG_hxKBXHFXM0w", "text": ["Great, authentic, fresh Korean food.  The entrance is in the back of the Asian grocery.  \n\nI had the best Korean soon tofu soup that I've had since...", "Seki is a small restaurant in the back of Dongyang Market. I really appreciate that it has curtains by each table for privacy. \n\nOut of the dishes we...", "Best bibimbop in town! Best Korean in town! It's small, good atmosphere for a date, great food! In the back of DY Market grocery...a hidden gem."], "rating": [5, 4, 5], "TBscore": [0.43, 0.0, 0.47], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["korean"], [], ["korean"]]}
{"id": "Ah7nqZ6X8sTHBYzk0-4XiQ", "text": ["My son and I tried Korean BBQ for the first time, and we enjoyed the food and the knowledgeable and patient server, who answered all our questions. Next...", "I ate at this Korean restaurant while in Lexington based on Yelp ratings. The place was large Nd a little quiet. The server/host was really friendly. \nI...", "I'm gonna start with saying that you should have some knowledge on Korean food prior to coming here for their lunch buffet. I came and there were no names..."], "rating": [5, 4, 4], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["korean"], ["korean"], ["korean", "lunch"]]}
{"id": "pgf-0SjpsogOzUXomEIs6A", "text": ["I love Charim! I don't know what authentic Korean food is, but I do know Charim has delicious food. My favorite appetizer is the Charim wings. Can't go...", "Solid.\n\nBeen here a handful of times now and always enjoy the authentic and high quality experience.  \n\nWe love the Hot Stone Bibimbap.  My bride likes the...", "This was my first time trying Korean and The food was very good. We both got the hot stone bibim bap. It was quite tasty. I was not a fan of the sides. My..."], "rating": [5, 5, 3], "TBscore": [0.66, 0.0, 0.47], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["wings", "korean"], [], ["korean"]]}
{"id": "Vn3UFntvv4DY8YW3Caoazw", "text": ["I've been trying to visit this place for several years. Every time I go by, it's closed. Clearly it is not in my destiny to visit.", "We have been a little shy in trying this place since our first and only Korean experience was an expensive, dismal attempt far from authentic. However, we...", "I have been going here for many years and when I tell you that I have never once gotten bad food here, I am absolutely telling the truth! The menu has..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["korean"], []]}
{"id": "vJRWTenGsi_WKuq5Kv7gTQ", "text": ["An Asian market in Louisville I wasn't aware of! No way! I just had to check this place out. \nThis store caters to those shopping for Korean and Japanese...", "They have a lots of frozen food, sauce spices! I think it's Korean family owned store but they have Japanese food as well. \nI usually get frozen food from...", "For a small market, this place has a superb selection of Korean and Japanese products with some other asian ethnicities represented as well.\n\nGood place to..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["korean", "japanese"], ["korean", "japanese"], ["korean", "japanese"]]}
{"id": "3iiUNOGdESUHrKDdEsSIbA", "text": ["This is my go-to place for Korean groceries in Lexington. Great selection of all basic needs--kimchi, produce, seasonings, and frozen meats. The cashier is...", "Yes this store is small, but convenient for your spur of the moment needs or when you have a sweet tooth for that hi-chew candy. It's a regular stop for me,...", "Easily one of my favorite places to get good ingredients for korean cooking. I've been coming here for years and they always have what I need, and are..."], "rating": [5, 5, 5], "TBscore": [0.4, 0.0, 0.54], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["korean"], [], ["korean"]]}
{"id": "qeP0ZKDTbzXQBby7OQm2OA", "text": ["Although this place is out-of-the-way they serve amazing barbecue the service was nice the people are friendly and I would go back to eat here anytime I was...", "With out a doubt, the Sample Platter is just delectable. The meats simply fall off the bone or melt in your mouth. \nHighly recommended. \nI brought Mike for...", "I wish I could give this a 3.5. The Decor of this place is phenomenal and I can't wait to go back when it's not raining and sit out on the patio. The only..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "Up5W5NjYfWKKRw0Ir4MxoA", "text": ["The first time I went here was a week ago and now it's my new favorite lunch place.\nI saw my friend ordering a \"Half and half\" - I didn't know what that...", "What a fun concept! \n\nYou can make your own salad or choose one of the options they've created. \n\nI've done spinach with dried cranberries and balsamic. I'm...", "This is one of my favorite spots in Lexington to eat. \n\nI always feel good when I leave here and satisfied. They have a lot of salad options that are..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], [], []]}
{"id": "tSqTYQgtPrd8v3UUoOzJCw", "text": ["I know that the Food Truck scene in Lexington is growing but I had no idea how far that it had evolved.  Formerly my favorite hotdog was the Sonoran Hotdog...", "Thanks to Mark Jensen and Fork in the Road for doing food trucks right! Some of the best gourmet food you can get on the street. We met this crew behind...", "Oh my is all I can say !!! I thought I would never top the sonorian hotdog until I met the Fork in the roads Haute Dog !!!!consider it Trumped with this..."], "rating": [5, 5, 5], "TBscore": [0.3, 0.0, -0.5], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["hotdog"], [], ["hotdog"]]}
{"id": "ZX2hSmp9nfBcocWQ1EsZUQ", "text": ["I have eaten at this location a few times now and each time I have been very happy. The service is friendly, and the food perfect. The soup choices are...", "I love these salads - LOVE THEM! They're so fresh, have just the right amount of fixin's and dressing, and they fill you up for lunch. I was excited to see...", "Fresh salad! Kale Harvest salad was wonderful.\nMy husband had the BLT salad and really liked it. White bean chicken chili soup was also a hit!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.42, 0.25], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["lunch"], ["chicken"]]}
{"id": "abARsGddAXRQYlKtZYqLnw", "text": ["Tantalizingly Scrumptious! \n\nI have a peanut allergy but it was not a problem. The staff deftly told me what to avoid and guided me through every step....", "Quite an interesting noodle place. Covers most of the noodle types of east Asia. \nI picked drunken noodles stir fry which was spiciest of the sauces. The...", "Visited for the first time today. I got the curry noodle bowl with roasted chicken and a spring roll. The curry had just the right amount of heat and the..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "4BXVRDeJH56kwWwvuAS10Q", "text": ["We had driven past this place many times and never stopped but now we are addicted! We do love the entrees.. they are always fresh and fast and hot! My...", "I was craving noodles, and since my wife's tastes are often different than mine, we decided to give this place a try. \nWe looked at the website to get an...", "I like the place if I have a BOGO. Otherwise, the entrees are too pricey. Personally, I always go with the Chipotle Adobo Pork. I like the spicy flavor, and..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "_TU0XM5SQm6NT3qvGZCOwA", "text": ["This is a pretty good ramen spot. Tucked in a food-court vibe spot known as \"The Barn\" it's located in the corner immediately to the right when you enter....", "I'd been looking forward to going to Atomic Ramen, in the Barn at the Summit as there are only a few ramen spots in Lexington, but was ultimately...", "I didn't want to give this place a \"bad\" review, but after eating a bowl of their ramen, I'm sorry to say I'm going to have to give it 2.2-ish out of five..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "xmP-zl2RGsuEW9WOEPRWWg", "text": ["I am  new to the P.F. Chang world;  but glad I got on board.\nToday was my second time there, and the food is amazing.   I have to say, they have  made a...", "Okay so straight to the point.  Foods alright, not the best. (Probably because it's GF.) \n\nService is a different matter.\n\nWe were seated and it took...", "We went here for lunch and the food was delicious. The waitress was a little slow in taking our orders but other than that it was a great lunch. We got a..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "acbG4S6zlUbs0LwgVw0RQA", "text": ["Really good, quick, tasty salad. A five-minute wall to the Mary Todd Lincoln house. (Do yourself a favor and take that your.)", "I typed \"good salads in Lexington\"\ninto my google search and this was the first shop and we were only 3 miles away so we hit it.\n\nThe space is adorable, but...", "I really wish I could rate this establishment 5 stars.  I really really want to.  However, I can only give three stars because of pricing and options.  If I..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "ovGOVLJvLfIv3EEKwQhfuA", "text": ["I have to admit I'm quite surprised to see the size and the varieties this place offers, they even have the Asian produce, very good selection of instant...", "If you need something that is for Asian cooking you will find it here. It will probably have anything that you are looking for. However, the overall store...", "If you are looking for any Asian groceries, this is your place! Prices arent inflated either. Cheaper than what you would find at large chain stores. The..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "GQbQyXyhE350dE-LpvH4Xw", "text": ["Food is great but the wait for it is usually a bit long, as it is with seating. \nIt's also a bit pricey.\nI'd definitely go back but it's definitely not...", "I tried Wing Zone's boneless \"wings\" in their new Korean flavor.  They weren't hot enough for me, and the blue cheese came in a little pre-packaged round....", "Great place for wings. Fast delivery and the food is hot. Great staff and I won't even look at BDubs again.\nCheck this place out if you want great food,..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.57], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["wings", "korean"], ["wings"]]}
{"id": "5Rf8YQch9DAeJVEivIeGSA", "text": ["4 clams of 5 on the clam scale rating scale. Too much water offered is the only thing holding this place back from the 5th and final clam. I felt too much...", "Sushi was soft and tender, not old and hard. However, it wasn't packed tightly. We did the hibachi as well. Waaaay to much sauce. All our plates were...", "Hubby and I were blown away by the amazing sushi so close to our house.  We normally drive 20-30 minutes to get quality sushi but those days are no more...."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["sushi"], ["sushi"]]}
{"id": "SG37acq9QiNNg2dqG3VJ_A", "text": ["Perfect warm up for this cold evening.   You have to try the Zucchini Spicy Peanut Sauté with Chicken.  It has just the right spice to zing your taste buds....", "Noodles is delicious! My favorite would have to be the penne Rosa and if you feel like treating yourself I recommend the cheesy garlic bread & the...", "Good concept and great location. The staff does a great job; the place is clean and they're efficient and super friendly.\n\nI had the Thai Chicken soup and..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "xI17F6XeuffuoSHT-tpQjg", "text": ["FlavaVille is like that best friend that is always around when you've had a bit too much to drink. Their food is the epitomy of when you are ready to...", "FlavaVille is a bit unassuming. The truck isn't hugely flashy, which is a bit like the food. But both are full of surprises -- great surprises.\n\nI ordered...", "Met Chef Katz at the B3 bash, after trying the dish at the event I HAD to check out this cool Taco Truck. I was blown away!! The way the mediterranean..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "No6xPXN-X2gQWbSTVZP_ZQ", "text": ["I came on Sunday and had good food and good service. I get the crab wonton but I have them put the plum sauce on the side. I get the magnolias beef...", "I've always been a fan of P.F. Chang's. I'm finally sitting down to review. After a doctor appointment yesterday I made my way over for a late lunch. I'm...", "Normally we have good experiences when we eat at P.F. Chang's but the last time we ate here the cleanliness was below standards. I have attached a photo of..."], "rating": [4, 5, 1], "TBscore": [0.7, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["beef"], ["lunch"], []]}
{"id": "K2YREmmKAse_D6eYOKPOlQ", "text": ["I love Noodles.  I love the variety and the international flavors of their menu offerings.  I love that they're not afraid to have spicy things on their...", "I hate to see a business I love go downhill, but this Noodles & Company is definitely losing it's A game. There were two employees working. There were three...", "My girlfriend and I went here for lunch and I was very surprise with the quality of food. Carol ordered the pesto cavatappi with tofu and I ordered the..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "fEFDFioiqbO8vp_ea1W2Ng", "text": ["This is a good place to go with your family or a large group (they also have a large party room). I went with family and they're very picky so it was great...", "I am not a buffet-goer. I am the type of person who will avoid a buffet at all costs...but Hibachi Sushi Buffet is the one exception I will make, and I will...", "Overview:  large variety with typical buffet quality and great service. \n\nThe staff here was very attentive and friendly. Throughout the whole dining..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["sushi"], []]}
{"id": "N4L_0xTWKPFzQVFLjN1LCw", "text": ["The food is all reasonably priced and suits well with portions and quality of the food. Solid quality on traditional wings and they are bigger than anywhere...", "Picked up an order of ten boneless buffalo wings with fries the other night. I had them with the medium sauce, the chicken was great I think I probably...", "This is by far my favorite chicken wing place. My wife and son decided to get a couple appetizers one the pretzels and cheese along with the mozzarella..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["wings"], ["wings", "chicken"], ["chicken", "wings"]]}
{"id": "RMRsYuvQ8IUh2MLNxgPmjA", "text": ["**Addendum***\nAfter posting this review, I appreciate management reached out and was sincerely disappointed with our dining experience and trying to making...", "I am kicking myself for not writing my servers name down. He made the experience great. \n\nI don't expect a lot from a wing place. They serve you chicken,...", "First off the only reason I'm giving them a three instead of a four is that they no longer had the Korean bbq option that was a special on the summer menu...."], "rating": [1, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 0.2], "keywords": [[], ["wings", "chicken"], ["korean"]]}
{"id": "2hpkvqepZ5aCvB-hPslzjQ", "text": ["The Crab Rangoon Sushi Roll was amazing! I will be coming back here just for that. \n\nThe Sliders were good. The Salmon was salty. The Quesadilla was...", "I say average for Drakes. It's a nice place for all kinds of drinks and brew. \n When I sat at the bar to eat the bartender was efficient with my order and...", "I like Drake's. They have a nice pub atmosphere and food. The open air patio/bar area is great and a nice option for dining in the Paddock Shops. I ate here..."], "rating": [4, 3, 4], "TBscore": [0.48, 0.22, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["sushi"], ["bar"], []]}
{"id": "r487RBQGmVyuca7Rwtbfhw", "text": ["So far this is our favorite Indian food in town. The Korma is delicious. They will make their dishes legitimately spicy, which I love. I usually opt for a...", "It's been a while since I've been here and I must say I'm glad I stopped by. This place is pretty busy for lunch buffet! I was pretty excited that they had...", "Masala is located at beaumont center next to Sahara. This place is awesome! Portions are generous, food is flavorful, very fairly priced ($12.50 chicken..."], "rating": [5, 4, 5], "TBscore": [0.37, 0.3, 0.24], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["indian"], ["lunch"], ["chicken"]]}
{"id": "uksBL0KIrb0cIs5Bs-wqjA", "text": ["It is difficult for us to pass up on an Indian restaurant with a 4.5 star rating on over a hundred reviews. So even though we weren't  very hungry we...", "My food was definitely 5 stars! And I will be back. I ordered one soft drink, an appetizer, and the chicken tikka masala...my bill was $28 before tipping....", "We finally had a chance to check out this restaurant. Love the fact that they have a lunch buffet 7 days a week for a decent price (weekends are a little..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["indian"], ["chicken"], ["lunch"]]}
{"id": "zDH-RFihca9O8suXJyhaIg", "text": ["Best Indian food in town at the moment. Can't wait to go back. The waitress is excellent, she even remembers the members of your group or family from week...", "Nestled between a Papas Johns and a Five Guys, this unassuming Indian restaurant packs a lot of flavor into their dishes while customizing spice levels for...", "If you are looking for authentic Indian cuisine, this is the place to go. It was delicious. Will come again."], "rating": [5, 4, 5], "TBscore": [0.67, 0.0, 0.75], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["indian"], ["indian"], ["indian"]]}
{"id": "gCFe3sGy82oI1fb7p4ebQQ", "text": ["stopped at King Tut Grille in Georgetown.  Looked at the many varieties available on the menue. It all looked really good. I finally decided on a Falafel...", "This is by far my favorite place to eat in Georgetown currently!  It is so nice to finally have some variety in cuisine around here, and to get a place that...", "A very unexpected, great find! The food was super fresh and delicious. The service was excellent. We will be visiting again and bring our friends."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "XJpRCnJovs11si8WMlYXhg", "text": ["The best Indian Restaurant in Lexington!  We had the Chicken Tikka Masala and the variety plate of Naan. I have been to several Indian restaurants and this...", "My dad eats like he never has had a meal. He is always on some kind of juice diet. So, whenever we go out to eat, and he is with us, we make sure we visit...", "While traveling in the area, we decided to try this restaurant, as Indian food is one of our favorite cuisines. The place is very nice, clean and..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.55], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken", "indian"], [], ["indian"]]}
{"id": "GSIY9b8aJ6Cbh5w0IL1OCA", "text": ["One of the best restaurants in Richmond. The food is consistently good. The wait staff are sometimes a bit slow. This is a great little gem of a restaurant...", "Tried the lunch buffet today and it was satisfying. I absolutely love Indian food, it's in my top 3 favorite ethnic cuisines, so I always have to try it...", "I stopped in here for dinner while driving through the area with a group of friends.  It popped up on our search, and seemed promising, despite the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["indian", "lunch"], ["dinner"]]}
{"id": "qMev1AbpOhhNe9E4S_thlQ", "text": ["The food was fantastic! The Chicken Tika Masala was creamy and hot and perfectly spiced. The garlic naan was fresh, soft and perfectly seasoned. It was my...", "Tandoori Express on Euclid ave. in Lexington has changed from offering separate entree options to a buffet format. For me, that's great news. While I pay a...", "Meh. \n\nWent during dinner, and there was no one else in the restaurant. My bf ordered the buffet food, while I wanted something hot and fresh. Ordered and..."], "rating": [5, 4, 3], "TBscore": [0.26, 0.0, 0.28], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["chicken"], [], ["dinner"]]}
{"id": "zUu-ZKHEjAhV7hIhsB4YYg", "text": ["The best Indian food in Lexington! The portions are huge when you order sit down for dinner and the quality is great. However, the real deal is their lunch...", "I had the lunch buffet. The food quality here is low, and the flavor was off. The basics (dal, saag, etc.) were clumsy...like they were prepared by someone...", "Our food was fine. We had a coupon. We'll probably stick to Tandoor. \n\nWhile we were there, every other party in the restaurant had an issue with their..."], "rating": [5, 1, 3], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["indian", "dinner", "lunch"], ["lunch"], []]}
{"id": "uvWJej_d9jh7a-BPtKNwNA", "text": ["Currently Lexington's best Indian, if you ask me. They've ditched the buffet, and instead cook food to order, and it is just magnificent. Exquisitely...", "This was previously my favorite Indian restaurant in town, but after the lunch I was served today I'm unlikely to return. After ordering Chicken Tikka, I...", "I have ordered delivery from here a few times and enjoyed it, so today when I was downtown and hungry for lunch I stopped in in person. Huge mistake...."], "rating": [5, 2, 2], "TBscore": [0.75, 0.0, 0.23], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["indian"], ["chicken", "indian", "lunch"], ["lunch"]]}
{"id": "vwUbqf4NL4Xv1gUmT-it-A", "text": ["I love the combination of spices at Shalimar. I always get the Chicken Tikka Masala with medium spice when I eat here, so this time I wanted to try...", "It had been a long time since we had eaten Indian food. We went here for the buffet. Like with most good buddies at buffets we ate to the point where we...", "First of all we are Indian cuisine novices, so we don't have anything to compare today's meal. What I can tell you, is between my wife and me, we tried at..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.38, 0.25], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["chicken"], ["indian"], ["indian"]]}
{"id": "3jXtC-ecfJMqX6qTUdgcSw", "text": ["Excellent and authentic Indian food that was well prepared.  We had a variety of foods including appetizer samplers that were vegetarian and chicken that...", "Food-wise this is my most favorite Indian restaurant in Louisville. The food has just the right amount of spice and close to the authentic Indian food you...", "My traveling book club landed at Dakshin this month. Most of us had never been before, but arrived with high expectations, based on the very reliable..."], "rating": [5, 4, 4], "TBscore": [0.3, 0.45, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken", "indian"], ["indian"], []]}
{"id": "GCdKW6xh90F-POxSNmGjuQ", "text": ["Had dinner at Tikka House last night and I can't say enough about this place.  Probably my favorite Indian restaurant in town.  We are regulars there and...", "Sometimes a craving for Indian food hits you while you are home for the holidays! I found Tikka House on Yelp and decided to give the lunch buffet a try. I...", "This was my 2nd time visiting Tikka House, and we were so disappointed with the service, that this becomes our last visit.\nWe specially drove 100 miles one..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["indian", "dinner"], ["indian", "lunch"], []]}
{"id": "XqVGYV-7-uvsBTY0Jy25mQ", "text": ["They have yet to disappoint! This is my 5th time visiting and I am finally writing a review to give this place the 5 stars it deserves. My spouse and I...", "We are privileged to have many Indian restaurants in Louisville - so clearly I must make it my mission to try them all. Bombay Grill was my most recent...", "We have become fans of Indian cuisine. I realize we are a little late to the party, but better late than never. \nThis is our second Indian Buffet in as many..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["indian"], ["indian"]]}
{"id": "OHbeaGF2rm-yZEPN7d7Dgw", "text": ["I've been here countless times with my parents after church.\n\nWe get seated right away and I always like sitting at the booths.\n\nIt's not a huge place as...", "I frequent Clay Oven on my lunch breaks. I prefer the lunch time crowd because I know I can get in and out in under an hour due to them never being overly...", "Pros: \nGood food \nCons: \nNot much food for the amount that you paid\n\nI would go here again next time during their lunch buffet. It seems like you would get..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["lunch"], ["lunch"]]}
{"id": "S5uZoaB9DVqzfCcRWsZMlQ", "text": ["I came here on my last night in town. I am PCSing to Washington and i had this as a groupon for a while. the staff is phenomenal! very friendly and sweet...", "Chicken Afghani - tries this dish here.\n\nMild but tasty ,\nWhite but flavorful,\nAppetizer but goes well with Salad and Naan\n\nTry it sometime", "This is our third stop on our journey into Indian Cuisine. Three weeks, three Indian buffets.\nWhile I found today's buffet acceptable, it just didn't seem..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["chicken"], ["indian"]]}
{"id": "wrl26hQ1V0Ww1elw3SSbOg", "text": ["The food is very good and they are very friendly. It is a new restaurant and they are working out the kinks but don't let that stop you from trying them...", "Red pepper is a wonderful addition to nicholasville.  Their menu has a few surprises as well as the trusted staples of central Ky Indian offerings.  I had...", "Very good!  And helpful on the type of spice you would like.  I have come twice and would return again."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["indian"], []]}
{"id": "PClZAzUQWJEk3Q8femiUrQ", "text": ["I found this place on yelp and it is super close to where we live. As Indian food lovers, we definitely had to try it! \n\nLocated in what my husband and I...", "This review is based on a recent experience thst happened on 8/13/2018\n\nMe and 2 of my friends goay biriyani and chicken 65.\n\nThe chicken used in chicken 65...", "I wish I could give this place 3.5 stars. It isn't really a 3 but not quite a 4. \n\nIn terms of food and service, it is 4 stars. I got the vegetable thupka..."], "rating": [5, 2, 3], "TBscore": [0.0, -0.45, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["indian"], ["chicken"], []]}
{"id": "5js2A19UuUDco3n2hEcxhw", "text": ["I am writing this review after coming here for the third time. This is the best Indian restaurant in entire Kentucky and probably should be the best fusion...", "3/5 Indian Dining Experience. The food tasted good, but came out cold. We had Baba Idli, Mysore Masala Dosa, Chicken Lollipop, MLA Pesarattu Dosa, Mysore...", "This is definitely authentic. In fact, best I've had in Louisville so far. \n\nI had the Vindaloo Sheperd's Pie, really good but also really spicy. \nHad the..."], "rating": [5, 2, 4], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["indian"], ["chicken", "indian"], []]}
{"id": "JrvHDi5saSIyBtqXLrX48g", "text": ["First time here and I must say the menu was confusing but just because I've never experienced this type of food.  I love it!!! It's vegetarian yet hearty....", "Shreeji is a welcome change to the standard Indian fare in Louisville. Sitting in what used to be a frozen yogurt shop, the restaurant is immediately...", "Went their during lunch hours and really enjoyed the food . As per their recommendation, I had samosa chat and it was freshly made deep fried with all the..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.4, 0.27], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["indian"], ["lunch"]]}
{"id": "moaUWKszT1tGwCjfWolHiw", "text": ["Chamling sits in the space previously occupied by the Empress of China, which was, at one time, my favorite Chinese restaurant in Louisville. It's old...", "Five Word Summary: Did I Miss Something, Repeat\n\nI tried going here 2 times before they reopened. The reviews were amazing but I don't get it. the momo as...", "I wanted to come here to try the lunch buffet.  I mean: Nepalese, Chinese and Indian?  That is a mix even I don't know how to choose.  But I came on a wrong..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, -0.27], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["chineese"], [], ["chineese", "indian", "lunch"]]}
{"id": "VIOoZXAvwwSarCKOAIGHtg", "text": ["This is my first time at Archa Nine Thai Kitchen and I have to say it's the best Thai restaurant i've tried in Lexington hands down. As soon as I walked in,...", "We had heard really good things about the place and finally ventured out of downtown to give it a try. The decor is simplistic and clean and tasteful.\nThe...", "If I could, I'd give this place 3.5 stars. Better than average, but not outstanding. I've been to Archa Nine a few times now, and the experience has been..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "sEtHcpd11qq_1Myerfc4Vw", "text": ["Amazing place to go!\n\nI only love their breakfast. Get the crepes. Any kind of crepes. They're all really good.\n\nBut that's it. Just the breakfast is...", "Shakespeare and Co. is a bit of an oddity.  Its a large restaurant decorated with Victorian art murals and serving water in glass goblets.  They serve sweet...", "Had not been in a while and stopped by for lunch. Super bummed to see that they have changed their menu. It seems like they've gotten rid of quite a few..."], "rating": [5, 3, 2], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["breakfast"], [], ["lunch"]]}
{"id": "ChHVSPVUO959jCR3u2hXog", "text": ["I love Queen of Sheba, but do not go often enough. When my daughter comes in town, for a visit, she always requests that we go. We had a late lunch, while...", "I went with co-workers to celebrate the Thanksgiving Break! This place doesn't have a huge choice of beers, but the choices they do have are decent. They...", "Occasion:  Thanksgiving eve dinner with Ben and Allison\n\nI was a little apprehensive about trying this place because we have an Ethiopian restaurant in STL..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["lunch"], [], ["dinner"]]}
{"id": "R-fYzx3NB324p3PqqeFxsA", "text": ["I frequent here way too often, not to leave a review.\n\n\nFood is amazing with generous portions and authentic taste cooked by authentic folks. \n\nService can...", "Simply Thai to put it simply is one of my favorite Thai restaurants. The food is tasty if you eat in, carry out, or the next day for leftovers. \n\nChicken...", "Food is good but the service is HORRIBLY SLOW! Avoid eating in and get your food to go!\n\nOr just go to namnam across the street, where the food is better..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "bmv55Nap6Pihor99nCmNQQ", "text": ["I always love me a good Chinese Buffet. Yoki Buffet is in a great location, right by the movie theater, Main Event and Malibu Jack's, so it's a great place...", "Yoki Buffet was your average american chinese buffet. The hibachi/stirfry/soup station worker was extremely antisocial and very unwelcoming. He gave...", "Listen if I could give Yoki 10 stars I would. This is the second time coming here and they've far above exceeded what I expect from an Asian buffet. My..."], "rating": [4, 3, 5], "TBscore": [0.46, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["chineese"], ["american", "chineese"], []]}
{"id": "60DecJHpA6hZBUXlc51bmw", "text": ["Fat Jimmy's Pizza is that one place you drive past all of the time, just curious of how good it may be, until you finally just say 'heck with it' and try it...", "It's been a while since I reviewed Jimmy's so I thought I would give them an update since things have improved since the last one. The soup tonight was Taco...", "I had been to Fat Jimmy's only once before, but liked it for what it is. I love pizza and cannot be mad at a place that has a fresh and clean buffet. I..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "SqbxaZeZXGZGGqd-AiUxhw", "text": ["Overall I thought this was a great buffet. The place was clean and the selection was big. I was sad that they didn't have honey chicken but otherwise...", "Overview: large variety but bland and unappetizing food. Typical buffet prices, with a mixture of rude and nice staff \n\nThe food was less then usual buffet...", "Horrible Quality Food! Everything Stale & Shriveled at 7:00 PM on regular buffet tables & sushi table.\n\nLook at the attached pictures & decide for yourself...."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, -0.5], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["chicken"], [], ["sushi"]]}
{"id": "MNgA0lDYKGLEeMpSI-2ieA", "text": ["Our little hometown's cafe! Love the variety that it has to offer. Everything from daily specials to ice cream, Poor Man's will not disappoint you! Plus the...", "Poor Man's is a great little restaurant. The food is great and the atmosphere is wonderful. It's family owned and operated. There are one friendly and funny...", "This place has good, homemade food at very fair prices. Everyone was very friendly too. Would definitely recommend."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "bk40Mcd5GArunM2Kxl81jQ", "text": ["Found this bbq joint with a Yelp search. This place is a true small business, hole in the wall restaurant with great food made and served by the owner. My...", "Overpriced, lazy, poor execution. This was a carry-out order to boot.\n\nThe slaw was bad, and he said \"I ran out of dressing when I made it last night.\"\n\n$20...", "Quite place with good food. I will be back. Had the brisket, pulled pork and sausage. All was excellent."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "_Y4fh1oTmo9RrYMV4QFjTg", "text": ["My work recently held an event at their Copper Roux venue. It was a great event- they had projector equipment and a microphone which was convenient for us....", "I attended an opening reception at Cross Gate Gallery for their new art exhibit.  We first eat with our eyes, and I have to say the table set with the food...", "I've been to a lot of weddings over the years and (lets be honest) the food is typically mediocre. I'm a big foodie so I was very particular when it came to..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "kndZQfklYZiYDvbmPjYU-w", "text": ["This location is a little slice of heaven. As we're driving on the property toward the tasting room, we were greeted by a beautiful, friendly dog that led...", "My husband and i go on wine tour rides frequently and decided to stop by this beauty in the hills of Kentucky. I was informed by one of my friends and a...", "We stayed at the owners cottage while visiting the area and YOU WILL LOVE THIS area , the wine, the owner, the accommodations, the weather and the view...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Kijpru-8TOS03LI99CbJ-g", "text": ["Fantastic day of Distillery Tours and tastings with Chuck, our Guide and Don, our driver. \n\nIf you want a fun informative day touring the Bourbon Trail then...", "Great experience! We had Mark, who was an adorable and hilarious tour guide. We signed up for 3 distilleries (Barton's, Lux Row, and Maker's Mark), but we...", "Purely professional and fun all the way through. We rode with Dan as our tour guide and John as the driver. The price is well worth it! Lunch is at a nice..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.34], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "jxKYWfarvHjSUoQHM58UbA", "text": ["Updated Review: 11/8/18\n\nThe quality is back and service was exceptional during our dinner last night at Malone's in Palomar.  My wife and I both had steak...", "Malone's is (for now) certainly the best steakhouse in town.  Plus when you consider the pork chops, chicken, seafood and sushi, there is certainly...", "What can you say it's Malone's!! I had the 16 ounce prime rib with loaded baked potato, and Lexingtonian bottomless salad, it was very good. My wife had the..."], "rating": [5, 4, 4], "TBscore": [0.22, 0.21, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["steak", "dinner"], ["chicken", "sushi"], []]}
{"id": "SqwMIWpraQbwJeJDWpYqIA", "text": ["Fantastic Dining Experience - Flavor Explosions (July 2018)\nWe discovered this gem thanks to Yelp. Suggestions and reviews we read said to call ahead for a...", "Never a bad meal, always consistent, excellent dinner specials & off the menu dishes, such as the tandoori lamb which we ordered today again.  Side of baked...", "Rodney's is an amazing place with an amazing experience!  Beautiful old home built before the White House nestled in the heart of horse country.  \n\nRodney..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["dinner"], []]}
{"id": "cQ0F5tDQ9CZ2XlRdZ--i3w", "text": ["This is basically my all-time favorite steakhouse ever. I've traveled all over the country (and the world) and this is the best filet mignon I've had. I'm...", "Holy freaking cow! \n\nI'm from Nashville and I dined here with a coworker while on business in Lexington. This was incredible. The food was all delicious and...", "Great restaurant... they always try to accommodate you if they can. I tried the Chilean Sea Bass and it was delicious!!! I don't like sweet potatoes but..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "3RSTIoHfKC8CdnZIGoFLMA", "text": ["11/12/2018.  Texas de Brazil at The Summit in South Lexington definitely earned a 5-star rating based on my first visit. \n\nTexas de Brazil is an authentic...", "It was not busy, maybe three or four other tables besides us; yet we only saw our server a few times.  We ran low on water frequently. \n\nThe buffet was a...", "I've been here 3 times this year. The food is fantastic, and the people with the meat on the skewers are totally on the ball. If you're a meat eater and..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "Fn6N4o3PhFobtCuPd2c36Q", "text": ["Delicious. Awesome service, very friendly. Willing to customize and recommended different suggestions. It's rare that a food truck asks me how I want my...", "I believe that this food truck is one of only two eateries in the Greater Cincinnati area to specialize in tri-tip beef - Tafts in OTR being the other -...", "Finally had a day that I could try this food truck!  So glad bc it did not disappoint!  \n\nTri tip is a sirloin steak that is popular on the west coast, if..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.41], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["beef"], ["steak"]]}
{"id": "ifAs3cYdk5-mliddWT-ejg", "text": ["No complaints at all about this place. It had a relaxed atmosphere and pleasant exposed brick interior, with a nice fireplace going in the middle of the...", "40oz porter house for 2 PETER LUGER STYLE?!?!!?\nHere is my question, You ever been to Peter Luger's? This is not Peter Luger style by any means. 1 Peter...", "This is one of the top 5 best restaurants in Lexington. The porterhouse for 2 is great. If you want to go to New Yaaawk and pay $125 for a \"Peter Luger\"..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "GNrGkiGEMPNggy8JupRJng", "text": ["We decided to try this place because of the great reviews as we were traveling and didn't want to eat at another chain restaurant! What a fantastic place to...", "I have been coming here for years. When the kids were little the high point of their visit was the soap dispenser in the rest room. Shaved soap that is...", "This was our second trip to this location and service was pretty consistent. Seemed to not be quite as busy this time around. \n\nWe started out with the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "b7B2yE3Yzdc9vfqgSwvZDQ", "text": ["Absolutely love the bison filet. It's cooked perfectly every single time. The onion rings are perfect and I've honestly never had a bad thing there.\nTry the...", "Don't be fooled by Ted's reply below. Today is 9/1/18 and nobody reached out in 2 weeks despite what he says. Nobody cares at that place. Please read the...", "Good bison burgers. Great jalapeño huckleberry margarita. Prefer brighter lighting though."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.75], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["burger"]]}
{"id": "wNKpb-FUbt-erVYIwCn6aw", "text": ["Came here for our anniversary....we ordered a special for 2..it was a sirlion mash potatoes and asparagus. We each got a plate of the items above along with...", "There were very few people seated in the restaurant when we arrived for our reservation. I was surprised that it took so long to get our drinks from the...", "WOW & WOW! MY NEW \"SPECIAL OCCASION\" DESTINATION!!\nAn amazing dining experience, on every aspect.\n\nMake an easy, scenic 60 minute ride toward Vevay, IN and..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "qrUtdy5XvxYLChqZDzCT-A", "text": ["One tip first. Sat in the bar area to have dinner. The lighting is terrible. It's just a little two dark to read the menu. Saw multiple people using their...", "Went here for dinner because it was next to the hotel.  We each had a steak.  My sirloin was a bit off in taste, didn't really taste like quality beef....", "Going around Georgetown trying different restaurants. Service was great, place was clean, salad bar was fresh. I ordered the filet mingon med well and it..."], "rating": [4, 3, 4], "TBscore": [-0.22, 0.0, 0.37], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["dinner", "bar"], ["steak", "beef", "dinner"], ["bar"]]}
{"id": "6dIFDXY6hJPCgiqDfP4BLg", "text": ["Been a customer for several years, and even tho I'm not a fan of management here..   they have one of the best steaks I've ever had. But! With that being...", "While visiting my hometown of Lexington Kentucky I gave Columbia Steak House a try. \n\nI walked in the place and it was very dark. It smelled like some over...", "Our first stop in Lexington, I was looking for a regional type food or beverage to sample.\n\nDid no one else ever ask \"What are Lamb Fries?\" \n\nI've never..."], "rating": [4, 2, 4], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["steak"], ["steak"], []]}
{"id": "DSGhZ_2J6ThoaZ-KGinStA", "text": ["I had a shrimp fajita quesadilla. Real large portions and very tasty. My friend had chicken fajitas and liked hers as well. The staff was friendly and quick...", "Great food and even better margarita's. Drink specials we're awesome and for as cheap as the drinks were they were not watered down.", "Who goes to a Mexican restaurant and orders a cheeseburger and fries? THIS GIRL!!! On this particular day everyone wanted Mexican for lunch but I wasn't..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["chicken"], [], ["lunch", "mexican", "burger"]]}
{"id": "S0tGQbWBloIsHaFl4gpWzA", "text": ["Always good food at a good price point. The Nighthawk was great as always. And the delivery to your door is great when you are just too tired to go out to eat.", "Absolutley horrible. Without a doubt the worst meal I've had while traveling the past 32 days in Lexington. The steak was tough. The mushrooms had a weird...", "Great steak and salad. Always reliable delivery."], "rating": [5, 1, 5], "TBscore": [0.0, -0.63, 0.8], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["steak"], ["steak"]]}
{"id": "EppZiaJQfTNutht7glYgqw", "text": ["This was for a food delivery to my office.  I will say that I liked the crab rangoon; it was decent.  However,  I ordered the Dragon & Phoenix and instead...", "I enjoy dragons and I definitely enjoy doubling my dragons. This makes me think of the Nintendo game back in the day Double Dragons. However that game was...", "So there are plenty of Double Dragon restaurants strategically stationed in and all around Louisville...but THIS one (#9 in Jtown) is by far the best...."], "rating": [2, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "034u6OSTWzdTDRMHehpWDQ", "text": ["Every time my family comes into town,  this is where they demand to go for dinner... for good reason.  This is the best seafood in town. I have been here...", "A delicious fresh seafood option in downtown Lexington. I had the red snapper entree and mussels as an appetizer.  I ordered linguine with white clam sauce...", "First visit here and I was not disappointed!  The place is very nice, and the ambiance here is very inviting.  We started off with the buffalo shrimp..."], "rating": [5, 5, 5], "TBscore": [0.85, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner"], [], []]}
{"id": "fd_RjjOjzrAlKDzCznhMxw", "text": ["I live in Winchester and this is just a few minutes down the road from my house.  A buddy of mine frequent this watering hole often.  They are a bar/grill...", "I was told that there was a new restaurant, by the river. So, we headed to the river on a Friday night around 6 pm. It wasn't very busy, but we were told...", "We came upon this bar and grill on our way back from our ride. The food was ok, but the service was slow. Our server seemed overwhelmed even though there..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], ["bar"]]}
{"id": "g1VRhyHq7f_W4-0uj-l8pA", "text": ["We had dinner at Longhorns Steakhouse on Harrodsburg Road to celebrate my daughters 7th birthday--she passed in 2014 but we celebrate every year. We didn't...", "A very good quality steak in Lexington for the price. Love the sirloin, loaded potato and steamed broccoli. Highly recommend it!!  I wish Hamburg area had...", "Long horn is a chain of restaurants, which usually means the food quality is sub par but I am pleased to report that the steak here was cooked to a perfect..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.55, 0.3], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner"], ["steak"], ["steak"]]}
{"id": "2G3Fjg2BCq0w9Iqf_al0Gg", "text": ["We enjoy this little restaurant...... Go there often and it's always good. Food on the buffet is usually changed out often. They have a large salad bar with...", "I haven't eaten at Ponderosa in twenty years and did not remember it being all that remarkable. Looking through the Louisville pickings for delivery food I...", "Large selection on buffet, never need to order of menu, lots to eat on buffet.   Ordered a steak, way over cooked.  Food is average.\n."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["bar"], [], ["steak"]]}
{"id": "nWaNSXGjWHmDwoEIeDcVHA", "text": ["The food is ok but what really stands out are the lemonades. I discovered Chicago Steak and Lemonade when I worked downtown. I had honestly forgot that...", "This place reminds of a place back home in Waukegan, Illinois call J&Js chicken and fish\n Love the lemon pepper chicken and the gizzards were bomb!...", "One of my favorite places to eat.. Best lemon pepper chicken in town. I usually order the 6 piece wing dinner extra lemon pepper.. and never disappointed...."], "rating": [4, 4, 5], "TBscore": [0.43, -0.21, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["steak"], ["chicken"], ["chicken", "dinner", "wings"]]}
{"id": "4BVsfu4kfOmqY5_1s0qNkw", "text": ["I love Saul Good! A great place. This location is conveniently located with lots of parking options. Top notch staff makes it an even better dining experience.", "First time at Saul Good. I have heard good things about this restaurant, so I decided to try it. I ordered the southwestern dip. Very disappointing. I...", "I had dinner at Saul Good on St. Patrick's day downtown. Arrived at just the right time before the dinner rush. Service was good and we were seated..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.56], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["dinner"]]}
{"id": "gTu4KAzxKZvI3t-mxEbVXA", "text": ["The food was good and the service was adequate, weekend night and she was busy.  My reason for the low rating is that I tried to pay with a gift card and...", "34/100 : 2018 Yelp Review Challenge\n\nIve been to Aspen Creek Grill a total of three times in my life.\n\n1st time - I really don't remember anything about my...", "Dream Girl and I took her son, his wife, and two young teen-aged boys here for dinner and were pleased. It was a lovely evening and perfect for the patio..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.53], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], ["dinner"]]}
{"id": "TvK-CBcO9edJrbozxBHBGw", "text": ["Amazing food and service. Went in at 6pm in a Saturday night and had no wait at all. Jenn was an amazing waiter and the food came super quick. Ordered the...", "While the food at this location is spectacular, you cant see it. Unless you are directly underneath a light, it might as well be pitch black. When we asked...", "It was a typical Longhorn experience, which I have found to be consistently good. I think Longhorn is a decent steak chain that's a bit of a step above the..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], ["steak"]]}
{"id": "AAbiz3WswDRPTIzgQQR6_w", "text": ["It was just okay for me.  I got the lettuce wraps and it came out looking like ground beef with a few pieces of iceberg lettuce next to it.  Nothing like...", "Carryout. Obviously they don't own a Rice Steamer/cooker, it stuck together couldn't pry it apart, took the shape of the box after shaking it out onto...", "Decent for take out. Fast! and well priced. food isn't too spectacular, but we like it."], "rating": [3, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [["beef"], [], []]}
