{"id": "BV1wTjWCSkTVkjPrQiZsPg", "text": ["11/2018\n\nI enjoyed my first visit to the new Sandwich whose menu showcases their in-house prepared meats & includes the popular Farm Show milkshakes....", "I've had the horseradish roast beef and the brisket cheesesteak.  The roast beef was served cold which surprised me but the sandwich was otherwise as...", "I have been driving by this place for months teased by its SANDWICH sign and it is finally open. \nBrought to you by the owners of Pizza Grille (which means..."], "rating": [5, 3, 4], "TBscore": [0.37, -0.25, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["milk shake", "sandwich"], ["beef", "sandwich"], ["pizza", "sandwich"]]}
{"id": "5aCyLlER1y3S7smn1Y7f_Q", "text": ["DELICIOUS! Can't believe I drove past this place for years without stopping.. so glad I finally did! My new go-to lunch spot! Tasty hoagie, very friendly...", "Verdict: That's a darn good Hummelstown hoagie. \n\nThe Philly influence isn't lost on this Hummelstown hoagie shop. They get the rolls and pretzels from the...", "I was in town for a convention and was looking for a place that makes a great hoagie and I found it!  This place is in my all time top 3 places for hoagies..."], "rating": [5, 5, 5], "TBscore": [0.32, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], [], []]}
{"id": "LMdv652LAxy8z_enpD9r6A", "text": ["Mother's subs are the best subs around.  The bread is fantastic and all fresh meats and veggies.  These are even better than Penn Station in Philadelphia....", "Let me start by confirming what others have stated. Do not let the exterior of the building fool you or scare you away! It's inside an old filling station....", "These hoagies are very decent. I have no complaints and, for once, no suggestions for improvement. \n\nI will definately be back!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "-8TGg04bnItaksosshaqXA", "text": ["We stopped in for lunch but we're not disappointed.  Very authentic German deli.  We had Nuremberg sausages ,liverwurst ,potato salad and thomys mustard.", "A perfect taste of old southern Germany, nestled just off the highway outside of Harrisburg. Note that it is a superior deli, but not a superior sandwich...", "Fantastic deli!  Delicious meats,  cheeses and bread.   German potato salad,  spices and chocolates.   We even were able to get some authentic apple..."], "rating": [5, 4, 5], "TBscore": [0.34, 0.24, 0.5], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["deli", "lunch"], ["deli", "sandwich"], ["deli"]]}
{"id": "WU9STutipgl-S0Ph3LCyrg", "text": ["I can only assume this Jo Jos Pizza is part of the ownership tied to the one in Hummelstown. However, based on the difference in quality I hope it isn't!...", "Pizza was delicious! Hoagies are on Philly style rolls. \n\nMy wings had barely any sauce on them (ordered them hot). Didn't wind up finishing them. \n\nLooking...", "A new location of JoJo's Pizzeria that is related to the other JoJo's in the area. Located in the Giant parking lot, this storefront has struggled to hold a..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["pizza"], ["wings", "pizza"], []]}
{"id": "o7IeLaVF5uAN7XxK0rjrtA", "text": ["Average BK.\n\nFairly clean ... staff are mostly polite which is really all I care about when stopping for a soda.  Some are disinterested and it shows....", "2 stars because the dining area was reasonably clean and the staff was passable in friendliness.... they ask for your name ( like Arby's) when your order is...", "We stopped by after a long day of traveling to this area. The value menu has plenty of choices. We didn't go for big meals and ordered two 2-cheese-burgers..."], "rating": [3, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "WBOcVLyru0aKEPpVxy4ZiQ", "text": ["Screw this place. Please believe all the reviews, as I did not and now I have a cold pizza, 1.45hrs after I ordered it. I ordered online and was told the...", "THIS PLACE HERE! SMH\nThis establishment is located Uptown Harrisburg (which is in the Hood)! For an establishment that is located in a predominantly African...", "Do not use this establishment. They don't update their web page at all. Caused me to place an online order at a store location they no longer associate with..."], "rating": [1, 1, 1], "TBscore": [-0.6, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["pizza"], [], []]}
{"id": "DAh4SG8szcY3kf3KYMIEIA", "text": ["Went to grab a quick bite at the Broad Street Market today, and we decided to check out the cheesesteaks and burgers at The Cheesesteak Guy. The menu keeps...", "Great new addition to the Broad Street Market. Fresh hoagies are brought in daily from Philly so you know they know what they're doing. I had a traditional...", "Just because 0 is not possible. Paid for cheese steak with onions and fries. I was number 11, after he served 12 and 13 I asked about my order, and was told..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["burger"], [], ["steak"]]}
{"id": "Vfox3NKcNN7uSZ7aRbbgZw", "text": ["Giving for stars cause I m willing to try to support the smaller business.\n\nThe place is neat but would need more TLC when it comes to the interior. Plain...", "There is no business sense happening here. My parents and I came here around 10:40 am on a Sunday. We were told that there was a 10-minute wait but that...", "Wife and I headed out, after running some errands,  looking for some diner breakfast food and I recalled seeing this place was opening soon so swung by with..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], ["breakfast"]]}
{"id": "C46918gaxiaajoN_a4lDZA", "text": ["Great stop for breakfast for us! \nWe had left a street fair in nearby New Cumberland and had been referred to Summit by a family member so we stopped in....", "Came here to meet a high school friend and her family who I hadn't seen in 12 years.  She works across the street, was a frequently customer of Summit...", "Yum yum yum ! \n\nGreat diner food served in a clean environment by a polite kind waitress.\n5 stars from me. \n\nRecently on a quest to try many different..."], "rating": [5, 4, 5], "TBscore": [0.46, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["breakfast"], [], []]}
{"id": "5ZvjnZo8Xly9d1_OwUASCw", "text": ["Perfect Fries!\nThe Potato Coop set up at my work for a \"kick-off\" to summer event for all the staff.  This was a nice sunny day, which was perfect to be...", "My first expierence about a year ago was amazing. The buff chicken friend and hot dog was great. And the staff was super friendly. \nThe last 2 times, not so...", "Dont bother with this food truck. My first time there I noticed I was overcharged for food,  (prices are different on website) person working behind the..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], ["chicken"], []]}
{"id": "FIdYpj1LkJJBiKma3iqXVg", "text": ["I've always had polite fast service here.\n\nThe location is hard to get in and out of but I choose this place at off times when I want a quick bite....", "I think the collective IQ of everyone who works here is 7.  The SLOWEST fast food in the world and there's a 98% chance part of your order will be wrong....", "I would give zero stars is possible.  Honestly this review is for multiple locations, this just happened to be the most recent with the same issue.  This is..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "KwPohw2G9wssSgzDFI2Zmg", "text": ["It's \"McTOBERFEST!\" for the Monster Hunting Yelper featuring quick reviews of all the area McDs we've been forced to enjoy.\n\nThis is a great location.  I...", "Why the reviews so bad? Stayed at a local hotel and at 11pm on a Sunday, options were dire. Ordered 2 Fish-fila meals and had to wait a couple minutes for...", "McDonald's corporate office replied to me and said they forwarded the information on the the exact location and they will reach out - still NEVER heard from..."], "rating": [2, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "e1OzReTB3wp7-TU6y-47iQ", "text": ["AWFUL customer service. Do yourself a favor and avoid!!!! We placed an order for delivery, received a phone call an hour later and stated that they couldn't...", "Ordered pizza and 2 liter bottle of soda. Was charged for soda but they didn't deliver it. Called manager and they said they would be over with my soda. 3...", "Just ordered take out pizza from this location. My husband picked up but once he got home, he realized the order wasn't right. I called the location..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "t8x6SZFNEHvKzXAqGPaMEw", "text": ["I like this place but everyone (kids) loiters out front & the Cashiers get thrown off if the bill is $11.00 & you hand them $21.00???!  They can not make...", "The worst Dairy Queen I've ever been to (and that's saying a lot).  Located at the end of a rundown strip mall--ok, whatever, we'll go to the drive-thru....", "Clean establishment and great service. Always has the newest limited time menu items."], "rating": [2, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "EQlbB0-qInhRcmS-jWg3Gg", "text": ["One word: DELICIOUS!\n\nThis place is very casual. I love it. I'm not a huge sports fan but it's cool because there's about 2 million TV's inside. Completely...", "I've been contemplating this review for several years. In fact, from the time we ate at this location not long after it opened until this every minute, I've...", "We had a craving for wings one night and decided to visit Buffalo Wild Wings. During this visit, we got the Dessert Heat and Thai Curry wings. When we..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], ["wings"]]}
{"id": "E4GvVVcbv6L0Hu6xewMzHw", "text": ["Years ago, I stumbled upon the original QSL while working in Sharon, PA.  They had a lunch buffet that was a great deal. (Interestingly, Sharon had one of...", "Not a very good experience tonight. The place was not very busy, but still 40 minutes to get 3 burgers. And the one they said they were waiting on to be...", "Stopped in on a bike night to eat.  Food was okay, our waitress was nice.  In my opinion the prices were pretty high for what we ordered.  Nothing..."], "rating": [4, 1, 3], "TBscore": [0.56, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["lunch"], ["burger"], []]}
{"id": "1CbvOkKn3j7IlCRdRIB_xw", "text": ["GREAT Visit yesterday! I waited until this morning to review to be sure we had no allergic reaction show..we are all GREAT! We had a yummy gluten free pizza...", "They were very rude when we called. I wouldn't recommend this place to anybody. Think twice before getting anything from here!", "Tried this place again with delivery.  Took 70 mins.  And the pizza wasn't warm so we had to reheat it in the oven.  The garlic and sauce and spicy sausage..."], "rating": [5, 1, 3], "TBscore": [0.72, 0.0, 0.6], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["gluten", "pizza"], [], ["pizza"]]}
{"id": "b4qaFj0tkDk3hP0fO5dmtw", "text": ["Go there all the time, have ordered half the menu by now. Nearly everything is amazing.", "Stumbled onto Nick's 114 Cafe while looking for a different place to eat lunch on Sunday afternoon. And so happy we did!  Large open dining area with a...", "If it is your first time here, get a crab cake! Even if it is just as an appetizer and split with people,, you have to try it! Amazing!  This place is nice..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.3, 0.58], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["lunch"], ["cake"]]}
{"id": "EuVcMQ5XLvlxcYmD5UjU7g", "text": ["I had an extra crispy breast. Simply put this is not good chicken. It's VERY peppery and didn't have a good taste at all. The mashed potatoes were alright...", "This is a small kfc,in a big area with a lot of traffic,as Hershey park is down the road and a number of hotels. Compared to other kfc's in the area it is...", "If you are looking for chicken you found the right god damn spot, this is the best chicken I've ever had in my entire life. I only found one 1 hair in my..."], "rating": [2, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, -0.6], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "f0fJNaKjZTQC-xAsSGvU7g", "text": ["I don't know why the rating is so low at this location. Whether it be 6 days, 6 weeks, or 6 months between visits, I always get excellent service. There may...", "Very fast service n nice employees. Not many kfcs left so it's a pleasant surprise. Their pot pie is so good", "Tonight .I drove thu the drive tru.ive been going here for 11 years,they used to have a sign ,stating if we fail to provide a receipt your meal is free,that..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "yC-iPLvJyDPI23K3cxYH5A", "text": ["Stopped in and got the $20 bucket.  It has been forever since I have had KFC and it was good.  \n\nThe order taker let me know this was the better deal and it...", "First time at this KFC and my last. The most positive comment would be my order was correct. I ordered the $20 fill up to-go, which included 8pc bucket of...", "We've done the take out thing here a few times. Is it my imagination or does it seem like one has to take out a loan to eat here? The food seems really over..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "c3tdtc-LE1x3arqxjqcLxw", "text": ["The best Jamaica food I've tasted at a restaurant. The portion sizes are good and the prices are reasonable. I'm so in love with their cabbage and pasta...", "Grabbed some lunch today from this spot called Capow for the first time. They are located on Market St in Harrisburg. There is no off street parking but...", "Amazing Jamaican fare! The spices and sauces are authentic and not catered to the typical American palate. I loved the jerk chicken--the meat was perfectly..."], "rating": [5, 3, 4], "TBscore": [0.6, 0.25, 0.46], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["pasta"], ["lunch"], ["american"]]}
{"id": "8irb-B2ydac9MTJpqSbPzQ", "text": ["Super amazing gyro & for a very nominal price.\nMake a point to pick one from here, whenever I'm at Harrisburg University!", "This food truck is located on Market Street outside Harrisburg University, near the south entrance of Strawberry Square.  I would have given it 5 stars if...", "Triple threat combination of great flavor, service, and price! I recommend the chicken over rice, or the Philly cheesesteak. Everything on the menu is great..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "310EONtHjuQXb24A9-utAA", "text": ["Great jerk chicken and other Jamaican goodies like cabbage and calaloo.\nNice family run place (counter) with seating in Broad Street Market.\nGreat prices...", "I first started eating Jamaican food down in the D.C. area at a small restaurant in the city run by a woman who referred to herself as everyone's Jamaican...", "I had a friend get me a beef patty from this place and I fell in love! The meat is flavorful and spicy and the crust is flaky and crisp. I decided to make a..."], "rating": [5, 4, 4], "TBscore": [0.26, 0.0, 0.44], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken"], [], ["beef"]]}
{"id": "apm388LLyRhHEjbTSlKiwQ", "text": ["This is becoming my favorite lunch truck. It's located at the corner of 2nd Street and Pine Street, right outside of Santander Bank. I've only tried their...", "This is hands down the best food in Harrisburg. My husband and I make sure to try and come at least once a week. The chicken with rice cannot be beat. The...", "I usually passed this up as an option for many months.  One day faced w time issues I decide to give it a try.  Street vendors always concerned me as to..."], "rating": [5, 5, 5], "TBscore": [0.21, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], ["chicken"], []]}
{"id": "52QD79Gaayelduppghso6w", "text": ["I enjoyed the pounded yam and egusi soup. Very friendly atmosphere and staff. Best authentic West African food in Harrisburg. Lots of variety and choices.", "Love this place.. jollof rice is very tasty, pair that with any stew and you're good.. the best part is the chili oil! Better than srirachaor sate.. good...", "Tried the okra soup with chicken and cassava flour - super tasty indeed! The chicken is baked perfectly and is slightly sweet (super mild! super good!) and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.28], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "MDrKyaaJH0E1_id9iIA8LA", "text": ["What a pleasant surprise! Fresh sushi served with a smile in a mall no less! You sir st the bar and actually don't even realize the ugly surrounds exist as...", "For sushi in a mall this is pretty good.  The place is a small kiosk type place but there is seating at their sushi \"bar\" right there.  You can get sushi...", "Sushi in a mall!  Yes, this kiosk has existed for couple of years now.  I never tried in before, because somehow I was not convinced about how it would be...."], "rating": [5, 4, 4], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["sushi", "bar"], ["sushi", "bar"], ["sushi"]]}
{"id": "Ah0SVj7r2UZ2p52sF1bd-g", "text": ["Definitely better than Union Deposit or Kline Villages Giants. Clean and nice variety of items I was looking for.", "This is a review of the MTO breakfast sandwich at Giant only. The eggs are MTO and taste great. Meat choices are bacon or sausage and you can add cheese if...", "I always go here to get my groceries because it's near where i live. They have mostly everything, and once in a while, you will find good deals."], "rating": [4, 3, 3], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["breakfast", "egg", "sandwich"], []]}
{"id": "F9jEjwW_TCgPeNdgi3r4yA", "text": ["We have been coming here for years and I'm pretty sure it's because the food is great! But the service is just fabulous and I do mean fabulous!!! Today our...", "We arrived about 430 pm and were seated straight away.  Our drink order was placed and our waitress was pleasant.  The all you can eat shrimp was featured....", "The glory days are over for Red Lobster. Had the Admiral's Feast-just ok. Portions continue to get smaller and the clam strips were same as Mrs. Paul's. The..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "R075jp4Iys5qvqhcjfqgzg", "text": ["I stopped in for lunch with my family and noticed that they did not have a lunch menu but just their regular menu. I really didn't want to eat a full dinner...", "\"Embarrassed On My First Date\"\n\nOne manager made the evening extremely embarrassing. We ordered a medium rare steak.\n\nIt came out blue. My date and I both...", "Always always a pleasure to dine here, had the shrimp and scallops, yummy, Brandon took care of us at the bar, great service"], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.8], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["dinner", "lunch"], [], ["bar"]]}
{"id": "y11i1cUuztxcaVNcfhpBrg", "text": ["Giant or Stop&Shop? \nUpon entering this place, I was extremely confused because EVERYTHING about it was the same as my favorite and local supermarket in my...", "I was so excited for this new Giant to emerge and now after shopping here a bit I can give it a solid review.  The Entry is a little congested.  I miss the...", "I can get lacinato kale turmeric ginger pineapple celery and English cucumbers here to make kale shakes...oh and can't forget elephant garlic, right August?"], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "G18yTuoTFl28Tb3MJdfHCQ", "text": ["Went to the Cafe for lunch. The food was awesome with an amazing selection. \n\nStopped at the beer section before going home and was also impressed with the...", "I. Love. Wegmans. My boyfriend makes fun of me because he grew up around a Weg and so he's used to how amazing it is. I did not and was so thrilled that we...", "In town for a few days and needed some items. Wegmans had most of what I needed.\n\nEasy checkout.\n\nParking is easy."], "rating": [5, 5, 4], "TBscore": [0.87, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["lunch"], [], []]}
{"id": "w2qbjTtpxmoVXVJZrtfNhQ", "text": ["This is by far the best Giant location for selections. \nI have shopped at multiple Giant locations over the years depend on which was most convenient to my...", "This Giant is one of my favorite ones.  They have a nice cafe area with plenty of hot and cold foods and a self serve soda fountain so that you can grab...", "Like this branch the most - has a vast selection of products but at the same time is not as big as some of the other chains. Has a café, sit down area and..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "RYXK3skw8YgNV6PGqiiCjA", "text": ["Don't let the building facade fool you; inside is very roomy with a well laid out communal feel. Long high top tables spread out amongst a long row of six...", "05/2018\n\nEver Grain on the Pike in Camp Hill is a terrific addition to the West Shore for gathering & unwinding. \n\nThe brewery has an industrial feel with a...", "Oho I am in love with this place this is my first time here and the ambience is so so cool and they have lot of games like zynga , ping pong table etc\nThey..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "yFwv1Npz43eDNis0FHrgOQ", "text": ["Loved the fresh smoothie made from real ingredients. The smoothie was the blend of the freshest fruits. Me and my friend ordered a Chia Banana smoothie, and...", "I stopped by after an emotional early morning doctor appointment and the girls were AMAZING. They recommended what they had a special on that day and helped...", "Had the super green salad. Chicken was excellent. It claims to have romaine, kale, and spinach. Mine did not have kale nor spinach."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], ["chicken"]]}
{"id": "p24_uKUGir91j4bJs1HZSA", "text": ["Obviously this is not fine dinning but I have to give this place five stars. Mostly because I go here a lot and it is faster, cheaper, and cleaner than most...", "I'm not religious to subway, but this is the one I go to in town and I've never had a bad experience. Even when there's a line they're pretty quick. They're...", "Fail on my salad today. Ordered a Sriracha Chicken Melt Salad. Chicken tastes like it came out of a can. The wrong kind of cheese was used. The cheese..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, -0.32], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], ["chicken"]]}
{"id": "XA_MTt-GL6nxpuYGM3GcSw", "text": ["The evening shift guy, Cesar is very friendly, he is always smiling and asking how he can help us. Their subs are decent, i like teriyaki chicken, with a...", "No 5$ foot longs :/ not as many ingredients as other locations... mediocre service. I don't understand how they are still in business. My normal order was 2...", "Stop. Ask yourself a question: why are you here right now? Do yourself a favor - get in your car, drive about five minutes down 22, and eat at The Sandwich..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chicken"], [], ["sandwich"]]}
{"id": "TOJcfgQaXO0AkEjiCAFsrw", "text": ["Location saves this store, as the staff is wordless.... no hello- nothing unless you speak first.....I feel that they are doing me a favor by allowing me...", "I just don't understand why the people working here constantly turn me away because they don't trust my out of state liscense. Honestly it's just a waste of...", "Thank you Turkey Hill for having well lit gas pumps, a decent gum selection and cigarettes...\n\nFor, when I am going downtown to exercise my liver - these..."], "rating": [1, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], [], ["turkey"]]}
{"id": "ActejZfEUA7xBp-qhlFwAw", "text": ["Great diner food!  Coffee is always great and hot!  Good breakfast served hot and cooked to order!  Always consistent!  \nCrab cakes were pretty good too....", "Stopped here for lunch with my hubs looking for a sandwich.  I ordered a pastrami sandwich that was listed as a special.  It was literally rye bread with...", "Great breakfast foods for cheap! My go to is the \"Front Street Special\" which consists of two eggs, two pieces of bacon, and two pancakes for under 10$ Only..."], "rating": [5, 3, 3], "TBscore": [0.55, 0.36, 0.41], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["breakfast", "cake"], ["lunch", "sandwich"], ["breakfast", "egg"]]}
{"id": "Mc8Zt6A01Bi2SHgR1xd8PA", "text": ["In full disclosure, I didn't have anything to eat here, but only because I was short on time. \nAttended mid afternoon on a Saturday in Late June, almost 95...", "We were in town for a hockey tournament. As our team had a dinner scheduled here for Saturday, we stopped here to eat Friday night when we got into town, to...", "This place is amazing. Came here for a quick drink with some friends after a night of a canceled flight and the experience was great. Outside it kind of..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["dinner"], []]}
{"id": "R2YwKU4b8ZMfeRJiZ_t2zw", "text": ["Awesome food, quick and friendly service! \nCute and quaint place. French style omelettes, homemade home fries, and the best bacon in town. You must try...", "As I was parking in the parking lot of Marie's Cafe another couple that was heading in said \"You Gotta Try The French Toast!!!\"  Once we heard that we knew...", "What a great breakfast find!  It's a tiny little place located at the end of a little strip mall. Hubby and I sat at the counter and were promptly greeted..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "t1HfKKUmUqe3gBv68_SLRQ", "text": ["This is me and my husbands go to spot for breakfast and something quick to eat! We love it here! It is nice and cozy the staff is super friendly and we...", "Kids had chicken fingers and fries which were good.  Everything the adults had was swimming in really thick unappealing gravy.   If you eat here, don't...", "I hadn't been here in a couple of years. It was crowded (noon-ish on a Sunday), but I was seated right away. Service was friendly, quick, and they checked..."], "rating": [5, 2, 5], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["breakfast"], ["chicken"], []]}
{"id": "X2WTRrAbp4M45iLQo9oRcA", "text": ["Gave it a 2 because the staff is super nice but the food is terrible. Ordered the chicken alfredo & it was so watered down & bland..... the salad & rolls...", "Terrible food. The bar didn't have a wine bottle opener. Cheese steak was on hard bread and tasted terrible. I would expect that from a hotel I. Ohio, but...", "We have been to seasons twice on Saturday night for their prime rib and seafood buffet. The staff is always every friendly. The food on the upscale buffet..."], "rating": [2, 1, 4], "TBscore": [0.0, -0.76, 0.0], "normalisedRating": [-0.2, -0.6, 0.6], "keywords": [["chicken"], ["steak", "bar"], []]}
{"id": "PZKku3NCsLOf-hKYtIDVFw", "text": ["Had the turkey wrap.  Lettuce was a tiny funky but the wrap itself tasted bland and the wrapping taste wasn't that good\n\nOtherwise haven't had a bad...", "I am going to boost my review up to a 4!  The past couple times I have been here I have really enjoyed it.  The service is friendly and they always make you...", "Excellent service and good menu options. Food was good and delivered in a timely manner.\nWe will definitely be visiting again!"], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["turkey"], [], []]}
{"id": "mmj52MvJuf2O_pKJpUMMwQ", "text": ["I guess it doesn't really matter to most whether they have a frozen custard place near there house, and I do have one so this would be a typical and...", "I'm downgrading my review as the last 3 times I was here the custard was melted and had large ice chunks in it and tasted off. Definitely not the smooth...", "Having a sleeping baby in the back and wanting to get my ice cream fix--- this was a godsend. A DRIVE THRU ICE CREAM PLACE??? Sign me up! I was able to pull..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "OuK0lRMwgr_lYQvS9_EwdQ", "text": ["Great ice cream but it often smells like an open sewer out back where the grassy eating area is, so that is pretty much a mood killer. They've cut off the...", "Surprisingly good ice cream.\nCones are fresh. I cut the small size waffle and it was perfect. \nI ate the whole thing. Got the ice cream peanut butter and...", "I called to see if they had Birthday Cake ice cream before we went because we live 30 minutes away. The guy that answered said yes! My son and I got there..."], "rating": [1, 4, 1], "TBscore": [0.0, 0.39, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], ["waffle"], ["cake"]]}
{"id": "esZkFQp6Udvp0rElk7wPqw", "text": ["King Kone is a great little ice cream spot right on 39 on your way to the attractions in Hershey.  They have seating inside and outside and have a cute...", "I stopped in this week for an ice cream cone since the temps were well into the 90's.  \n\nI told the young lady I would like a chocolate dipped waffle cone...", "Good selection of decent ice cream. Many sundaes available, as well as some grill-type good. Nice shaded places to sit outside on a hot day, or inside air..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], ["waffle"], []]}
{"id": "Yhaby5hMywk8yQPz4ctQeQ", "text": ["(3.75) ~ Good Overall Food & Service.  Need to try the Breakfast sandwiches next time...\n\nOUR MENU:\n** Ultimate Banana Milkshake = (4) very good...the...", "I stopped at steak shake at a service plaza in between Virginia and Pennsylvania. I find the eating establishments in service areas to be hit or miss. Steak...", "Wow. Pretty nasty attitude from Carlise or whatever her name is. She was too busy talking to her friends and playing around in the back than serving the..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["breakfast", "milk shake", "sandwich"], ["steak"], []]}
{"id": "oeS2M2rLYqcES2pk1YAkqQ", "text": ["I have been going here for almost 11 years and it is always something I look forward to coming home from college. My favorite is the \"Berry Furious\" but all...", "When I was in college in Mechanicsburg, I visited Juice and Java regularly with one of my close friends. It became a staple of my time living in Central...", "I used to live in camp hill so I've come here for years. The establishment is simply going downhill. \n\nOrdered quiche, Fresh Cut Fruit Salad, buffalo..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "i5BdXDhpZrDUEhS0cgn5KA", "text": ["I commute from the great white north to south of the Mason-Dixon so this is a weekly stop along that route. Let's set the stage--it's an honest-to-goodness...", "Really wanted to give this place a chance, considering it's an authentic highway diner from another era. Unfortunately it's a top contender for \"kitchen...", "Sat down at the counter and we were immediately greeted and served. Angie and Ashley tag teamed service to perfection. Our two meals were as ordered and..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "T9SWc8z_Coq1-H8LXIKQZQ", "text": ["Typical diner fare that is unimpressive.\nThey definitely need an update. The seating in the booths has broken springs that don't make for a comfortable...", "Nothing fancy but the service is always solid and they deliver hearty breakfast staples better than most diners... Plus the prices are ridiculously low", "Food is solidly mediocre here. Absolutely average. No bells, no whistles. There is nothing more or less to the food that they serve here. Essentially..."], "rating": [2, 4, 3], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [-0.2, 0.6, 0.2], "keywords": [[], ["breakfast"], []]}
{"id": "uICDLi_pyzxp8i7EmPpiAA", "text": ["Maple Donuts is, and always has been, a great York County institution.  This location, like all the others, is fast, friendly, and has the best donuts on...", "These are the best donuts in central Pa. Area.  Quality ingredients and a great selection.  We want one in Camp Hill!", "Stopping on our way home, needed coffee, tea and donuts. Rather than go to a chain we chose Maple.  It was late afternoon, and while they don't make the..."], "rating": [5, 5, 4], "TBscore": [0.59, 0.67, -0.3], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "k_-HSG2v-d9Yd-r1hXCveA", "text": ["Wiw! Fast friendly service from both ladies this morning! Keep smiling and having a good time while working!", "I'm a fan ... but PLEASE bring back the fruited iced teas from last year!  I asked the location on Progress Avenue and they said maybe they'll come back in...", "I've been to this place many times through out the years. Since Starbucks has left downtown, I go here for a quick cup of iced coffee. \n\nThe manager allowed..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "J3ZpWaMvVOUc8r2rRxn1-w", "text": ["I just moved to the area and was searching for a good farmers market nearby to get my meats and veggies. This farmers market has that and much much more !...", "It was just....ok.  I'm a Broad Street Market frequenter so I thought I'd check this place out (this was my first time here).  I thought it was a bunch of...", "I love this place. If I'm ever in the area again, I'm going to be sure to stop here for food items. There are some Amish people working here (there are..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "uNIx2YnUG1E5gkcx_StDOQ", "text": ["This is the only coffee place that is very near to my office, I visit this place regularly, these guys are sometimes very quick in taking the order but some...", "Came in for cup of coffee. About 5-6 costumers ahead plus what was inline with the the drive thru. These guys were on the ball, they got through everyone in...", "I see a lot of negative reviews for this place but in my opinion, I had a good experience today. I walked in since the drive thru looked line looked long..."], "rating": [3, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "Bv7xcrvGc7b24Tb9GA9r3w", "text": ["Great kid activity.  Kind of ironic to come here all the way from CA to pick berries but when summer vacation found us in PA, we looked for a place where...", "Came from Lancaster to meet with friends to pick pumpkins. Got there at 3:00ish and asked where to go to pick pumpkins and/or apples, was told that an...", "Very friendly family run orchard.  The market has lots of selection, even in the winter.  There is a CSA program so your family can have a variety of..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "P-YMqbtdXQylACXzw7PaZA", "text": ["I agree this is the best DD in the area. I live two doors down from another DD but leave the house extra early just to take the trip to this one on UD....", "Who is the manager of this location? What's the point of having mobile ordering if you still have to wait in a long drive thru line because the doors are...", "First issue was there were hand written signs saying they were under staffed and only drive thru was open.  There was definitely someone laying down in the..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "UVNjeLI5-WaNnTiKRK4GGQ", "text": ["i love the selection at this store.  the breads that we eat are so much more affordable here.  the bread i get is under $2; my god-daughter's brand is $3....", "This place is wonderful and cheap! Its a mom and pop store that sells cheap stroehmann and Arnold's breads, chips, entenmanns, milk, meats and a whole bunch...", "Great great prices on name brands!!  Thomas & Sara Lee bagels $1.50 a bag, woo hoo!  Lots of other foods and sundries squeezed into a little store.  But do..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "qs--OlZLRjMkqq63yMPW3g", "text": ["Went to Dunkin' Donuts for my very favorite coffee this morning while I was in there I met a lovely man why we were drinking coffee and sharing some donuts...", "Welp, tried giving this place another shot which was a mistake. 1 cream... 1 splenda here must equal a full cup of cream a drip of coffee and a leftover...", "This local Dunkin' Donuts has done a MAJOR turnaround, FOR THE BETTER! I live nearby - it's my closest Dunkin' - but I totally stopped going there last year..."], "rating": [5, 1, 5], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["donut"], [], ["donut"]]}
{"id": "HlQ25XG4jwvZCgOJ4QMgIw", "text": ["This place is the perfect place for mobile ordering. Their lobby is a little small so you might have to wait in between their double doors when it gets...", "I go out of my way to come to this DD. My order is always right. My food is always hot and my coffee is typically always correct. The parking lot is hard to...", "My experience at this location was very disappointing.  The employee (slim, short with a mustache) was extremely rude to us exhibiting negative attitude and..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "s5Nl9tmAkUh_NbxyRfH-6w", "text": ["After a nice trip to Hershey, I decided to stop off at Speedway to get some gas and snacks before getting on the Turnpike. \n\nFirst, getting a spot when it...", "Speedway can always be a useful stop for gas with the \"Speedy Rewards\". \nFor me, doing something to satisfy something else is always enjoyable and nearly...", "Less is more.... smaller- Dunkin Donuts coffee....  easy fuel access, friendly, mature employees....the other store may appear on the surface to offer..."], "rating": [5, 4, 5], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["snack"], [], ["donut"]]}
{"id": "6bqNSR4xsQPWWEXjC2xDyw", "text": ["This is your typical Dunkin Donuts.  The location is small and parking is kind of tight. But They make a good coffee and the donuts are usually well...", "Really can't believe this issue. I was traveling with the Mrs and it was a early morning drive of 4.5 hours to get home to NY... had with us special thermos...", "Did a mobile order and they messed up my donut order. You'd think it'd be hard to do that. Well they did, both kids wanted different donuts; Boston cream..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["donut"], [], ["donut"]]}
{"id": "FkIvn346SGtSJWR_E9A2og", "text": ["For coffee this place is pretty good but I've noticed a huge change in service. My bagel is burnt every single time.", "This is my favorite Dunkin around. They get my order right every time which you think would be an easy feat, but I've been to others where it's never right....", "Something else?\n\n\n\nDrive thru was very rude... would not recommend. Honestly just go to another Dunkin donuts if you care about service. although, the..."], "rating": [1, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [[], [], ["donut"]]}
{"id": "CI1_PqtA3YuQ6eBXTGpKJQ", "text": ["Ordered on the mobile app and walked inside to pick it up. The line for drive thru was very long but only 1 person waiting inside. My order was ready in...", "I like Dunkin Donuts coffee as it is consistently strong and good. Stopped here to get my caffeine in the mid of the day and ordered 10 mini donuts too -...", "The slowest DD ever. I would rather drive further and go to a faster location than have to suffer through this drive through line. Saturday morning and they..."], "rating": [2, 3, 1], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [-0.2, 0.2, -0.6], "keywords": [[], ["donut"], []]}
{"id": "qKtPGIvvpW-PnOqcB75BoQ", "text": ["Fresh coffee and donuts. Line goes quickly and it's very clean. Good for an airport or for any DD.  Donuts are actually better here.", "Located near the security gate. I tried the coffee for the first time at this airport location. Staff was friendly quick and well versed. Coffee stayed hot...", "Love their vanilla chai. very refreshing and full of flavor. nice blend between coffee & tea."], "rating": [4, 4, 4], "TBscore": [0.46, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["donut"], [], []]}
{"id": "xyAhSfUxDKAuvo8SDIDz0g", "text": ["Their meat is bad. I don't know how many times I have gotten sick from their rotten meat. Also their pharmacist, that female one, she's got a nasty...", "Beer Cafe now available!  The prices are awesome but probably just for the reopening. Closest non-bar place in MBG that you can get small quantities. And...", "Not bad, I always need something sweet to put me to sleep and Weis sure helped me out.\n\nThe donuts were sooo good, you could serve them at a party and noone..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], [], ["donut"]]}
{"id": "OAAz2BeoeSIxGUF04NFhNA", "text": ["Thai Palace proves substantial portions and you will not leave hungry.\n\nBYOB and you can now order take out using Yelp. \n\nThe Sunday buffet changes each...", "I gave Thai Palace a second chance during their lunch buffet on a weekday. It was worse. \n\nThe restaurant itself lacks upkeep. In addition to a worn...", "Second time trying this place. BYOB,which I like. The decor is a little dated and haphazard. Just one server/cashier on duty but fortunately only one other..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "bWuXNE3B-m0PcIwBr0HOwA", "text": ["Second time eating here. Both times were great! Staff was friendly both times, the place was clean, the service was fast, and the atmosphere was laid back....", "Came here because they had a salad bar.  Place was less than half full and the waitress said seat wherever you like.  \nI ordered a steak that came with soup...", "At 1030 the place is pretty empty. I notice several workers maintaining and cleaning the salad bar. I elect to order the sirloin and eggs for breakfast as..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], ["steak", "bar"], ["egg", "breakfast", "bar"]]}
{"id": "R2Uf22wUws3SNPK-x1brDA", "text": ["We finally made it by Cliff's to check out the new place!!!...\n...except it was the. exact. same. \nNothing has changed about decor, layout, features, or...", "Food was very good and service was fantastic!  Rachel and Bill were very attentive and made sure everything was fine.", "The good: Service was top notch.  Recommend onion rings as a starter.  \nThe bad: French onion was bland.  Potato soup was very with cream and would of been..."], "rating": [3, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "eklS_2vrtxM4WmeyRBBENw", "text": ["Really good place and have been here several times.  Food/drink/service has always been very good.  I will say I assume the place is Greek owned as they...", "After rehearsal with my chorus, we tried this place. I have never been here but was always curious. \nSo the first look, inside was nice, a lot of TV's and...", "One star for claiming their roast beef is \"Kobe Beef\" even though the food is good. . .\n\n. . .We rolled into town on the late side and while we were..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], ["beef"]]}
{"id": "EXWwHzFBE7WdP7KPfKYLLw", "text": ["Kickass staff who took good care of us when we were in town for an extended work trip... one lunch turned into many, as well as an after hours slice or two....", "No contest for the best pizza in town. Don't let the small size fool you. This is the place for real, delicious, thin-crust slices. Crust is thin and...", "Not sure where all the rave reviews are coming from. Got a buffalo chicken pie and it was not good. Dough was super thick and chewy. Pizza had no sauce on..."], "rating": [5, 5, 2], "TBscore": [0.6, 0.34, -0.23], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["lunch"], ["pizza"], ["pizza", "chicken"]]}
{"id": "M7MoYEg_zZjIvQLVtexotg", "text": ["This is a really good pizza place - I work in DC and this would be the best pizza in the District. The Della Nona pizza holds up to the hype. A thin but...", "Geez.... I was excited to see that this place delivered to local hotels. But the guy on the phone....wow. He kept on asking if I wanted chicken on the...", "Excellent choice to eat. Cheesesteaks rival the great Tony Luke's of Philly.  Definitely would recommend."], "rating": [5, 2, 5], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["pizza"], ["chicken"], []]}
{"id": "zEri1xUBCCglGgBksem_UQ", "text": ["Drove from Ocean City Md to go to Hersheypark.  \n\nHad a gyro and pizzas.  Get everything on one of your pies. Fantastic New York style, great...", "Great pie (meat lovers and Hawaiian) and conversation! The mozzarella sticks are legit!", "Love the food made here. Always fresh and flavorful. Nice local shop with friendly workers/ owners. Always consistent. Never disappoints. Good lunch..."], "rating": [5, 5, 5], "TBscore": [0.45, 0.0, 0.39], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], [], ["lunch"]]}
{"id": "0MubP6ep84xSZTGHYLLHtA", "text": ["I'm moving that 4 stars back up to 5 after the amazing pizza I was served tonight! If they ever mess up your order they sincerely appologoze and make up for...", "Passing through town afterba soccer at CD. Not the friendliest counter staff at 3 pm with a virtually empty resturaunt. Pizza was good, but overall feel of...", "I have been a regular.  Food is good but never prepared in a timely manner always always waiting much longer than any other place I ever ordered from.  Not..."], "rating": [5, 3, 2], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["pizza"], ["pizza"], []]}
{"id": "N_zW91XOskThxLRHghuq9g", "text": ["This here is some great pizza!!!!! \n\nFirst off customer service is always on point. I believe its a family run business but everyone working the counter...", "Delicious pizza here in the West Shore Farmers' Market!  They have thin and Sicilian and both are outstanding.  The cheese/sauce/crust balance is always...", "Best pizza in the area. Really. Cork and fork is close, but this is the place. Get there early, they do sometimes run out of particular slices towards closing."], "rating": [5, 5, 5], "TBscore": [0.62, 0.37, 0.37], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "kPlkzYslg58N9A-TD21kYA", "text": ["I made a good life choice by ordering from here. I ordered online around an hour from close on a Friday (I know, I'm THAT person, I work in a restaurant and...", "We absolute love this place...The delivery is always quick with the food still steaming hot. Their driver always arrive we great smile and happy which is...", "I have only ever ordered delivery from these guys. I always get a cheese pizza and its phenomenal! Keep up the great work!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.54], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["pizza"]]}
{"id": "IQKBrK6Y8YBNhDcbt1lkjA", "text": ["You can't go wrong at Santo's. Tasty pizza by the slice? Check. Decked out custom-made pies to-go? Check. Creative salad entrees with unique touches? Yep,...", "I'd say best take out pizza in the area. It's not the best pizza you'll ever eat but it's good and it's consistent. They're quick too when you call for pick...", "Ate here for years, great pizza I did however notice those preparing pizza handled money that's definately not a good idea. There are 6 deadly diseases on a..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.66, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "39PMQnfoRxeVRlHtBXbQCA", "text": ["I ordered chicken fingers and fries.\n\nChicken fingers were hot, crisp on the outside. Fries were also hot and crisp. \n\nOur orders came out within 10...", "Love their cheeseburger sub!  There is something about the Mayo they use that makes it really good.  Can't find that type of tasty mayo in LA!  I've...", "Never again, they are just to slow and forgot to I was there...the oil for\nthe fries must have been weeks old, because my fries were not golden\nbrown, they..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.75, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["chicken"], ["burger"], []]}
{"id": "N-rfZlpuTCXKimpT2_C12g", "text": ["great food. Hands up! Love their basil pizza on olive oil we would Come back again! We also go in camp hill too", "Everything we've ordered was so extraordinary.  Very delicious, and hot.  We've always ordered take out, however our order was ready as stated and so good.", "My fiancé and I love coming here because the food is absolutely hands down great for the price. This pizza grille location has good food and does a great..."], "rating": [5, 4, 4], "TBscore": [0.5, 0.0, 0.47], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "7rOBohap5NLaUIplYzaK4Q", "text": ["Just moved into a nearby neighborhood and thought I would try this well-established Camp Hill pizza joint. \nI loved the community feel to it as soon as I...", "Stopped here on my way home from work on a Friday night. I was really frazzled and just wanted to bring home pizza to the kids. I had a coupon so that...", "Delivery driver tailgated my car the entire way to my house, then came tearing around me at 45mph (in a townhome development) to deliver a Pizza to..."], "rating": [4, 4, 1], "TBscore": [0.7, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "gNEmd4pLtN7tHITqyr76Bg", "text": ["Not bad for a Pizza Hut.\nI like the location.\nBut, I will never forget the time I stopped by here to order and they said \"We are out of pizza \"!\nI am not...", "I recently relocated to Harrisburg from the Wilkes-Barre area (where they closed all of our Pizza Huts) so I was happy to learn I lived only a few miles...", "Pizza hut is not pizza.  Its Pizza hut.  If I am hungry for pizza I go to Toninos.  But if I am hungry for pizza hut, while rare, I have no problem with..."], "rating": [4, 4, 4], "TBscore": [0.44, 0.0, 0.3], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "7iPAJ3DR_tY1Fl8E7sbmcQ", "text": ["Finally!  A good pizza place near us! I'm so excited! The other pizza joints around here leave a lot to be desired. This place was wonderful. Service was...", "The fact that they have a credit card minimum was annoying, but there are bigger problems here. The place was not clean, the floors were dirty and all the...", "Fast, friendly service together with Tonino's DELICIOUS pizza makes them the \"go to\" for fresh pizza in the area.  Both times we called to  order carryout..."], "rating": [5, 2, 5], "TBscore": [0.43, 0.0, 0.47], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "MYjLG16gMYXyX_lIwpNCpQ", "text": ["This great coffee shop is only a few steps from the state capital complex, and is perfect for state workers (or non-state workers!) taking a quick break....", "This is a nice spot near downtown Harrisburg to grab a cup of coffee. I stopped by on a Friday afternoon after parking on the street (there's 15 minutes of...", "This place is fantastic! The coffee is excellent, service is great and their tea is FANTASTIC!! I even asked for a mixture of 2 teas (royal breakfast and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.73], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "NBrTA0Mh5yCYXLVd7qfN1Q", "text": ["We just stop on our way up to Canada.\n this lovely place ,excellent coffee ,\nvery good service!", "Overview:\nGreat little local coffee shop offering various coffee drinks, sandwiches, and pastries.\n\nFood:\nWhat a delicious place!  Their coffees are...", "Good coffee and good service. The food was ok, not a huge menu to choose from and nothing GF"], "rating": [5, 5, 4], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["sandwich"], []]}
{"id": "qfeBhD4RE9jLdIC1NU0mdg", "text": ["I've used yelp for years and never felt inclined to write a review until now. We were passing through on our way north looking for a bite. The Game Table...", "This place was perfect spot to spend a couple hours with the family over the holiday weekend. The cafe style service and food was good and the prices were...", "If you're in the area ever, I would really recommend stopping by. The staff is super energetic, the food is delicious and reasonably priced, and there are..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Hsm92zomAqgyzTB1cv4HoQ", "text": ["Do not use this establishment. They don't update their web page at all. Caused me to place an online order at a store location they no longer associate with...", "Hands down the best pastries in Central PA! I highly recommend the guava and cheese. Also has very good lunch menu, good subs. But come for the pastries....", "I give this 3 stars, it was hard to decide on a rating. This place has changed hands multiple times since we've lived in the area. I think they should..."], "rating": [1, 5, 3], "TBscore": [0.0, 0.44, 0.0], "normalisedRating": [-0.6, 1.0, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "wb2hl4hhEsh9tTnYS5Eiog", "text": ["Much better quicker pickup and always ready when ordering thru the app! Being a kiosk in a mall has its difficulties but they have overcome most to provide...", "Cute and quaint Starbucks tucked away in this small shopping mall. I only visited this mall to go to Starbucks. \nPros - Little to no wait, close to food...", "Green tea frappucino, light, less ice and no whipped cream!\nLocation is great.  It is inside a 'famous in the area' mall.  Everyone who comes to shop, gets..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "8dNiJk7LFAeIO2ieTFoemw", "text": ["I see Lemon Tree has partnered up with a Coffee Shop down the street . . . which gives me one more place to not visit because I stand up for my principles.", "Pretty place and interesting. Lot of cupcakes, different decorating, different flavor, and also taste pretty good. Kids are welcome there to decorate their...", "I've been to this place a handful of times since they first opened.  I'd bring my three year old who would LOVE making her own cupcake at the cupcake..."], "rating": [1, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "85hMO09sVWLHUnyvrfgQIA", "text": ["We went here during a special event and got to see a singer/poetry artist.  We arrived like 3 hours early because my significant other did not want to miss...", "5 Stars for the independent bookstore of my dreams. \n\nMan, I hope this place stays here forever. Not because I live nearby and plan on visiting often, but...", "I've been too a bookstore or two in my time and Midtown Scholar Bookstore is the best I've ever been too (including Powell's in Portland and Strand in NYC)...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "8WTI4zRJk41lkL-sLFcJSA", "text": ["10/2018\n\nHellenic's has delicious Greek food & warm hospitality. \n\nThere are many tasty Greek menu items to choose from. I love their Signature Gyro....", "Was in Mechanicsburg for the PA Tea Festival. Hungry after the fest, we Googled for Greek food, and found this.\n\nIt's a moderately expensive restaurant -...", "Hellenic Kouzina wait staff, THANK YOU for being so accommodating!!!! Especially for entertaining my son's quirky comments. Almost anytime we go out he..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "v0HVfGyV4_Fykjn-yUDYYw", "text": ["I drink a lot of coffee and tea, so naturally Starbucks is a place I frequent quite often. This particular location has a lot of what I like: consistent...", "The young man who is working this afternoon should clearly NOT be working for your company. After hearing another barista tell him that my drink was next...", "I am not sure why the rating at this location is so low. The baristas are friendly and they have many regular customers that have been coming for years...."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "2S8Z-5W2dijIYvTDdFVh9g", "text": ["This is a cute new spot that supports a good cause with local ethically sourced coffee. It has small areas for indoor seating and a couple tables for...", "Love it here! Love the strong coffee and how the almond milk iced lattes are not watery or burnt tasting ! Love the overall atmosphere and idea behind the shop.", "Really solid coffee shop. I'd drive past other local \"coffee\" shops to get to this place.\n\nThe inside has lots of table seating (not much in terms of..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "POQ8ZV6BV3hasbmD1IXdcg", "text": ["I've heard rave things about this place and we wanted to see for ourselves! The restaurant has beautiful decor and a nice atmosphere - we did turn into the...", "We really wanted to like this. It had so much potential and I will say the venue is lovely, though difficult to find. I have been twice but I will not be...", "Staff was inattentive.. \nPrices are high... \nFood is between good-okay...\n\nMy coworkers love Thea so we went for a work lunch. I was not impressed. It..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], ["lunch"]]}
{"id": "fed1Pi2MJqRoCMacvmC-UA", "text": ["The Baristas are nice, the location is clean. There's outdoor seating, although you're just in a plaza overlooking a busy road. Hopefully developers start...", "Slowest Starbucks I've been too. Doesn't matter if you order on the app or in person, expect at least a 20-30 min wait for a drink, especially on weekends...", "This is my local starbucks.  They have the typical starbucks faire and its consistent with Starbucks quality.  Its a small location but its clean and..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "4cFg1DAU_FeqXcRpJhxQ-Q", "text": ["I came here for the sole purpose of trying Beef Wellington and I was not disappointed. \n\nThe building itself it very luxurious or perhaps more so chic....", "Went here for my birthday with my husband. With two small babies we rarely go out so we're very excited. We opted to go here for the ambiance and fine...", "What a beautiful setting to have supper at. It's a magnificent building, perfect date night. Very cozy. Food was good.  I had the fresh pasta, I believe..."], "rating": [4, 3, 4], "TBscore": [0.27, 0.0, 0.6], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["beef"], [], ["pasta"]]}
{"id": "NxhsGCMOPqrvnpjBnW5dOA", "text": ["Whenever I am traveling for business I always try to find a Starbucks close to my hotel or my office. I stopped in to this location on my way to work and...", "I love their holiday specialty drinks, but I'm not a big fan of the price. As always, their machiattos are more like lattes than actual macchiatos, but then...", "I've always had good experience, the few times I've stopped at this location.  There's always a line of people to order, but it keeps moving.  Yes, if they..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "DmbG2acZmv2RKWfuADoJNw", "text": ["This place is only less than a mile from my house so i get my fix from there at least 3x a week for just a cofffee! Some staff know sign language and have...", "No wonder this place has less rating. I went there early in the morning on red cup giveaway day. They ran out of red cups so I ordered a hot chocolate and I...", "Slowest Starbucks ever!  Not sure why anyone thinks it is normal to wait that long inside or in a drivethru for a coffee. This is not normal people.  I..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "mhH5BROUjfNG3I_f0pHckQ", "text": ["This is a lovely coffee shop and cafe right in the Hershey Lodge.  They don't have a huge menu when it comes to food food, but they have a decent selection...", "Stopped by while waiting for Fire and Grain to open to grag a cup of coffee. Instead of coffee I had a Caramel Apple Cider Latte. Pleasantly surprised.", "$2.50 for a cup of coffee and I have to serve myself. Why the high price?  The cups are even small. \n\nAs a plus, they do have a dark roast."], "rating": [3, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "59oEntCw4yRmCtn46QdtJg", "text": ["I am a New Jersey native  - my teenage years were spent working at a bagel deli, then a pizza place. \n\nWhen I moved to PA, no lie, I was bummed about the...", "I was visiting the dry-cleaner in this strip mall, when I noticed the constant  flow of people from Ressler's Bagel & Deli....decided to see what it was all...", "Quick service, delicious breakfast (shoutout to the best jersey pork roll outside of New Jersey), good prices, what more do you want? Coffee tasted a bit..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.52], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["pizza", "deli"], [], ["breakfast"]]}
{"id": "WF2HcuxJulvrFtnXzjKokw", "text": ["This is great BBQ! I tried Get Smok'd at a food truck festival earlier today. I got the Better Than Their Brisket sandwich with Mac and cheese and coleslaw....", "This truck is a new regular at my office for lunch, and I was super excited to try it today, even looking up their menu beforehand so I could decide what I...", "Had the crab Mac n cheese and jalapeño poppers, both were excellent. Friendly and fast service."], "rating": [5, 4, 5], "TBscore": [0.5, 0.21, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sandwich"], ["lunch"], []]}
{"id": "jGxMEhGA5zb33QWz7p9hIg", "text": ["Thank God for yelp! I searched for breakfast and found this quaint and very clean diner. One word - YUM!!!\n\nIf I am ever back in the area, it will be my go...", "Drove by this place on way to airport! So we came back this way and stopped for breaky. I'm have special broccoli cheddar omelet, home fries English muffin....", "Great service, classic atmosphere, and delicious breakfast! Had the Ham Steak and Eggs - it was huge and pretty much perfect. My husband had the sausage and..."], "rating": [5, 5, 5], "TBscore": [0.47, 0.0, 0.6], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["breakfast"], [], ["steak", "breakfast", "egg"]]}
{"id": "4dPxzjONM7r_3pAEQPYCzw", "text": ["Can you say generous amount!  Ordered huevos rancheros and thought my belly was going to burst after.  Great food and service.  Worth every penny.", "This place doesn't look like much to be honest but I was actually really impressed. Think of diner type restaurant with a Mexican flare to it. They have an...", "We come through Harrisburg a couple of times a year on the way to visit family, and we basically eat every meal here when we are in town.  Consistently good..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["mexican"], []]}
{"id": "aehbBDId_1u1PFivY3ZmyQ", "text": ["Phyllo has become our go-to Greek cuisine in HBG area.  Located in the Broad Street Market, which is only 15 minutes from work, enables us to place take-out...", "I have been here three or four times now so I figured I would write a review. I really like Greek food so o was happy to find this at the market. \n\nThe food...", "I really wish that for the amount of people complaining about the small portion sizes, that they would ramp it up a bit. Being a lover of Mediterranean and..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "-_4fRURnND5bB9BgrT22Nw", "text": ["I really enjoy Sophia's at Walden.  Much like the restaurant on Market Street, nothing is bad here.  I also love that it is a byob.  Brunch is great,...", "We had a great brunch at Sophia's at Walden. After arriving around 1pm on a Sunday, the restaurant was packed but we only had a 5-10 minute wait without a...", "I came here for brunch with my cousin.  \n\nFood 3.75/5\nWe got the seasonal French toast which they change. Mine had fresh berries on it. And we also got the..."], "rating": [5, 5, 3], "TBscore": [0.24, 0.4, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["brunch"], ["brunch"], ["brunch"]]}
{"id": "yAAHjRbkcGRmosis-dVQDw", "text": ["Great selections for healthy food! Lots of variety and tasty options. So glad to find this hidden gem. New favorite spot in the Harrisburg area!", "An insurance agency is an odd place to find a healthy lunch, but...  The Healthy Choice Cafe is nice little spot to find fresh food options. I had the...", "What a pleasant surprise inside a building I otherwise thought was just an insurance office!  I had the opportunity to have lunch here for a business..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.26, 0.92], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["lunch"], ["lunch"]]}
{"id": "LIXGB6XYG90D-m0Vu2m8Pw", "text": ["This restaurant is located in the Sheraton Hotel on Lindle Rd.  Delicious food!  I had a prime rib sandwich, my friends had the grilled cheese sandwich and...", "Stayed at the Sheraton,  and this restaurant is inside !\n\nCustomer service in the restaurant was friendly and fast. I ordered the chef salad.... delicious!...", "I've only been here when I have had events at the hotel and I've only had drinks and appetizers here but their bartenders are good and they pour a strong..."], "rating": [5, 4, 4], "TBscore": [1.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["sandwich"], [], []]}
{"id": "_PThTbjV26-8-xw9W6ek4g", "text": ["I was super please the 1st time I went here for my to-go order. I ordered at a funny time and I think on a Monday so my expectation weren't high. They were...", "I love Thai and I try to visit a Thai restaurant every where I go! I recently relocated to Harrisburg and tried Kanlaya for lunch. The restaurant is very...", "I go to Kanlaya for lunch frequently and I always get the same thing because I love it so much.  \n\nWhen you order, they bring you 2 little fried egg rolls..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["lunch"], ["egg", "lunch"]]}
{"id": "Ru2xxszC20Ib-Rm4jPFHOA", "text": ["This candy store has everything you would ever want! \n\nI stopped in and they were so helpful with helping me create a throwback basket of goodies for my...", "Walk in and sniff the roasting nuts! I go here for candy though, lots of fun candies! Great selection of retro ones, my daughter NEEDED an Abba Zabba bar,...", "For a hole in the wall candy and nut shop, this place carries more variety than you could imagine. Their prices are fair and they even make a lot of custom..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.59, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["bar"], []]}
{"id": "3xmEAMDbUTDuBdOyNYp62w", "text": ["Wow - got a breakfast sausage biscuit and my sausage is crispy like they put it on the grill!!!! My first experience with this EVER!!!! And I've been eating...", "I have to say there service here is some what decent speed wise, but damn they always are missing an item when I go thru the drive thru. Then when I go...", "Avoid this one if you can! What happened was, my boyfriend and I were on our way back to his place one night, I used the app for the free fries that came..."], "rating": [5, 3, 1], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["breakfast"], [], []]}
{"id": "TiHF4Jakf1VkZaNDzfOiPw", "text": ["DO NOT EAT HERE!!!!! I GOT FOOD POISONING!! 20 minute wait for 2 mchickens  and fries for me and my girlfriend. The floor was completely covered in food ....", "Driving through PA to go to VA.  What I thought would be a quick stop for a burger turned into a 30 minute wait! This is the most ridiculous wait I have...", "The food was hot, they got my food quick. HOWEVER!\nThis place needs a health inspector. As I was waiting for my food, I looked at the barricade near the..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], ["burger"], []]}
{"id": "HmjuE3gaNDi8clksiY0amA", "text": ["The worst experience I have ever had. I went into the store to place an order and the lady that rung me up had a very bad expression on her face. As I was...", "This location is extremely dated and old. It needs it's benches and entire restaurant updated immediately. They always have flies attacking you as you eat...", "This is the McDonalds in Walmart. The place is a little dingy and could use a good cleaning. For the most part, the staff is friendly and quick about..."], "rating": [1, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "aw2l03OX_ZVp83kJr3Nadg", "text": ["It's \"McTOBERFEST!\" for the Monster Hunting Yelper featuring quick reviews of all the area McDs we've been forced to enjoy.\n\nFrequented this location mainly...", "Okay, so we all know what McDonalds is, so unfortunately if I am writing a review for them it's due to something being completely wrong.\n\nIt is 1:50AM. I...", "Bottom Line:  An updated McDonald's that is consistent with the McDonald's brand.\n\nMy expectations for McDonald's isn't high but I do expect consistency..."], "rating": [2, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "gKfKIF1B11xS7AfNsjGbow", "text": ["Sometimes, when you're on the road and in a hurry, McDonald's can be the perfect place to stop. Well that was me the other day...\n\nHeaded from Jersey to...", "This is the second time in less than a week that I have waited in the drive-through for 10 minutes before I could even place an order. I left before I could...", "I gave this place one star because there wasn't an option to give zero stars. I'm a truck driver and got off the highway because I saw a McDonald's sign..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "8IKhSZuqOcZ4Qi3RtxmuPQ", "text": ["Went tonight, there were very rude. Gave  my order to the car in front of us. They finally gave us our order and the fries were cold. We waited a half hour...", "Deserves zero starts for worst branch in the entire country.  Slow service (25mins drive thru 9pm with two other cars in front of us!!!) lobby trash...", "I understand not to expect five star service at McDonalds, but c'mon. \n\nFirst off, they don't accept digital coupons from the McDonald's app even though the..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "1ihGapmadtv-g6rC92sVBw", "text": ["Was in the area for some training in our corporate office and was looking for something different than McDonalds, Subway, etc.  Then... I came across this...", "This place definitely has more variety in international products than the stores back home. My complaint about this store is the odor. It's very strong and...", "Wow! They've got SO many things I can't find anywhere else! Great variety of SE Asia and E Asia foods and lots of veggies choices, too! Was worried I..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "l0aZnNlIBa-d5dvz212CKg", "text": ["I have been taking my sister to Olivia's for years now for her Christmas gift.  We have never been disappointed.  Olivia or her assists have always been...", "My friends daughter recently had a party here & we were all kind of disappointed.   The girls had fun.   BUT the \"snacks\" were pretzels and goldfish.   The...", "I came in here with my daughter for a birthday party.  Everyone brought their American Girl Dolls and posed for a group picture before the party started...."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], ["snack"], ["american"]]}
{"id": "Xcm2IbqwtTRtfsQjB37WUA", "text": ["We love Bamboo Frozen Yogurt no matter what the weather may be outside!  On a cold day you can enjoy the wonderous flavors of frozen yogurt including...", "Good frozen yogurt with many flavors and toppings and combination of flavors. Found the topping display case to be neat and organized. Tried their birthday...", "This yogurt place is a lovely spot to go for some sweet treats. It has a wide variety of flavors. I tried triple chocolate, coconut, and key lime and they..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "-k14QSOxu-o1ur_MF_K0ww", "text": ["I sometimes go here for a mcgriddle but they always don't wrap it right so I have to be careful  or it will go all over the floor. Also they have shitty...", "Who would have thought... of all the McDonald's in Harrisburg... this is the only one who can make a caramel iced macchiato correctly! Go figure - good job...", "I pull up to drive-thru around nine pm....\n\ndrive-thru guy: can I take your order?\n\nme: I'd like an Oreo mcflurry \n\ndrive-thru guy: we have no ice..."], "rating": [2, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "TBA_09eZ-BLitkNhgt2bRg", "text": ["FREE FRY FRIDAY FIASCO ...\n\nStar goes down for the incredibly rude \" manager \" who was more concerned with the idiot in front of me getting FIVE free medium...", "Forgot macsauce on my burgers along with cheese,like who wants a mcdouble with no cheese or mac sauce..wayy to dry super disappointed in lack of customer...", "Typical fast food place. Fries were fresh for once but the mcflurry I had bought could have had more oreos in it which I had to ask for more and was charged..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], ["burger"], []]}
{"id": "i84ZhQnKjS-EqKTm4YBp6A", "text": ["Visited McDonalds for the first time in several years.  Ordered a quarter pounder and fries.    Wow.  I can make a burger a whole lot better than this,...", "I'm a former employee here. I worked with some great people. Helped me if needed. Made me feel appreciated. Even made me feel like family. That's why I...", "The drive thru is always busy to the point where I have to wait for 20 minutes in line. The workers stand around and talk to each other instead of handing..."], "rating": [1, 3, 2], "TBscore": [0.21, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.2], "keywords": [["burger"], [], []]}
{"id": "tOcQOosJjGkYwc6wsRRq8w", "text": ["Sweet frog is always a favorite stop for my family.  They rotate flavors and have great options also for those who don't want dairy or sugar believe it or...", "I was on the way home from Hershey and came across Sweet Frog Premium Frozen Yogurt and decided to stop off and get a frozen yogurt.\n\nI came in and was...", "\"The people that work here are very kind all of their frozen yogurt is good. Their toppings are also really good and there are a lot of choices\""], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "3BBupXPdYUkAPfbzMVNS2g", "text": ["Everything looked so good so I had a hard time picking something. \nI had california rolls, bibimbap, and coffee.\nThe vegetables were fresh and the spicy...", "This was a fun find. I often drive through Mechanicsburg and not notice all of the businesses. I think part of the problem is the signage doesn't always...", "Food is superb, but at lunch can be busy so be ready for a slight wait.  However, that doesn't stop me from returning.   I keep coming back for the smile,..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "SXVTjWGvw1ukjOFjPxE_OQ", "text": ["I ordered a small coffee with cream, no sugar and a hash brown.\n\nI got a cup of coffee with 2 sugars and 0 cream,\n\nWith a hash brown.\n\nI had to use the...", "My gosh never again. Went to the drive thru at 10pm s since lobby was closed. No one came on the speaker. A line of cars were sitting at the speakers...", "It is disappointing how terrible this McDonald's is. The employees here do not take pride in their work and serve substandard food.  \nI stopped for a late..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "JFe1BzkltAS0HqLhDSvwPw", "text": ["Thank you for sending my family treats for the holidays! My family was very happy and I appreciated the opportunity to shop LOCAL online from my PC and was...", "Another great find in downtown Mechanicsburg.  The day I visited I was on an art/wine tour.  I sampled every treat layed out in every bowl and had to...", "Purchased last years (2009 season) corporate gifts from this great company and were thrilled with them.  The candy towers looked great and were filled..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "ZArQL0aMY8RZwX9XfQieJA", "text": ["I don't think this should say open 24 hours first of all. Maybe the drive thru but not the inside. Even the label on the front doors to the place say 24...", "Seriously the sweetest employees. I asked for a hungry hippo game and they are digging through every kids meal to find it. For it being almost midnight I...", "These guys are our heroes for being open on Christmas Day, when we were starving driving up from BWI to Harrisburg, especially after we struck out on the..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Wm0o6onkFCFz4U_Z_P8WBQ", "text": ["Great place unique.  Love all the options and prices are good. If itd be closer I'd go more.", "Great place for produce (mangoes!), indian snacks, curry powders and mixes, authentic / imported soft drinks, bulk yogurt and rice.\n\nNot so great for:...", "Food is always fresh, large variety of fresh produce. Staff is quite and friendly. Love, love, love the deals - compared to American grocery stores! 4 full..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.6, 0.34], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["snack", "indian"], ["american"]]}
{"id": "f9dj3Bciif4Qa_r6bNwTXQ", "text": ["It's \"McTOBERFEST!\" for the Monster Hunting Yelper featuring quick reviews of all the area McDs we've been forced to enjoy.\n\nI was going to give this...", "No matter what time it is, 2:00 p.m or 2:00 a.m.,  service is sloooooww.  Every....freaking....time.", "Always easy to get in and out, and extremely fast service. The staff is always great about getting my order correct, and all of my items are always nicely..."], "rating": [3, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "w4LDeAhKWM_4slRMOEkHag", "text": ["Was in the strip mall this was in for lunch and saw a sign on the door for take and go snacks.  There was also a sign for $2 off parfaits.  (This goes till...", "Ordered online and picked up at the store today. The chocolate dipped fruit box was ready on time and looked great. This was supposed to be a birthday gift...", "I received a small arrangement after recent surgery. I have purchased and received Edible Arrangements in the past that were very good. I was disappointed..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["snack", "lunch"], [], []]}
{"id": "JuzWdpB_d48XE4ivmMs-ZQ", "text": ["Side salad had only one cherry tomato with no other toppings on a bed of lettuce was charged $1.89 for it. Very disappointed in this McDonalds.", "This McDonald's is attached to a convenient store. However, at a certain point the main dining area of McDonald's closes and only the drive through is open....", "I stopped by here to grab a bite on our way to Gettysburg. It was a bit slow here, since there weren't many people here when I ordered, and I only ordered..."], "rating": [2, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "8tQb0t5h9jc7iXXoZb3nBQ", "text": ["Second time here love that there open till 9, holly cow were they busy. We got a large chocolate peanut-butter it was soooo good! It taste a lot like...", "What a great place to take the family or have a sundae after date night.  New look and new management.  Love having another local family owned and operated...", "This place is located right in Pineford. It's tiny, but the interior is so cozy. I love the little booths. Cone-A-Cabana teleports me to the '50s, when they..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "PW4UjoveKBnknA88WmRYIg", "text": ["Awesome modern venue and a crown jewel of entertainment complexes in Harrisburg. It doesn't get any bigger or better than this place for miles around. The...", "Rocking club..here to see the Sharks..bartenders are hopping especially Megan..they know their shit !!", "As much as I like coming here, I feel like I always run into some sort of issue. The first time I went there, I was thrown out, which wasn't even my fault...."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "NsU5WEowfTz1IBvg_pB0ug", "text": ["Very nice tasting room. Relaxed atmosphere, wide selection of cocktails. Terrific, friendly bartender. What we tasted on this our first visit was all good,...", "We had an amazing time at Midstate Distillery trying all sorts of delicious distilled beverages during our whirlwind visit to Harrisburg! The servers were...", "My favorite place I visited while in town! Danielle took such good care of us. We tried several of the infusions but mostly enjoyed the iced coffee cocktail..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "jilvr1j3Ood4CPddumx8UQ", "text": ["Walked in around 7 pm on a Wednesday night.  The place was pretty dead so we sat at the bar and were given menu that included beers, burgers and sandwiches....", "My 70-plus year old Father and I went here.  It was an interesting experience though not ideal.\n\nRecommended that we go here a brewery we were at...", "Talk about a winner! Nestled in this cozy shotgun are an array of nostalgia inducing video games, a different console at each table, that are all free to..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["burger", "bar", "sandwich"], [], []]}
{"id": "9MA84K71ebxLp45MWjctyw", "text": ["Great bar with loads of beer on tap!  48 taps to be exact! Bartender was very attentive and the crowd was friendly as well.\n\nThis is a smoking permitted place.", "So Shady's used to be a place of lore, legend and infamy. It seriously was the BEST dive bar in all of Harrisburg. There were times when it rained so hard...", "Good beer selection but it seemed like every single smoker in the city converged on this one place. Couldn't take it for more than an hour. \n\nOh and not one..."], "rating": [4, 4, 3], "TBscore": [0.55, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["bar"], ["bar"], []]}
{"id": "HS7yWFQVToTldzrocZVsWA", "text": ["LOVE THIS PLACE!!!!\n\nThe service is excellent.  The decor is gorgeous.  The music is well chosen.  And the food is delectable!  I especially enjoy their...", "Upscale, well stocked, friendly/knowledgeable bartenders serving up a banging CHOCOLATE Martini ;-)  Use CAUTION...they go down so smooth you're likely to...", "This is fine place. On weekends they have live music, and it is quite there. Good for a sophisticated date. \n\nIf you are a single guy who is trying your..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "AyuJ4gCAOIa-9qFHC8fdSQ", "text": ["This is the best small brewery in the area. Their brews are delish and change according to what they afte currently brewing. They also offer other local...", "This is a super chill, low key brewery in a little strip mall. The bartender was very friendly, knowledgeable, & accommodating. They have in house brews &...", "A neat little brewery tucked into an unsuspecting neighborhood of Harrisburg. It doesn't look like much when you pull up to the storefront in a strip mall..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "ta4pHmjj4I1vqTByhbCopw", "text": ["Knock is by far the best club in harrisburg that I have been to and also the best speakeasy in all times. Its a must visit and a unique place. \nI have been...", "Knock is a pretty cool place. I went with a local, who is a regular.  You need a password to get in, however, you can usually find the password on Facebook....", "Everywhere else I go, when I buy bottle(s), no one walks thru my area and disturbs our private area. My party bought 4 bottles, yet the \"bouncer\" or..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "AVKy5lZZxqyqJNY0VVTsag", "text": ["We were visiting Harrisburg for about a day and a half so we didn't have a lot of time to check out all that the city had to offer. We were staying in the...", "This restaurant is perfectly nestled inside of the Crowne Plaza Hotel in Harrisburg Pennsylvania. My husband and I went there thinking we were going to get...", "These folks are in the Holiday Inn Crowne Plaza and let's face it, they are a hotel bar.  I've stayed here a few times so I've visited here a time or two...."], "rating": [1, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 0.2], "keywords": [[], [], ["bar"]]}
{"id": "SntxSbA4i0yMHRuFotCQxg", "text": ["We randomly found this place while bars-hopping in downtown. It is literally on level 2 of the building. We stayed here the longest out of all bars. The...", "Absolute worst lounge you could go to in Harrisburg. Horrible service, horrible music, horrible!!! Do yourself a favor and DONT waste your time! Also...", "Are you kidding? A club with only 5 people including the bartender? I'll pass. It was clear that this club has no professional management or marketing team...."], "rating": [4, 1, 1], "TBscore": [-0.5, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["bar"], [], []]}
{"id": "wJhcjyRYLZLRnzqPRzV7qA", "text": ["I love this place!  The vodka is unquestionably the best I've ever had. I typically drink their vodkas on the rocks, but they have an extensive selection of...", "We decided to come here for a friends birthday after finding it on Yelp.  When we first got there it was very busy, standing room only.  Within ten minutes,...", "Really amazing gem for the West Shore. Stopped here for the first time last night and it was packed! Standing room only! They had some live music going on..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "GjPE-XgbMsN6doB9awm2Sg", "text": ["More of a 3.5.. this bar is spacious and has great specials. It loses points for allowing smoking (a lot of bars in the area seem to allow this) and for...", "I came on a Sunday night it wasn't that bad parent gets very packed on the weekends I thought our bartender was very nice but the girl I was with wasn't...", "Rounding up to 4 stars from a true 3.5 score. This place is a dump, a proud dump that serves cheap drinks and allows you to smoke and smell like a bar when..."], "rating": [3, 4, 4], "TBscore": [0.33, 0.0, 0.52], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "zb-kGWWfeLxJPgc5JcF99w", "text": ["The best pool hall in Harrisburg. Hands down. No competition. One of the best places to come hang out and chill. Bring your own drinks too. The owners are...", "Super fun night.  Love the byob attitude. Next time i definitely will bring more with more. Would recommend this for any group who wants to have a nice evening.", "Great pool hall!  Friendliest staff in the world. BYOB and have a good time. If you need to eat,  snack bar is awesome. Pizza,  chicken strips,  Fries,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.53], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["snack", "pizza", "bar", "chicken"]]}
{"id": "pm55KzfptkjTJPy6xFv7eg", "text": ["I been here a couple of times and I think is really decent. I seen other reviews and i don't know what to think, maybe every time we go we had the best...", "Great food, lot of menu choices, excellent service, lots of tvs and great music playing, it's my kind of place... try it you'll like it!!!!", "Terrible burger. Undercooked, so much blood the bun was a soggy mess. I ended up eating the burger with a fork and knife. Fries were luke warm. Never again!"], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], ["burger"]]}
{"id": "ooO6dt0Qq4NjGB0LSyk54w", "text": ["I'm visiting the area of Harrisburg on business and to my surprise the city has a few LGBT bars in the downtown area that are actually LGBT.\n\nCame to 704 on...", "This is my spot. I love this place. The bartenders are always awesome Mitch is always a blast to see. They have karaoke Thursdays, and happy hour! It...", "I love that there is no smoking here! So much better than going somewhere with all that stale cigarette smoke like the other bars... service is also really..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["bar"], [], ["bar"]]}
{"id": "UbkfretCkkTzLb0WrMnDbw", "text": ["Tonight Double K's had a very jovial crowd. Music is on and the patrons are all living the dream. The owner is cool and the beer is cold. The only problem...", "I went to this joint for a bite to eat and some music, as I approached the front door, The was a sign \"NO COLORS\" I made a quick California U-TURN. My...", "Sickening sitting here next to 2 dudes spitting into a cup with there SKOAL dip.I'd much rather it be a smoke bar then watch this gross act\nThought this..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], ["bar"]]}
{"id": "_-FcWxnZ21xzFEqBID5mbw", "text": ["Great drinks and staff. Rumor has it a new menu is coming to make their already amazing food even better. Excellent place to run into colleagues and to...", "The worst bar I have ever been to. I was kicked out after I played music that other patrons did not \"appreciate.\" The staff is rude and unprofessional. They...", "A bad place to go for a drink. A good place to go if you want to push your way through completely drunk patrons (which is against the law by the way) to get..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.48, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["bar"], []]}
{"id": "CGYiJZk0naWG53lV2D6hkw", "text": ["HMAC, a sometimes sore topic of discussion for a plethora of reasons. You just have to remember one thing: this is Harrisburg. It's the best we have. It's...", "Such a hit or miss on service \nLots of drug dealing behind the scenes\nBad rap for assaults \nLots of rumors about owners \n\nNot spending any of my money on...", "Fun place for karaoke Wednesday night.  Lighting was good considering the club/party atmosphere.   We got here late, so we had no food.  Bottled beverages...."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "tn1VA5SnyoIizGcm2Jcf4Q", "text": ["Harrisburg's gay version of \" Cheers \".\nA staple and always a nice time with friends.\nOwners support local charities and events.\n\nOnly negative is the smoke...", "If you aren't a local, don't bother wasting your time or money in this bar.   First, the place allows smoking indoors so you come out of there reeking....", "Great bar. Reminds me of Cheers. Owner quickly knows the regulars. Drinks are strong and reasonably priced unlike the rest of Harrisburg. Watch special..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.42], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["bar"], ["bar"]]}
{"id": "A-40x-cIIS0RH_yFaAzkxg", "text": ["I came in fairly late. They had a decent tap selection, with the REAL King of Beers - Big Gruesome Peanut Butter Chocolate Stout by Spring House Brewing...", "If no stars were optional I would be completely satisfied...The staff is very rude and unfriendly to their non white customers...I am a disabled Veteran,...", "Just... no.\n\nA group of co-workers went to Mulligans today for a party. The seating for our group, which had been reserved in advance, was not reserved. No..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "YxW2_ijm2xPdyLXFhc4pOg", "text": ["I've been coming here for years, and I pretty much get the same thing every time. I am a vegan and they have my meal memorized, I always get the Tofu &...", "Always a good deal for good Chinese food. Reasonable prices and a typical menu found in most restaurants. I like their lunch and dinner combo specials...", "For my husband and I, we try to have Chinese food on New Years Day (as do most people) the only difficulty is that we are usually driving back from\nNew..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["dinner", "lunch", "chineese"], ["chineese"]]}
{"id": "fF0LqmWGbMy99d-THjZrZQ", "text": ["We were in town with family for Hershey Park and we wanted to eat outside of the park and found this place on Yelp. We walked in at 8:35, right before...", "If I can, I would give zero star. I have ordered large size of dish, the box is large, but the dish is even less than half of the box. Comparing to other...", "The best hot n sour soup. Huge dipppable fried Chinese noodles with duck sauce free if ure eating in. Never had one bad Chinese Entree ever.  Older lady is..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["chineese"]]}
{"id": "SxOQcgBgp1p4lkjDQosiJQ", "text": ["I ordered pick-up from here on a Friday night. Service was friendly and the place was clean. I ordered Mongolian beef, boneless ribs, white rice, and fried...", "**DONT ORDER FROM THIS PLACE** \nI don't eat meat but will eat fish and ordered shrimp dish and hour and 20 minutes later food shows up and completely wrong....", "This is one of my favorite Chinese restaurants in Harrisburg. They recently remodeled, so dining in is now an option here. I typically do takeout and I am..."], "rating": [3, 1, 4], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [["beef"], [], ["chineese"]]}
{"id": "Z_IXrRXdqMEoyIDmTODIOQ", "text": ["Just got my order of beef and broccoli. WOW\nI can't eat it the \"beef\". Not sure what type of meat this is but not any I have ever had... slimy and chewy....", "Love their beef with broccoli. Nice think brown sauce and a lot of beef.\nI try to stop here whenever I am on this side of the river!", "After ordering here several times, I'm convinced they are bad on purpose. I work in the shopping complex they are in, and eat there frequently. This time, I..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.62, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [["beef"], ["beef"], []]}
{"id": "uq2--SpKqhi6M-vjqPEuvA", "text": ["This is the few places that serves Bourbon chicken AND delivers! \n\nThis place is a typical Chinese restaurant. They have lots of people working and the...", "Ordered from them this afternoon, the order was made for delivery and took about 45 minutes to arrive. Chicken wings and fries were ordered, the food wasn't...", "I got the wrong order. Even though prices are good and delivery is fast that still is wrong."], "rating": [4, 1, 1], "TBscore": [-0.28, -0.6, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chicken", "chineese"], ["wings", "chicken"], []]}
{"id": "Wx7GhjBvi4xobFegJv53nQ", "text": ["What just happened?\n\nLegitimately authentic Chinese food in Middletown, Pennsylvania? I don't understand how or why this place exists here of all places,...", "I really, really, really, wanted to love this place. I've had good chinese food from different regions of China (this restaurant specializes in Xi'an...", "I don't know what authentic Chinese food is but this restraunt is certainly different. It is closer to Chinatown in NYC than the usual Chinese buffet in..."], "rating": [5, 2, 4], "TBscore": [0.25, 0.28, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["chineese"], ["chineese"], ["chineese"]]}
{"id": "_gNXoRrzWeZogtpXOD54lQ", "text": ["I live a few blocks away from Emerald Chinese and go there quite often. The food is good, the staff is friendly, and the service is prompt. My favorites are...", "Open till 12am\n\nAllot of parking next door in Family Dollar parking log \n\nFriendly staff \n\nLooks very clean\n\nIn the hood but quiet (went at 11:30pm on a...", "Best Chinese meal in town,they know what I don't want in my wife's food whenever we call,on point"], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "B0_h7opxh_cBmad0_rdLsg", "text": ["First time here.   I ordered the Crab Rangoon and Beef Lo Mein.   The Lo Mein was very good.  The Crab Rangoon was just, so-so.", "Gross. \nGen Tso's chicken was tough and tasteless (broccoli was good). \nRice was tasteless as well. \nWill never return.", "Always good for a quick lunch! Food is always very hot and lunch special is a great deal!"], "rating": [4, 1, 4], "TBscore": [0.58, -0.25, 0.56], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["beef"], ["chicken"], ["lunch"]]}
{"id": "f0iFDPUOmY51rOfrrNJYbg", "text": ["I come here because of my friends recommendation. First impression was it is a little dark, maybe I come at around 6 pm so that the lights werent on yet....", "Ho Wah is a great little oriental mainstay restaurants in Lemoyne! Great portions st a great price and since my last review the quality has...", "After seeing this place win \"Simply the Best\" year after year we finally tried Ho Wah.  We left wondering \"why?\"\n\nWhat we found were filthy windows, a..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "lW4qIgjxGqNur2BcoROuDw", "text": ["I was pleasantly surprised by the large number of vegetarian options on this menu! The steamed veggie dumplings were inexpensive at $4.50 and yummy. My...", "Very simplistic Chinese styled restaurant no frills!\nClean and well kept, Friendly staff, and very efficient.\nWe were on the hunt to get something quick so...", "I'm usually very happy with my to go order from china cafe.  My beef and broccoli was good, but I decided to order chicken wings also.  \"BAD MISTAKE.\"..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], ["chineese"], ["beef", "wings", "chicken"]]}
{"id": "1taDt-BhUk9NWvjK6as1Nw", "text": ["Rating this for exactly what it is - a cheap, strip mall Chinese food joint - it reallllly hits the spot. I visit from NYC and this place is still my go-to...", "Their Chow fun is so good that even though I'm from Flushing, Queens  I think this is the best I've had yet. Over the weeks I've gotten a variety of food...", "So stayed at a hotel nearby and they were nice enough to deliver to the room! I've never had such nice delivery experience at a Chinese food restaurant...."], "rating": [5, 5, 5], "TBscore": [0.22, 0.0, 0.24], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "wkHT9lxZN6k1MYsukFjnug", "text": ["I so wanted to love this place because it's so close to our home, but I didn't. It was just meh. I have no complaints, but the food was extremely bland. The...", "Stopped in at Golden Wok today for lunch, mostly because it is close to my apartment. I really didn't expect much based on other reviews but thought I would...", "Completely empty restraunt. First warning sign. Drink selection was rootbeer, ginger ale, sunkist peach or water. Second warning sign. Order was slow and..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], ["lunch"], []]}
{"id": "ZMOFfabypqV7VnFbSwWQEA", "text": ["Great service. Super friendly. We stopped on our way through HBG with our family. Food was amazing too!", "Wife was craving Chinese food so we stopped in since this place had decent reviews. I order the Generals Tso chicken combination platter, the pork lo mien...", "By far the best Chinese food we've found in the area. Very clean inside and the staff is very kind. There are several other Chinese restaurants around us..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.28], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["chicken", "chineese"], ["chineese"]]}
{"id": "jInp9oHMOZWggsr7UBe9FA", "text": ["Decided to surprise my guy with Chinese food.  I ordered it to go.  The staff were very friendly and prompt.  All he kept saying how fresh and delicious the...", "Service was awful. Just went up to the counter and she looked at me like I was bothering her. I bought sweet and sour pork as one of the items I ordered and...", "Checked in on 1/26/2016.\n\nI took one of their lunch specials.  When I walked up to the  counter, I asked the lady which one of their dishes is the spiciest...."], "rating": [4, 2, 4], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["chineese"], [], ["lunch"]]}
{"id": "1RAt5TfaRwuhQywIldmZAA", "text": ["We were at the Crete terminal for the night and inside the terminal are all these take out menus and one of the other drivers recommended your menu as being...", "The chicken with broccoli and the pork fried rice where delicious.  I really enjoyed the food here and I have actually been looking for a delicious place...", "The food was okay, but not great. I ordered the chicken with broccoli and fried rice. I will probably not be returning."], "rating": [5, 5, 3], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["chicken"], ["chicken"]]}
{"id": "9jjtg27R4kgrG-20Jcs77g", "text": ["Lo mein was pretty good!  Kung pao could have been better. They had really good dim sum!   \n\nVery friendly, food comes out hot!", "Stopped by today to get my one of my favorite Chinese dishes, the shredded chicken pan fried noodle. I was startled when I found out the signage has changed...", "This is a typical Chinese fast food restaurant for American taste. Another name as China Tea House.\nWe were mislead by google and expected some Hong Kong..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], ["chicken", "chineese"], ["american", "chineese"]]}
{"id": "nztqMoV_2DWfwPeZJRypig", "text": ["Stopped here briefly while headed south to Washington DC. It was a nice halfway point on our journey.  Good delicious Chinese comfort food, young man behind...", "I like this place, I like the food, the flavor. However, I ordered the shrimp with green beans lunch special today and I found that it was more like 'greens...", "If I could give this place zero stars I would!! The first time I ordered from here, I got Sweet and Sour chicken, and I was not a fan. When I bit into it,..."], "rating": [5, 3, 1], "TBscore": [0.29, 0.22, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["chineese"], ["lunch"], ["chicken"]]}
{"id": "0A0FwTichdBH77vWxYWyAg", "text": ["I can only vouch for delivery and I've ordered the same thing both times..but I have no complaints.\n\nDefinitely a generic Chinese menu but it has all the...", "This the second time in three visits where I ordered \"Chicken and Beef Hunan Style\" and this is what I got. What the heck is wrong with the kitchen? I've...", "Had dinner here on Saturday February 10,2018 approximately 6pm.  Place was fairly busy, especially takeout.  Phone range nonstop for takeout orders.  My..."], "rating": [4, 1, 3], "TBscore": [0.0, -0.37, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["chineese"], ["beef", "chicken"], ["dinner"]]}
{"id": "6XCBL08BhtW7noqEYbuodg", "text": ["Many years ago, there\nwas a small Vietnamese restaurant in Lancaster. My friend a\nand I ate there at least once a week. \nMy favorites were the spring rolls...", "This place has the best Pho I have eaten so far in the US. \n\nMy wife and I ate here for the first time the other day.  She got the Pho 3 Mein (the...", "The place smells liked spiced heaven when you walk through the doors. We've ordered take out on a couple occasions, now, and are always left stuffed,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "xqt5ez4vDnWJHzJJJIZXnQ", "text": ["A Chinese fast food spot off the main road.  Clean with friendly service.  Food was reasonably priced and good.  If in the area ever again, would repeat.", "This place has amazing shrimp egg fu yong! They give you three patties and the sauce is sooo good! I've tried it other places, but this is the best place by...", "Very disappointed ,my wife's shrimp combination had only 5 shrimp,and the pork fried rice had no pork.Not a lot of beef in my pepper steak either.Prices..."], "rating": [4, 4, 2], "TBscore": [0.29, 0.62, -0.49], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["chineese"], ["egg"], ["beef", "steak"]]}
{"id": "RPBrLlFHp1WsEJ1JHsbjSQ", "text": ["We recently moved to the area and tried this Chinese restaurant first. We ordered delivery and the food is absolutely delicious! It was delivered in a...", "This is my go to Chinese take-out Restaurant .  \n\nYou can see everything they are doing because there is no wall behind the counter, so you are able to...", "Good food. Fast service. Friendly. It is a little bit hard to understand them when placing a phone order but they are patient and repeat themselves."], "rating": [4, 5, 5], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["chineese"], ["chineese"], []]}
{"id": "-jYJyJGA6tiYfLwo3dixjg", "text": ["So good!! This food is delicious, the service is quick and friendly and you can't beat the prices.", "Good food, came here multiple times but this time I witnessed the cook laughing at a customer that was adding sauce to their food and even talking to the...", "This was the first time I ever had Japanese food. So let me say that is was so good! They give you so much that's its enough to take home for later. I was..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["japanese"]]}
{"id": "KvRtWLeWXb5iyK17Nq2hhQ", "text": ["Dusty, cold and stuff looks like it has been there for quite a while.  If you want some Vietnamese dishes pre made and saran wrapped on a styrofoam plate,...", "Little Saigon is your typical Vietnamese / Asian supermarket. It's located right off of Paxton Street, near the intersection of 29th & Paxton and with easy...", "This is a typical Asian supermarket - a little shady, a little dusty, and has pretty much everything you need. They have a pretty good selection. I wouldn't..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "fki_snJlNNRysGxltRor-w", "text": ["** Vegan Review **\nHad the lunch buffet.  There were 4 vegan items plus an entree.  \nFood was outstanding.  \nI can't wait to return.\nUsed a localflavor.com...", "Ordered take out from this new Indian/Nepalese eatery in the area.  My other favorite restaurant in the area serves the best Mo:Mos I've eaten outside...", "Himalayan Fusion features a great variety of both Indian and traditional Nepali cuisine, as well as a bunch of Vegetarian and Nonvegetarian options. \n\nI..."], "rating": [5, 3, 4], "TBscore": [0.5, 0.0, 0.4], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["lunch"], [], ["indian"]]}
{"id": "aqFtu3hE1UL3iB9Pzy9Tuw", "text": ["The food was really good when I went here. The butter chicken & the dal makhani were both delicious. It was hot and fresh out the kitchen. The reason I'm...", "After my most recent visit/experience here on February 3rd, I have to revise my rating.\n\nThey've bought the adjacent store and decorated inside. The...", "Horrible service !!! I ordered food for delivery through GrubHub. I received a confirmation the delivery would happen between a certain time. The delivery..."], "rating": [3, 1, 1], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["chicken"], [], []]}
{"id": "7QVgcsl2dLo0zxGAvbXveA", "text": ["This restaurant is open with a new owner! We had Chicken Biryani, Lamb Saag, Chicken Tika Platter and Chicken Tika Masala and it was so yummy! It did take...", "This was our first visit here. It is in a strip mall. Not a very big place but they have seating available inside. Not a very fancy looking place. We...", "I am sorry to say that the food was very disappointing. I ordered the mixed vegetables, and while the spices were not bad, what was served was obviously..."], "rating": [5, 3, 1], "TBscore": [-0.36, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["chicken"], [], []]}
{"id": "9aO-8o6qStzbg_R-v9N_VQ", "text": ["The food is really good. The waiting time could have been little better. Overall, this is worth visiting in Harrisburg.", "I've been here multiple times as it tends to be our Monday night \"get together\" spot for all of my road warrior buddies.  It's BYOB (super nice) and has a...", "Small quantity. Normal nothing like good restaurant. Average quality. Bad service. Only good food in this region is at Bollywood Restaurant. Rest are..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "tUo_bqHc9aNQH3ok_e_NKQ", "text": ["It was so wonderful to finally be able to eat here.  The food is delicious and the employees are so nice. I wish I had tried this sooner. This will be a...", "The food was good, I think, but I was really disappointed by my takeout experience. I called ahead and placed an order for the samosa chaat and bhel puri--...", "My most recent visit to Punjab Chaat House is forcing me to reduce my initial rating.\n\nThe Chole Bhature I ordered was disappointing this time.  I'm..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "v8aIUpg1l6wxjbTSvFjRAg", "text": ["Excellent food, gracious service and reasonable prices.  \n\nDon't let the strip-mall location fool you.  This is a very popular spot, mostly for take-out. We...", "Drove there to order food with a completely valid coupon... for literally their location. It was from one of those $25 coupon books that I paid money for....", "Today I had lunch at this restaurant. Totally disappointed . I ordered goat curry , the worst curry I have ever tasted in my life and trust me I have tried..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, -0.88], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "Y0M4qXaBPrf5BNac3junxw", "text": ["I've been coming here for years and I'd really love to give 4.5, not a whole 5.  The lack of atmosphere in the restaurant is the main reason it deserves a...", "I liked my food. We had Samosa Chaat, which was an interesting spin on samosas. It was spicy and flavorful. I then had Chicken Kahari, described as \"spiced...", "This place is a joke, I went in to check the price for a party tray, the person at the counter asked me what my budget was, I thought to myself, does the..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], ["chicken"], []]}
{"id": "BFim59v9zk5UxKnLvypbfA", "text": ["It is a new restaurant and is a nationwide chain.  The other branch in Edison, NJ is very good.  This one in Mechanicsburg can't seem to get their act...", "Their incompetent management, untrained waitstaff, excessive number of children in the restaurant, tiny portion sizes for takeout and lack of buffet menu...", "Mixing dry tandoori chicken and burnt stir fried rice and garnishing it with fried onions does not give this restaurant a right to call a dish biryani. I..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], ["chicken"]]}
{"id": "SCFF6I4qa3oDtnOR3oBwaA", "text": ["One of my favorite mom and pop places! Everyday fresh specials to choose from with lots of rice white or yellow with beans! Good empanadas and wonderful...", "Don't judge it's place by it's parking lot. It does look a little sketchy from the outside but the inside is filled with smells of deliciousness! \n\nIt's a...", "Really good food, best in the area but I am here 20 before closing and they are steady covering up the food to put it away and told me that there is nothing..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "fRFcQriSsxFN_w8tnEfUWw", "text": ["Appetizers are great and affordable, and portions are large. However...the waitress was a bit unprofessional...talked about how sick she was (eww) and, when...", "The day time bartender, Jean, was extreme rude and condescending toward my daughter and myself. After trying to call in for a manager she claimed there was...", "5 stars for this awesome smoker friendly sports bar with billiards, horseshoes, outdoor seating with heat lamps, super-friendly servers and drinkers alike!"], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.73], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "UJtukuglHfa2wXt81keE-Q", "text": ["Don't know what it is but the \"energy\" is always off in this place.  The vibrant happy decor and music do not match the servers personalities.  Never...", "Okay.... I really like the food at this restaurant.  It is great portion sizes. The carnitas is really good, and cooked perfectly.  The Margarita's are...", "To me all of the El Rodeos are the same and that's good that they're consistent with each other.  I don't get to this one too often.  I used to eat at this..."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "vgZq2KsN5_W57Yi-Hbngpg", "text": ["Chipotle. America's first successful fast casual restaurant. If you're not from the USA or have been living under a rock, it's a Mexican restaurant that...", "This newer Harrisburg location is my new go-to Chipotle in town. Fairly fast service and nice employees who know how to make this food delicious. I like...", "Absolutely my least favorite of the burrito joints.  \n\n I've dined here three times. Each time the wait has been too long, and the dining area has been..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["mexican"], [], []]}
{"id": "r6k17tOZiJ43lFwqYnsLvA", "text": ["The environment was okay and food too. a just need to add little bit more spruce and modern up to date. Some staff were friendly.", "We almost ate at a bar a few miles down the road that had 'Mexican' on the menu. I'm so glad that we didn't. The carnitas were the best I've had in years....", "Worst margarita EVER. They couldn't fix it and then said they couldn't refund us... so we were given another terrible after tasting margarita and had to pay..."], "rating": [3, 5, 1], "TBscore": [0.0, 0.23, 0.0], "normalisedRating": [0.2, 1.0, -0.6], "keywords": [[], ["mexican", "bar"], []]}
{"id": "BiXiR7d72iROkm7FKz-dQw", "text": ["Went in here for lunch with coworkers. Anyway this place was awesome the food was great and they even offer complimentary water. We ordered 5  burritos I...", "A classic burrito used to be a staple in my diet at one time. I was excited to see Neato advertise a classic mission-style burrito.  Growing up near San...", "My first time trying neato burrito and I must say I was definitely surprised. My blackened chicken burrito bowl had crazy flavor and super delicious! Only..."], "rating": [5, 3, 4], "TBscore": [0.7, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["lunch"], [], ["chicken"]]}
{"id": "Dqti60WZxQHlPZdzPgcj5A", "text": ["This bowling alley has well maintained lanes. The alley itself is very clean with a no-smoking atmosphere. Johnathan and his staff are friendly and willing...", "Nice facility with a great staff. Was there with a large group and they took good care of us. Updated equipment in a well maintained facility.", "The lanes of this location are nice and the bar is very convenient. I reserved 3 lanes for a birthday party. I put down a deposit for $10 a lane. I called a..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.21], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], ["bar"]]}
{"id": "bsVfUWvKZYQaZsRpTEMVsA", "text": ["It's a fun place,  the people addre very nice and everyone had a good time.  The prices are good and the food was decent.  The meatball app was very good....", "I've been a regular take out customer of sons of italy since they took over cantones.  Well apparently its,again under new,management...they are no longer...", "Great place. Food is good and nice staff. Price is great but can get smokey. They have several bands in and other things going on as well as weekly specials."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "Tat9a3L0xvb7vgZZBp5FAw", "text": ["I found this place on Yelp and decided to go since we were in the neighborhood. The server was very friendly! The food was outstanding, I had veal with...", "RESERVATIONS REQUIRED!!\nI had the nerve to bring my wife hear on our anniversary for a nice dinner, but due to her busy schedule we did not make...", "A friend of mine who is also a hostess brought me here for a bite to eat and a tour (4/10/18). I met the owner and several wait staff, they were all so very..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["dinner"], []]}
{"id": "mr7YS_MZXiwMOxLPsWsWFQ", "text": ["This is our favorite Italian place.  The food is great, the servers are awesome.  I highly recommend the place.\n\nEmily waited on us and she was also 5 star...", "There were 6 in our party last night.  My wife has been there a few times with her lady friends with no issues. However yesterday was different. The service...", "We went there for dinner last night... It was our first visit. After being seated we sat for about 20 minutes without being acknowledged by anyone. A group..."], "rating": [5, 2, 3], "TBscore": [0.49, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["italian"], [], ["dinner"]]}
{"id": "JCHxG-7-2ZZyPPhyIWViwQ", "text": ["Stop in for dinner tonight. Have lived in the area for many years but this was our first time eating at Dafnos. \n\nThe food and service was outstanding!  Our...", "We were hungry for Italian and wanted to try someplace we've never been and decided on Dafnos.  \nWe arrived and were greeted by who appeared to be the owner...", "I really enjoyed my meal at Dafnos.  Took the family there on a Friday night when we all had a craving for Italian food.  We had tried the other local..."], "rating": [5, 4, 4], "TBscore": [0.46, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["dinner"], ["italian"], ["italian"]]}
{"id": "MNZp3NrP8xUhJ4qtUVD8OQ", "text": ["DaVinci's is a great place to eat authentic Italian food in a casual atmosphere. The staff is top notch and makes you feel like family! We always make a...", "I have passed by this place on my way to and from the PA turnpike for years. Tonight I decided to stop and have dinner for a change.  The waitress was...", "This place is great. The food is excellent, my wife went crazy for the sauce they use. She got the Linguine with meatballs and loved it. I got the Angel..."], "rating": [5, 4, 5], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["italian"], ["dinner"], []]}
{"id": "ynoZItEYno99FIEM7sP5-A", "text": ["The cake, cupcakes, and cookies created for my dad and step mom's wedding were delicious!\n\nThe team was a pleasure to work with, and made my step mom's...", "Words cannot express how happy we were with our cake. I was traveling to Hershey for my sister's baby shower, and after my bakery dropped the ball with the...", "I have ordered two cakes from Sweet Confections and they exceeded my expectations both times. I was looking for a very specific design for the first cake,..."], "rating": [5, 5, 5], "TBscore": [1.0, 0.8, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "HDAEirFv3SBdV9zNaNd5NA", "text": ["Absolutely incredible cakes, cupcakes and treats! The variety and quality are out of this world. My daughters most favorite birthday cupcake tower was a...", "For me to do a review of a bakery shop, it has to be DAMN GOOD.  This is that shop.... I've tried different products and I have found myself thinking...", "Great looking cakes that are delicious!! A variety of flavors. I have had many flavors & enjoyed them all. It is hard to find a cake decorator who can get..."], "rating": [5, 5, 5], "TBscore": [0.67, 0.0, 0.5], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], [], ["cake"]]}
{"id": "_PwG8fDiwEqMTosQErtnsw", "text": ["This is a family owned business and you can taste the love and pride they have in their food! \n\nNora and Ed have been baking for a long while and I've had a...", "I got the carrot cake and sweet potato pies. They were both delicious and very tasty!!  You can taste the homemade taste in both desserts. Just call ahead...", "Wanted something sweet before we checked in to the hotel....yelped it and came across this little gem.  Twenty minutes to closing on a Saturday. The owners..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.55, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["cake"], []]}
{"id": "1NyLsXyWGnrTASQhAasIVg", "text": ["Couture cakery made my wedding cupcakes a few years ago.  I am still getting compliments on them!  Not only how awesome they looked, but how delicious...", "I called Jasmine in hopes of speaking with her about a wedding cake and when I reached her via phone she made it awkwardly clear that she didn't want to or...", "I don't even like cake, but this cake was fabulous! We had a 50th anniversary cake made with fondant on the outside and chocolate cake with peanut butter..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["cake"], ["cake"]]}
{"id": "Etr4teybyhYokod6oNhaPg", "text": ["A rare find. \n\nGreat German food in an inconspicuous location.  Don't pass it by based on outside appearances. Parking could be tricky especially if it's...", "I am a 1st generation American, having German parents. So this style of food is home to me. Josie's does it right. Small place but excellent food! The...", "My husband and I were delighted to find this cute little German eatery/import boutique shop on the ground floor of a house in Mechanicsburg on our drive..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["american"], []]}
{"id": "bGOap1sHkpzVq-NP4tVXBA", "text": ["As always this product is great, however if I could give them no stars for this location I would. It is unacceptable for a line to take 25 minutes for four...", "Love Rita's! Mango gelati tastes like a creamsicle So refreshing anytime but especially in warmer weather.  Highly recommend!", "Absolutely terrible experience and will not go back. I ordered an Oreo Blendini, what I got was a cup half filled with custard and some Oreos. The employees..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "euYe3wVicWdSmtCeSzpMUA", "text": ["This is  the best place to go for oriental groceries. it is primarily vietnamese and has lots of other stuff. the rice is always fresh, they use usually...", "My husband and I went to check this out based on Dan's recommendations. It's certainly not as big as Kim's Oriental on Paxton or certainly not 88. It's in a...", "Best place for Asian groceries. Many other bigger places have opened and closed over the years while this place has been around for over a decade.  It is..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "F1nwGJ-oDNjt459D6lAYjQ", "text": ["I love great BBQ and enjoy good BBQ, but unfortunately my visit to Blazing Swine BBQ is neither of the two.  BSB was at a local winery and after watching...", "At Etown Fair- I Ordered THE COW - Brisket was tasty but not enough traditional sauce. The coleslaw needed more creaminess. Heads up, these are open faced...", "At Blaine Vineyards today with awesome BBQ food from Blazing Swine. Had food from them last weekend at Boyertown Streetfest. Not disappointed with their..."], "rating": [1, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "3pKqmisz0kjkIj2J6QNpuA", "text": ["We wanted to stay away from the chain restaurants while in Hershey. This place is a gem! So happy we made the effort to get here. The sauces are all...", "An interesting find in this neck of the woods, but incredibly difficult to find. The location is set back off the road a bit, but it's very close to the...", "Best BBQ in the Hummelstown/Hershey area. You won't be disappointed by the top quality food and service!!\n\nOrder the wings..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.34], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["wings"]]}
{"id": "phkOJkj-joav8iqDNsCt0Q", "text": ["Hands down the best barbecue in Harrisburg. Admittedly, finding Three Sons Barbeque is a bit of an adventure, but I can assure you the search is well worth...", "Congrats, Lukeman, for a wonderful startup! Food was excellent. Tender, succulent brisket, delicious, moist pulled pork and tasty brisket chili. Wings were...", "I'm from the Deep South, so I'm biased when it comes to good BBQ. This place is decent, the quality of the meat is good, it's just not my style of BBQ."], "rating": [5, 4, 3], "TBscore": [0.0, 1.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["wings"], []]}
{"id": "x5HBo2Mq-aygKjIJ9qBqxA", "text": ["First time here 5:30pm got the 3 meat sampler w 2 sides over all was good rib was a little dry, pulled pork & sliced brisket was great, mac & cheese and...", "Stopped for a 6 pack. The place was empty. Surprised that a mix 6 pack is $13.50 but whatever Didn't have time to head to Giant or Breski's. The girl behind...", "A solid 3.5....But close to a 4.  My husband would disagree but there was just something not doing it for me 100%  so anyway...\nThe Hop Yard is located in..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "8q6T22w592Qug-gLdrjbDA", "text": ["Well, heard through the grapevine new owners are taking over.Hurray!!!!\nWent there religiously now you can't pay me to go.A hole in the wall for sure.\nYou...", "My husband and I wanted to go grab a couple of drinks and stay close to home.  We always go to the same places and decided since we were just drinking we'd...", "Stopped for a sandwich and drink last night at 5pm and I will not be returning until it is under new ownership. Food was good and the service was great. The..."], "rating": [2, 3, 1], "TBscore": [0.0, 0.0, 0.41], "normalisedRating": [-0.2, 0.2, -0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "GPoczUUgp0NIdGnPGjJriQ", "text": ["Drive thru experience.  Wife asked for ketchup, server walked away.  Chicken sandwich had quarter sized spot of blue green mold.  Nice.  Run, do not walk away.", "The employees weren't friendly at all. I was never greeted when I walked in. The floors are sticky, the soda machine had ants on it, and the chairs were...", "Visible grease and black lint on walls near order sign. Employee was trying to hang signs with tape and she couldn't get them to stick... Store stinks like..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["chicken", "sandwich"], [], []]}
{"id": "nAwkvzuPkS2CeHz3vm267A", "text": ["I don't know if it's the people or the the kitchen layout, but this place is SLOW!!!!\n\n15 minutes in line just to get up to the counter.  Seemed like the...", "This location has consistently gone down hill in the last few months, not to say that it was 5 stars to begin with. We almost always get the same thing, and...", "They seem to help themselves to free food and not care about customers. The team is so dysfunctional, slow, and no one has a clue to what they are doing...."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "K1RR83LI84REUROBmdclxQ", "text": ["Wow - a meal with an extra helping of Rude. Grumpy service, no greeting, clearly inconveniencing the workers, ketchup empty and had to ask repeatedly for...", "Food was great for being a fast food joint but we got hot fries YEAH. Service was good not the happiest bunch of people. They definitely don't win an award...", "Worst experience at Burger King! Terrible service, so rude,  not welcoming, and irritable workers. Don't waste your time and go anywhere else that at least..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, -0.56], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [[], [], ["burger"]]}
{"id": "UeJIF9WfMm4dgBv7Y6bDpg", "text": ["Above average Cheese steak!\n\nI think that's such an uncool name though. There's more businesses in and around Harrisburg like this one, such as Two...", "Terrible terrible service. Used to love this place but under new ownership. They don't recognize printed coupons, the mgr/owner is extremely rude!  Never...", "Awesome subs.  Got a sausage sub with some fries and it's a meal for two. The fries alone are enough for a meal.  Sub bread is fresh baked from them and..."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "llr6gJajLWO3WZ3JEfFxMw", "text": ["Came here with a large group of friends (20+).  We had called ahead to make sure they could handle us.  No worries!\n\nWe were seated right away at the...", "I'm gonna go for it and just give these guys five stars all the way. I've been here half a dozen times strictly for the buffet at lunchtime and I have been...", "Al's Pizza & Pub of Enola is our go-to place for solid food, friendly service, and good pizza. \nWe eat at/take out from AL's a few times a month and the..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["pizza"]]}
{"id": "Pc0bSujJDxl4Pt_Ke4NsIA", "text": ["I have to review Chuck E Cheese because I have been there more than I would have liked to be due to my children.  Now this Chuck E Cheese is known for some...", "Worst kid place ever! Slooooooowwwwwww service. Seems like managements don't care. Not the kids who work here fault.", "I am biased because I am an adult. To sum it up:\n\nLoud\n\nLoud\n\nLoud.\n\nHOWEVER, from the perspective of a 2 and a 6 year..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "5cl_mzeDKAP_Z9730Zfa7w", "text": ["Received my food lukewarm, chicken looks as if it's been sitting out for a while before it arrived to my room. Also oddly resembles the Tyson chicken brand...", "This place has some delicious food, but none of the tables were clean, the salt and pepper shakers do not work, and the workers were really mean!", "Never been so disappointed! The first time i ordered pizza i was completely disappointed it did not even taste fresh.I decided to give a2nd chance and again..."], "rating": [3, 3, 1], "TBscore": [-0.46, 0.0, -0.48], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [["chicken"], [], ["pizza"]]}
{"id": "nSVZJ6uczIeDUMtKJvA0yA", "text": ["It takes a lot to get 5 stars...the cleanliness of the restaurant was major!!! As soon as I walked in I was greeted by a very nice server, who was very...", "Great Food..Wings on Point, Delicious Pizza. Very nice staff they greet you with a smile. I will visit this restaurant again.", "No slices on a Friday night. WhT kind of pizza place is this?  And the girl at the counter says well if you want any they will be like 8 minutes. Uggghhhh...."], "rating": [5, 4, 3], "TBscore": [0.0, 0.72, 0.6], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "9y6u5IXMwodD9KV1IXxxoA", "text": ["This Wendy's is great! After my bad experience at camp hill Wendy's this one was sad to here of my bad experience. They apologized for our bad experience at...", "STAY AWAY!!\nI will never set foot in this location again. The drive thru line was crazy long so we went inside. Big mistake. Took 20 minutes to even get to...", "At this location when ordering you have to step back a lil ways from the counter because of the FUNKY SMELL that's coming from either the soda fountain..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "JdNGtNiIBQjMSzpHIei_tA", "text": ["Perfect as always! Quick service, nice people and pretty quick too! Food is amazing cuz duhhhh! Wendys never disappoints!", "Not much to say about Wendy's.  The food was served quick and hot.  The frosty's were fantastic like always.", "I used to come here 2 times a week for lunch because its convenient to my job. Stopped after they got the order  wrong both times in 1 week. The  last time..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, -0.25], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "8yiaJfk8hinR2_HnB5jk6Q", "text": ["Checked in on 12/11/2015.\n\nOrdered the following:\n1) pepper jack tomato soup - excellent \n2) broccoli salad - excellent \n3) fresh fruit salad- good \n4)...", "Unless you like essentially sitting in a booth with strangers, ask for a table. The booths are joined by these big windows. No privacy!! Can not recommend...", "I'm so happy I found this place traveling through the area, the food is delicious,good quality  and the prices are very reasonable, somebody comment about..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "IB3djjE9dNaLv41Mbi4QdQ", "text": ["This is a family restaurant, and not what I would consider a steak house, even though they market themselves that way.  Great for families and even large...", "Wow. I mean wow. You would enjoy a dinner from the freezer section of your grocery store more than Hoss's.\n\nThis is supposed to be a steak house. I really...", "Upgraded to 5 stars because of how well your manager and the employee from Altoona handled the asshole who spent the whole meal bitching at the staff that..."], "rating": [4, 1, 5], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["steak"], ["steak", "dinner"], []]}
{"id": "1Dbt1JUqOqRNNHs8w34Zfw", "text": ["Very nice place...Good food and not too pricy.the fresh fish are so good and the jambalya is good too...I didn't like the mussels that much, it doesn't...", "Came here based on a recommendation from the gentleman whom checked us in at the radisson. Sat outside on the deck since it was a nice day out and the...", "Alrighty, some time has passed and I made it back to retry this place. What I found out is that dinner far surpasses lunch. While I still think their hush..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], ["dinner", "lunch"]]}
{"id": "VLMj9MzWIeu_Jn4_Ukp58Q", "text": ["We found this restaurant on our way back from Penn State to New Jersey and we are happy that we did. I had their black and blue burger with a blue moon and...", "Let me say after frequenting this bar and grill in the last year, the one thing that stands out is there seems to be a new face bartending almost everytime...", "Called ahead to make sure we had a table on deck on this beautiful evening ... drove 50 minutes for no service!!! Like none!!! Sitting here at the bar and..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.75], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["burger"], ["bar"], ["bar"]]}
{"id": "XNz3ItrvwRtL_lr4j6fRXA", "text": ["Good food.\n\nSalad bar is normally fresh.\n\nEaten here at least fifty times.\n\nGreat place for kids.\n\nThey stopped using MSG years ago.", "They have a nice salad bar, soup bar, bread bar. Not a huge variety of desserts but you can find something to eat for dessert.  \nWe got a $7.99 meal that...", "Went in once to try it. Salad bar was disappointing. Honsty, I get better food at the supermarket buffet."], "rating": [4, 3, 2], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "Hn3dNlZ8e1NEtrC3ir8nMg", "text": ["Update 7/28/18 - I thought this place and Outback in general started to improve but I guess I was mistaken. My last 2 visits which were within the last...", "Now the service here is great. I went on a packed day and was still able to leave within an hour of arriving.", "Went here for a business lunch more out of convenience of the location than the excitement over the food.  I ordered the lunch version of the chopped steak...."], "rating": [3, 5, 2], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [0.2, 1.0, -0.2], "keywords": [[], [], ["steak", "lunch"]]}
{"id": "rWXsiVeXSy1G0egc-7XZbg", "text": ["Five of us had lunch here today.  Was the first time for a few of us.  Attractive interior, clean and since we got there at 11:30, it was fairly quiet for a...", "First visit to eat at the Hillside Cafe. Had the crab cake sandwich no bread, comes with homemade seasoned chips. The crab cakes and chips were awesome. The...", "The husband and I stopped here for a early dinner never been before I will say that the prices are fair and the staff was lovely unfortunately on the way..."], "rating": [5, 5, 1], "TBscore": [0.24, 0.5, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["lunch"], ["cake", "sandwich"], ["dinner"]]}
