{"id": "P-rYnK2xOM4XPkLSHC0Ubw", "text": ["It was the perfect solution for a quick lunch between my hotel and the train station, and a MUCH better option than the Subway sandwich stand at the train...", "I just kinda can't really recommend this place. :(\n\nI vascillated between giving this place 2 and 3 stars.  And by yelp's own 2-star definition:  \"Meh....", "Tried it for the first time today. I received a $2 off coupon and thought why not. Must say not a big fan of their sandwiches. I found them too bready and..."], "rating": [4, 2, 3], "TBscore": [0.61, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["lunch", "sandwich"], [], ["sandwich"]]}
{"id": "v1xftMu7NLC_gwTz7FRPGA", "text": ["Cute deli on Silas Deane Hwy in Wethersfield! The staff were all really friendly and the place looked super clean. I went during the typical lunchtime; it...", "What an excellent spot for lunch.\n\nNot much to say other than the fact this place really makes you feel like you're in one's home.\n\nWell I mean it looks...", "I have been to cove deli a few times.  I typically choose the #7 Honey barbecue wrap. Although, the food is tasty. I do find that $11.00 expensive for a..."], "rating": [5, 4, 4], "TBscore": [0.31, 0.0, -0.29], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["deli"], [], ["deli"]]}
{"id": "tDw8TiHiLNEIa9EpTD8w-A", "text": ["I was looking to order lunch somewhere and I stumbled upon The Underground Deli. They are located at the lower level of central plaza. The parking spaces...", "After I first discovered this place I couldn't stay away. The variety and creativity in all of their options are impressive. For example, chicken salad...", "I was looking for a deli near my new jib and i was lucky enough to find this spot.   The staff was very welcoming and helpful.\nMy sandwich was made to order..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.22, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch", "deli"], ["chicken"], ["sandwich", "deli"]]}
{"id": "PM2EoZtLvEgNrCrADfTM5Q", "text": ["The sandwich was good but the staff was a little off-putting - not very friendly or helpful. I got one of their specials with smoked turkey, cheese,...", "Around 10:30 on a Saturday, lots of individuals were streaming in for takeaway food. No one was sitting in the restaurant. All of us ordered egg and cheese...", "Best sandwich place in town. Pastrami Lovers sandwich is amazing, but so is everything else here"], "rating": [3, 4, 5], "TBscore": [0.0, 0.0, 0.8], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [["turkey", "sandwich"], ["egg"], ["sandwich"]]}
{"id": "R3bpz1FcOC58VQ9Cc8RHTQ", "text": ["In addition to being the only place open on a Sunday night (or at night in general) in DT Hartford, the sandwiches are great. Al whips up a great bacon, egg...", "The store is cute and the location is great.  Too bad they treat their regular patrons so poorly.", "Delicious sandwiches. Since capital view deli closed, this place is the BEST GO TO sandwich place and there prices are great compared to the other places in..."], "rating": [5, 1, 5], "TBscore": [0.33, 0.0, 0.52], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["sandwich", "egg"], [], ["sandwich", "deli"]]}
{"id": "2dKH9Bbu1kUfWOqLojkL_g", "text": ["First, I wanna start with how much I loved my wrap.. I got the chicken salad wrap and it was honestly some of the best chicken salad I've ever had, perfect...", "Service was fine and preparation well executed...but were it fell apart was the recipie itself...a bad chef is a chef that creates for their taste without...", "Lunch only but a much needed place for multiple vegetarian options!  This place has a mission. They employ people who have had challenges and need a break..."], "rating": [5, 3, 4], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["chicken"], [], ["lunch"]]}
{"id": "Y6D7yaHS-BtnDXX8-3O9ZA", "text": ["Best place local to get a hot sandwich. Beats all the chain sandwich shops hands down! The bread is nice and crispy but on the inside is so soft. The horse...", "I originally walked in not entirely sure what to expect. That didn't last long as a very friendly person behind the counter immediately greeted me. She must...", "Surprisingly delicious and fresh tasting panini sandwiches, and really yummy soups. The ingredients they add to your sandwich are fresh and clean and a..."], "rating": [5, 5, 4], "TBscore": [0.29, 0.0, 0.43], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["sandwich"], [], ["sandwich"]]}
{"id": "JYYI7lIPlaEa_AOyoQoBJQ", "text": ["Stopped by for a smoothie & was nothing short of impressed! The place has a comfy & welcoming vibe and the owner was extremely pleasant! I LOVED my green...", "Juices smoothies and a little food. The space is quiet and large a good place to go and work if you are looking for a relaxed environment. They are next to...", "The space is okay. Drinks are average. I haven't tried the food but this place definitely needs some improvement if it was to survive as a business.\nHas..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "p8jkSj8P0E5OsOsKV6m7ig", "text": ["We gave this BK another try, and had a similar experience... this leads me to think this business is a front for something other than selling food...", "I know it's fast food- But that shouldn't be an excuse for poor customer service! I ordered a #3 (bacon egg muffin) and asked for sausage instead with an...", "Wow been to many bk's and this one's a dewsy very terrible. Once we walked in it had a light Dirty smell  and when we started ordering I noticed Thier back..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["egg"], []]}
{"id": "hk_oySQSIDOQ3Nv1EI5nHw", "text": ["This location needs more staff to handle the lunch \"rush\".  I feel bad for the employees.  There is always a long line and people state getting impatient to...", "this location is bad its comical. All surfaces are filthy. orders take eons. bathroom stinks like cat pee. employees are less than friendly. front door has...", "I have eaten there twice and gotten food poisoning both times. I will never return. Also, it would be nice if they were not the local bus stop waiting room...."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [["lunch"], [], []]}
{"id": "-JZvg6LjqckkzXtVE8w11Q", "text": ["Joint # 41: MAGGIE'S LUNCH TRUCK, East Hartford, CT. Maggie's Lunch Truck has been in business in the same location for 41 years (since 1973). She is a...", "I have been coming to Maggie's for as long as I remember.  It was always a treat when my mom would bring my brother and I for lunch. Maggie, who has been...", "I've been coming to Maggie's since my parents would bring me as a child! Seriously, THE best hot dogs in Hartford County. I haven't had a hot dog better..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["lunch"], ["lunch"], []]}
{"id": "FV-ETP5mrOlfTXZ_H5zKXQ", "text": ["Walked down to Sam's for a quick lunch while visiting my company's CT office and had the lamb gyro. It was absolutely delicious - very well seasoned meat...", "Sam's was delicious! We ordered the combination platter, a beef/lamb gyro, and a side of hummus. All of it was excellent. I'm glad they had authentic...", "Killer gyros packed to the brim. Seriously, they're huge. The interior is beautiful and the staff is friendly. I've also walked by at night and have noticed..."], "rating": [4, 5, 4], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["lunch"], [], []]}
{"id": "jI33PQPeLVN0AzlVBFBNWQ", "text": ["That's right, an update. They found my wallet. Every... single... dollar... remained. Nothing missing. wow. And it was there for nearly a day. I dropped it...", "For a fast food burger place I'd say good job!!   There whoppers are hot and fresh and I always ask for heavy onion and pickle!!!   They never do me...", "Just one simple thing would make this Burger King a ton easier to access: connect the Burger King parking lot to the parking lot of the strip mall to the..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["burger"], ["burger"]]}
{"id": "LIiMAOt5YOXg_Rnp-_nzMA", "text": ["My favorite wing it place and thanks to my girlfriend who introduced me to \"BWW\". I never expected this place to have so many options of wing flavors,...", "I ordered 10 wings.... they said it would be ready at 5:10 I waited inside until 5:30 \n\nThe staff is busting their humps, running around constantly but it...", "I never find anything great to brag about BWW. Their wings are fine considering the variety of sauces to choose from. Other than that, a place to watch some..."], "rating": [4, 2, 3], "TBscore": [0.31, 0.0, 0.36], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["wings"], ["wings"], ["wings"]]}
{"id": "swt-5-PkHAD8i6W6-7rKvQ", "text": ["I have only been here once so far and what a great first impression of this place. We decided to WING IT and come here one day. It was pretty busy on a...", "Nothing to complain about here !  All food came out hot and well seasoned, service was timely and large parking lot.  4 TVs in the bar and pretty good happy...", "Average but over priced for average. Wings were just ok, had traditional buffalo.  Nothing to write home about.  I had a salad with mahi,  it was fine...."], "rating": [4, 5, 3], "TBscore": [0.25, 0.41, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["wings"], ["bar"], ["wings"]]}
{"id": "yffqNzb8Z5InF5QcGAgwEA", "text": ["Since Hooters has tried to up their food game (better quality and a more extensive menu than bar food) it has become an easier place to stop in and get a...", "\"Bad service with pretty faces\" was the quote of the night from a guy friend.\n\nMy quote is \"it was good after alcohol, but not before.\"\n\nMe to other friend:...", "Great Service.  The barkeep was very prompt and friendly.  The Hurricane was as advertised, i.e. strong just like I like a drink.   Not a food stop so no..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["bar"], [], []]}
{"id": "__yjNwnGBodrBTbKApdZNw", "text": ["Came in 20 minutes before the kitchen closed. The waitress was extremely pleasant and welcoming. She welcomes us into the location and happily served us....", "Consistently good food.  Every time we go here it's good.  Fun, lively atmosphere with lots of tv viewing for sports enthusiasts, which I am not, but still...", "So I decided to use the delivery app door dash to order from this establishment. I ordered the sampler and you can choose any 3 apps. I chose chicken wings..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, -0.6], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], ["wings", "chicken"]]}
{"id": "B3Z2yQAjFbK7xz-xfwvfqg", "text": ["My friends and I went for a happy hour and had an awesome time. We shared some nachos that were so good. I had a white sangria that was ok but a bit watered...", "I had the 3 sampler which was delish! Tom had the calamari and it was really disappointing.  No tentacles, way too many hot peppers like they were short on...", "Quiet and delightful atmosphere but non that impressed with the craft beer selection.   Food was definitely good. Cant complain about the appetizers (that..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "O2BMPB5ovNhdXsMvxrwJlA", "text": ["I saw them in front of state house square for years. Today I finally decided to try them out. I had the sea food platter. Instead of the regular fish fry, I...", "This is a great little take out place on the square in Hartford.    The food was reasonable and really really fresh.  They had several different sauces....", "Mr. B's is THE BEST fish fry in Hartford. He'd get 6 stars if I could give him 6. Not only great food at reasonable prices but great guys running it and..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "0SRbRN7CSXv7HahkUpWI2A", "text": ["In the area running some errands so Tiffany and I decided to meet up to grab some breakfast! I've driven past this place many times heading to West Hartford...", "Wicked awesome service! Wicked good food. Husband ordered a burger and it was cooked perfectly. I got the sampler and those mozzarella sticks are HUGE!...", "Seated right away, waitress came right over and we had a very breakfast. It's a diner a d we had a good and efficient diner experience ! My BLT was dry good..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.8, 0.38], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["breakfast"], ["burger"], ["breakfast"]]}
{"id": "Ra5b6wOxTiCTVJQ0PPRPIw", "text": ["Went to Long John Silvers/Taco Bell on Friday, Aug. 31,2018. Ordered the Fish Platter Combo and when I got home, was disgusted with the food. Everything...", "this was the worse place we ever ate. the employees were yelling at each other about orders. this girl came in yelled she wanted French fries and then went...", "This place was dirty and the girl working the register was very rude. I will be going to the one in Plainville."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "Hl-mXua2wkkw5oFUDyseSw", "text": ["I am disgusted by the lack of customer service provided from this location. I found them unprofessional if I could give anything less than 1 star trust me I...", "Slooooooow service. Waited 15 mins in line with no one else in line and 2 cashiers. The cashier who took care of us, couldent remember what we got and was...", "Poor customer service ranging from long lines to wrong orders. No acknowledgement when mistakes are made. Instead you're a nuisance for trying to get your..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "UflVXsJjGG6LgKJxBCjLcw", "text": ["Local KFC.     Never fad a problem. Food is always hot and fresh....  Chicken is crispy and meaty.... I'm amazed with the amount of meat you can pull of a...", "Food is disgusting, workers act like they're doing you a favor taking your money and giving you \".....food\".", "Worst KFC. They forgot about me and I waited over 15 min for food and to pay while they clearly didn't want to work. They could care less about their..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["chicken"], [], []]}
{"id": "BN7FAz30tLmOzGkxK0zl8g", "text": ["Excellent!! If you ever want a wing addiction this is the place. Just don't order on Tuesdays... I'm not sure if the chefs wires are crossed on Tuesdays or...", "It's best for takeout as the place does not have much of a dine in option. Pizzas are really good so are the chicken wings with buffalo sauce. \n\nUpdating...", "Pretty basic pizza place. It's quick, it's fairly cheap and their food is pretty decent. The delivery takes a little longer then other places. But we..."], "rating": [4, 4, 4], "TBscore": [0.38, 0.32, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["wings"], ["wings", "pizza", "chicken"], ["pizza"]]}
{"id": "OYskHiBTY897cELtqtn9xw", "text": ["The truck was at Hartford Hospital as part of their World Market Wednesdays. I ordered something I'd never heard of, a Jibarito. The Jibarito is a sandwich...", "Despite the large crowd and super long lines at this food truck event, I was still able to get my food accordingly.\n\nMan this line was super long yet...", "Jibarito is a great sandwich.  I had it with pork, rather than chicken or steak option.  The owner said that pork was the \"traditional\" way so I went with..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["sandwich"], [], ["sandwich", "chicken", "steak"]]}
{"id": "svLXRAJOSQE9yVEkG6e9og", "text": ["Great Spicy Chicken!!!! Love That Chicken from POPEYES yum yum yum yum. Hot Fresh and Juicy is the best way to go", "It's bad for you.  I understand this.  Literally everything they sell is loaded with fat and salt or sugar.  80% of the workers and customers are obese....", "Popeyes is always my favorite vs KFC.  Always get the bucket of chicken!  No sides, no nothing else.  Chicken and oh yeah, hot sauce."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "8X-N0HWOlWNFQw2SFAnnLQ", "text": ["Very friendly staff.  Very large portions.  Very casual.  Nice atmosphere with Latin music playing. \n\nFor starters a basket of bread and Aji Verde (Peruvian...", "A group of coworkers and I ordered takeout from this place on a long night at the hospital. They said they would gladly deliver, and within the hour, there...", "Another great Piolyn experience. By the way...they have moved from 360 across the street a little. Closer to 399. \n\nI had the seafood chaufa and my friend..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "ZPgTYY253uk1zIbLz2VqqA", "text": ["I'm SOO THRILLED that Pokeman exists! WeHa is consistently at the forefront of the food scene and I knew it was only a matter of time before poke, a West...", "Finally a poke restaurant near me! I haven't ate poke in the longest and decided to try this new spot out. It's located in Blue back square, a beautiful...", "Ok, I love Poke. And this place does a good job filling the void.  The food was good; toppings were plentiful and a decent selection.\n\nBut we need to talk..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "sqrccSQMznxZejVCgPAeLA", "text": ["What a wonderful gem of a sushi joint! We stopped here for lunch on a work trip and they had the freshest and tastiest sashimi. Quick service, great prices,...", "There are a lot of good Thai options in West Hartford, and Sweet Chilli Thai Cuisine is definitely one of them. I was so impressed with their vast menu and...", "I usually order takeout from here and the food and the pick up experience has always been pleasant. I usually get the pad thai or drunken noodles. Their..."], "rating": [5, 4, 5], "TBscore": [0.71, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sushi", "lunch"], [], []]}
{"id": "jLy36Gn1kdT3SSt4HkAy_A", "text": ["Hands down my favorite Thai place in the area ! They have tons of options for vegans/vegetarians to choose from their menu. \nThe place is decked up so...", "My last two meals at East West have been off from their previous quality.  Seems there has been a change of hands, possibly in the kitchen or management....", "This is a little diner with a large selection of Asian fusion dishes-mainly Laotian and Thai.  Lots of Knick knacks and the decor is gaudy in a charming..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "iy-0bAyynbz0-epQUPH_XA", "text": ["Siam is my go-to place for Thai. All the classic Thai dishes are done extremely well and prices are more than reasonable.  \n\nApps:\nThe wonton shells on...", "Siam of Glastonbury is located right next to Whole Foods.\n\nSo a quick tip to start off for those in a hurry, in need of pricey groceries and craving Thai:...", "Pretty good Thai food and the probably one of the best around the area. The restaurant is clean and the staff is friendly so it's nice to eat there or take..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "Tt1rMvtLMMPdvba4w1FyUQ", "text": ["Great affordable place to eat with your family!! The staff is outstanding.. The food is very tasty and fun to eat.", "I can hardly articulate how dirty this place was.  Since we'd already paid (they have you pay upfront), we reluctantly stayed.  \n\nSeveral patrons were...", "Average buffet with one exception...very very cheap prices.  Two for under 20, I was shocked.  You pay first which was different then most buffets but I'd..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "trk8QZf9jN-965xbGFmH0A", "text": ["I grade on a curve, which means that I don't rate a cheap eats place against an expensive fine-dining boutique.\n\nFor a Chinese buffet, this place is pretty...", "One day we'll find a Chinese buffet which suits what we're looking for.\nToday is not that day.\n\nHibachi Grill, to its credit is super clean. That's pretty...", "I should preface this review with minuses against these buffets....but wanted to try a new one and had a coupon \n\nWe were seated immediately and drinks came..."], "rating": [3, 2, 2], "TBscore": [0.0, 0.24, 0.0], "normalisedRating": [0.2, -0.2, -0.2], "keywords": [["chineese"], ["chineese"], []]}
{"id": "X9CMfCnaAprN_mKSJnbFnQ", "text": ["This store has been part of my life since I've been young. It is the best place that you are going to go to for all your Asian needs. Don't expect this...", "There are very few grocery stores that can be considered magical, but to me this is near the top of that list. Once you brace yourself for the chaos that...", "A Dong used to look great. This last trip was a huge disappointment. I'm sorry to say, I have seen a lot better. It's hard to compare this to 888 in..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "4wbgzGEHGYcI1oQo4KESOA", "text": ["We were not prepared for a brunch menu but it was Sunday, so, o well we'll make it work since we love the fish here. To our good fortune there were other...", "I just keep thinking about how good the Lobster Pan Roast is! Just amazing! The butternut squash risotto. Yum! I will say one downside was that the serve...", "My girlfriend has raved about this place for quite a while so we FINALLY got a chance to check this place out, so here we are! My first time coming I came..."], "rating": [5, 5, 5], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["brunch"], [], []]}
{"id": "OtyYa74Hx870G02m-9LMJw", "text": ["Lovely, cozy, and tasty place to eat. The inside was not what I was expecting, it was like walking into someone's living room--very charming. We were seated...", "I'd been meaning to try Arugula for years, because I'd always heard good things. A recent write-up on the WHSquared site (for those who are not familiar...", "Arugula is a great choice to enjoy the WeHa restaurant scene at a venue that is slightly under the radar compared to the really \"hot\" places. No outside..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "amw8yXriTbD20SQN32IXzQ", "text": ["Food: This place is the Chili's of seafood restaurants. The food is decent, today I went and everything was hot on my plate except the crab legs. They felt...", "The wait in here is usually ridiculous. My advice to the company is to hire more staff . I visit at varying times from lunch to dinner time and it seems to...", "3.5 stars\n\nMy sister wanted to treat me to Red Lobster, we hadn't been in years.  \n\nThe parking lot was full so we parked on the street but thankfully the..."], "rating": [3, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.2], "keywords": [[], ["lunch", "dinner"], []]}
{"id": "-sk5l_az-1JbJjoa97u_gw", "text": ["Authentic chewy bagels with a nice gloss, the best in CT. Take home a tub of cream cheese or better yet have them toast up and prep your bagel there. They...", "Best bagel I have had!! I stopped in one day while working in the area. Decided to try a bagel with cream cheese - it was amazing! My only complaint is...", "This could be a great store - the food is good and there are more options than previously. The biggest problem is their customer service, especially in the..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "nNq4sdShcI3w4sMqIRGHRA", "text": ["Very helpful employees and the store is usually always very clean , it's just too small very difficult to manuver through the aisles when the store is busy,...", "I came to this location on a busy Sunday afternoon. I swear it felt like I was in Walmart with all of the people and kids everywhere. I like whole foods as...", "I had no idea that Whole foods delivered! The first time you use their online ordering system, the delivery is free. I had classes all day and knew that I..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "L6G8P4mqCK4bwXr00Z0fUA", "text": ["Fav market! Great produce, great sales and organic options!\n\nCome on Sunday mornings and get the breakfast bar food, always so delicious! And the salad bar...", "This is not a great Whole Foods. The prepared food section is abysmal - nothing looks appetizing, everything is kinda the same color and looks cooked to...", "I drive from Vernon each week to shop at this Whole Foods. For me, it's worth the drive, even though I do wish it were closer to my house. I try to buy..."], "rating": [5, 2, 4], "TBscore": [0.93, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["bar", "breakfast"], [], []]}
{"id": "Yl4LA2kTr2eC4On74vYScw", "text": ["A friend & I ate there yesterday. There were gnats flying everywhere, landing in cups of water. Flies were around, landing on the food, walls etc. Was very...", "Hotel room service prices, but the food isn't as good.", "I usually grab a breakfast sandwich from here when I am running late in the morning (scrabbled egg, ham, + a slice of tomato). Needless to say, I am a fan."], "rating": [1, 2, 4], "TBscore": [0.0, 0.0, -0.35], "normalisedRating": [-0.6, -0.2, 0.6], "keywords": [[], [], ["sandwich", "breakfast", "egg"]]}
{"id": "l40kJxKvOo243D_hLgIZKw", "text": ["Average service. Normally they're pretty quick & handle your order fine. However, some employees here have issues tending to customers in terms of merely...", "Someone please tell me why anyone buys subway?????!!!!!! Skimpy on the meat the subs are pretty much all bread smh.", "Shocker, I know......I usually can't stand the 'chemical' taste of Subway, especially when we live so near to tons of wonderful Italian and other..."], "rating": [3, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [[], [], ["italian"]]}
{"id": "1-gagSuGrn4f8o5c8L3qOw", "text": ["This is one of my favorite places to go around here for food because the customer service is AMAZING! I haven't had the Yelp app on my phone in a while and...", "I think a subway is a little ridiculous in this area, there are a lot of very good sub shops and places to eat, they sort of stick out like a sore thumb....", "Subway chain......need I say more?\n\nUnclear WHY oh WHY one of these would open up, amongst the amazing  sub shops of Little Italy, here in the south..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "42vfxWhQWilWuzHliiWoKQ", "text": ["They made my sandwiches pretty quickly. On the day I came there was no line. They took my coupon without any problem\n\nThe bread tasted a little off. I got...", "Generally as far as subway goes. But now this is 2 times i have been in there and the girl making the sandwhich could not be lazier. She just throws the...", "It's does not matter how early in the morning I call it is ALWAYS an issue to order party platter over the phone. They have every excuse of why they can't..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["sandwich"], [], []]}
{"id": "VFM5Kb24x0Kr-VtFT5BhTw", "text": ["Quite possibly the WORST customer service I've ever received. Came in yesterday around 6pm or so for a quick dinner with the family before a show. When we...", "If you work or live downtown, you damn well know there aren't many late-night options. It's a standard Subway, perfectly average and ordinary experience....", "This location over charges you and refuses to honor their advertised pricing.   They give you next to nothing for meat on the sandwiches and by far are the..."], "rating": [1, 3, 1], "TBscore": [-0.22, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [["dinner"], [], ["sandwich"]]}
{"id": "M14naQU59eBujg9-c_-OOw", "text": ["This is my go to meat market-I can always count on the nice butchers to give me recommendations and suggestions on preparation/cooking. It's a small market...", "Our \"Go To\" for ANY Cut of Beef, Poultry, Pork, Lamb or Beast for special occasions or if we want to pamper ourselves.  Beyond that the meat counter offer...", "I go there for red meat. Meat is fresh. Look at their flyer for the week before hand. Shop is a congested place. Many times you will hear excuse me. They..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.36, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["beef"], []]}
{"id": "TtOP-8iOA7hXs6eoPvGEGA", "text": ["This is one of the cleanest Subways I visit so I do not mind going a little out of my way to come here. The owners a pleasant and orders through the app are...", "When Zero stars is not an option.\n\nPeople who have no decorum whatsoever and don't appreciate their customers shouldn't have customers.  After my experience...", "Nice little family owned franchise that is very clean in the dining area and peering over the counter sneakily. \n\nThe employees are friendly and unless it's..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "e_2l5WRD1nT3Mh9tTMgUiA", "text": ["Friendly staff,  consistent food quality. Would prefer avacodo instead of guacamole...it's too spicy for me.", "How you go to Subway at 11:30 in the morning on a Sunday the employee  talking about is no bread but wheat bread that's like going to Burger King n they...", "I like coming to this Subway if I forget my lunch for work.  Friendly staff, and they're efficient and on their game.  They offer good deals at this..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], ["burger"], ["lunch"]]}
{"id": "-a5ESqiA8CaMqBglfXoSJQ", "text": ["For people working in downtown, the location is ideal. There is a good number of tables. From sandwiches, I liked the chipotle chicken avocado melt most....", "They got my order wrong they were curt and rude. When I asked to use the bathroom they asked for my receipt. I'm very immobile due to recent surgery and...", "Probably the worst panera bread in CT. First off the hours are super weird but I guess I understand that since a lot places in and around downtown hartford..."], "rating": [3, 1, 2], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [["sandwich", "chicken"], [], []]}
{"id": "w4Z13Q2gt4LL7V_y4R_gLA", "text": ["The Sloppy Waffle is just that.  My Gluten Free daughter has long awaited the moment she can indulge on a worry free Waffle.\n\nThis is a hard concept to...", "This was a great breakfast spot that I came to with my sister. There's indoor and outdoor seating, friendly staff, and a huge menu to choose from. When you...", "The breakfasts are amazing. I have never seen a  pancake this size before. There is a restaurant in Salem ma that says they have the biggest pancake - NO..."], "rating": [3, 4, 5], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [["waffle", "gluten"], ["breakfast"], []]}
{"id": "4Hhpzz1OxthsZHOMX5kYvQ", "text": ["This place is awesome!\n\nGood service, good and prices!\nWaitstaff is always nice!\n\nSunday between 10 and 12 its extremely busy so I wouldn't go there then...", "We went for breakfast on a weekday. It was not too busy with a 1/4 of the tables full so we were seated quickly. \n\nPros: great pancake and syrup options,...", "Second time at chips, this time there was no wait and they didn't mess up my order, so they deserve a 5 Star. \n\nI got an omelet with toast and potatoes. For..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["breakfast"], []]}
{"id": "N8fskTJOHViVQ5sH8FfOsw", "text": ["I've always bashed on Thai rolled ice cream because it seemed like such a gimmick. You pay $8 for your frozen dessert and what you end up with is more air...", "After the novelty of the show wore off, I came to realize I was left with 7 dollars worth of sub par ice cream that tasted no better than inexpensive...", "It was a nice experience going for icecream here. Tons of flavors to choose from, good combinations and lots of toppings, offered in unlimited fashion. I..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "mQl_haqy0c6Y8WqonoMXgw", "text": ["This place is instagram explosion. \n\nEvery inch of the place is made for you to take IG photos. It is very nicely put together, but can be seen as hectic or...", "The ice cream is so so good, rich and creamy, but the extras that make it really expensive are not worth it. I've had the bubble cone before and knew it...", "Kept hearing a lot about Milkcraft and just couple days ago I tried with my family. The portion size of the bubble cone is humongous(Any ice cream for that..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "7H8AJyquIeIN_25ab_H6mA", "text": ["Spot is a nice option for breakfast in WH where you can definitely bring a big group and commandeer a community table. I've had the burrito, omelette, and...", "Love the location of this coffee spot. The​ layout is very open and is usually busy with people catching up with friends/family as they visit blue back....", "Recently tried their bagels, granola cup and coffee on a Saturday morning. The bagel was plain and choose veggie cream cheese, loved the filling it had..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [["breakfast"], [], []]}
{"id": "3tr6DVpDi5pL131-5TWg7Q", "text": ["I love frozen yogurt. And I like that Sweet Frog lets you pick as much as you want and then pay for it. This means I can eat a few bites ( rarely happens )...", "Self serve , ton of great flavors , toppings . Yummy and more healthy !! Good seating inside and few outside . Ummmm will be going a lot more this summer!", "We love coming here! The place is clean and colorful! We love the different seating options and more importantly, we love how they have a good amount of..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "3D1wqLQWB6r6fj0MlWV9qQ", "text": ["This little luncheonette embodies the term \"greasy spoon\" but I find it completely endearing no less. I met up with a friend yesterday for an early...", "Went here for breakfast on a Saturday morning 10am and were seated outside without a wait. Server was very friendly and extremely fast. \n\nFood was just ok,...", "Visited this coffee shop several times now. I can say it is a genuine 'local' hangout for the elder Glastonbury set. Few young people at 9:30 am and that..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["breakfast"], []]}
{"id": "2bQug7bkOBhLqEsGevI5yA", "text": ["First time and very impressed! It was exactly what our family was looking for at the end of an early winter day. Solid assortment of Italian dishes with...", "My partner and I are always fans of a good brunch, so when we were looking for brunch on the way to Stews, we decided to try Elaine's. We were excited that...", "I came home from Elaine's on Thanksgiving thinking I had a good meal but the more I thought about it and had my parents input the place sucked.  First off..."], "rating": [4, 3, 2], "TBscore": [0.27, 0.54, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["italian"], ["brunch"], []]}
{"id": "Fv6qjH1v7bvYCxYn2YoYHw", "text": ["Baskin Robbins as well as a dunkin' donuts. It's in Glastonbury. It's okay. Not much to complain about. I guess you can say the floors and tables are pretty...", "You can't beat their ice cream, especially if you get it hand packed (the pre-packed quarts are light on ingredients such as chocolate chips, etc)....Its...", "Baskin Robbins is in the same space as Dunkin Donuts. I recently purchased yet another ice cream cake from this location. Once again, the design was perfect..."], "rating": [3, 4, 4], "TBscore": [0.22, 0.0, 0.33], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["donut"], [], ["donut", "cake"]]}
{"id": "rBog8VKKRFoaVOLodByr9g", "text": ["Recently, we went to this place that we frequently patronize for family lunches and dinners and put in a big (for us) request. I had a landmark birthday...", "This was my first time experiencing this place. It is not the type of restaurant where you are abls to dine in. I ordered a small curry shrimp with veggies....", "Not a lot of parking options, you either have to parallel park on a busy stretch of Farmington Ave, or find a spot in the tiny lot in front of the stores. I..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "S-ruRdlCTzopGKStnfyV7g", "text": ["Food's Aok here, it's good but nothing special and tastes similar to other hospital cafeterias. The specials are worth trying out and is usually the best...", "The cafeteria is definitely changed of the past few years. Initially it was run by a company that did a horrendous job, with barely palatable food. However...", "For a hospital cafeteria, this place is great. There are tons of options! A large salad bar, grab and go wraps, salads, and other various items. A grill, a..."], "rating": [3, 3, 4], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [0.2, 0.2, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "pdluVvu_MYVzCggKmaeNGg", "text": ["Today was our first visit to the Main Streat Creamery. We were lured in by the seasonal ice cream flavors. The pumpkin gingersnap was really, really good....", "The Place is Magical esp you have the opportunity to sit on the outdoor chairs.\n\nEating Ice cream surrounded by flowers and facing the Calm residential...", "Main Street is cute, truly, but the ice cream just doesn't stack up. \n\nIt's located in Old Wethersfield on a street studded with a few other small eateries...."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "tkqUvbv_rjEB7FplHN-rvw", "text": ["Best pho in CT, hands down.\n\nThis pho is on par with the best stuff in LA and Seattle. Hot, savory broth... tender meat... perfect ratio of cilantro,...", "Came in for pho with my family on Sunday morning and was delighted with our experience! Although this wasn't my first pick, it won the day by opening at 10...", "The word \"AUTHENTIC\" Vietnamese food caught my cousin and I's attention to come here and try it out because we love Vietnamese food. We actually tried this..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "S3iT_VNf4CGvt4cbPjbMwQ", "text": ["Carvel in Glastonbury gets 5 stars for their hard ice cream which is served at the perfect temperature. I have never had a crystal of ice in their product....", "Was walking to my car after leaving Tisumi for lunch and my radar picked up CARVEL tucked in the corner of plaza.  Well, with a mind of their own my feet...", "Freshly made soft-cover sundaes at a BOGO price every Wednesday? I'm in. The value for the price is good, and there are always coupons available for Carvel..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.6, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "iV2LTytGNYD-BwIHL_8aWQ", "text": ["It's so sweet - literally - to have Bloom Hill a mile away from me. It's insane how even on a dreary, chilly day, the parking lot is packed and the line is...", "The ice cream here is pretty good, Its toward the harder side 1. Because it's organic 2. Because it's ice cream....REAL ice cream. \nThe prices of the ice...", "This was a great recommendation by a relative who lives close by.  Great flavors, huge portions and fast service. A definite \"must\" if you're in the area!"], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "beiKhyBRtUao6frHOUe1yw", "text": ["We had an excellent breakfast yesterday. Came here spur of the moment and were seated right away, ordered quickly and our food also came out fast. We both...", "I've been to this restaurant twice. It's a 24 hour diner restaurant with a large menu. Many different items and they supposedly make all their dessert...", "Each time I've been here it has always been a pleasant experience!  The staff are pretty friendly and attentive.  The eggs and corned beef hash are exactly..."], "rating": [4, 3, 3], "TBscore": [0.45, 0.0, 0.44], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["breakfast"], [], ["beef", "egg"]]}
{"id": "AgegodMCdwpp65yxAWSb-w", "text": ["I loved coming here for a chicken salad, some hot peppers on top and a bowl of chili! And don't forget to pickle on the side.", "They have Turducken sandwich during thanksgiving time. It is a combination of turkey, duck and chicken. I liked it. It has a slight sweetness. Mediterranean...", "After eating there for a few times I find it a quick and efficient way to grab a sandwich or salad.   Today I had a chicken salad salad which was excellent...."], "rating": [5, 3, 4], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["chicken"], ["turkey", "sandwich", "chicken"], ["sandwich", "chicken"]]}
{"id": "4AxI4PMLrVqGLD_8GfAWyg", "text": ["Slam Dunk[in'] with the service!!\n\nI've been to this Dunkin' many, many times (how am I not the Duchess?), and each time I receive outstanding service.  I...", "The WORST service ever. Especially being in a new location, I would expect the staff to be friendly...nope. So rude and they got both my friends and my...", "Just went to order some donuts for my nephew and niece and the woman taking my order could not have been more rude! I was actually contemplating calling her..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["donut"]]}
{"id": "ClQ47mokAP_fw9eWj-1OcA", "text": ["I can't believe I never knew this place existed.\n\nI've been walking by this place for months and had absolutely no idea I've been missing out on such a...", "Tea is just the best. First of all, there's just so much to choose from, no matter what your preference or mood! Secondly, it's pretty awesome to drink...", "I really wanted to like The Green Teahouse, but I just walked away feeling cheated. It seemed like they really cared about their tea. \n\nTheir special..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "jwQo8jIL7v9_4x4rbbogXg", "text": ["Ever since I've had my first Bumski's donuts I have been dreaming about them every night. Easily the most delicious donut I have ever had.\n\nI had my first...", "Bumski's Donut Truck has been outside of State House Square, downtown Hartford for the past couple weeks from around 8am to after 2pm. So far I've tried one...", "I need to eat another donut like I need a third arm. Actually, I do need a third arm because I could have two hands for  keyboard + mouse and  another..."], "rating": [5, 4, 4], "TBscore": [0.49, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "56W-leTGaSjDY0hGqdBsAA", "text": ["Ok ......   If you live in Newington you know that We have about 8 Dunkin Donuts in Town...   I'm gonna tell ya forget about all of them and Go to King...", "Newington, ct residents speak about Kings Donuts in hushed tones  throwing anxious side glances hoping no out-of-town people find out about this hidden...", "A work buddy brought in a dozen from the Manchester store, they were beautiful, old fashioned donuts made with care.  So many establishments now (leaving..."], "rating": [5, 4, 3], "TBscore": [0.32, -0.21, 0.48], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "XzJxJSJj9WnkAqecDGyQfA", "text": ["I definitely prefer the Manchester location over this one. The gentleman who waited on me was very nice. However the shop itself is not very inviting. I...", "Pleasantly surprised... Coffee was just as delicious!! Amazing donuts... Tell everyone! Yummmm", "A cash only sign on the door would be a great idea. I waited five minutes for the old man to come out the back, and take my order. He had my donut, bagel,..."], "rating": [2, 5, 2], "TBscore": [0.0, 0.62, 0.23], "normalisedRating": [-0.2, 1.0, -0.2], "keywords": [[], ["donut"], ["donut"]]}
{"id": "PTK3OHVmgA-9Gys82fZBZw", "text": ["Note: this location is right next to the Cabella's entrance! \n\n2-3 patrons in line around 11:30AM on a Saturday. \n\nPros:\n-More flavors than I was expecting...", "At Brimfield Antiques Fair, we ducked a rainstorm by taking cover undee Faddy's tent. They were making the doughnuts fresh onsite and the air smelled of...", "The donuts are good, but I wasn't a huge fan of the raised donuts--they were a bit too greasy for me and not very flavorful.  The cake donuts on the other..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.5, 0.22], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], ["donut"], ["donut", "cake"]]}
{"id": "oI6D70v5G9j6A4kz-qFghg", "text": ["After walking through two doors to get into the shop. You mostly witness quite a long line as this is located right in the purview of Travelers Insurance...", "This is probably the busiest Dunkin if downtown. They have enough number of seats. During peak morning hours there is a queue. For holiday they have special...", "During the work week the line is always out of control long. Soul crushingly so.  But the line moves at a good pace because of efficient workers.  \nAnd the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "PXfjZ75NWWYzoPVY_4svAA", "text": ["So rude.  I stopped in when there was no line just to grab a cup on the go and was refused service.  I will never be back.", "Just your standard Dunkin Donuts, perhaps, but the service here is what makes it four-star-worthy.\n\nI ducked in here just before 7 on a cold night to get a...", "Heck, I understand this is just a Dunkin Donuts.  All the need to do is have fresh donuts, make some sandwiches, and serve beverages.  So, if that is the..."], "rating": [1, 4, 4], "TBscore": [0.0, -0.3, 0.3], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [[], ["donut"], ["donut", "sandwich"]]}
{"id": "hTHgZbRd_5Tp_apdwaCrrA", "text": ["I get my on the go here because it's \"convenient\" but they need to fix the drive thru situation.\nThere are two entrances and if you come rom Farmington Ave,...", "Worst Dunkin Donuts Ever! They really need two cashiers in the morning. All I wanted was 2 orders of hash browns but the wait was 15 minutes.", "Worst Dunkin' Donuts ever!\n\nWe just waited over ten minutes in the drive-through and we were the third car.\n\nMy iced tea was actually not tea.  They gave me..."], "rating": [2, 1, 1], "TBscore": [0.0, -0.4, -0.25], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], ["donut"], ["donut"]]}
{"id": "qRQlt5SEL8Y1vaup9DEsRA", "text": ["This Starbucks is inside the UCONN store. Store has books, UConn clothings and similar stuff. Coffee cake was nice. It had something crunchy topped in it. I...", "This is the worst Starbucks I've ever been to. I leave the line more often than I stay and wait for the register because they are unbelievably slow. Like 5...", "This Starbucks is the worst. Staff is friendly enough and the food and coffee are mostly the same mediocre Starbucks that you'd get anywhere, but this store..."], "rating": [4, 1, 2], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["cake"], [], []]}
{"id": "Veb55HhVJ2BkRDRQu_JwkQ", "text": ["The workers here are usually polite and friendly, but the service kind of stinks.  Heaven forbid a person in front of you orders something to eat.  That...", "A trip to the Northeast is not complete unless you visit Dunkin Donuts!  I was taking the train from Hartford to NYC early in the morning and needed some...", "Worst customer service ever. The guy at the front counter gave me so much attitude and sass when I asked one simple question. I went up to him with such a..."], "rating": [3, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [[], ["donut"], []]}
{"id": "CTIkcOX5qNEZTyHZ03QJvg", "text": ["This Dunkin is conveniently located within the State House Square food court. In morning time, there is a good queue,  but the line moves fast. As the food...", "Ain't no DD like the SHS DD. \n\nFor serious.\n\nThe staff here is the best DD staff I've ever encountered. They are always smiling and chatty, remembering not...", "The staff is really nice, but how my coffee gets made definitely varies from day to day.  This one is inside the State House Square food court.  They do..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "L79kKG35heojY2F1xlg_7g", "text": ["I wanted a nice fresh cup of coffee, when got there and ask for a medium one it was not fresh because it tasted like it was in the pot for a very long time.", "This is the most disgusting Dunkin Donuts store I ever visited in my life.. Two lazy guys were just standing by the register and busy checking their phones...", "Costumer service is always superb; drinks and meals are always on point. My client, a gentleman w/ mental disabilities, is always welcomed by all staff;..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], ["donut"], []]}
{"id": "b1tVTBzTQoAPn_4z_3PHBA", "text": ["I don't know what it is about this Dunkin' Donuts location, but they seriously hire the nicest employees ever!  I've never actually been inside this...", "Worst Dunkin' doughnuts ever. Management is rude and unprofessional!!! I will never step foot back in that store.", "There are so many problems when coming to this dunking donuts\n\nFirst the parking is regularly a cluster of confused souls trying to maneuver vehicles. I..."], "rating": [5, 1, 1], "TBscore": [-0.21, -0.53, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["donut"], ["donut"], []]}
{"id": "BBbwFY-59PTaj4GphPAYcg", "text": ["As you can probably tell from my other reviews I frequent Dunkin for coffee and wake up wraps. I have a few trusty ones, but honestly a lot has to do with...", "The staff was incapable of making two teas correctly after I repeated it twice at the drive thru and at the window. Still made the wrong drinks! When the...", "I pull up to the drive thru and I'm asked \"What do I want \"? As if I'm being such a bother . Then I ask that I want a Pumpkin latte and a large reg coffee...."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "GEnLT_-kBBxykmLRA-kn5A", "text": ["Brazil Grill is one of our favorite hidden gems in Hartford. My partner goes all the time and I go sometimes when we're in town. \n\nIt's definitely not...", "The meats were flavorful. I felt the atmosphere was relaxed not sure about the decor seemed confusing.\nWhen you enter you are faced with a register directly...", "I got introduced to this place several years ago by a family member and have loved it since. I would definitely recommend especially if you have not tried..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "KdH47rLFb8Pe41oEysxnDw", "text": ["Amazing restaurant! Really fantastic service and delicious, authentic food. You can tell that everything served is very fresh and has a genuinely authentic...", "Dinner salad was nicely prepared and house dressing very good. Had beef rib special. Big portion, so tender and taste. Attentive service. My second great...", "Great authentic Brazillian cuisine! Had a great time with my wife and kids! Would definitely come back when I am back in Hartford ;)"], "rating": [5, 5, 5], "TBscore": [0.0, 0.44, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["dinner", "beef"], []]}
{"id": "mAS9Vd9EfWMrHOLAntnPNg", "text": ["Ya Mon, that's the stuff, Mon!\nReally good Jerk Chicken!\nGreat service.\nI was not sure what to order, so she let me taste the curried goat before I...", "Line is pretty unorganized and they did mess up my order. Wanted oxtail not beef BUT their food is still banging and I understand it was a lunch rush so one...", "Checking this place out for the first time with a coworker I had the pleasure of enjoying two beef patties with a cream soda to wash it down. It has all it..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["lunch", "beef"], ["beef"]]}
{"id": "KwVDqwYHTIxFOVbA1O-OGg", "text": ["Great pizza and friendly staff! Got the buffalo chicken pizza for pickup and it was delicious. Came with onion and bacon too. The staff was very friendly...", "Two words : Food Poisoning!   \n\nThis is the second time I got it from Harry's in the past few months.  The first time, thought it was a fluke and not the...", "Ordered GF pizza.\n\nIt had soap all over the bottom of the crust.  They apparently didn't rinse off the metal tray they cooked my pizza on.\n\nOther places use..."], "rating": [5, 1, 1], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["pizza", "chicken"], [], ["pizza"]]}
{"id": "gsgulWI6ODyypcq4H94ZRA", "text": ["Easily a top 3 favorite pizza place that I've ever visited.\n\nNot only do they feature inspired specialty pies, apps, salads, and more-- but they also have...", "If you are WHITE please ignore this review. Y'all just wanna be in West Hartford. \n\nThere straws are cardboard literally. That being said they have good...", "Had a great meal here last night. Service was friendly and prompt. Atmosphere is comfortable and feels like a slightly upscale version of an old-school..."], "rating": [5, 3, 4], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["pizza"], [], []]}
{"id": "whjU2KTc5-n6BDZjd4nZ0g", "text": ["We love it so much. Always a go-to for any occasion ! The pizza is huge and delicious! Thank you", "Thick crust, not too sweet or salty sauce, no shortage of toppings, and that delicious Greek-style you remember from \"back home\" - Park Lane hits it out of...", "I've been coming here for a long time, the salads are terrific and the pizza is decent.  They definitely could use a make-over. The parking lot is a puzzle..."], "rating": [5, 3, 3], "TBscore": [0.54, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "RQTiIN4O7u5cl6UOAsN1lA", "text": ["Was in town for a labor day weekend wedding and we got there around 9pm. I knew my free time would be limited for food exploration but I 100% wanted to make...", "3.5 stars,\n\nHad Pepe's for the first time in my life! It was pretty good pizza, but not even close to the best I've had. The flavors weren't there, and my...", "Decided to come here for Friday night dinner right  before closing at 9:37 pm (not smart) . However, once we were seated and our order was taken, the food..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.57, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["pizza"], ["dinner"]]}
{"id": "PF3uA1MAjtVIgx38N-2Pbw", "text": ["When the RedSox win in the 2018 Postseason \nGet a Free Slice of Pizza the next day. \nGreat Staff. Serves pizza with a Smile every time. \nThin Crispy Crust...", "I love this place! The foods good, the people are nice and the environment is clean and has a modern feel. \n\n\nThe pizza is thin crust and toppings can be...", "After having heard a lot of good feedback from my friends, i finally made it to Harry's Pizza and I love it. The newly renovated interiors giving it the..."], "rating": [5, 5, 4], "TBscore": [0.32, 0.35, 0.33], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "6tcdVtNigf6uOtUsVjEBGg", "text": ["Ordered the Italian Lovers pizza minus the sausage and oh my goodness. I was so surprised. The pizza was loaded with the toppings. The crust was crunchy....", "Worst place ever , ordered online and never got my food , when I called the place they were very rude and hung up on me multiple times , told me to \"call...", "$15 order $1 card charge. I am done with them. Used to be st. Pepperoni  now its rob you cuz they think they can. I wanted three slices came to over 10 and..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["pizza", "italian"], [], []]}
{"id": "77Xc5g74VdKeAYWQIfD7mw", "text": ["There are a million places you can go to get a good pizza but when have you ever gone through a drive through to get one? For $10 bucks and 2 mins to spare...", "It's always fun to try new places and 1k* is a great new fast food place that I'll definitely be adding to my list of places to visit. \n\nPicture Subway but...", "This is a new Pizza chain. Today was the opening of this restaurant in Glastonbury. The concept is very similar to Chipotle. You can pick a Neapolitan or..."], "rating": [3, 4, 4], "TBscore": [0.7, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "V9920IH-YHFVb7a6qkiB8w", "text": ["This place is underrated for their pizza. Nice thin crust pizza I get the simple Mozzarella pie every time and it never disappoints. Great location right in...", "When in CT, clam pizza is the baseline against which all pizza places should be ranked. The clam pizza here was awful. The clams were all cut up into bits...", "Pizza was fine but don't use delivery. Took 1 hr and 45 minutes for pizza to show up....and still waiting!"], "rating": [4, 2, 1], "TBscore": [0.26, -1.0, 0.52], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "5pdu1_JmHhzCgRhCOnkBVg", "text": ["If you're ever in my home town.   Get a large Wilson special from here.   You won't regret it.   \n\nCrust with just the right amount of crispness.  Tons of...", "Ordered from Wilson and got a delicious small cheese pizza. I know getting a cheese is boring but it was very good and very cheesy so I can imagine that...", "I've been going here for close to 50 years.  I remember the old place before it burned down.  We used to drink beer at the Polish Home down the street.  You..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["pizza"], []]}
{"id": "A8PqHbhq7unWpXs1prpM9A", "text": ["Great food, competent wait staff, never disappointing. Best pizza in Hartford County and beyond. Ice cold Coors Lite on draught always as good as any draght...", "I thought about this review for the last week and I can't live with myself if I don't share. \n\nWe went to The Old Town bar for the first time. The kitchen...", "HOW have we lived down the road from here and my husband just NOW took me here?  I swear that they have one of the best bread baskets I've had in the..."], "rating": [5, 1, 5], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["pizza"], ["bar"], []]}
{"id": "0it1DlzI0RWLd-TVgCXhrQ", "text": ["Best pizza in East Hartford been eating Queens since it was located next to Dairy Mart!!", "I order a small Special Pizza for lunch, called a head to dine in. It was good, the staff were nice. It was clean and cozy place. Location is easy to get to...", "I've had their take-out pizza before, but I had never actually dined in until last week. The small pizza was perfect for 2 people to share, their Queen..."], "rating": [5, 4, 4], "TBscore": [0.5, 0.29, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["pizza"], ["lunch", "pizza"], ["pizza"]]}
{"id": "cdfw2wfLPUfOmY2c8Y-ceA", "text": [":::: WARNING STAY FAR AWAY:::: Do you always sell pizza with extra protein cooked into it? This beetle was cooked into the crust of our pizza. When the...", "Perfect pizza for curling up and binging Netflix on cheat day. The grand reopening has been awesome for pickup. They are busy with orders into the late...", "Ordered 2 chicken salads and a small Pizza and at $40 I got a greasy disgusting pizza, oregano infused oil for dressing, oregano on my salad and garlic..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.46, -0.62], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [["pizza"], ["pizza"], ["chicken", "pizza"]]}
{"id": "XgqoZ0VKXUYtvkNJE7MMNQ", "text": ["The best kept secret in Glastonbury. Family run, next to Whole Foods. Best pizza in Glastonbury. \n\nDefinitely recommend.", "Don't know why I procrastinated for so long. I have been coming here since 5 years old with my parents now 30 years later I'm here with my kids letting them...", "I am a bit of a pizza snob... being from NY, you kind of get that way. My fiance and I stopped in here based on a recommendation from a friend. I was a bit..."], "rating": [5, 5, 4], "TBscore": [0.3, 0.0, 0.6], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "TOgjoTUQulHHK1EVpQ_iTA", "text": ["A new addiction--and it's a healthy addiction.  \n\nFlora has become my absolute favorite place because of the unique fare it dishes up.  I don't have any...", "One of the best vegan places and a fine meal, regardless of your meat or veggie persuasion\n\nNext to Whole Foods, this restaurant has wonderful food and a...", "I've been back to Flora since my first review, and WOW. The food is A+. Everything from my first review still stands, but it seems like you really can't..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "WO__JZij6oSeDaUEVucX9A", "text": ["We went for our 50th anniversary. There was not one complaint. Food, atmosphere, service were exceptional. Would go again in a heartbeat.", "Octagon was totally dead on a Saturday night despite the hotel being extremely busy, and now I understand why. We had EXCELLENT service and the restaurant...", "We went to Octagon to celebrate a birthday over the weekend.  We had ordered an array of items:  Beet Salad, Surf & Turf Chowder, Oysters, New York Strip..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "t4Y_YMbHTWSCUDupM-UEow", "text": ["After our breakfast in Hartford, we wanted to combine our trip with something nearby that would be fun. We decided on checking out one of the many nearby...", "The chicken cutlet grinder is out of this world! So good and fresh, best I have ever had!", "Who would have thought that a non-descript building on the SIlas Dean Highway in Wethersfield could hold so much good food, but it does.  Enter these doors..."], "rating": [4, 5, 5], "TBscore": [0.4, 0.31, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["breakfast"], ["chicken"], []]}
{"id": "CuMpmeKgjZXX756IDKXepQ", "text": ["When you set foot into Pasta Vita, you are struck by just how many grab and go choices are there for you. Case after case beckon you to open their door,...", "I've heard such great things about Pasta Vita so decided to stop in after a trip to Marshalls/Homegoods.  The store has a very open layout with plenty of...", "hands down my favorite italian food. if you are looking for a delicious gourmet italian meal, Pasta Vita is your spot!! I have had the ravioli..."], "rating": [4, 4, 5], "TBscore": [0.25, 0.27, 0.27], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["pasta"], ["pasta"], ["italian", "pasta"]]}
{"id": "VJfBh8qmT_SygHXmmXDbfg", "text": ["Ordered the Fish & Chips as take out.  HUGE portion of fries and 3 large pieces of pieces of fish!  Excellent !", "We visited on a Friday afternoon. For a place this busy and this good I am surprised I have not see advertising for this place. It is modern inside and good...", "Good grinder.  The Italian cold cut grinder was very good.  The place is very clean and has a nice ambiance.  The french fries were awesome.  The server was..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.39], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["italian"]]}
{"id": "N3MIS8UNcFmhjwy9jfmAbg", "text": ["Great food, great place, great service. Everything was perfect!  Great wine  list.\nFound this new restaurant (they opened 3 months ago) earlier today for...", "I went to Harvest for lunch in September. The food was great and I really liked the atmosphere. The place wasn't busy, but the service was kind of...", "Came here for lunch recently with a couple colleagues. It started off dicey...we were seated immediately, given menus and water, and then...crickets. Must..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], ["lunch"], ["lunch"]]}
{"id": "sTy5DtkHNw3nxqq20R6VxA", "text": ["Service was friendly and quick.  Pizza was perfect for me, the crust was light and fluffy", "First of all, I saw none of the customer service deficiencies mentioned by some reviewers. The gent who took my order at the counter was helpful and...", "Chris, buddy... I tried man. I really did. If it wasn't for my quick reaction time, I would have ended up with a buffalo chicken wrap filled with mayo...."], "rating": [4, 3, 1], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["pizza"], [], ["chicken"]]}
{"id": "3h3exEPBBDRhjvLrYKoxvA", "text": ["I am new to the area and when I started at CCSU Tony's came highly recommended by most. I usually shy away from highly endorse places because the fame/...", "If you're dining in, don't plan on it being an in and out visit. I would not recommend eating here if you have a time limit. The service is slow but the...", "great place. lovely staff and perfect for college students. the lasagna and the chicken cutlet grinders are awesome. the chicken is perfectly crisp and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.34], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "zN-Z5TQS-i6HJnhLVkhqzA", "text": ["I love coming here since it's great for late night eats they have such convenient hours plus free delivery. I can't exaggerate enough how addicted I've...", "Only ordered pizza and wings all were delicious.  Very expensive and smaller sizes than other restaurants.  Plus if you want sides, those prices are...", "So since moving to the other side of the river it's been really hard to find a decent pizza place that delivers .  So we have tried all the pizza delivery..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["wings", "pizza"], ["pizza"]]}
{"id": "oT1bT331F3ViHPLsQcSKWA", "text": ["I've had this place bookmarked for some time and stumbled upon it today looking for lunch options in the area. I didn't have much time to fully explore...", "Heirloom,  You are extremely valuable to me and need nothing more than what you offer, which is exceptional service and spectacular coffee and treats....", "Set in a spacious, old barn with a relaxed and welcoming atmosphere.  Not only can you nom on delicious brunch-worthy sandwiches and salads, you can also..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.37], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch"], [], ["sandwich"]]}
{"id": "2XKrhB1-lIX36uUnzZ0w7A", "text": ["I ordered an overpriced ice coffee out of convenience. The coffee tasted like either hazelnut or burnt... they didn't ask if I wanted black or flavored and...", "Came for the good reviews on lattes. Perfect spot for a coffee date if you're looking for privacy to talk, mind you it's summer and schools out, not sure...", "I go to Cinestudio often, and I never knew this place existed.  My friends went to the cinema on Sunday evening to find the movie we expected to see was not..."], "rating": [2, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "gpzwVR4_wKNM9HpvY852FQ", "text": ["They finally have delicious sandwiches and a good selection of pastries! Now I have a place to buy decent toasted sandwiches and delicious coffee!", "The donuts and pastries are always fresh and to my liking.on the other hand the bread is where I have an issue. They claim it's fresh, bit I find that...", "Ordered a birthday cake for pick up at noon on Saturday morning. Arrived at noon to find the place closed. Normal business hours are 7-5 on Saturday. Had to..."], "rating": [4, 3, 1], "TBscore": [0.61, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["sandwich"], ["donut"], ["cake"]]}
{"id": "2iiQ1z2njaaJx-uWcl0wYw", "text": ["I wanted to take the time to recommended The Kakery in Newington! They made this graduation cake for me when I needed a cake last minute. I called on...", "We tried the cupcakes from the Kakery using the coupon that was published in the Hartford Courant. I'm glad we didn't pay for them because I've had better...", "cakes are delicious and the owner is really nice.  their cakes are better than any other bakery i've gone too.  would recommend to anyone!!!!"], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["cake"], [], ["cake"]]}
{"id": "y3acmM85czdBiofvvIOIBw", "text": ["If you are in downtown Hartford, this is a decent option for lunch or breakfast. Cafe is inside Hartford Steam Boiler building. There  is not indication or...", "I work in this building so I come here between 1-4 times a week for breakfast and lunch. For the most part I think the food is tasty but...and I'm not sure...", "One of the best options for quick, convenient and tasty lunch in downtown Hartford.\n\nThis is the company cafeteria for the Hartford Steam Boiler Company..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.67], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["lunch", "breakfast"], ["lunch", "breakfast"], ["lunch"]]}
{"id": "u4AkXyvXld7hvcCDbmffgA", "text": ["Best place in West Hartford for breakfast. Service is always spot on. The owners are totally engaging with the customers. They always have an awesome...", "I like this place. Not fancy, nothing pretentious, friendly and fast and good.  I know what I want, I do not even look at the menu, I order and they smile...", "Cute little breakfast spot. Very tight seating even for us with little kids. Slow service, but the staff was friendly and the food was good."], "rating": [5, 4, 4], "TBscore": [0.8, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["breakfast"], [], ["breakfast"]]}
{"id": "-E2EjICZGPc4OZqG8WpiOw", "text": ["Great breakfast and lunch spot.  Bagels were outstanding, staff was very friendly and easy enough to get in and out off without waiting forever for your food.", "Solid local spot. Looks like it'd be a good place to meet up with people or spend a bit of time in the leather chairs (see photo).\n\nI forgot to eat...", "Such a gem in the heart of Bloomfield! Perfect for anyone living in surrounding towns to grab a delicious bagel, hot sandwich, or breakfast pastry.\n\nWalking..."], "rating": [5, 3, 4], "TBscore": [0.44, 0.0, 0.56], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["lunch", "breakfast"], [], ["sandwich", "breakfast"]]}
{"id": "-ex5jbKteRfUHkv_3TlCag", "text": ["A group of us came here for the Thanksgiving set menu feast. I'd been here before and loved the place. The atmosphere, the food, the service... everything,...", "Stayed at the Delamar Hotel for the BF's birthday in late August ('18).  This was quite the surprise.  We sat outdoors and it could not have been nicer....", "I wish I could afford to go to Artisan more often. I have really enjoyed happy hour the couple times I have been. Once, we were inside and the bartender was..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "3EQR21-_GcSAFwRAV2QYMg", "text": ["Came here Wednesday night with my friend for a bite after an event. We were pleased to see small plates are 50% off on Wednesday (score). \n\nWe split a...", "It was West Hartford restaurant week, so of course I finally had to come and give it a try. We purposely came on a Wednesday night to avoid potential crowds...", "Great location and busy area. Interesting bar area and decor inside. Wonderful patio. Out front, it nice try to get a table outside . No reservations..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], ["bar"]]}
{"id": "Pq6iIBjMGW_6ogMMzq2XJQ", "text": ["I love Zohara. The food is delicious and inventive. The service is spectacular. The ambience is great. It's great for solo dining, for romantic dinners and...", "A great culinary experience of freshness and flavors!\nThe interior is spectacular and so tastefully decorated.\nService was excellent. \nNothing compares to...", "This is a fun, trendy, but comfortable spot. It's loud with conversation and more for adults. We had the tahini hummus (fresh, great consistency, a little..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "vXHqkixr5VEXHdhrA_xx0g", "text": ["I stopped in a couple of times last week. Always great food and drinks. Sara the bartender is outstanding! She made me a special drink featuring Polish rye....", "Ten beers on tap. Full bar. Plenty of tables. Kind service. Solid, hot, Polish comfort food served up quickly!  Prices are reasonable.\n\nNot the best...", "Last minute decision, late on a Sunday afternoon and the kitchen is still open! Great choice. We both had the Deluxe Polish Platter with everything..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["bar"], []]}
{"id": "NYMd23_hm4Uz_rT1pA_7Rg", "text": ["I love coming to this place, the drinks and food are great. The shop is located downtown which is convenient for me, although finding parking can be an...", "Nigel the owner is a juice master! Not to mention I am full for hours after I go there!\n\nI love the veteran, it is a mix of mango pineapple watermelon and...", "Checking out this place during my lunch break was a nice adventure from the walls of my cubicle. It was a nice walk enjoying the nice weather while getting..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.57], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], ["lunch"]]}
{"id": "zMRXvwQ0a1KtPZ9svVhAYg", "text": ["This place is the best, if a little strange. I love it. \n\nEuropean ham that will BLOW YOUR MIND!  Give up on Boars Head. This stuff is exponentially better....", "Truly one of my most beloved businesses in the area. If there's one thing I can't skimp on, it's goooooood keilbasa - and no, that's not Hillshire Farms or...", "I've now been to Adolf's twice and both times left blown away.  The first time I went for some smoked ham hock for a New Orleans red beans and rice recipe I..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "PXhD5UUhUUsjVFxrtPJYlg", "text": ["It's your standard rolled ice cream but we had to stop since it's on Connecticut Magazine's Ice Cream Tour.  Good flavor choices and great customer service....", "Dropped by after driving past it, doing a double take and I'm glad that I did.\n\nHad some yummy freshly made rolled ice cream with as many toppings as I...", "Finally, we have the rolled ice cream craze in WeHa. I enjoy the fun names and wide variety of flavor combinations 0degree has to offer. They also offer an..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "XHzHR3k3QcTzOshqREINbg", "text": ["Have been here a couple times grabbing everythihg from breakfast to lunch to a snack. I've gone through drive thru a couple times and it's very hard to get...", "I had Micky-D's the day before a doctor appointment. I was then diagnosed with diabetes, thanks a lot McDonald's. Food was aiight Would definitely go again.", "Average McDonalds but this one has lazy employees who never seem to understand what you say at the ordering intercom.  I also ordered one item, a medium..."], "rating": [3, 3, 1], "TBscore": [-0.38, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [["lunch", "breakfast", "snack"], [], []]}
{"id": "DUsEQRHpsWbHP3FqinCZtA", "text": ["Been there on their first day of opening. The orders were pretty slow, but its all good. This place has a good potential. It is inside barnes and noble...", "Horrible experience. Got there 555 employee said they didn't open till six . Said i was fine and I would wait . Another customer came in before 6 and was...", "I love dropping by here during my lunch break walks with my co-workers.  We sometimes walk the stairs by the hotel and stop into Starbucks for a little..."], "rating": [3, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "248h7SnT46IvmU9Fc0-IoA", "text": ["Another crap service in 24h McD? Are those ppl make less per h than average NON 24h locations? Because the definitely don't give a shit. And manager on the...", "This McDonald's is horrid. Always a long, slow line at Drive Thru no matter what time. They also are often out of things on the menu or only serving...", "Spent 30min stuck in the drive thru line. Kept telling \nme to hold on. I had to call them for her to tell me her system is down. Why not tell me over the..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "WCaYipilICnvdJtXp_7xSQ", "text": ["This will be our summer go to juice bar. This establishment makes fantastic green drinks, fruit drinks, and smoothies. You can order from the menu which has...", "Very confused by this place. Moving to West Hartford from Boston recently, I was so happy to hear about a local juice bar. The first time I tried to come...", "If I lived closer, i would be here at least twice a week. This is a hidden gem that's right in your face. Located on the busy Hartford side of Farmington..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "7IOUnme6RugNdxNF9eufeg", "text": ["Super fast service, clean, delicious meal replacement smoothies! Really can't ask for more than this place offers. The staff were very knowledgeable about...", "My sister wanted to take me to The Fresh Monkee to try there protein drinks. All the drinks are healthy and good for you. It's perfect place to stop after...", "Love the idea of a meal replacement as I have the tendency to skip meals from being so busy. These smoothies are EVERYTHING! So delicious and filling which..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "FzNuSnbFWgeDVtNqHN65QA", "text": ["Food is amazing! Service is much left to be desired. I think there was maybe one cook and 2 people waiting tables. The other person was waiting tables and...", "Good afternoon my Elite and all foodies around the world. Today I decided I wanted a Virginia hot breakfast sandwich. I decided to pick up a sandwich for my...", "We are always down for small mom-&-pop diners because often they have some of the best authentic local fare, so we were excited when we found this spot. We..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.47, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], ["sandwich", "breakfast"], []]}
{"id": "EmBzbP6QCk_BYbq4yVxnRg", "text": ["Horrible service. Just left there and I ordered a medium iced caramel macchiato skim milk...the girl at the drive thru at the window goes medium or large...", "This Dunkin Donuts is by far the best one! I look forward to seeing Dave every morning when I'm picking up my coffee before class :-) Dave is awesome! He is...", "Fast device at drive thru! Clean environment with multiple staff working hard. Some flattering comments made by cashier could of been left out."], "rating": [1, 5, 4], "TBscore": [0.0, 0.65, 0.0], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], ["donut"], []]}
{"id": "mGf8jSOkzV7uTUXQiyRDtQ", "text": ["Super friendly staff that were super helpful with questions! If you've never tried bubble or milk teas before, I highly recommend checking this place out...", "Atmosphere: clean exposed brick walls. Small, but cozy. Limited seating on the inside. Tricky to find as it's on the side of a shopping strip. \n\nService:...", "One of the better boba places I've found in Connecticut. \n\nThe portions are pretty good and they don't purposefully overfill the cup with ice like some..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "4isnFj-e2hU4Ny3oNrrkdg", "text": ["$1 beer Wednesdays intrigued me to visit this place. Went with my friend Jay.\n\nIt was packed with young college crowd. I wasn't comfortable with the big...", "The Worst place to go to have a good time because of the staff/management. The bouncer is a jerk who picks and chooses who he likes, which is not a big deal...", "The asshole owner of this shitbag kicked me out tonight literally because I was walking funny LAST MONTH when I have been they're greatest customer and was..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "ewO88TadEHwvZgn0bihCFA", "text": ["I come to Russian Lady pretty often, it's pretty much the only club/bar left in Hartford to go to. I like the atmospheres on the different floors, you can...", "Friday night and the crowd really sucks! .... did I go on a bad night? I don't know... maybe it's a Saturday nite destination lol. There was a line out the...", "I was not personally impressed with The Russian Lady when I came here for a company holiday party. However, I realize, I may not have had the full..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "pFWHhPZ1DUH7zulmZF9POg", "text": ["I love this place. It has been around forever and always a great place to hang out with friends.", "My first visit to The Spigot was during the last game of this year's World Series. The bar was full but not packed. I overheard the bartender telling some...", "The Spigot is a West End icon. The bar has an old school charm without the layer grime that is typically associated with bars of it's age. The crowd is..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "-ejz6gGYyCDy-LZ-j4Q74w", "text": ["I moved to Hartford, CT from Miami, FL, so needless to say, I wasn't sure what to expect when going to a downtown bar.  Rocking Horse totally surprised me!...", "Absolutely the worst bar in the downtown area.  I went there for a Halloween party earlier this evening and literally two seconds after I walked through the...", "Quirky Kind of Place.\nThe barkeep 1st served me a beer they were trying to unload.  There's a reason for that as it was...... poor.  We got over that and..."], "rating": [4, 1, 4], "TBscore": [0.0, -0.27, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "ojmLNwP-8kYHiQPPfT8mfA", "text": ["Met my bestie for drinks & apps and we enjoyed it. Drinks were good. Roasted Brussels sprouts & calamari were both tasty but nothing to write home about....", "I'll keep this short and sweet because no one likes a complainer - the service was subpar. They never came to greet me and when they finally noticed me...", "It was late last night we arrived to the hotel, tried to find places around to eat and we couldnt. We came back to Marriott again, and the bar was open and..."], "rating": [3, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "5zgmXOWabgPKZoQmLBzSJQ", "text": ["Tough to find without a spotlight or lit up exterior sign. \n\nCold beers, cheap duckpin bowling. What's not to like? Went on a Thursday night and it was...", "Trust your GPS, or look for the CVS, because you may have trouble finding the Ducks. \n\nWalk down the staircase, more or less next to the basement of CVS,...", "Wonderful community bowling.  This evening had disco black light fun.  Nice way to \"Bowl off some steam\" on a Friday night!"], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "JciOU0qhvOZ-_bRZBH0E8Q", "text": ["I was happy to see this new addition when I stayed at the Goodwin Hotel recently. It's a fun twist on the typical hotel bar. Also, I was thrilled to find...", "Awesome donuts! Love to be able to enjoy donuts and cappuccino while lounging on fancy leather couches and surrounded by the history of the Goodwin...", "We had an excellent breakfast here in the morning (Fritatta on a roll and another in a wrap), decent coffee and a wonderful ambiance.  At night the bar is a..."], "rating": [4, 5, 4], "TBscore": [0.33, 0.6, 0.72], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["bar"], ["donut"], ["bar", "breakfast"]]}
{"id": "2g0b5VQo7xQaYDkjxAxSIA", "text": ["This business is closed down and should be removed from Yelp.\nThanks", "This seemed like a nice hang out during the warmer months but it appears to be closed for good.", "This is like your neighborhood Cheers (almost everyone knows your name)!  The crowd is savvy, witty (most of them), and have an intellectually progressive..."], "rating": [1, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "BWyJFiiMxWZlwOf5Ah8Uxg", "text": ["A great old school neighborhood bar where everyone knows each other and each other's business (think Cheers). Opens around 9 a.m. for the few early-drinking...", "I believe there's a sign painted in the window here, from long ago, which advertises \"seating for ladies.\" That's a tip as to how long this place's been...", "Great place to hang out if you like a dive bar, good people and cheap drinks. If cheers were a dive bar, this would be it."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.63], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "P4za_Pe9B_QvQyhCMDqPmw", "text": ["How old is the Hartford Club?\n\nIt goes way back to 1873 and was established for \"Gentlemen who had agreed to form an Association for the promotion of social...", "This is my review as a guest at an event here. First of all, the Hartford Club is has that classic historical look that just makes events look beautiful. As...", "We came to The Hartford Club for our 2017 Holiday Party, there was a party of about 100 of us.  It was a great atmosphere, nice and open which allowed..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "hW-XQr3qU3Evz1GapOnjKA", "text": ["1.) Intro:\nThis place is inside of a hotel. I like how they try to make it its own entity. This is an upscale looking spot. My friends have hosted parties...", "My sales crew and I are staying here this week at the Hilton for business and decided to venture in the Element tonight before a team dinner.  Absolutely...", "I assume it's named after the address here at the Hilton Hartford which is on 315 Trumbull Street.  Very small but friendly bar in the lobby of Hilton where..."], "rating": [3, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [[], ["dinner"], ["bar"]]}
{"id": "cPNsuzRnz7DTx4GqUQbq-g", "text": ["I stopped by here this past Wednesday night for dinner.  I happened to be craving a salad and  it was latish and a couple of the salads on Bin228's menu...", "I live within walking distance, so having Bin is definitely a plus, as its so convenient. However, I don't think I'd go out of my way to come here. Menu is...", "Stopped by for a quick glass (or two) of Chardonnay before having dinner with the family. Cute place, smaller inside than I expected but great vibe. \n\nI sat..."], "rating": [4, 3, 4], "TBscore": [-0.25, 0.0, 0.31], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["dinner"], [], ["dinner"]]}
{"id": "exBG67p5Wz5V8PeYuapQwQ", "text": ["Love that this restaurant is in the lobby of the movie theater!! Such a cool concept. The theater is really pretty awesome and you can drink whatever you...", "I had the maple bourbon glazed chicken with bacon and roasted potatoes. It was absolutely delicious, very juicy and great flavor. The whole staff is...", "I've been here twice now, once for a holiday party for a mentoring program, and once for a holiday party.\nWith the mentoring program, all students and..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "jdD3syRUGSpMVn711zYqWw", "text": ["I've gone to this bar for many events with friends. I continue to return after unfortunate experiences, but my most recent visit may have been my last. I...", "Poor excuse for a gay bar in Connecticut's Capitol city.   The crowd was noticeably young, very young.  The drag shows are not even second rate... Bottom of...", "This was a fun night out I def needed. The bar looks like a reg house. Cute and cozy inside.  Great music but the drinks could of been better."], "rating": [2, 1, 4], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [-0.2, -0.6, 0.6], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "15VZRhIr9FY--PS0h09rYA", "text": ["When it's your first visit and a manager comes to you at 6pm on a busy Friday night and apologizes to you because your happy hour spinach dip is late due to...", "I gave Bar Louie three stars because I loved the nachos I got.  The service was very bizarre.  We were approached when we first walked in and a young man...", "Been to this place a few times. Consistently poor - \n\nPoor service \nLong wait times for food \nInattentive serving staff\nMediocre food \n\nThe only thing that..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.39, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], ["bar"], []]}
{"id": "gwrEAoNXMQ28txKXRntcBA", "text": ["Went for lunch. Nice and very open space and clean! Food was very good! Freshly cooked and enjoyed every bite!", "Tried this place for the first time yesterday; went with some friends for happy hour and had a great time. You HAVE to try their chili glazed shrimp, it is...", "Went for lunch today, everybody was sitting outside at the patio. I choose to sit inside where it was cool. I didn't know what to order because everything..."], "rating": [3, 4, 4], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["lunch"], [], ["lunch"]]}
{"id": "3PSPUPScgBl_SvJZV3eb4A", "text": ["Authentic Vietnamese food. It's a hidden gem with a menu on the wall with only a few items. \n\nI recommend: half beef & half oxtail. Mmmmm... it's delicious...", "I love their soup.  Oxtail isn't on the menu, so if you want it, you have to ask.  I ordered beef with oxtail in my soup.  There are various condiments...", "This, is my happy place. Pho 501, as the name suggests, serves pho. Pho is a Vietnamese rice noodle soup that is known for its deeply flavorful broth and is..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["beef"], ["beef"], []]}
{"id": "UtZj_fcV_0WZz8D74RSosA", "text": ["This is a take out restaurant only.  Not in the best area, I would assume it gets mostly local business.  However, they do have good food and are...", "Horrible...Disgusting and a waste of money. I had the beef and broccoli and it was raw.....HOW THE HELL?!??? They got a one star only cuz the\nBroccoli was...", "Hands down one of the best places to get Chinese from, definitely lives up to their name."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.21], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [[], ["beef"], ["chineese"]]}
{"id": "8nUbk6ysAfbPKnox5M62wg", "text": ["This is my first review on Yelp.  I am just blown away by the food my mouth received tonight.  I decided to get take out, and I thought...I haven't had...", "Is best Chinese food in Hartford been going here for decade never got bad just better.. def rec there food everything is good", "Cheap and fast.  The food is surprisingly good.  Primarily take out, but there is one table.  The restaurant and building may be a little scary looking.  I..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["chineese"], []]}
{"id": "_pvqYRBNqt3XPYVremtzcg", "text": ["Wang Palace is awesome!! They have a dedicated section of their kitchen for making items gluten free. They even have gluten free soy sauce and they are very...", "Went in on Friday night. Severely understaffed and slowww service. \n\nWe were a party of 5 and we were hungry. Took forever to get seated and waitress never...", "I had an awful culinary experience here the other night. My egg drop soup tasted like it had been cooked in fish water. The waiter got really mad at me and..."], "rating": [5, 1, 2], "TBscore": [0.5, 0.0, -0.44], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["gluten"], [], ["egg"]]}
{"id": "VZ-sto371P13gu172HMjQw", "text": ["This is the best Chinese restaurant in the area! They deliver everywhere from Wethersfield, East hartford, hartford, glastonbury and Newington and they are...", "Worst Chinese food I've ever had! Omg no flavor at all! Waste of $30!!!! Never again.", "Absolutely good tasty food. This is one of my fav takeout place. The food taste so good and they are consistent every time you order from here. They are..."], "rating": [5, 1, 5], "TBscore": [0.5, -0.5, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chineese"], ["chineese"], []]}
{"id": "1-iED3ldqqEmbN5Q_9dcjA", "text": ["Went in for my lunch break.  The lunch specials are a great deal.  The food is pretty good. \n\n The location is right next to a popular pawn shop that has...", "Great food but the customer service sucks! The guy who took our order was very rude and unpleasant. Moving forward, I will be ordering from Mr. China. Their...", "Clean, with friendly staff.  Took my order quickly and got my dinner fast.  The food was good and my mom enjoyed the shrimp rolls"], "rating": [4, 1, 4], "TBscore": [0.44, 0.0, 0.41], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["lunch"], [], ["dinner"]]}
{"id": "InxyRREOA2shIo5hk2Lw4A", "text": ["I feels comfortable in reviewing an restaurant after visiting few times,especially if they are good to check their consistency.\n\nSiam has impressed me with...", "The very definition of nickel-and-dime-ing, over something so petulant, left a bad taste in my mouth.  \n\nI don't like bean sprouts, so I asked for broccoli...", "One of the disadvantages to going to the XL Center in Hartford for a non-arena event is the lack of restaurants in the building. The good thing is that it..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "bp4TJ1yU2CGbnRPqk7_6mQ", "text": ["This business has been opened over thirty years! It was only eat-in restaurant at the beginning, because of the business was going down, forced change to...", "I live in the area and this is without a doubt a go to restaurant, their pork fried rice is on point.", "This is one of my go to restaurants when I am in that area of CT. There is nothing fancy about this Chinese take-out restaurant but I have always found the..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], ["chineese"]]}
{"id": "aaQ8hD5_Y1QoIiBJY1gO2g", "text": ["We ordered the General Tao's Chicken, pepper steak and steamed vegetable dumplings. Everything was excellent, except the dumplings, which were mediocre....", "I'm not too picky with my Americanized Chinese food restaurants, but with that, it takes a bit to impress me. I was definitely excited to try a spot I...", "We ordered take out from here for the first time after our move to the area. The outside of the building looks just fine but we were shocked when we went..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["chicken", "steak"], ["chineese"], []]}
{"id": "Uy5LvyfQBtQ0el3RxtB9sQ", "text": ["I would give them no stars if that was an option. The food was fine. The fried rice is more like yellow rice, but I wasn't irked by that. The service was...", "The food was good but the people were very rude. Ordered delivery and after being told it would take 45 minutes, it took about an hour and 15. When it...", "Say it's 7:00pm on a Sunday and you've been at the office for 11 hours.  And you're in downtown Hartford where only two places are open on a Sunday evening...."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "tUPjEzvmzKEn5ZTfPXhWsw", "text": ["This is what Chinese food should taste like!the spare rib combo was on point. The ribs were sweet, not too fatty and a great portion. \n\nCombo came with...", "My girlfriend told me about this place and that is was on Groupon, so when that extra % off comes around her and I load up! Lol. Then we spend the next 2...", "I'm not sure why I haven't been back here in so many years. I think everyone knows it's the best karaoke in town, but come early for delicious Chinese food..."], "rating": [5, 4, 4], "TBscore": [0.24, 0.0, 0.34], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "My39PojXp1AuCYkFqy5I1w", "text": ["I am finally writing a review for my favorite Chinese restaurant. This hole in the wall place is literally down the street from my apartment like a 3 min...", "No spice but flavorful. Added sauce from packet. The accompanying pork fried rice was good. The lunch combo did not include egg roll.", "Good portions, quick and good prices.  Lunch and dinner specials available.  Good for takeout"], "rating": [4, 3, 4], "TBscore": [0.0, 0.7, 0.57], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["chineese"], ["lunch", "egg"], ["lunch", "dinner"]]}
{"id": "3ZZKfGVqqNOl3DkPNtPDqQ", "text": ["So our first time ordering from the new Mr China was 8 days ago from the second time we ordered ordered completely different things and I have to say for...", "Overall I was very impressed with my 1st experience with this restaurant.  I placed my order online at 5:22 and it was delivered at 5:55.  I ordered...", "I have lived in Wethersfield for awhile and have tried all of the Chinese places in the area this is the best place in town prices are good, delivery is..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.57], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["chineese"]]}
{"id": "630dvEjRSoZJaw845i-nVA", "text": ["Good Chinese. Must be new owners, very friendly, fast , great for pickup quick.\nEasy location quick in and out.\nNot a sit down.  Small place but typical for...", "Over the years I have found this to be some of the most consistent take-out Chinese food in the area. I typically order a lunch special (smaller/cheaper...", "If I had to put no stars I would. First time ordering from this place was horrible. First of all on the phone she was getting fustrated because she couldn't..."], "rating": [3, 3, 1], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [["chineese"], ["lunch", "chineese"], []]}
{"id": "fmjxmss_PLzwB2gsiWc2bA", "text": ["Msg msg msg\nIn menu it says MSG free\nNot true.\n \nTried this restaurant twice to confirm,\nSecond try, we took the chef's special Tsos chicken\n\nConfirmed....", "Tasted like TOO-OLD leftovers!! We got delivery but couldn't even bring ourselves to eat it. It tasted old and sour and looked like it was blatantly...", "Scratches the Chinese lunch need perfectly! Very good and well priced, with good portions as well."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.54], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], [], ["lunch", "chineese"]]}
{"id": "4xS9x-7d3TOx4S8cdkJdKg", "text": ["The general tso chicken was the best I've ever had! Chinese take out can be soggy by the time you eat it, but main wah did an excellent job of maintaining...", "The woman who works here is extremeley rude, I usually go here because I go to school right up the street. I called 30 mins ahead of time to get my food,...", "Food was good only wished the crab ragoon fillings were a little sweeter or flavorful the sesame chicken comes listed as spicy on the menu good thing she..."], "rating": [5, 1, 4], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["chicken", "chineese"], [], ["chicken"]]}
{"id": "dY37UcolvrvqpqKJINEV6Q", "text": ["YES! spot on chinese food, for take out!\n\nWhat i am implying is that, yes the grub is good, but you dont want to have to move the kids/daycare station they...", "Have been customer for years, both pick up and delivery. They where always ehh. But they had fast and free delivery. However now they advertise Free deliver...", "If I could there would be No stars for this place. I placed a lunch order for the first time on a Sunday. It was a delivery. I ordered Chicken lo menu with..."], "rating": [4, 1, 1], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chineese"], [], ["lunch", "chicken"]]}
{"id": "CzZ8yNY8AS3jJ9ZYzvLlJA", "text": ["Eggshells in the batter of my sesame chicken I'm guessing... I was chewing and noticed this sandy crunch! Shocked...glad I didn't share any with my 9yo!...", "Henceforth let this establishment be known as Wah's Ga! That's how I stuck it in my contact list, and you better believe I'll be calling them up again. It...", "Here's what Wah's Garden isn't.\n\n1) It isn't large and it isn't a sit-down restaurant. It has just two 4-person booths and three 2-person booths, so it's..."], "rating": [2, 5, 3], "TBscore": [-0.94, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 0.2], "keywords": [["chicken"], [], []]}
{"id": "HAuGRBpXm_9p-0_pA8d67w", "text": ["Very consistent quality and taste. Nothing ever tastes to greasy, everything fried well. Delivery and pick up, friendly, prices normal. Of course fast service.", "The ONLY place I will go to anywhere in Hartford. (No delivery, so not a 5.)The food is always fresh, never greasy or over processed. I've tried several...", "So I decide to try out Yelp's EAT24 app and order online for the first time and it didn't go so well.\n\nAlright so I wanna see if I can trust the app and..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "PMRJB2ofuH-a3GuYmhhUcQ", "text": ["Very solid Chinese food in an area hat has a shortage of it.\n\nLight Star Chinese is located in Bloomfield, right on Park.  You can do take out or delivery,...", "This used to be My family's favorite restaurant until the ownership changed recently. \nFood: Overcooked chicken wings and burned fries if you are lucky...", "Waited hour and 45 min for delivery to our work. Was charged. $45.  For 6 meals.  ( lunch ).  And only recvd 5.  Every time we called they would hang up on..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["chineese"], ["wings", "chicken"], ["lunch"]]}
{"id": "42GRQLF3hZe1K7g8kZEQCg", "text": ["Buckle up kids this one will take a few minutes.\n\nFirst the easy stuff,  Brooklyn Ramen is not a restaurant, its a \"stand\" inside of Maruichi Japanese...", "What it lacks in atmosphere it makes up for in taste.  I've been mainly for lunch. A nice selection of sushi, and some premaid dishes. Monday and Tuesday...", "I drive half an hour out of my way to have the best spicy miso ramen in ct! Super filling and delicious! The ramen is served from a little stand in the..."], "rating": [2, 4, 5], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [-0.2, 0.6, 1.0], "keywords": [["japanese"], ["sushi", "lunch"], []]}
{"id": "qCnEipnlST2DJ0Oonk4nQw", "text": ["Food and service was fabulous! So happy for a great Thai place in the center. We have been several times and the food is fabulous every time. We really like...", "I expected to be impressed by Prai Kitchen considering that it's run by the same folks that own Siam in Glastonbury, but the fact of the matter is that Prai...", "Oh so good! \nI went there for lunch with some friends. We rarely get to take advantage of lunch specials, so I was looking for a place with decent lunch..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "ugMMPIA5d7_WFBVwh3CDOA", "text": ["Utsav is amazing!  The original location in Vernon was written up in The NY Times...", "I have been back a few times since my prior review and am pleased to say it has been excellent.\n\nThe lunch buffet is outstanding with a nice selection and...", "I tried the buffet here on a Sunday. Here are the few things that I observed here in the restaurant.\nTaste 2/5: There are a very few items in the menu. Food..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.34, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "VnW1lGTz18NOT4gbuS87fg", "text": ["I really enjoyed an early Sunday dinner at India this past weekend. It was some of the best Indian food I've had. I first heard about this place from an​...", "Been to Bangalore few times, Indian food is our favorite cuisine in the whole world because of it's  rich  taste.\n\nThis is a sad experience for us. From...", "Very slow service. 45 min of waiting. Tea served cold. Ridiculously.\nCancelled the appetizer."], "rating": [4, 2, 2], "TBscore": [0.32, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [["dinner", "indian"], ["indian"], []]}
{"id": "At42YrprGdbHV-tZI95VoA", "text": ["The food here is delicious. It was awesome from start to finish- and then for left overs... but this review... is not about the food. \n\nWhen my husband and...", "A favorite of mine! Me and my fiancé frequent the lunch buffet on Sundays. Food is always fresh and tasty, they have a few options that change on the menu...", "Just letting y'all know I have no idea how good this food is compared to, say, homemade Indian food is, as I've never had the pleasure of having any..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.21, 0.7], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["lunch"], ["indian"]]}
{"id": "cvmO7rzy0ooNVkAxZwHjdA", "text": ["How does the Tamil goddess Mariamman reveal herself to humans? She brings rain, she cures dread diseases, she can be a cruel and violent deity when the...", "We were craving for authentic Indian food over the weekend. Having heard of Naatiya from few friends, we decided to try their ala carte dinner. I am very...", "Use to frequent here.   Always enjoyed the food.   Use to be very authentic.  Still they do make some food very good,  but overall have gone downhill.\n\nWent..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], ["dinner", "indian"], []]}
{"id": "Za1OcZKmRI8IpanPqTbTMg", "text": ["Following a recent third visit, I decided it was time to put in on the record.  My introductory visit was a bachelor night and no where to go, except some...", "Winter is here, and with the change in season, so is my propensity to hibernate. So it follows that my takeout and order in will go up and dine in will...", "Amazing Persian Nepali India cuisine. Never eaten them all together. The pooris were amazing. Are them with madras chicken masala. Also got the wonton soup...."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], ["chicken", "indian"]]}
{"id": "4ZdgfH-mHc79CnlpSxbjGw", "text": ["I went here for a birthday party, and I had high expectations. I wasn't disappointed. \nTo begin with, the staff was wonderful. Polite, charming and very...", "This restaurant never disappoints.  All dishes are flavorful and cooked perfectly.  They adjust the heat level just right too.  We like certain dishes spicy...", "I went here for the lunch buffet today. The price was only $ 10.95! The selection was great and the food was seasoned awesomely! I've been to other Indian..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["lunch", "indian"]]}
{"id": "ZsQZlPOQDQIKyyU7yFv3Ng", "text": ["This place is everything to rave about! Their food is so good and tastes so authentic AND the menu is huge! They also deliver to Andover which is awesome...", "This is most authentic Indian food place in Harford ( in fact in the state of CT), the place is amazing, from interior decor to food- everything is 10/10....", "The food is just about ok. It's not bad, but it's just nothing to rave about. \nGulab jamuns were good, so were the medu vada. I would order those next time,..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["indian"], []]}
{"id": "Pd3ZYDqtxHm7rWVZsAr_Bg", "text": ["Good vegetarian/vegan options. \n\nMy favorite thing Ive eaten here is the Ackee with dumpling, banana and yellow yam.\n\nThe vegetable patty tastes good but it...", "I ordered the Lions Den chunks with ital stew.   Holy yum!  I ordered a medium, a small would have been perfect.  I totally over ate because it was so good!...", "This place is in a weird spot of town and the menu changes daily, so I had no idea what to order. The proprietor or chef, I couldn't tell which made me a..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "uIrVOOxixTsTzrlei2A4-A", "text": ["This is a ridiculous place, we ordered for three biryanis to go and one of my friends was thirsty and asked for some TAP water to drink.\nThe guy said NO and...", "This is just an average place. The person who served is really nice and nan is really good - soft and topped with butter. And for that they earn 3...", "Omg! Best place for biryani to go! Must have. The spice is perfect the portion is large I eat small portions  so I usually make two meals out of it! To go..."], "rating": [1, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "TndQFyZzytdy_Lp6idY5ow", "text": ["They have a buffet on the weekends. That is a very good value. Generally I wake up and go for the buffet. Whole days calorie intake will be taken care of by...", "They are good but too much expensive", "A really really good chicken tikka and chicken seekh kebab.\nHowever they can do much better with their service.\nIt took us almost an hour to get our food on..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], ["chicken"]]}
{"id": "79b1163IqPqsF-Tls8jO6g", "text": ["One of our favorite restaurants in west hartford!\n\nWe have never experienced a wait, \nthe food always comes out fresh and fast, \nthe food is DELICIOUS,\nthe...", "This was our first time here; and definitely not the first Afghan place we have been too. \nSunday evening, after happy hour, there was just about 10 people...", "2.5 stars\n\nCame out here twice, and both experiences were underwhelming. I've had lots of Afghani food and so know what it's supposed to taste like, and..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "QLJhvfptg3EA4AdxMyYFfQ", "text": ["We had a really nice experience here. I did the Starry Night escape room with two friends and my boyfriend. It was a bit challenging but thankfully they...", "My husband and I took two of our kids today to try out the starry night room.  We were paired with another couple to make a group of six.  Within 15 min we...", "So much fun!! Great date night we had a really fun night trying to solve all the problems"], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "whPxKkchAi_ZZr9QPT-FhA", "text": ["DoorDash just started in my area and I decided to try Melina's for the first time. I'd never heard of them prior to doordash. \n\nI can't wait to order again!...", "Fantastic food.  Their Papusas are World Class.  If you are in the Hartford area, you need to check it out.", "we went to Melina's for the first time today and absolutely loved it! The place is beautiful inside with many seating options. The staff was very friendly..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "IcmlrdOIZWpn6TBDysGP_Q", "text": ["I LOVE Moe's, especially the queso! This Moe's is local to where we live and work, so often we order using the app (although sometimes it isn't working...", "I really like the food here but the place is usually dirty with fingerprints everywhere. The black trays the put the food on stink like swamp, I told the...", "These guys have really changed their game.  This place used to be gross with not the best employees.  This new staff and management team are great!  The..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "-Su8ek4BuEZkmGr3VIGqDA", "text": ["This place has some potential - the food is pretty cheap (if not very good), they have decent specials (kids eat free Tuesdays), and it's a decent fast...", "So far standing in line for several minutes and still 5 people in front of me, employees didnt welcome me as I came into the business. Very unfortunate that...", "if i could put a negative star i would. not only are they untimely theyre rude. i have a 30 minute break and if i order 2 and a half hours prior to the..."], "rating": [2, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "hZH4o7TpyxRnvvojeZJ9Ng", "text": ["Great Cheap Drinks. Friendly Bartender.", "What a great dive. Some fancy IPA's on tap. Staff are nice and check in with you frequently to see if you need refills. I haven't tried the food here....", "Open tonight with the snow storm. Cooked us food and all. Killer place for South Windsor. One of the owners served me himself in the snow tonight. I had a 6..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "PXKsFxcWI2SaJLtf3xAjaw", "text": ["I stopped by here this past yesterday by myself for some after work drinks.  Hanging Hills Brewing Company is located in what looks like an old warehouse...", "Have a I really not written a Hanging Hills review yet?! That surprises me as this has turned into one of our favorite breweries in the area. \n\nMy first...", "A rocky section of Central CT is known as the Hanging Hills. The brewery's website describes a very creepy legend about a \"mystical black dog\" roaming the..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "pOYKksu9lvV9KSRypDMvDg", "text": ["This place knocked my socks off. I don't tho m we ever have to travel to Italy again, because this was spot on amazing. \n\nThe food truck was right outside...", "Delicious!  I got the Burrata Salad (hold the prosciutto), and it was fantastic!  The burrata was a wet ball of heaven, the pesto was the star, perfect...", "Great food.\nFast, friendly service.\nVery reasonable prices.\n\nLove it.\n\nHad burrata, gnocchi, arrancini, and meatballs. \nMeatballs are a bit dense, but still..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "29mWGrHdbSYZrpuikSbP-A", "text": ["My friends and I came here for lunch on a Tuesday. We were greeted nicely and tended to quickly by the staff who were very welcoming. My friends have...", "Everything you would expext from the Carbones family of restaurants.  Ate there on Thu 10/25/18 for dinner. Ive been to Carbones Prime numerous times and...", "Meh.\n\nWe attended a family birthday party in a private room.  Our table was too small for the number of attendees and we were too close for comfort.  I do..."], "rating": [4, 4, 3], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["lunch"], ["dinner"], []]}
{"id": "u4E_cWczKpiWNyEQUEt2tA", "text": ["Soooooo I'm not the biggest fan of fried seafood but this place rocks \nDid you know their escargot is like $8 that's amazing for the quality \nSurprisingly...", "We walked over from our hotel. They have a large parking lot. The restaurant clean, good lighting and lots of seating.  \n\nThe service was very good service....", "Been here for Happy Hour as well as Dinner. Let's get started.\n\nHappy Hour in the bar area is open seating at the bar top or the high top which they have..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.46], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["dinner", "bar"]]}
{"id": "3iebarZmCxbeGN6i97SojA", "text": ["I was at a lunch with 20 other people. \nThe minestrone soup was good. \nThe NY Strip was more than 10 ounces cooked. \nThe NY Strip was cooked to perfection...", "I have been to Max Amore many times and it's probably the only Max restaurant that is just okay. It's almost like Max group is trying too hard with this one...", "Meals are generously portioned and my chicken parmigiana was one of the best that I've had in a long time! The cheese is great and there was a perfect..."], "rating": [5, 3, 5], "TBscore": [0.36, 0.0, 0.43], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["lunch"], [], ["chicken"]]}
{"id": "D72z7SQOiY94xFv2JpL9ig", "text": ["We love the pizza we come here once in awhile this is are second Favorite spot We have one favorite In\nGlastonbury center", "Usually great food but terrible customer service. I work down the road and have gotten great food from here many times. I got two chicken Caesar salads...", "Although I live less than a mile and a half from this restaurant it is taking me over 4 years to actually try them out. This past Friday night my wife and I..."], "rating": [5, 1, 3], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["pizza"], ["chicken"], []]}
{"id": "8oc9DGmx1tOHWq953jQ_yg", "text": ["Owner Hope, of A Little Imagination Cakes in West Hartford, created a masterpiece lawnmower birthday cake for our son modeled after his favorite toy. She...", "Hope and ALIC is AMAZING! I have used them for several cakes in the past two years and they always blow me away! Hope is so creative and she always seems to...", "BEST. CAKE. EVER! 7 years ago, I had a Groom's Cake made from this place as a gift for my husband at our wedding. It was a really great cake! Fast forward..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.23, 0.73], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "nCPDw0lQw9K_QvfpXaT8wA", "text": ["Amazing cake. The cake was delicious, fresh, light and wonderfully chocolaty. I ordered a cake for a combined graduation/birthday and everyone loved and...", "Customer Service here is terrible! Called to order a cake a week ago and was told to call back 24 hours before we needed it. So when I called over 24 hours...", "I wanted to take the time to recommended The Kakery in Newington! They made this graduation cake for me when I needed a cake last minute. I called on..."], "rating": [5, 1, 5], "TBscore": [0.67, -0.5, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "k2uugKVeR9Opgr58qWm82Q", "text": ["I was in need of some cupcakes to be delivered to my daughter at school in Hartford, and Larry really came through.  I will definitely order again, it was...", "Do not normally seek out cupcakes but son of a bitch these things where great!  \n\nWhile staying at the Hartford Marriott and Convention Center I saw this...", "I love everything about Hartford to begin with but THIS just takes the (cup)cake. So I have to admit-- I was bummed to see the poor reviews from other..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "zDSEeLCuwWh5Zunz7pMiKw", "text": ["I have a \"No Jamaican beef patty left behind\" policy.  So when my friends and I recently hiked Talcott Mountain I suggested (insisted) that we stop by...", "The best of all their branches. The food taste more like home cook Jamaican food. Does Not taste like they add sugar to the food", "I first discovered Scotts' Jamaican beef and chicken patties at my local Big Y store, but they are no longer available so I now periodically make the trek..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["beef"], [], ["beef", "chicken"]]}
{"id": "jxsqkxhc10dXnkVWk7o0fA", "text": ["Great shop. I come here when I travel to Hartford. They have chilled wines, and a great spirits selection; beers too. Friendly and helpful staff will get...", "Five stars from me, and four paws up from the Beloved Goldendoodle!  We had just checked in at the Residence Inn around the corner, needed a little walk,...", "Decent selection, however I went there and bought beer that I later found to be expired"], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "wai_rWYtfBqx_2d8J0engg", "text": ["Cute!  Dog pics adorning the walls and a clean booth made our experience quite welcoming and endearing.  It was a bit \"old school\", with classic New England...", "We really like eating at Corner Pug (the kids always eat their chicken tenders and hot dogs and love the waffle fries. The fish specials have been delicious...", "The Corner Pug is often overlooked in the crowded West Hartford restaurant scene, but it shouldn't be. If you're looking for a warm, cozy, authentic pub..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["waffle", "chicken"], []]}
{"id": "rrZxsS_BWPfLOn3qjEnRwA", "text": ["This was my first trip to Bear's takeout location. I've had Bear's app elsewhere, but never in my hometown.\n\nWe were getting Bear's to take with us to the...", "Did the Bears Thanksgiving special.  Had read the reviews and decided to try it.  We are 2 adults and 3 children.  Being new to the area we had only been to...", "YUM, salivating just thinking about this place. It's on my top 5 list of places to get BBQ. Favorites: Burnt Ends, Pork Ribs, Brisket. The menu was..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "EPgQ2kNPRq7nkeFgN-TdgA", "text": ["Pho Saigon is probably my favorite Vietnamese restaurant in the state. It's homey, a great value and  always serves food that is both fresh and delicious!...", "Meh.  \n\nThe food is what you'd expect from a neighborhood Vietnamese joint.   I had delivery from this place, and don't expect a lot of bells and whistles....", "Hearty Pho with good prices \nThe Pho here is really good for such a small hole in the wall type of place. The only issue was the language barrier between us..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "2H6eF07YKtm4Rk_CGIta7g", "text": ["Food was excellent. A little bit of a wait but worth it. Very friendly waitress, good portions. Will definitely be back again.", "This is a great location for happy hour!  They have great drink specials and the food is amazing!  I love the garlic shrimp and the shrimp house salad.  It...", "Every time I come from Los Angeles to visit family in Connecticut, Andreas is my top stop. The service is always great although its always a bit awkward..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "eU7mODmCS5K3CboM7Z2JOA", "text": ["The worse service ever..\nWaitress Rule number one, always bring the food at the same time for the table, my friend and I ordered at the same time yet she...", "I was recommended to try out this place from a coworker and the choice I made was great! Being it was my first time there the owner Marlene was very helpful...", "Food is delicious but what's the point of good food and horrible customer service? Worst service from employees to owner. I'm done! Never again. I even..."], "rating": [1, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "HM4m6gDP_O1t9YrwyUbUnA", "text": ["It just got totally rebuilt, so it's worth a more recent Yelp shout out.\n\nPretty much every kind of seating now... bar height, regular tables and booths,...", "I go here often and usually everything is fine. Lately it seems the service and food are inconsistent depending which manager is there.\n\nI go often for the...", "The restaurant is a standard BK, service is always quick and polite.  However if you go in the early morning, you might get service provided by an employee..."], "rating": [4, 2, 4], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["bar"], [], []]}
{"id": "plDXQGa9BnxvMOa7nu3M-Q", "text": ["Fantastic! We used Tastebuds for our wedding reception (offsite, outdoor) on Saturday evening and could not be more pleased. I know what \"good\" looks,...", "I did not personally set up the function, but the buffet food was very good, the staff was very attentive and professional, the room was very comfortable....", "Absolutely love this place! From the employees to the food and the venue. Very spacious and comfortable. I've been here 3 times for a wedding, a birthday..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
