{"id": "O1Nj7qMFsTKrjygfOvJEZw", "text": ["Super convenient to the Great Northern hotel. One lady working but she seemed on top of it. Solid Subway sandwich.", "Saturday at 12:30... when we walked I. There was only one customer in front of us. The guys working were stoned out of their minds... the one with green...", "I used to love this place but they hired some bad employees and now it's garbage food. I filed a complaint and asked for a manager to respond but got..."], "rating": [5, 1, 1], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["sandwich"], [], []]}
{"id": "Kj7125KJLI5RsU2HSs7tFA", "text": ["I'm in town for the fires and sampling Helena's finest.\nThis place is hard to find but I'm willing to bet this is Helena's best takeout. \nThe ribs were...", "When it's good it's gooooooood. Trouble is half the time we get the brisket it is dry and chewy. It's a gamble every time we go, but when it's goid it...", "Recently stopped by for a quick pork sandwich. The pork was a nice smokey flavor, and not over-gristled (as I find many bbq pork places serve sliced pork..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["sandwich"]]}
{"id": "5hRWbUf3k6qt36lCRHaeZQ", "text": ["If you ever find yourself near Avon, MT you need to stop at this quaint, little roadside restaurant.  The staff makes you feel just like one of the locals....", "Five stars just for the service!! The server was so kind and friendly.  The food is what you'd expect at a diner, and although the corned beef hash is a...", "Yes it is as good as they say. The people are tremendously friendly. Had Ham Steak and eggs\nKathy had the Famous cinnamon rolls. We will definitely be..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.49, 0.39], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["beef"], ["steak"]]}
{"id": "37efhZW-QNj18a0Lu01tNQ", "text": ["As good as a McDonald's can get! I came in late the night before and even though my food took a minute the lady at the window explained how long and we had...", "Stood in the lobby for at least 5 minutes before anyone even acknowledged me and they were standing right there!! The manager!! And there was no one in the...", "Not sure if I stopped on on their good days but I've stopped in a couple of times and enjoyed the service, clean large tables and wifi \n\nI'll be back."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "osOajWsH5sft-l7lymrm8Q", "text": ["What an amazing gem in Deer Lodge.  These guys know how to make a pizza taste quite well And believe me having lived in NYC and Chicago, I can say this...", "That was the best pizza I have had in a very long time! Great size, quality, crust, and ingredients were fresh! It only takes 12 min for them to make it....", "The first time I came here it was fantastic, the second time it was ok and the 3rd time it wasn't very good. I want to love this place so much. The outer..."], "rating": [5, 5, 3], "TBscore": [0.6, 0.42, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["pizza"], ["pizza"], []]}
{"id": "PVTZvQbYsT1xbr1_kMFPkQ", "text": ["I love this place! Fresh, decently priced donuts. Support this local business if you can!", "Fantastic bakery!!!  The fritters are amazing!  \n\nThe ONLY thing that could be improved is that the people working could be a bit nicer.  They aren't mean,...", "In two words; fresh and delicious. Breakfast burritos  are huge. Donuts are from scratch. Coffee made to order and they can make anything the big brands..."], "rating": [5, 4, 5], "TBscore": [0.27, 0.0, 0.43], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["donut"], [], ["donut", "breakfast"]]}
{"id": "r55jK8l7R1wXzQsHsu4cew", "text": ["The good: We ordered a dozen pasties which I've never had before. They were frozen and we popped them in the oven at home. The crust was flaky and buttery...", "Who cares about the decor when pastries,cookies and beef pasties are made with skill. You couldn't walk by without smelling the baked goodness! Inside,...", "Love the donuts! The staff is friendly. The decor is not the best, but it's a great place to get good donuts. The downside is their only open tuesday..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["beef"], ["donut"]]}
{"id": "HCe-bvWJd63whkWfPdgBRw", "text": ["Most reviews I saw of this place sounded pretty good, so I had to come try it. I really wasn't too impressed though. The salad bar was an absolute joke!...", "As a tradition I stop here every time I am in Helena. The pizza is super cheap. They also have a lunch buffet for under $7. I've been eating here for 30+...", "What ya want, Lunch for under $7. While we were here they had lots of their classic thin crunchy crust pizzas. Including Hot Hawaiin, Kings Ransom. Cheese,..."], "rating": [2, 4, 5], "TBscore": [0.48, 0.37, 0.0], "normalisedRating": [-0.2, 0.6, 1.0], "keywords": [["bar"], ["lunch", "pizza"], ["pizza", "lunch"]]}
{"id": "Ve9SbTpZ97GjwqB2VjgoDw", "text": ["Fabulous space. There are multiple areas to explore. The outdoor patio is so relaxing. Staff was super friendly and the beer was delicious. We will...", "Large local brewery. Even though the sign says Taproom, that's the correct location. Parking sucks. There's one tiny parking lot so you'll most likely have...", "Neat eclectic brewery to stop by while in town. Standard bar food (pizza, brats, pretzels) we weren't enticed to try. Awesome building with numerous hide..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["pizza", "bar"]]}
{"id": "frFYRzJ6zEyBGsdcqHAcvA", "text": ["We really enjoyed this brewpub!  We were able to get a seat right by the railing during a perfect summer day.  It was crowded, but it was nice that after...", "Service was friendly, the patio was relaxing, and beer was alright. Free popcorn and a variety of beers.. even a ginger lime one. Last call is a few minutes...", "Lame! I really wanted to like this place but there was so many loud obnoxious yuppies, and their toddlers. My party of three over paid. We were served the..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "u8VeR39q9YFzni25A4PWRw", "text": ["Stopped by on our way out of town. Friendly service & a much larger place than I expected. All our coffees were good, while the scone was delicious. The...", "A group of us stopped in for drinks on our way through town. 2 out of 6 liked their drinks. The rest of us were very surprised how little flavor there was....", "A little disappointed. I've been coming here for quite awhile now and would have next to no wait time. But gradually, it's become a lot worse. Just now me..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "msKvyBToJCrhgbIqfB0d3g", "text": ["I really like Bobs. Great bear and wine selection, delicious choices at the deli and the staff are all so nice and efficient. The only reason I didn't give...", "Got gas at Bob's two weeks ago for truck and lawn mower.  Both instantly started misfiring badly.  $800 later my truck is running again.  Buy their fuel at...", "Got gas and snacks here while out for a drive.  Tried to use the bathroom, but you have to hit a button and wait for an attendant to open the door for you...."], "rating": [4, 1, 1], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["deli"], [], ["snack"]]}
{"id": "aSan7b6xkggiV46YaKqjKQ", "text": ["Love this place!! Hadn't been there in a few years but I stopped in today and I still love it. Brent was awesome, gave us some great lunch recommendations...", "Solid neighborhood bar. Bartenders were super friendly. Drinks were cheap. Peanuts were readily available. Friendly crowd of mixed ages. Would definitely go...", "Haps is a fun place to drink, whether right after work or on a Saturday night. The bartenders and karaoke DJs make an effort to get to know you and take..."], "rating": [5, 4, 5], "TBscore": [0.58, 0.24, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch"], ["bar"], []]}
{"id": "xcsgAt4-Rv1Xlxpme0fJgA", "text": ["This is the best wine bar in town, and not only because it's one of two!  The owner has obviously taken the time to hire and train their staff.  Every...", "I am OBSESSED!! Who would've thought that Helena would have something like this? \n\nThe atmosphere is very trendy and posh. This is something you would find...", "Awesome wine bars in unsuspecting cities are such pleasant surprises! I give my thanks to Yelp for pointing me in the right direction on this one! Trust me,..."], "rating": [5, 5, 5], "TBscore": [0.33, 0.0, 0.49], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], [], ["bar"]]}
{"id": "jz7uHPrATy_UjNIeRM9BlQ", "text": ["We are from out of town and were amazed to not be able to get beer at the brewery that closed at 8pm so stumbled upon this local gem. Inside were a few...", "Once a year we splurge on a baby sitter and after a down town H-town dinner, this is where we walk... Walking distance from our favorite eats. Great brews...", "Great for a stinky old dive bar. Fun place. Love kateokee nights. Been a while and I heard they have new ownership now, but I can't wait to go out again."], "rating": [5, 5, 4], "TBscore": [0.0, 0.38, 0.37], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["dinner"], ["bar"]]}
{"id": "MyHy7aoBdj7Lc6xxOawccA", "text": ["One of the last real bars in downtown Helena. Good happy hour prices. Good drinks. Good bartenders. No BS. Don't go there after 10 pm on a weekend, unless...", "I love coming here for drinks the bartenders are great they always remember my cocktails..the drinks are always perfectly made and if they dont know what it...", "This bar is absolutely disgusting. Filthy, fights, crowded, and not worth it if you want a night out."], "rating": [4, 4, 1], "TBscore": [0.52, 0.0, -0.65], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "ODEN0mhjBCWDSULM4NfbrQ", "text": ["Omg bahn mi!!! Thank you so much! Y'all made my day !! Brought me right back to and gave me that feeling of the first time I ate bahn mi.  See y'all again....", "Good bánh mì and Thai iced tea.\n\nHowever hard to locate where the truck will be, you must check their Facebook frequently to know for sure (and then...", "I live over an hour away and am happy to make the drive - pretty regularly - to Saigon Alley! The food is unique and incredibly flavorful. Having eaten damn..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "Ua-QHF33F7QgH2MQmYkf_g", "text": ["Now I'm going to preface this review by stating that this is by no means the kind of Chinese food you'll find in New York, Chicago, or Seattle. \n\nHowever,...", "I'm not a fan, like most people now days, of fast food; however, the meal here reminded me why McDonald's is successful. \n\nIf you are in an unfamiliar place...", "This place is just great, and very nice after a long drive! The portion size was huge; we shared one portion. Everything was freshly made and tasted superb."], "rating": [5, 1, 5], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chineese"], [], []]}
{"id": "-gjV7ROd34EJTYMQQ1V0ZA", "text": ["Absolutely stunning food.  We ordered the pad kee mao, pad Thai, and the seafood curry.  Since we are from Malaysia, Thai flavors are very close to us and...", "It's very surprising, but this is some of the best Chinese/Thai I've had. I travel 100% for my job and it took me to Deer Lodge this week. There aren't many...", "I had the Singapore noodles...chicken was not edible, hubby had the Thom kow gai soup missing important ingredients like galangal and lime. We eat a lot of..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "d62G1SseMbNBQWByr-9DkQ", "text": ["Great brewery. They had live music the night I was there and the vibe was neat. The space is large, new and industrial, easy to hang out. I had a wheat beer...", "Awesome place, even the employees helped out keeping my kids entertained. The when in dought American wheat ale is perfect for a hot day like today. Great...", "Great little brewery located in the Gulch. A buddy and I really enjoyed the beer and the service. The 16K IPA and Bullwhacker were noteworthy offerings. One..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.61, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["american"], []]}
{"id": "u9Xk6zXoTc7YILHKUaIQpA", "text": ["Best kept secret in Helena! In the land of giant steak, Grub-Stake is as good as it gets. Get Grade-A steak, giant portions, and friendly service without...", "Beware of the parking lot. If you're not driving a truck the entrance will break your front end. It's super dark and you can't see where the pavement ends...", "Waited 15 min at the bar for 1st drink, the people weren't friendly (other patrons) and the music was sooooo bad. We finally gave up and left. Definitely..."], "rating": [5, 1, 1], "TBscore": [0.26, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["steak"], [], ["bar"]]}
{"id": "2tQ7EVONS-ClCtcVYb8luA", "text": ["Passing through on a motorcycle tour and found this awesome bar. Burgers were amazing, great wings, perfect onion rings. Live music was a an awesome touch...", "Stopped in on a Saturday night for a burger and a beer. Waited for nearly an hour for a burger and order of onion rings- in meantime the couple that sat...", "If you are looking for an amazing steak or prime rib, DO NOT GO HERE!  We wanted to give them one last chance. Never again. We went on a Saturday for the..."], "rating": [5, 1, 1], "TBscore": [0.76, 0.0, 0.38], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["wings", "burger", "bar"], ["burger"], ["steak"]]}
