{"id": "J6MITPR20MrZjxQKHuIHIA", "text": ["All the reviews below are true. Wont give you water and the lady is not friendly. Its a regular subway so the foodnis good....", "I'll give zero star if I can. Unfriendly staff, which is fine, everyone get unhappy some time occasionally and have bad times in their life.\nBut keeping a...", "Ok it's subway so the food is automatically Meh,  But this place is a special kind of bad.  Always one way under qualified person there.  Ordered a meatball..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "R4GefLshiHmdiIH9yM30Kw", "text": ["Newer Gas station in Canandaigua. It was built in the former place of Ranks IGA on West Ave. Clean and in an easy location to get into from either Pearl St...", "Wow, what an outstanding crew, and great management team....Lots of smiles, and great ice cream....great Deli sandwitch with enough fillings for an...", "You can't buy a \"Sub\" at a reasonable price because they only make \"Deli Sandwiches\" for much more money. If you want the best sub in town go to Casa..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.44, 0.42], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["deli"], ["sandwich", "deli"]]}
{"id": "qDaEZVlcsvbqCc9ANRnl4g", "text": ["If your here catching a flight I highly recommend the hamburger.  Fresh everything.  The staff was outstanding and very friendly.  Excellent service and...", "Very friendly and the prices were very reasonable.  I ordered the grilled cheese and it was perfect--gooey and hot!  I waited about 5 minutes for my order,...", "This little cafe at the Ithaca Tompkins Regional Airport is a bit of a gem when it comes to airport food. Its basic diner fair: eggs, bacon, omelets, and..."], "rating": [4, 5, 4], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["hamburger"], [], ["egg"]]}
{"id": "PDNk0BrBzJOzT6X6JwggJQ", "text": ["So glad there's finally a chicken joint in Ithaca! For years we'd gone without one -- no Popeye's, no KFC, no Chick-fil-A.\n\nYou'll find this hidden gem...", "Unfortunately, Ithaca's fried chicken game is pretty weak unless you are willing to pay $20 for a plate of gourmet fried chicken. This place changes that...", "Just stopped in! This place is fantastic -- great chicken and honey butter biscuits."], "rating": [5, 5, 5], "TBscore": [0.0, -0.28, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken"], ["chicken"], ["chicken"]]}
{"id": "yF8TrnDbnj_6nUZ0Intt3Q", "text": ["Good service and considerate server. Pretty average subway experience. I just don't think this place deserves a 1 star average.", "Walked into Subway for a quick sandwich for my kids and was taken aback by the completely rude, surly and disinterested person working behind the counter....", "Subway is good. I like it, but I could only taste one thing in sub. You can buy cookies there too. They have a large selection, which is good. I've had some..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], ["sandwich"], []]}
{"id": "rFEkPPc0w2Y3Z9sLXWoxdQ", "text": ["The guy was rude af...and on his laptop for 5 min before he even got up and served me", "Guaranteed to be missing almost every ingredient you want, every time. They need to work on their inventory issues.", "Service was terrible. Lady has an extremely repulsive attitude. Story is just dirty and unkept in general. Would NOT recommend."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "81Z-hyEQ3m5s3iNjozHFxw", "text": ["Best damn Chinese food in town, period. \n\nThis place has been my family's choice for Chinese since I was a little kid. The Lo Mein...excellent. The General...", "Ling Ling is the best cheap Chinese takeout in Ithaca.  Now - don't go there expecting five-star service or some over-the-top special menu items - they...", "If I'm comparing it to other Chinese takeout in Ithaca, it gets five stars--it's definitely the best in town. I've had better in bigger cities but all in..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.25, 0.23], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chineese"], ["chineese"], ["chineese"]]}
{"id": "uPvM9by48kKU_070aZTioQ", "text": ["Again used Ithaca To Go to order from Hai Hong in Collegetown and my rating for Ithaca To Go remains a 5 star.   My assigned driver was Rithy, and the...", "This company is ABSOLUTELY the worst. I'm praying GrubHub and Yelp take over for Ithaca and outer area deliveries. \n\nI've had more terrible (not just bad)...", "As a frequent supporter of countless local businesses, I feel it makes such good business sense to keep as many dollars within our community as possible,..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "OqjZvcPIUQb7AkDGDe6qeg", "text": ["I paid a visit to their stand at the Ithaca Farmers Market yesterday. My friend ordered the peanut lime cold noodles and once I tasted a bite of hers, I had...", "I just wanted to stop by briefly and share a rave review for the women of Macro Mamas! I am a recent Ithaca bride (and a wedding / event planner as my FT...", "I LOVED the corn fritters we got. I agree that $5 for 5 fritters was a bit pricey but it was honestly well worth it! And plus everything else at any..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.56], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["corn"]]}
{"id": "IEc4R932gCt8HnQ6Nz9e9Q", "text": ["Flying pig catered our grandsons graduation party and did a wonderful job from start to finish. The planning process thru the final clean up went off...", "What a fantastic experience. Ron and Lynn are exceptional to work with. We live hours away and only spoke on the phone (for hours!) until the day before my...", "Bring on the smokin pork butts!    Flying Pig Roast exceeded our expectations in planning my son's graduation BBQ.   Planning a party from 200 miles away..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "RvT1fRZIyEBeeUX_0MN2nQ", "text": ["I came here in October with hopes of doing some fall \"pick your own\" apple picking- this is a lovely and quaint farm which has more \"pick your own\"...", "I really like that this place is not too far from town and each pound is $1.99. They grow a lot of fruits and vegetables and you can pick whatever is in...", "Great place to get wholesome apple goodness. $1.75 per pound, but you pay for the experience and to get all muddy:D. Tomato, eggplant and peppers were ready..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "eAZ6O8mY7_iH5i6njXVWnA", "text": ["This Dunkin is awful again.\n\nI went over there today for my lunch and was told that they were \"shutting down food\" because they only had three employees...", "Young women working all super nice and incredibly quick. No tipping allowed which makes Starbucks look darn pricey. Kids all got yummy egg sandwiches and...", "Service is very quick & friendly. 24\nHrs. Convenient location with drive thru. Iced hazelnut lattes were good but disappointed they didn't drizzle on the..."], "rating": [1, 4, 4], "TBscore": [-0.39, 0.34, 0.0], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [["lunch"], ["sandwich", "egg"], []]}
{"id": "dMvR-khu_DdQ1cLP6x9Spw", "text": ["I am only giving this place 3 starts because of the nice staff and the EXTREMELY nice/clean interior, otherwise it would be a 2. \nPros:  Clean inside,...", "First off I would like to note that, yes..this place was packed with a drive through line wrapping around the DD and blocking parking spots but non the less...", "This was probably the only experience I've ever had that was horrible when goinf to a Dunkin. The employees seemed like they didn't want to help us, and I..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "2yB1wx6AHtTyOcR-J4rTyw", "text": ["For what you are paying the pizza is good, but the attitude of the guy on the phone and behind the counter is lousy. I'll be going somewhere else to grab a...", "Awesome Bacon Cheeseburgers.  Totally simple, no fussy garnishes, just real beef, real bacon, and real cheese.  Grab a side of fried pickles with honey...", "As I recall, very good veggie subs. And I seem to remember they use to deliver beer."], "rating": [1, 4, 4], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [["pizza"], ["beef"], []]}
{"id": "ag4q579Ux5KRHy4UfDsTKw", "text": ["I love bbq, but am usually disappointed and wish that I'd just made it at home (and I don't really make great bbq).  However, the food here was excellent....", "House sampler of Tender, moist, fall-of-the-bone, great flavored pork ribs, brisket and pulled pork prepared perfectly. Though various bbq sauces available;...", "Excellent pork ribs. Meat falls off bone. Good smoke and texture. Texas chili and Fried Pickles also great. I found it very fair priced. No beer. Only soda..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "_ujmzDTlKMtlnSgZ-nS-9Q", "text": ["Love this place. A very good cup'a joe. Nice mellow bright vibes, really good coffee. Overall double thumbs up!", "I have no doubt you will receive a tasty and quality espresso-based drink when you visit here. When the weather is nice, and the large overhead door is...", "I was im-PRESSed by this cafe. This space is modern, chic, trendy and hip. The space looks like a shipping crate store with large garage-style industrial..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "i6TQnb0UI5N65RbM7NId-g", "text": ["I use to work in a coffee shop much similar to this so I was extremely pleased to stumble upon this shop as I waited for my wife to finish her class. The...", "I'm in town for a wedding and I don't want anything heavy. It's humid out and we're heading to the grand event in the late afternoon, so I look for healthy...", "I kept coming back to this bright, cozy nook - the atmosphere is relaxed and it's a great place to catch up on emails on a Sunday afternoon (if you can find..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "vXwTHb4ejO5Jm-FEhPjtnw", "text": ["When I think of Ithaca, I can't help but think of the wonderful experience I had at Sunny Days. Not only will visitors be in for a treat, but the owner(s)...", "Unique gift shop participating in Ithaca Loves Teachers week. They offered a nice discount and have something for everyone, signs, kaleidoscopes, flags,...", "I love this place! I am an Ithaca student and when I found myself tired of buying college-themed gifts for my family, this place had the most unique and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "BkwCUXtSxf_oW1Q6rJce-g", "text": ["One of my friends told me the other day that this was the most profitable 7-Eleven franchise and it turns out he was wrong (I fact checked him because I'm a...", "As a 7-eleven customer and supporter of FLOC, I am deeply saddened that this store continues to carry VUSE products. The Labor and Human Rights abuses in...", "As a 7-Eleven customer and supporter of the Farm Labor Organizing Committee, I am deeply saddened by the fact that this store continues to sell VUSE..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "urPsinII1A2PzFHm_lsbVw", "text": ["Maybe this store is rated 5 stars because it's literally a block from the Cornell gate and it's catered towards students at the university. I guess it can...", "Actually, it should be around 3.5 stars. It has a variety of Chinese sauce and Asian food including snacks, beverages,​ ​and frozen foods. Honestly, it is...", "Green Castle makes living in collegetown so much easier.\n\nIf you need snacks, they've got your Pocky, Pepero, Shrimp Crackers, Choco-Pie...\nThey've got a..."], "rating": [3, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 1.0], "keywords": [[], ["snack", "chineese"], ["snack"]]}
{"id": "4o6B9KEbFg3p8lbpnBUVRQ", "text": ["The negative reviews here really bum me out. This particular Starbucks' staff has always been cheerful & pleasant; they ask how your day is going... and...", "This Starbucks is located inside the Target at the Ithaca Mall. There is a decent sized seating area in front of the counter area, but no window seating...", "BEWARE THE STAFFS, I ORDERED VENTI GREEN TEA FRAP BUT THEY GIVE ME GRANDE SIZE AND STILL FIGHT WITH ME, IT HAPPENED 2 TIMES\n\nFirst of all, here are the size..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "4Gzv_B96ssWG6OO5V5Bwtg", "text": ["Larger than the one in Collegetown, but still very much overpriced. Apparently, the Green Castle market has been in the Ithaca area for about 10 years....", "Best place in Ithaca to go for Korean food. All of the Korean restaurants in Collegetown are horrible and you are better off buying the prepackaged food...", "Pretty decent selection, had a funny smell though. Cashier was very helpful! Would come back again!"], "rating": [3, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], ["korean"], []]}
{"id": "pow4nSYu60xDY-jtC_rOgQ", "text": ["Come for a literal taste of Cornell--the agriculture school struts its stuff at this farm stand with apples (including special Cornell breeds), cider, and...", "This place is AWESOME ! We went when we were visiting NY and it's a cute little shop with a ton of different apples, cider, syrup, local honey, soaps,...", "We stopped by the orchard store before going to an event at Cornell early in apple season. They had a small selection of gift items up front, and evidence..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "2zpObYpke5VlgflNn-mYEg", "text": ["This really is the best bar in Ithaca! It's beautiful and the ambient is great. It's perfect for a date or friends get together. My friends and I did a...", "Great place to catch up with friends and chill out with drinks. They might have live music too on some days, wasn't there when we went. Only sad part is...", "This place is outstanding! Interesting and fresh cocktails. They make there own tonic! Which I would have never known if they hadn't been in the process of..."], "rating": [5, 4, 5], "TBscore": [0.77, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], [], []]}
{"id": "cnH0qX1HOrksbwLOEWl7Gg", "text": ["Amazing drinks. Drinks are curated, not made. Ingredients are tip top. Quality abounds. Sipping drinks. But no one will stop you if gulp. No one would blame...", "BEST DRINKS AND BARTENDERS IN ITHACA! Yup, I said it. We had an excellent experience here. The drinks were out of this world and the bartenders were also...", "Great bar, awesome bartenders.  Drinks are on the expensive side but worth it.  You don't have to just get what is on the menu.  Also just a comfortable..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "sBlXj41G7RPtFYCfnOlD0g", "text": ["I was born in 1939 and raised at 526 Linn Street less than a mile from the Fall Creek House.  I graduated from Ithaca High School in 1957 while still living...", "It's a great place and all except it feels they are trying to squeeze you for extra money by only playing jukebox music. I brought in a group of 15 people...", "I've only been once while visiting for weekend, but definitely will make it a regular stop from now on. We were there mid day between kitchen hours so can't..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "NrN-0SRAb33cVyTXHj3kPg", "text": ["Good option for a drink on the Commons. Good crowd, sit at the bar for best results. Shout-out to bartender Libby for her service!\n\nIf you're into dancing,...", "I agree with what a lot of reviewers are saying - they're having a bit of an identity crisis. My friends and I picked this place because I saw they had...", "I love this bar since I moved to town over 2 yrs ago. I love to host some parties there for friends many times, and hang out once or twice a week...."], "rating": [4, 3, 5], "TBscore": [0.8, 0.0, 0.5], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["bar"], [], ["bar"]]}
{"id": "T5APSfj74xtlFHwDLifZSA", "text": ["Is it just me or does this place smell like a porta potty ? \nNo like it actually smells like real poop \n\nDoes anyone else smell this?\n\nSOS\nASAP", "Great drinks! Great atmosphere! Great bands. And even tango. Great friendly staff and Andrew is a top notch professional. Really knows how to treat his...", "I really like this place. Nice selections of beer, wines  and ciders--many locally-sourced products. I often get a martini here, and am always delighted by..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "C7SC0GWXcXmknid8ktTsaQ", "text": ["Great place to get cocktails! I have been here a few times and let me tell you if you are looking for a delicious cocktail, this is the place for you. As...", "If you want to see pretentious white boys who dance like fucking idiots to white rappers with face tattoos who don't know the boundaries of personal space,...", "Went to Lot 10 on 4/13 and 4/14 for two Twiddle after parties. Great location- right around the corner from the State Theater. Two story establishment-..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "gxRWEghSeNtpICRkQzkcIw", "text": ["Only in Ithaca. This place is very chill. I am a big tea lover so I thought it this place was great.  Unfortunately, they were out of some menu items when I...", "Sacred Root is a seriously cool place. You'd be hard-pressed to find a cooler spot in Ithaca, and this place is SO ITHACA. It's weird, offbeat, quirky. It's...", "Its a wonderful breath freshening place. I don't come here much, but it is always welcoming. People are friendly, and the teas are great!!! Very cave like,..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "ZHG5k1PBawdJ-DYMoFaMcg", "text": ["I visited the Chanticleer for the first time after a 25th High School reunion event.  Really visiting Ithaca for the first time since I turned 18 the...", "Nice little dive bar located at a very convenient area in downtown. I came in with a group of 12 and I was surprised at how fast and efficiently the...", "My friends and I were told to stop in there for the 'experience' and maybe not even have a drink, but we had a drink anyways. Loved the Rooster stuff..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["bar"], []]}
{"id": "bl2Hb7TuKyzrPBzwZXSg4Q", "text": ["This is the bar I've been looking for since I moved to Ithaca. The bartender is friendly and funny. Drinks are reasonably priced (a rarity in this...", "This is a good quality dive bar, equipped with darts, a very old TV and some really interesting graffiti. It's cash only, but worth it as a fun place to...", "The best dive bar in Ithaca!  Cash only, but drinks are cheap and good!"], "rating": [5, 3, 5], "TBscore": [0.27, 0.32, 0.57], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "KT-al57yee5Ixv-gVx2jxA", "text": ["The place is a decent venue, but for things like ragay night they start charging cover at 930pm and it's dead until after 1030. What incentive is there to...", "Friendly bouncer & bartender. Great folk music playing, good sound, nice stage. Mojito was so-so, but served in a cool mason jar glass, so they get an extra...", "Good tasty burgers. Would have given it 4 stars but the Guinness was under-poured and poured too fast."], "rating": [2, 3, 3], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [-0.2, 0.2, 0.2], "keywords": [[], [], ["burger"]]}
{"id": "qeNoKe7cKDV72-98xIOPQA", "text": ["Really good food! Good pricing too. Kind staff. I got the BBQ chicken, chicken with broccoli, and rice. Total came out to $6.47 including tax.", "The food was pretty good. I enjoyed the General Tso and rice combination. It's a lunch counter style serving, and though the two women behind the counter...", "Don't eat here. I saw one of the male employees use the bathroom and go back to work without washing his hands."], "rating": [5, 3, 1], "TBscore": [0.0, 0.22, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["chicken"], ["lunch"], []]}
{"id": "7Tp-J0La7FJtubAJpWd0nw", "text": ["Little Thai House is literally the best deal in collegetown for takeout speed & value. Sure, there are slightly fewer options than apollos but the prices...", "Stir fry veggies and Chinese BBQ pork w/ a lot of rice for dinner. Flavors are good, but the texture needs improvement. The pork are completely dry out,...", "Not the place I would go to if I wanted to have good thai food. So there are many entrees kept on display and you can choose from them. I went for the..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], ["dinner", "chineese"], []]}
{"id": "Kh1_yt_q24uqbuqMjvDD2g", "text": ["This humble little restaurant has no competition in Canandaigua, yet somehow beats big Indian restaurants in Rochester. Though the lunch buffet is much...", "My boyfriend and I travel about 40 minutes just to eat here. We go once a month and it's always on point. The service is always good, and so is the food....", "We dined here on a Sunday. The buffet had two vegan items so we were delighted. They also made us an amazing vegan dish with cauliflower, broccoli and peas...."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["indian", "lunch"], [], []]}
{"id": "-ZpEKPuLevtU0JFs-8S_-Q", "text": ["Visiting family in the area and stopped in for lunch.  I tried everything on the fairly typical Indian buffet.  I have to say it was all good to my American...", "Precooked flavorless food\nExpensive on top of that.\nMust not be getting a lot of business so they are trying to cut corners to save money.  \nWill never eat...", "This was not only my first time at this restaurant, but it was also the first time I ever tried Indian food so I came in with a little bit of skepticism but..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["american", "indian", "lunch"], [], ["indian"]]}
{"id": "WGzvjCOZlnnrgU5hNCRCJg", "text": ["Stopped by late Saturday evening, the place seemed to be understaffed and we had to wait for around 20 minutes. \n\nThe food though was quite good, we got a...", "This is the worst restaurant experience I have had in a long time. The service is terrible. I have been waiting for my food for 2 hours, watching everyone...", "This is probably one of the worst Indian cuisine I've ever visited. Right from the customer service to the food , everything is intensely stupid.\n1) waited..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, -0.5], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["indian"]]}
{"id": "XgmL1B-XS8P1Xgn0fwHyPg", "text": ["Chicken Thandoori is good and I liked all items. Ordered a la carte and food is good. \nFood - 4\nService - 3\nCleanliness -3\nPrice - $$", "This was the worst Indian food I've ever had!\nChicken was overcooked and chewy, gravy was undercooked\nThere was no taste in anything\nIf you're an Indian...", "Terrible food /ambiance/customer service \nThis is no authentic Indian food pls avoid this place , we had no choice and ended up there."], "rating": [4, 1, 1], "TBscore": [0.35, -0.8, -0.62], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chicken"], ["indian"], ["indian"]]}
{"id": "BkKVGpLRCuPYEHNBzHKR6w", "text": ["The SHRIMP PAKORA is phenomenal!!!! So Delicious!!! The garlic naan is also very delightful !\nLamb gyro is AMAZING-  Vegetable Samosa Nice and spicy!...", "I only had take out from here and it was in February 2018. My friends usually order take out from here and they've done so twice or three times i believe....", "One of the best Indian places in Binghamton. The dishes are always very flavourful, and spicy. The mango lassi is great!\n\nThey also deliver and have online..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.73], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["indian"]]}
{"id": "nBjBk1QprpgALbp6kCn2Og", "text": ["As a vegetarian starving late into night, I didn't have many options available. I've had Moghul at Binghamton University Marketplace before and wanted to...", "DO NOT USE YOUR DEBIT CARD HERE. We went for our first time a few days ago and left a tip in cash... and when I checked my bank account statements today,...", "It's the best Indian classy place in broome county with great taste. I stopped in many times before but decided to write today. Buffet is  good for..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.62], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], ["indian"]]}
{"id": "zThlZoc73hxnZWWeIMmlzg", "text": ["Our favorite Indian Restaurant in the area HANDS DOWN. My wife has been coming here for many many years and she introduced me to this little gem after we...", "Not the best... greasy food , kind of sweet. Tablecloths stained, about one inch of dust on ceiling fans. Wouldn't go back. Service was good.", "Currys is my new favorite go to spot in downtown bing. I have enjoyed every dish I've ordered there (and I've ordered just about every vegetarian dish). The..."], "rating": [5, 2, 5], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["indian"], [], []]}
{"id": "Fsxws1q5KN_5qeFrchN22w", "text": ["I was in the area after visiting someone at crouse hospital and i was hungry but the place i wanted to go was closed so i came here and i had this dish (do...", "The only reason I'm giving more than one star is because I've eaten here in the past and enjoyed it. HOWEVER!! The service has gotten worse and worse, to...", "Hmm I was not a fan. We were in Syracuse for the weekend for a concert and I decided to try a local Indian restaurant. I ordered chicken mahkani and an..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, -0.3], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], [], ["chicken", "indian"]]}
{"id": "QYzyfdm93eyYj0WRGUUUlw", "text": ["This is such an interesting concept.  I love Indian buffets but they are so expensive. This is like all the things you love at the Indian buffets with a...", "Delicious, great, amazing. I stopped by to take out dinner for myself and a friend and we both got rice bowls with chicken and lamb, plus added veggies (I...", "This place is kind of like if Chipotle (or Qdoba or whatever you prefer) got genetically spliced with an Indian restaurant.\n\nThe lowdown:\n-They were under..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.45, 0.6], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["indian"], ["dinner", "chicken"], ["indian"]]}
{"id": "-dJp88uU05nepy8Nt9zY9g", "text": ["I love this place! They deliver quite a bit sooner than the time estimate and give extra silverware, napkins, and condiments without me even asking. I am...", "Lets begin with the nice delivery guy in the cold weather. ok anyways ., me and my friend we ordered fish rice and chicken shawarma. For us , we both agreed...", "I've eaten here 3 times now and the food is generally good. They have a great variety and the pricing is fair. Most recently I got the Chicken Kofta Kabab..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["chicken"], ["chicken"]]}
{"id": "Gld3m1IKZm-Tsk9v6VhS-A", "text": ["I have not been here in ages, and all i can remember from then was the odor.\nWell, smelled fine on this trip and even though we came for the fish dinner...", "Firekeepers is a diner/restaurant of the Onondaga Nation, just off the highway with plenty of free parking. You seat yourself at a table or booth and...", "Absolutely amazing gem of a diner. Very friendly people, great food and excellent service. We were driving to New York city from Niagara falls and stopped..."], "rating": [4, 4, 5], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["dinner"], [], []]}
{"id": "AKY2Yh8dKIq1co_pSn9vaA", "text": ["great restaurant! grotto is great, live bands in the summer, great bartenders, great chef and kitchen staff ... excellent owner!!! \n\nfood is definitely...", "What a find. My husband and I stopped here for an early dinner and I have to say the entire experience was special. \n\nOur serve was wonderful and suggested...", "Hammondsport is a small town with few dining options; but when in town I usually stop in at the Union Block Italian Bistro for dinner.  The food is..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.36, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["dinner"], ["italian", "dinner"]]}
{"id": "hvyRadZ6pCua0zpp0UwcKw", "text": ["I've taken my kids and family here for years. I can honestly say, the food has never disappointed, and the waitress has always been fun and friendly", "They added 15% to our total and then they were mad we did not tip them.   \nDo not add a % percentage to my bill and you will get a tip.   Not going back !!!!", "This is probably one of the most disgusting buildings I've been in. It only took about 45 minutes and I was laying on my bathroom floor. After almost..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "9F2zRgWyn1srb9y4ZIg6Dg", "text": ["This is probably the best food for it's price on campus. Everything I have gotten there has been excellent. They have great vegetarian options as tofu can...", "Not really sure why this has any bad reviews. Interesting ethnic menu, quick service, high-quality food. Arguably best food truck on campus. Summer rolls,...", "Possibly the best food now available on Cornell's campus, Franny's is a food truck located behind Sibley Hall, Cornell's architecture school. The \"truck\" is..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "pTNLIbE3swnJxy7EpuqeDw", "text": ["Decent variety of options that taste just okay. There's a selection of wraps, hot/cold sandwiches, and pizzas on one end. The wraps are occasionally swapped...", "Waaaay too pricey for the taste and quantity. I would recommend eating at Terrace across the street", "This past semester, I think I must have dropped $500 in total on lunches at the Atrium Cafe.  They've got an awesome selection of sandwiches, pizza, soups,..."], "rating": [3, 2, 4], "TBscore": [0.22, 0.0, 0.25], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [["sandwich", "pizza"], [], ["sandwich", "pizza"]]}
{"id": "nvd_6PF7AggAgQeme2E3Pg", "text": ["Smaller Asian grocery store on Ithaca's busy shopping strip offering a full range of Asian dry and frozen food items in an area with few options. They don't...", "I don't know what the other reviewer is talking about re: the cleanliness of this place. I have never seen any cockroaches - it's always sparkling clean!...", "Yay, Chinese buns, frozen goodies, and lots of drinks and ingredients! I like this place a lot. The prices are good, and it is about 2.5 times the size of..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], [], ["chineese"]]}
{"id": "KY7-La6hP_9QA-lP9MYcLw", "text": ["Angela was the BEST tour guide ever. My girlfriends booked this tour for my Bachelorette party and it was so much fun. They had snacks and water on the bus...", "Emma was our tour guide and she was great!  She was fact full and funny. She had a great personality and made us feel welcome! We got snacks and water which...", "We booked this trip as part of a bachelorette weekend.  We loved our tour guide Antoinette.    The tour as a whole exceeded our expectations with lots of..."], "rating": [5, 5, 5], "TBscore": [0.65, 0.68, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["snack"], ["snack"], []]}
{"id": "U2yipGoCc3pZj6ajBaZqLA", "text": ["I cannot say enough great things about Serendipity! As a wedding planner myself in the Philadelphia area, I was taking a risk selecting a caterer I had...", "This was the best wedding I had ever been to.  Of course it was my daughter, but seriously, the food was top shelf.  The table settings were beautiful and...", "Very disappointing. We attended and paid for a case club party at a finger lakes winery catered by Serendipity Catering. The set up: cheese and charcuterie,..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "zU2kY64LV0Jkx8Tw6Z5_5A", "text": ["Whet on Friday and there was a good size crowd.  We brought our Dog, was not sure if it was pet friendly since we are not locals, but there were several...", "Great day at a fun fair. Fun to taste apples from a variety of local farmers. I also loved the free samples of cider. It was crowded, but not too crowded...", "AppleFest was...okay.  Think of it as your typical street fair with five, six, (seven?) blocks of booths set up with crafts, food, and samples from the..."], "rating": [3, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "3uZ7fK40CY4FkhZvYotwFA", "text": ["I just got back from my stay at Firelight Camps and have been talking about it nonstop. The staff were incredibly helpful and friendly and the tent exceeded...", "Loved Glamping at Firelight Camps.  The Buttermilk trails are awesome.  Also,  if you stay a couple nights upper Treman park is also gorgeous.  The hosts at...", "These guys are amazing. We came in on Friday night and they were welcoming, accommodating and funny from the start. We stayed in tent 14, which was spacious..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "G6eVUNDvfCiFy8ICavGScQ", "text": ["Probably my favorite spot for lunch in college town. The food is above the average in the area for a reasonable price. \nI read some comments about being...", "Best to avoid this place. I've gone here a couple of times as it is so close and convenient to where I was studying, but have been disappointed each time....", "Doesn't compare to Saigon Kitchen, though I will admit that I haven't done a head to head comparison of the pho because I don't eat meat. Be cautious if..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["lunch"], [], []]}
