{"id": "RK6663TFIrN6YcXqx1uSJg", "text": ["The I got a lot more meat on my the new gyro but now it's brand new building I'm getting shorter meet and lot more bread and I'm disappointed with that so...", "The service is great here!  The people are very friendly and always have a polite greeting when you show up.\n\nIt's Arby's.  You know it's going to be good....", "I have always liked Arbys for their wide range of food choices but this location stands out for their great service.  They must pay their employees well b/c..."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "gemFbIhOUuPGLTNkHM-COw", "text": ["If you live in MS and never heard of this Southern staple, you're not a true Jacksonian. Southern transplants and travelers passing thru, have probably...", "I'd like to give this establishment 5 stars for originality. I've never seen or tasted anything quite like this.\nAfter COUNTLESS facebook posts raving about...", "This is a hole in the wall that happens to be a one trick pony.  I tried the pig ear sandwich, to see what it was about.  You have to get your drinks from a..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "Uk0TEHzRtJjaEa_P_oQ4Kg", "text": ["Holy. Smokes.\n\nI recently moved from Phoenix to the Jackson area, and have had a somewhat rough start to exploring the totally Yelpable dining scene. Today,...", "Simply Put, this is my favorite place to eat in Jackson! \n\nThe gyro is consistent and well crafted. I love it! It's not some super fancy restaurant with a...", "Excellent, excellent quick lunch! Found this on yelp- looking for a spot to stop on the way to New Orleans from Memphis. Very nice, clean open restaurant. I..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.53], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "Hoh3zTKEIj_4LNghbTOnqg", "text": ["Service was fast and good. Burgers were thick and juicy, cheese was nice and melty, just how I like my burgers. Patty wasn't overdone and fries were crispy....", "When you think of food trucks, there is one name that stands out in central MS, Lurny D's.  Awesome people and unbelievable burgers.  I love the Sunrise...", "I love the burgers and fries!!! \nThe black bean burger is the bomb!! \nIf you haven't visited the food truck, you have no idea what you are missing."], "rating": [4, 5, 5], "TBscore": [0.3, 0.31, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["burger"], ["burger"], ["burger"]]}
{"id": "HVUslnDifJqBIVWqfV1mZg", "text": ["I love this place. \n\nIt's a total hole in the wall - but a fantastic one. Note that they are only open Monday through Friday - 8:30 AM - 4:30 PM. \n\nThis is...", "My kid loved his Chili Cheese Dog and his Frito Pie in a styro cup which you just don't run into outside the South. Think Nachos. I loved my Boudin sausage....", "Love this place.  Hot dogs are cheap and the owner just added some great items to the menu.  Service is friendly and fast!!! Frito pie is the bomb!  Usually..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "i6vpl9mUz57ci4EHu_oQGQ", "text": ["We just moved to ridgeland and started writing out at the northtown gym. After working out on Saturday night we noticed a bunch of cars in the stove through...", "This place is really nice. They have a nice waiting area with music. There are so many different types of desserts to choose from. They also have Nacho's...", "This place is always great. Friendly service and a huge sno-cone for a small price. They always are generous with the seemingly billion favors."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "gMDKffp60_auZl8er0rGQA", "text": ["Super clean ! Really nice staff and the food was excellent ! We will be back! Bathroom was spotless and they have low carb options ! Thanks so much", "The only reason I gave 1 star is because the associate T the window was nice.  However, this was by far the worst burger I have ever eaten.  Black and bleu...", "Can't speak on their burgers, but their grilled chicken sandwich was by far the worst in my life and I am 64.  Very tough, stringy and couldn't even bite..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, -0.5], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["burger"], ["chicken", "sandwich", "burger"]]}
{"id": "K3vhzr7LI2YEofdm7OuouQ", "text": ["This burger joint is really good, the meat was very tasteful, season well. The portions were commendable. I have to go back and try their grilled chicken...", "My husband and I visited this location on Friday, July 13, 2018. I ordered 3 back yard burgers with extra mayo and no mustard, a large order of onion rings,...", "Hard to decide which is worse the food or the service. Disorganized design and microwaved food served by surly help. Ugh!  Go to Chick-fil-A next door."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chicken", "burger"], ["burger"], []]}
{"id": "iYbbiRAYU-epyGDaStehHA", "text": ["One of the best true southern food meals you'll put in your mouth many choices cook fresh daily eat there all the time pricing is very reasonable service is...", "The choices you can choose from are insane. I got a one meat & two sides blue plate with country fried steak, fried green tomatoes, and coleslaw. Everything...", "I'm not the biggest meat eater but all my friends love to come here l. I got the veggie plate. over all it was good they even put each veggie in a different..."], "rating": [5, 4, 4], "TBscore": [0.0, -0.4, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["steak"], []]}
{"id": "fEpSG5MT4_FPTJfvW_1jQQ", "text": ["So yesterday, I went to cash in on happy hour 1/2 price drinks. I was looking over the menu and spotted the new brioche breakfast sandwich and was like hmm...", "I went there today.  Lot was practically empty. Pushed the red button for service. Waited for about 7-10 for someone to answer. They never did, so I just...", "What can I say---sometimes you just crave a burger, fries, and a chocolate shake! No lines and they even had their credit card machine outside of the pickup..."], "rating": [5, 1, 4], "TBscore": [0.47, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["sandwich", "breakfast"], [], ["burger"]]}
{"id": "Q2bJ2FQ45YsZfnuNJc4CQw", "text": ["This Sonic is far from the best I've ever been to. They have some pretty bad attitudes, are slow, food has been cold on more than one occasion. I will not...", "This is the worst sonic I have ever been too!! They can never get my order right everytime I've went. Blaine ( the carhop) is sooo... rude. And not polite...", "No complaints about this Sonic.  Service is friendly and quick.  The food is typical Sonic food - burgers, coneys, fries, tots, etc.  I love their chili..."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.26], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [[], [], ["burger"]]}
{"id": "E-x7PR-ZYUGyyTZy-qKSYA", "text": ["The staff was super nice but like every other sonic they didn't have the one thing I wanted, which makes up half of their ice cream list, COOKIE DOUGH. I...", "Food is decent enough for fast food. The staff was friendly as one would expect. The dining area was smelly...like ketchup has been sitting out too long...", "Yelp forces me to give this establishment at least one star or else I would give it negative 3.5 stars!!!!! First of all, they take 10 years to make any..."], "rating": [1, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "JuFYaZ1tn0A-bXu1JxBBJw", "text": ["What happened to quick service in a drive thru?  This Krystal used to be a great restaurant but things have obviously changed.  Got in line this morning...", "Ate here when I met up with an high school friend from way back. I ordered my favorite sandwich that I always get Chicken. It was delicious as always....", "The food is amazing! It's fresh and made to order. The dinning room had a stinky odor. The bathrooms were not clean but to top it all off the customer..."], "rating": [1, 3, 4], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [[], ["chicken", "sandwich"], []]}
{"id": "KY8XAq1Fdotb9OjW33b2cQ", "text": ["Supreme sandwich shop. I get the deluxe club every time. I am not a fan of spicy mustard, but I have friends that say it is divine.", "Second visit and still a laughably small sandwich.  I can only assume the old Lenny's by Dogwood went out of business because they made good full...", "Went back today, ordered a philly add mushrooms extra meat and cheese... was really good except they added a tone of Jalapeños instead of onions, still..."], "rating": [4, 1, 3], "TBscore": [0.6, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["sandwich"], ["sandwich"], []]}
{"id": "kTLJhxAkg1G-W_N0fmbp-A", "text": ["Some DQ lore for you: There was a time (and that time may be now) when employees were required to flip your Blizzard upside down in front of you to prove...", "do they ever clean this place?\n\nflies flies flies flies flies flies!\n\ni stopped going there over a year ago and thought i would give them the benefit of the...", "Ok. I'll start by saying that I travel for a living and have a weakness for DQ blizzards. This said, I have had many great blizzards over the years. This..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "8niviAtEJ0hILUUq6gv1sA", "text": ["Wings were overcooked. Tasted like I was chewing shoe leather, just with sauce on it. After sending the first order back, the second order was just as bad....", "The ABSOLUTE WORST SERVICE EVER!!!!!\n\nI came in for an early dinner - around 4:30.\n\nIt took 5+ minutes to get a beer with less than 6 people at the bar and...", "Food ok. Bathrooms are disgusting. If I could of gone #1 outside I would have."], "rating": [5, 1, 1], "TBscore": [0.0, -0.22, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["wings"], ["dinner", "bar"], []]}
{"id": "DMuNiPoAc4Ef5DhGiyAkHQ", "text": ["I know I said in my last review I probably wouldn't be back but the owner Tony asked me to come back in and let him try and make it up.  So I snuck back in...", "Set down to watch a game and get some work done, ordered chips and queso, After 10 minutes, still no chips and case so, but had to change plans and asked...", "Our waitress was super nice, but we sat there for 2 hours before we even got our food. Then on top of that  the food was horrible. We got our appetizer..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "DkgggfX72AxDInHDupHNqw", "text": ["We went through the drive through, and the person was so patient dealing with us. Two of us had never been and were trying to figure out what we wanted to...", "By far one of the worst service experiences I've had. Unprofessional service from employees. They looked like they hated their jobs.  Couldn't figure out...", "Service was good,  food was good, but they need to figure out the Soda machine... more than half the selections were unavailable."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "OZrWUqoM-rDRL19Ih66IrA", "text": ["Finally tried them, passed by this place a million times. I actually enjoyed the wings, didn't have the hamburgers, but the hamburgers looked so good. I...", "The food at Appetizers is excellent!  Everything good but the wings with mild sauce are still too hot...they need a different mild sauce.  People are nice...", "Staff wasn't very friendly. Not very edgar to take order. Food: wings were great. The cheese fries were gross. The fries were good. But the cheese is..."], "rating": [3, 4, 2], "TBscore": [0.4, 0.49, 0.38], "normalisedRating": [0.2, 0.6, -0.2], "keywords": [["hamburger", "wings"], ["wings"], ["wings"]]}
{"id": "QqBVMtUhp7b5l851dBsvFg", "text": ["The food was great! The lemon pepper wings was hot and fresh. The shrimps are the bomb too. The wait time isn't bad at all. If you haven't eaten here please...", "I've tried to give Ellis Seafood an opportunity to, at the very least, satisfy my seafood craving. Saturday night was the final straw. Any seafood lover,...", "Meh. \nI said months ago I was never going back, since they never ever get my orders right and shorted me on my lb of crab legs. But Jr Foodie wanted..."], "rating": [5, 1, 2], "TBscore": [0.21, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["wings"], [], []]}
{"id": "UQ0JixWa7R1AAp5l5J90Yw", "text": ["The worst service at any fast good establishment I have ever been at. Attitude as soon as we walked through the door. Was called \"Felicia\" as in \"Bye...", "Terrible service. Forgot to order a drink in the drive thru. Asked the cashier if I could add one at the window she proceeded to tell me that I can't order...", "I will not go back. 11:45 am, my fries were cold, as for my burger. COLD. Not even a bit warm. Didn't even attempt my special order( no mayo ). \nWent..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], ["burger"]]}
{"id": "vDtvyrhx3ynS5xsiczdOqw", "text": ["Been coming here since I was a kid in the 90's, amazing southern food and the pan trout fish sandwich is everything", "Eddie's is one of the places for fish in west Jackson. Its one of those local spots that everyone in the neighborhood knows when you stop by and say hi. You...", "This is the best place to get fried fish like momma cook at home. I've been coming here since my days at J-state (90's) when it was called Eddie's and..."], "rating": [5, 4, 5], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sandwich"], [], []]}
{"id": "j4cFXoZ2vAhELpegoJTQ8Q", "text": ["Piccadilly's at 55 N. Jackson Mississippi .Dinner to go meal. This meal is very disappointing. The fried chicken taste like fried fish.  . The carrot...", "I eat here fairly regularly, and I am usually satisfied. But today I went here and got pot roast. It was the strangest pot roast I ever had. Pot roast is...", "My father drags us to this wretched place almost every Sunday after church. I would rather eat cereal at home than eat any of this food. I have tried almost..."], "rating": [2, 2, 1], "TBscore": [-0.69, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, -0.6], "keywords": [["chicken", "dinner"], [], []]}
{"id": "SrrObhmE1O4cf6AZFxTefQ", "text": ["We drove to this KFC because of the time that is posted in for this store. The info says they stay open until 10 pm. The place was dark and locked up. The...", "Well They Got Me Again! This KFC Needs Help Or Shut It Down!! They Don't Even Try To Give Good Fresh Food , They Just Give You Food, Sad!!! When Does It Stop?", "Ok I get it.  Its fast food, but the staff canat least pretend to care.  The drive thru lady was very short, couln't have cared less.  No offer for any..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "s923EXW-awFZ68xGPhZhKw", "text": ["Unless you like you dinner served with a side of heart disease, go elsewhere. There's basically two things on the menu: chicken tenders (fried) and catfish...", "Good atmosphere and staff, they very helpful and made sure I didn't need anything, without being intrusive. Ordered hamburger steak and receive good...", "Great, country-themed restaurant! You seat yourself and they'll come to you. The burgers are my favorite, but the catfish platter is great nonetheless."], "rating": [1, 3, 4], "TBscore": [-0.6, 0.52, 0.77], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [["chicken", "dinner"], ["hamburger", "steak"], ["burger"]]}
{"id": "hA5m6ggovndXuSzRMhBVVA", "text": ["I went to school and Auburn and this place was a staple! But since graduating, I've been living on the other side of the country for 5yrs. I had no idea...", "I tried the Nutty Nana, Fancy Nancy, Buffalo Barclay, Lauryn's Lemon Basil, Olivia's Old Southern, and Pimiento cheese. Let me give you the run down,...", "Fresh idea not your typical fast food. Good taste. Portions are equal about cup and or scoops. A variety of salads from grapes to broccolis. The store are..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "jvoZADxhaniBRjWNqRxsvA", "text": ["I love this place! The best banana pudding you'll ever have! Staff is helpful and friendly as well!", "I love this place. Great looking casseroles and such. Tried the chicken and rice, chicken salad and pimento cheese. All were delicious. I will get supper...", "I was given a gift card here because I was having major surgery and wouldn't be out of bed for several weeks. I went in prior to the surgery and met a very..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["chicken"], []]}
{"id": "LlMPpfhAzZ3riWKtr1jdGw", "text": ["DON'T come here to buy groceries. You'll be mad because you can't find basic needs, and what you do have will cost a fortune.\n\nWith that being said, the...", "This is definitely what one would call an artisan grocery store. There produce is amazing, the meats and seafood are fresh and the baked goods are...", "The sweet cornbread alone is enough to make this place a 5, holy amazing. It's one of those breads where you can see the kernals. As for all the other food,..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "MNCARu52J5_ifAFAe8g__A", "text": ["One word describes this restaurant , MAGNIFICENT!!!!!!!!  The food is delicious and the service is great. My favorite is the salmon with a side of asparagus...", "We came for a late dinner (after 10) and our server Darcy was wonderful. Even at the late hour we felt welcome and the food came out perfectly and was...", "Had to come back for some more of that \"Bang Bang\" shrimp! \nAnother great dining experience. If the menu had more options then this place would definitely..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.44, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["dinner"], []]}
{"id": "WL2CVXPXdJ1W1fDiKGhraA", "text": ["I've been to this location dozens of times. On at least 2 prior occasions, I've been shortchanged. On multiple visits I've been overcharged and had to...", "This location is impossible!  They all act as though they hate their jobs...as if I am an inconvenience.  I work in the the business they are part of, so my...", "The morning staff is pleasant, Kim & Kelcy. They are professional & are always aiming to please the customer. Two thumbs up for the service they..."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "5gc5cCrI44dCLlU3O9ZCIg", "text": ["Visited the Food Depot hot foods section because on my quest for bomb peach cobbler, I was told this was the place to get it....nope.\n\nIt wasn't bad,...", "Best friend Chicken in the city, hands down. Always juicy and fried/seasoned perfectly. Always a good selection on veggies. All well seasoned. Don't be...", "As a person that has lived in and visited many places across the country, this is not the cleanest grocery store, but it is not the worst I've seen either...."], "rating": [3, 5, 3], "TBscore": [0.0, 0.37, 0.0], "normalisedRating": [0.2, 1.0, 0.2], "keywords": [[], ["chicken"], []]}
{"id": "-Vn_1iApibcfoWoSnhU82Q", "text": ["During a trip to Forest Mississippi. We realized there wasn't a decent restaurant there.So will drove back to Jackson and went to Piccadilly. The food was...", "Quite easily the nastiest dining experience I've ever had. From the nauseating odor to the hard sale technique and the shameless treatment of patrons as...", "One of the best dining experiences EVER!!  They had OX TAILS!!!  From the great selection of entrees and sides to choose from to the outstanding customer..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "7vJ7vKZHooJ91N0ANVlOgA", "text": ["The food was excellent. The wait was a little longer than I anticipated but the food was still good.", "I don't know ‍ who the other people had for a waitress but my server was  great!\nI order a steak n eggs with hash brown for breakfast and it was cooked...", "Visited this location tonight. My server Vikie was attentive. It took a while to receive my food because they were short staffed, however the manager Greg..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.44, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["steak", "breakfast", "egg"], []]}
{"id": "dXnZeVTB7teFlZmt6QiKNQ", "text": ["Best waffle house in the jackson area... and one of the best wafdl house servers in the industry (Nina). She's the only one who is always attentive and...", "The scrambled eggs were \"magical\" according to my son and the rest of the meal was pretty darn good to. Typical as Waffle Houses go but with a little extra...", "This is my favorite Waffle House in the Jackson area! The food is amazing along with the people that work there! Love them! I've been there a few times and..."], "rating": [4, 5, 5], "TBscore": [0.6, 0.0, 0.45], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["waffle"], ["waffle", "egg"], ["waffle"]]}
{"id": "OHTVQeOkg2tRSN-Gg_HniQ", "text": ["Living in the South,  I have been to my fair share of Waffle Houses and they're usually the same: noting fancy, the floor and tables a little sticky, the...", "If I ever gave a better review, I don't know where it was. Lisa was our waitress and her presentation of herself was outstanding. The food was super, the...", "I'm going to make this review short and sweet.\n\nThis is probably the worst Waffle House I have ever been to.  Food is the usual and it's good.  But the..."], "rating": [4, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [["waffle"], [], ["waffle"]]}
{"id": "ofE-M0uDGAEdT9_wy8PmYg", "text": ["Have had really great service lately at this location and have really enjoyed the food quality which has been top notch. Waffle House can be a rough...", "Ok so we come to this Waffle House often.  Sometimes you just got to have Waffle House.  But today, our server was fantastic.  She is new and really good....", "I know I went during the lunch hour and I expect to wait a little bit but I waited a long time for service and then for my food that did not come out all at..."], "rating": [5, 5, 2], "TBscore": [0.28, 0.43, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["waffle"], ["waffle"], ["lunch"]]}
{"id": "KWhgxPGSCTeDDAfwirAlCA", "text": ["This is one of the cleanest Waffle House I've ever been to..\nChad the manager is awesome...\nAnd I couldn't have asked for a better waitress, thanks Neicey...", "Been waiting for my food for over an hour and customers have came in after me and ate and left already. I asked for a refund and I was informed that there...", "Poor service. I an a friend went to the waffle House on Beasley Rd in Jackson MS this morning at 10:45 for breakfast. When we arrived their was a couple..."], "rating": [5, 1, 1], "TBscore": [0.57, 0.0, -0.4], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["waffle"], [], ["breakfast", "waffle"]]}
{"id": "l6eK5BYo6rdtj6Rw3ADUNg", "text": ["Very clean and bright atmosphere. Waitress was friendly and extremely patient while we checked out the menu. Holiday music wasn't too loud. Great food!", "What I ordered Vs what I got!! $40.00 later off waiter! This is my first ever yelp review! I love Ihop but today was the nastiest food I've ever tasted!!...", "My daughter and I recently visited this IHOP location for the first time and I highly doubt we will ever be back. The food was very poorly prepared,..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "JBHZFwFSi20CTIG3Km2i_w", "text": ["I have ordered from here multiple times and I still get the same quality of service! Most times I \"try\" to make an over the phone order (usually Friday...", "Respectfully, to all my fellow Yelpers. \nIt's the Waffle House. Not the White House. \nYou have to make a legitimate effort to communicate your wants and...", "Ok - just to start, this is not a \"I went to Waffle House and expected great service\" type of review. I legitimately just showed up trying to get something..."], "rating": [2, 4, 1], "TBscore": [0.0, 0.23, 0.4], "normalisedRating": [-0.2, 0.6, -0.6], "keywords": [[], ["waffle"], ["waffle"]]}
{"id": "CRLH8IbvuoAu-TLHq7PaQg", "text": ["This is my favorite Waffle House in all of Mississippi. This team has it down. From the wait staff to the cooks the nicest folks you'll ever meet!", "Stopped in for an early breakfast on the road. Had to sit at a dirty table, as all the empty tables were dirty. Most did not get cleaned the entire hour I...", "Arrived and was not greeted. 2 tables were occupied and ALL others had dirty dishes. There was a group of friends of an employee standing at the bar talking..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, -0.6], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["waffle"], ["breakfast"], ["bar"]]}
{"id": "iQKOQWai7-uBv2bGciWQEA", "text": ["I really like Waffle House it has always been a favorite. The food was good the service was great and the establishment was neat and clean. I would Recommend", "Well, called this morning and was told that they were too busy to take my order, I would have to come in to place my order.\nThis means that I have to now...", "We decided to stop in and have breakfast. What a big mistake. Not one hello, or May we help you? No place to sit because the staff did not clear the empty..."], "rating": [5, 1, 1], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["waffle"], [], ["breakfast"]]}
{"id": "g8DI_KhH-0pDDbNJAb6wHQ", "text": ["Needs to be cleaned..\nDirty! Tables, floor and windows needed to be cleaned . Service was lousy. Wait staff needed to wash uniforms.  Need do I need to say...", "The food was good but the customer service was horrible. Very unfriendly waitresses. There seemed to be some tension and confusion between the nine (9)...", "We love Waffle House but today the staff was just lazy. There was only one family here when we arrived but every other table was full of dirty dishes. The..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], ["waffle"]]}
{"id": "5l2acLGS6fBD4UHjODLehA", "text": ["Tons of food for the value...and in Madison, no less! \nWhat a cool idea to take an old legend and really locate all the locations into one epic memoir...", "My husband wants to give them another chance. Fine. But if it were up to me, I won't come back for the following reasons:\n1. they do not have a changing...", "I recently went to Fill-Up with Billups and I previously went to the restaurant when it was Bacchus.\n\nI was unaware that Bacchus and Fill-Up with Billups..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "8Lze1KSSAP0KcnNcZLcRGQ", "text": ["Let me just say that my main goal in this review is to make sure that good, friendly service is acknowledged. We have had the pleasure on multiple occasions...", "The food was delicious, just your typical Waffle House fare. Service was pretty bad, but again, typical of Waffle House. But the roach that decided to crawl...", "Still a new restaurant so accuracy isn't all there...check your \"to go\" orders before you leave.  Staff is friendly and the food is good."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], ["waffle"], []]}
{"id": "j-d6t_22r2VOuwqnZCHbIw", "text": ["Do NOT come here!!! You have been warned! Food came out with raw eggs and partially raw bacon! If we would have eaten what they gave us it could have killed...", "Place us always good. It is what it is. Just good greasy diner food. Workers here are always nice to us. Usually a late late night eat when you want...", "What to say about this icon.....You just have to love a place that they have a picture menu.  The Chocolate pie is fantastic and the staff always friendly."], "rating": [1, 3, 3], "TBscore": [-0.24, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.2], "keywords": [["egg"], [], []]}
{"id": "rfr5sVpCtdz0ijhjhVrerw", "text": ["Wish I could explain how upsetting it is to try to give this place a 2nd chance with again being completely ignored.  But, this is my 2nd time there and NO...", "The service was so poor I left. After 15 min of being ignored (only 3 occupied tables) wait staff carrying on personal conversations. It's also dirty. This...", "Had I noticed the cobwebs and food under table or if I had went to the bathroom, I would have never ordered. We  had already ordered when we saw these..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "OtoVsLW-YhNhzKcMrnWENg", "text": ["Really good service and very budget friendly. The better one of the local diners. I had the farmers burger with hash browns, which they gave me fries...", "It's just cheap diner food, but I prefer Huddle House over waffle house anyday. They have a lot more options and the weekend night staff is AMAZING....", "For a late night meal that's convenient, Huddle House is a good choice. \n\nWhile this would never be my first choice during normal business hours, during the..."], "rating": [4, 4, 3], "TBscore": [0.35, 0.5, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["burger"], ["waffle"], []]}
{"id": "cZV5Zm0I0tKdKCZmZ3_koA", "text": ["One of my favorite Greek restaurants in Madison and Ridgeland. The patio area is perfect for an intimate glass of wine or a family dinner. Call to find out...", "Worst restaurant experience I've had in many years....maybe ever. Not sure I've ever been at a restaurant for 2.5 hrs and waited that long between touch...", "This was a great place to get some lunch. We loved sitting out on the patio. The patio had a great breeze. The bacon cheese burger was really good. The..."], "rating": [4, 1, 4], "TBscore": [0.42, 0.0, 0.75], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["dinner"], [], ["burger", "lunch"]]}
{"id": "K4KUM5zwq8VRNmoZ5A6byw", "text": ["Great home cooked food! I highly recommend Grant's for that \"good mood food\". Atmosphere is set to relax and enjoy.", "I really liked Grant's. The baked chicken was moist and flavorful all the way to the bone, the sides of Lima beans, Mac and cheese and potato salad were...", "Wonderful delicious comfort food. We have always had a good experience -- during busy times and slow -- love the selection.  Nice, helpful people."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "LvlNDIoiaYzA-V6MElZAzg", "text": ["We had the Fried Shrimp Poboy!\n\nTo be honest.. looking at the photos on yelp... it didn't look tasty but because of the starts we went and IT WAS REALLY...", "Hubby & I stopped in here for a early lunch. I was craving some crawfish but they were completely out at 11am. So no crawfish at the CRAWFISH BARN. Yikes....", "I love these kind of places.....simple food dives that don't try to be anything but simple yet tasty. On our way through the area and checked out my trusty..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "XSgyKGad9UrrlKlZLxbMDA", "text": ["Went for lunch! We ordered pork chops but didn't get them until we were almost finished with our sides! The food was good,  and the servings were large!...", "Best soul food in Jackson, hands down!! It's always seasoned to perfection!! My only con is that they were a little far away from where I lived but that's...", "I'm a regular here...you really can't beat the good food, great price and huge portions. You can get 3 home cooked sides, desert, a drink and a meat with..."], "rating": [3, 5, 5], "TBscore": [0.48, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["lunch"], [], []]}
{"id": "YeJJa8O6Hdd9pCkKTDHDqg", "text": ["The staff was unprofessional, like they really didn't want to be there. The food was not as good this time. Table was not clean.", "Since my hosts were taking me to various places to eat, I asked them to take me to Capt'Ds.  This place reminds me of Long John Silver, but with an urban...", "Had to try the lobster rolls and I was so pleasantly surprised!!! Not only were they so good to me, but the staff was really friendly!!! I only went through..."], "rating": [2, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "G7dwRfO1pLNFSAxXqRergA", "text": ["Great little find in between softball games!! Game in and was immediately greeted by the cashier. I asked for a suggestion and he offered up The Snappy...", "I've always seen bops but never stopped. Man I was missing out! We got the snappy turtle (their best seller). It's a custard sundae with caramel, hot fudge,...", "Bop's Frozen Custard is a great option for a quick sweet treat. I have been to a few locations and they are all pretty much the same with the same..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "CZ8h72YatJEVpFT6J9YO0A", "text": ["Delicious and creamy custard! Loved it! Had to come back and order more. Staff was friendly and helped me understand the menu. Great variety of toppings and...", "Bop's is a must whenever I'm in town. Why? The customer service is fantastic and the custard is out of this world! I always get the Amazing Grace concrete...", "Aside from the well know 31 flavors spot I noticed the Bop's is the only ice cream (frozen custard) spot in town. There are places you order and 'get' ice..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "3m1JdGmxmmFEEK5Mjb20VQ", "text": ["Similar food  to any other cfa.   Long lines. 20-30 minutes on most Saturdays to get through the drive thru.  At one time, maybe still, this was the second...", "I've lived in 4 states and this is the worst chick fil a ive ever been to... \ntakes forever, workers are rude and act like I'm interrupting their social...", "So my first mobile order transaction on the Chick-Fil-A One app was a complete and utter... SUCCESS! The biggest issue was finding an open parking spot to..."], "rating": [3, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "gKVeSNvVlwQC2Ry9ROPNYA", "text": ["I come here often. Very friendly, very prompt, excellent price and product!\n\nI love the maple bacon bars!", "Really tasty donut products with a staff that is very very rude and unpleasant. Kind of a quandary in that you have Krispy Kreme on County Line. \nBut the...", "The pecan rolls had just come out of the oven. Oh. My. Goodness. Heavenly!!!\n\nBright and clean, nice open space! Everything in the case looked delicious!!"], "rating": [3, 2, 5], "TBscore": [0.58, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 1.0], "keywords": [["bar"], ["donut"], []]}
{"id": "sut43954PXd0Vfy6uRvhFw", "text": ["When I was a kid, Jackson had a doughnut shop in West Jackson names Harlow's. Those were the BEST doughnut ever. Then they closed and Dunkin Donuts and...", "Well just shows how busted jackson is.   Wanted to surprise coworkers with doughnuts and went out of my way to find this place bc there is no place to get...", "We went and this place tuesday but it wasnt even open!! It was 2pm. So disappointed... waste of time and gas. I guess no where in mid day will I find them..."], "rating": [5, 1, 1], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["donut"], ["donut"], []]}
{"id": "GWYFRU417XETtn4lRGGmeQ", "text": ["These donuts are so fresh, airy and just the right amount of sweet. I honestly like them better than Krispy Kreme, which I also love. I love how they fill...", "Well, I can say this  place is no frills. There is a drive through, which I didn't use because I let another car go ahead. So, instead I went inside to view...", "The donuts are very moist, not to sweet sometimes I get there before it opens and the man is always friendly and happy to assist and say give me 2 minutes..."], "rating": [5, 3, 5], "TBscore": [0.43, 0.0, 0.43], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["donut"], [], ["donut"]]}
{"id": "V6YyGZPe34i5ia_19ZBgNQ", "text": ["First off, I have a disclaimer, this is not the location I went to. So anything written below is not a reflection of this particular store. \nMy family would...", "Shipley is always good! No matter which location I've visited they are consistent in freshness.", "I love this place. The staff are friendly and the donuts are fresh. Today I ordered a glaze donut and strawberry filled donut. I'm only in town for a few..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.23], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["donut"]]}
{"id": "t_Ppzh838iL8TgP0orAgIw", "text": ["They have the best jalapeño dogs, which is a big pigs in a blanket! They also have regular ones if you don't like spicy. They are so soft and just perfect,...", "I give it three stars now. Before it would've definitely received 5 stars\n\nThe donuts are still great, light, fluffy and airy!  But the selection the last...", "I always a Mom's and Pops donut spot, new to Mississippi. Maybe I arrived late from the morning rush,  but wasn't much to choose from.  Can't go wrong with..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], ["donut"], ["donut"]]}
{"id": "C5IZ7K1-AsjUpiPEmLPhRg", "text": ["We come in on Fridays. My son gets  six donut holes and a chocolate milk. It's a family owned business and the owner and his son plus the employee that work...", "Best donuts in Madison by far! We typically go simple and get the donut holes and plain glazed, but the specialty donuts are delicious, too. Bring cash and...", "Good soft donuts with some average kolaches. Not too expensive and fresh."], "rating": [5, 5, 3], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "-QHmAGmTeRob-PMUdijaBg", "text": ["Exceptional blueberry cake donut with Delicious coffee...Perfect Breakfast for a Sunday Morning :)", "Their stuff is always fresh. The place is clean, parking is easy to find. My bf loves their Kalaches, pretty cheap too!", "Chances are, when you walk in there's going to be a line and there's a good reason for that. I've never had a bad experience with Donut Palace. Everything..."], "rating": [5, 4, 5], "TBscore": [0.72, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["donut", "breakfast", "cake"], [], ["donut"]]}
{"id": "3K1ivoYQdV9Zba3rPNUSNA", "text": ["They are running a sale 5.99 for glaze but when I show up at 7am no hot donuts to speak of. This place needs new management I think. Second time this has...", "Not a big variety of donuts. No apple filled, no strawberry filled, no powdered donuts. Could have gone to Walmart and gotten same thing.", "I'm not here to be judged, but the \"hot light\" was on and we had to stop! I mean, who doesn't stop for the hot light?\n\nAnywho... Once we got the got box in..."], "rating": [1, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 0.2], "keywords": [["donut"], ["donut"], []]}
{"id": "vRL25esUjWZ7ruaNGW_xRA", "text": ["Had to drive 80 miles to Jackson for VA hospital appointment, so I decided to stop first at what used to be my favorite donut place. It was about 10:00...", "If I can put 0 star for this dunkin donuts store. Worst donuts I ever had. I asked chocolate froze, and they give me glaze donuts, 1 donut was broken, the...", "This store seemed very clean and the restrooms also were quite clean. It wasn't real busy but service was very good and very quick. Coffee was hot and fresh..."], "rating": [1, 1, 4], "TBscore": [0.38, -0.7, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [["donut"], ["donut"], []]}
{"id": "45bp2ZWc29g-ICdiROoTtw", "text": ["This was my first visit to Georgia Blue. The food totally lived up to the hype created by some of my friends. Special shoutout to our host, SHANE, who was...", "1st review was deleted by Yelp. This is my 2nd attempt. \n-food was fine, not great, not bad\n-service left a lot to be desired, like a lot a lot \n-waitress...", "5 stars and well deserved! For appetizers we had the fried green tomatoes and turnip green bites! The FGT were pretty good, but the turnip green bites! Such..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "qBd3LddPZgIA-IoXBr6OIA", "text": ["Food was the very Okayest it could possibly be. Upon entering, all the staff yelled \"Welcome to Moe's!\", then set about the task of making their customers...", "I love Moes. I always get Wrong Doug Stack. Two employees really stood out to me and their names were Josh and Calandra. Josh was very pleasant and I even...", "My family and I have gone to Moe's twice now. The staff is super friendly. You're greeted the second you walk in the door. They are all about the costomer..."], "rating": [2, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "nUhYmKJxPdO4nf1sxXmwxA", "text": ["New FAVORITE spot! We just moved here and decided to try GB out! I am HOOKED! Thankfully it's 8 mins from our new house!\n\nThe Turnip Green bites were...", "Stopped here for lunch last week while working in Madison. A nice, locally owned restaurant; however has a little chain restaurant feel. Ordered the...", "First the good. This place has a great blues/Jazz feel and bit of a Nashville touch. The atmosphere wasn't too loud and the wait was only a few minutes. I..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], ["lunch"], []]}
{"id": "WAEpmtPAVZ7EBrw1LTUgcw", "text": ["The employees are really friendly.  Our food was made correctly, was hot, and came out in a timely manner.  The service and food here was better than your...", "Stopped by for the new breakfast tacos. Only one car in the parking lot with two employees working. After walking in and waiting at the counter for awhile....", "Our food was good and came out hot and fresh....The service was good everyone was very friendly...\n\nThe restaurant is in need of updates..... The parking..."], "rating": [3, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [[], ["tacos", "breakfast"], []]}
{"id": "Gr_Ht1g2-Ms4XAcAA-iJ8g", "text": ["Saturday date night was at Monte's Steak and Seafood. This place was only 10 minutes on the 55 from Baptist! Much closer than I thought. The place was...", "So I came here for lunch one day while in the area for work a few months ago, and it was so good I had to go back. Came back the other day and it was just...", "From the atmosphere to the food, it's a really good place to enjoy a meal. \n This is one of those restaurants that will have you thinking about what you're..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["steak"], ["lunch"], []]}
{"id": "Fp25RBI_gln28qK7XC5Ikw", "text": ["Im from the south and saw they had fresh greens and green beans and fried chicken and Im here to tell y'all, they know how to season it all the right way!!...", "I always like the skillet....I'm a truck driver and they were very nice inside....some good old southern hospitality.", "Avoid this place. Service was terrible. I walked in and the waitress that approached the table looked like she was totally annoyed that someone sat down...."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["chicken"], [], []]}
{"id": "8OsIhKyBom8b-qdzPmBHvw", "text": ["We came in on a Friday about 5 and had great service good beer and good appetizers. The broiled shrimp was amazing and the deviled eggs were delicious. I...", "Friday night horror!  My food finally arrive after 8 others in our party;  ordered steakhouse burger, well done; it was really rare.  The waiter brought it...", "The food and service here was outstanding!! The cowboy cut ribeye is literally enough for two (my husband had this), I ordered the 10oz filet and both were..."], "rating": [5, 1, 5], "TBscore": [0.76, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["egg"], ["burger"], []]}
{"id": "ftsAnefJVfFjA2V2k69RrA", "text": ["I will NEVER waste my time or money here again.  After over 30 mins I asked for my salad, which must have been frozen at one point because over 30% of my...", "I really like these pizza places. They are always tastefully decorated and reasonably fast. This particular location was really good and the woman behind...", "Pretty good deep dish for MS., Especially since this is. The only place I've where I've found a true deep dish pizza in this state and area, I will order it..."], "rating": [1, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "beBzgHMyOI7i4p7uo6imjA", "text": ["Some of the best pizza I have ever had!  The cheese is the best and they don't scrimp on the toppings.  Never dissapointed", "I had a personal pizza and cheese sticks. The food was excellent. The brownie dessert was awesome. The reason for 4 stars was the limited \nThe last few...", "I'm in pizza love! I'm sitting here eating leftovers from the carryout I ordered last night, and it tastes just as scrumptious as it did then.\n\nThe crust,..."], "rating": [5, 3, 5], "TBscore": [1.0, 0.29, 0.31], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "zvqC3Gc47B_3enBX4aX69A", "text": ["The people working at this Dominoes are always so friendly. Seriously every time I've gone these past 4/5 weeks it's been a different person and everyone of...", "I placed an order at 11 pm that was never received. When I called and asked for my order they said they could not find it then they put me on hold for...", "Real nice experience. 8:45 pm and they won't let me inside to wait for my pizza. I love being treated like a threat.  Don't worry, I won't be back."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["pizza"]]}
{"id": "86ZxAbbuYZ9Gidv2Nhu6zw", "text": ["Worlds worse dominoes. They have door with a open sign but won't let anybody in. Instead they would rather traffic be held up instead of serving there...", "I order from my job which is right around the corner and it took them 57 mins to bring me my food and then to top it off they got my order wrong and my...", "This is the only pizza I eat... Always fast always good... I love it always... I have never had a problem with ordering or even with my pizza... My family..."], "rating": [1, 2, 5], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [-0.6, -0.2, 1.0], "keywords": [[], [], ["pizza"]]}
{"id": "y5M8Yd3GJlF5mdwWEwnQPg", "text": ["Me and my dad brought my brother for his first fried pie experience. We had pizza, a big guy pizza, chicken pot pie, blackberry, and Apple. There is no...", "Do yourself a favor and stop here!!!\n\n\nEverything about this place is great! Decor, set-up, the flow, the product, the owners! \n\nI bought three pies....", "You can't order wrong. Everything they have is five stars including the owners! Worth the drive from anywhere!\nThe coconut is my absolute favorite. Peach is..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken", "pizza"], [], []]}
{"id": "hq0FrMgxg0igHxcnS1HYdg", "text": ["Love this place!!! The buffet was small and that was disappointing but the pizza was still great.", "Visited Mazzio's in Madison, Ms for lunch.  I was very pleased.  I enjoyed the buffet of pizza and the very generously stocked salad bar.  I do plan on...", "This chain has really slipped over the years and this specific site is no exception.  Dirty floors, dirty tables, very dirty restroom, cold Pizza on the..."], "rating": [4, 5, 1], "TBscore": [0.23, 0.45, -0.4], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["pizza"], ["bar", "pizza", "lunch"], ["pizza"]]}
{"id": "Juw2U7cIaXcGn12pVJV42g", "text": ["Great atmosphere, and great food! Even tho there was a lot of people, food came out fast and good Quality.", "Always get great food here and the newest menu items are really great. You can always count on getting good eats at this location however, you can also...", "Pretty fair for a quick sit-down bite or even a carry-out.\nLots of soup, sandwich and salad choices. \nPrices are inexpensive. The staff here were very..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.37], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "rJd9uGQM_rISjwb6sk-Hgw", "text": ["Great service, nice and very friendly staff. Even when they are shorthanded you would never be able to tell unless you asked. This is my first time at this...", "This Newk's is the closest to my house and definitely the one I frequent the most! The only reason this review is four stars instead of five is the parking...", "I never been to Newk's , but when I got there the service was great . And I got the Debra pizza which was delicious . And it was a lot of pieces of pizza..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.9], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["pizza"]]}
{"id": "IvA5ORYdAPEQ93m3Zt7QjA", "text": ["I don't know that I've ever given 5 stars to a sandwich shop, and a chain at at. But when i was in Jackson recently, our work group discovered this gem that...", "Big Apple Inn was very busy and unable to take my call in, but no despair, an old friend, me, and the superhero went to lunch. I suggested Newk's in...", "My daughter went to this restaurant to order and take home for 3 people. They completely screwed the order up. Mediterranean pizza I asked for no red..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["sandwich"], ["lunch"], ["pizza"]]}
{"id": "pQ1yRFCTIKft9XQ8R5eUtw", "text": ["I love Cici's and this is one of the better locations. \n\nIf you do not see \"your\" pizza on the line, all you have to do is tell them and they'll make you...", "My host took me to Cici's...Garbage, garbage, garbage.  The 'salad bar' is trash, the pizza is trash.   The customer service was good though.  We have...", "Worst pizza and buffet I've had in a while...\nThe prices are the drawing point here... You can't beat 2 buffets with drink for 13.91 total... but what u get..."], "rating": [5, 1, 1], "TBscore": [0.5, 0.7, -0.5], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["pizza"], ["pizza", "bar"], ["pizza"]]}
{"id": "CEsxmiST0oGVBzkUwUpExQ", "text": ["This is a good location to go for the buffet...not to order just a pizza... The price is high for a large, so I'd rather order elsewhere. \n\nThe buffet is...", "SLOW. Literally SO SLOW. Do better . It really shouldn't take 30 minutes for a small pizza when there ARE NO CUSTOMERS.", "I am going to start by saying that I did enter the restaurant about 35 minutes before they closed... I don't normally do this, but I was only getting a..."], "rating": [3, 1, 2], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [["pizza"], ["pizza"], []]}
{"id": "hgH2l2xLcpRLGGL42_lCDw", "text": ["The brisket plate was okay, but a little dry. While I have no complaints, it was not memorable either. \n\nThe portions were good for the price and they have...", "Soooooo I tried this new barbecue place called Willie something needless to say I am not satisfied ... It was utterly disgusting.. I had the hamburger and a...", "Smoked meats and BBQ.\n\nI enjoy the food here.\n\nThe pork chop dinner is fantastic. Two sides a roll and a drink. The sweet tea is good.\n\nThe red beans and..."], "rating": [2, 1, 5], "TBscore": [0.0, -0.4, 0.37], "normalisedRating": [-0.2, -0.6, 1.0], "keywords": [[], ["hamburger"], ["dinner"]]}
{"id": "7KbfuE5Ydixw75SaJ5gHew", "text": ["I think if this place makes it they will have to be open more.   I never see the lights on.   Needs to open 30 minutes earlier weekdays and probably on...", "I stopped in for a quick cup of coffee while traveling because yelp identified this as a coffee house near the interstate. I had a cup of their drip coffee...", "Tiny, quaint, and quiet.  I'm back in town, and wandered around the older part of Brandon for the first time.  I saw a used book store and wanted to stop..."], "rating": [1, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "4JRT2niWuz6C4j8GVwlJlg", "text": ["I have been live in LA last 5 years and I still can't find coffee like this is in the west coast !! Hands down best latte and the mocha frappe is one of my...", "One of the best lattes I've had in a long time. I love every cups location. Purchased a mug here this time, everything is top notch!", "Cute place to grab a drink. They do have a drive through. I was in town and wanted to try something new other than Starbucks. We got the Caramel macchiato..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "la4i5lvRsYWaEG6vFQSOtw", "text": ["It's sad  that this Starbucks coffee shop is in Target ... so, of course; there are many people in line and waiting time is pretty much significant in the...", "The barista Jasmine does an amazing job everytime. She remembers your drinks, she is always so helpful and knowledgeable. Gives great recommendations when I...", "I will not be back to this Starbucks. Twice I've come here and they have been out of iced coffee (all they have to do is make more and they won't). Went..."], "rating": [3, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "ZpBzJPtYJj8AXeAbzu63uw", "text": ["Great Team! Extremely friendly, efficient, and great humor. Glad I stopped by on my way back to FL.", "This was my favorite Starbucks until they changed managers. \nI was a regular here but I can no longer support this location. \nEVERY time I have gone in the...", "Love this place,but the wait is outrageous! Stayed in line for an hour. Never going back to this location"], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "3KH0THXv5t4PDIfrz11UNg", "text": ["I've never written a review for a fast food place before but I don't know what they're serving at this Taco Bell. I got cheesy bean and rice burritos, which...", "Good food, rude customer service.  The woman working the drive they clearly hated her job or people in general..... or both.", "most of the food is alright but the tostada shells the use for crunch wraps and such are always stale and taste like they've gone bad. i always try to avoid..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "J9sJi3zdaf0XHJfstk94EQ", "text": ["4 stars for a Taco Bell, you say?  We all know Taco Bell is a far cry from 4 star food, but this one earns 4 stars from me because they deliver exactly what...", "Horrible customer service and sound half dead when asking for your order! And they are always out of everything. Today they were out of taco...", "4 stars really yeah I'm serious the food was good fresh foods and very fast service took them no time"], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "h2rKo-tWNSn2JqCdF0VnVA", "text": ["Love this Taco Bell, I go here for lunch often and the food is always hot and fresh, and my order is always correct! Very consistent. You can tell they take...", "I just don't think it is right, that all employees park right in front.  This causes customers to park far from the door.  management needs to fix this....", "The staff was extremely rude to me. I wanted to add a side of guacamole to my order, but the worker told me I had to get back in line. I had to wait an..."], "rating": [5, 1, 1], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["lunch"], [], []]}
{"id": "2df9VbFQtz9jS3DPIF-EmA", "text": ["This has got to be one of the best restaurants I've ever been to anywhere in the world. It's a fancy or as casual as you like it to be but either way you...", "What a neat place for a relaxing dinner! The prices are higher than typical, but you definitely get what you pay for! Excellent wine selections and service...", "I am unclear why I have not written a review for this place! Its simply a lovely French restaurant. The atmosphere is perfect for a romantic evening or a..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["dinner"], []]}
{"id": "JFjlwnrEN0O9V5mOIr3POA", "text": ["We are regulars here!\nLocal 463 is the perfect place for a casual lunch, business dinners, date night, parties (private or casual), or just a Tuesday night...", "Do yourself a favor and make a mad dash to this super cool restaurant! I am a huge fan of Walker restaurant and this is owned by them as well so it lived up...", "This place is new to me. Really nice contemporary decor. Food was delicious. I had the Portobello fries and crab cake during their happy hour menu..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.54], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], [], ["cake"]]}
{"id": "6B7xRv9WB1S8ISGRXyvhmQ", "text": ["This restaurant was worth 10 stars! We visited late and they brought the food back out to accommodate us. Everything on the menu was homemade and melt in...", "This place is right around the corner from my work!  It is so fast and easy to run down and grab some delicious home cooked soul food!  Delicious!! And...", "We were driving through Jackson headed to Memphis and found this restaurant on Yelp. After reading the first review we had to check it out!! It was..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "4rxnLujn_FVu4BLnC_uoLg", "text": ["Easy on and off I 55 at exit 85, west side of road.  Looks like a new and clean place with nice employees.  Busy intersection.  2 drive thru.  Flaming hot...", "Worst McDonalds I have ever experienced.. my meat on my cheeseburger was raw. They might as well have left the cow in the field because it was a complete...", "I visited this McDonald's for the first time today and I was thoroughly impressed. I have never been treated so nicely in a drive-thru before. It was also..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["burger"], []]}
{"id": "Dug-hGxhirmzETM7LYIvSQ", "text": ["Everything ordered is fried however I have been waiting over 15 minutes for my food. Don't waste your time at this location.", "Terrible. Went through drive through- waited over 15 minutes. When asked what was going on, employee was rude. Avoid this McDonald's if possible.", "They got the order wrong, then they were extremely rude when asked to fix the order, THEN they got the order wrong AGAIN!  Avoid this McDonalds at all costs!"], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "Hj_3DVC_YI_1YJkVZX5RvQ", "text": ["Lovely interior & touch screen game consoles are very neat.\n\nI cannot believe what they did with the tiny lot they got but it was designed very well and is...", "To date, I've had NO follow up call from the Leo Collier, the so called Director of Relations! So, as of yesterday, I have sought legal counsel and will...", "This one deserves a -star for being so slow! I have been inside and they forgot my order after waiting on the order for 18 minutes. I time these \"fast\" food..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "l_QRvZa7TiqjJ1tqOgF04A", "text": ["The wife's review - So glad we found this place. I got the açaí bowl and hubby got the peanut butter smoothie.  Both were delicious. Coming from Atlanta the...", "I must say I am in LOVE! The ingredients are fresh, staff is friendly, and each time everything taste GREAT.", "In a town full of deep fried everything, sweets and sweet tea, there's Mama Nature's Juice Bar. The menu is full of delicious healthy options ranging from..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.42], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "gV7mu3yBVzKhVabH94UGnQ", "text": ["Nastiest bathrooms I ha e ever seen in a McDonald's. Drink Station was pretty disgusting also. Will never ever go there again!", "I couldn't even bring myself to order food here because the restrooms (men and woman) were so disgusting!  No toilet paper anywhere (even after I told them...", "If you are not of African American descent, do not eat here. We walked in and stood by ourselves at the counter.  They did not even acknowledge that we were..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], ["american"]]}
{"id": "WE-OkQhgtwHFvvtpdpBp2w", "text": ["There is always issues here with the hours, they are always closed before the hours that's posted. I e tried to eat here 100 times and never got anyone to...", "The worst McDonald's in the south in every way\nThe worst McDonald's in the south in every way\nThe worst McDonald's in the south in every way\nThe worst...", "Absolutely the worst, dirtiest McDonald's in the WORLD!   We travel a lot and this is the worst!  Tables had not been bused.  Food came out in to-go bags..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "_Ab0kbbMZGvCGJARct_4wA", "text": ["I'm from Illinois and was hoping that getting Starbucks would remind me of home. Boy was I WRONG!\n\nThe girl behind the counter is in no way, shape, or form...", "It's 8:10 and since she was to work late, she is not able to make me a coffee. She \"got to get all the temps and stuff first \"?!!  Even though a customer is...", "Very long wait! Only one person working at this location and with it being inside of a Target there is a lot of foot traffic. Great customer assistance and..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "DH3mWb36e4lzWqjLX2dU8A", "text": ["One of favorite spots for frozen yogurt. The toppings are always presented in a neat and organized way which seems simple- but trust me this is sometimes an...", "Still awesome. So clean and fun to hang out at. Seems to be busier now than ever cuz of the hot weather. Move to ridgeland recently and been back here a...", "I like their selection of low fat yogurt. It's always super clean in there. They have a good selection of toppings. There's also outside seating and games..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "UuXcxg6XoRFcehtSoyDtgQ", "text": ["Had to stay here for a couple hours. It was freezing. Employees didn't care, they said like it that way because they're working. Manager casually said only...", "Never had a problem out of this location. The staff have always been very professional here. Good is always hot and correct. The dining area and the...", "Pretty good for a quick lunch. They even did a combo with a Mocha Frap for me.  This is the closest place to my studio for fast food and it's always a short..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.0, 0.3], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "SMbn66aUc3hqBppyp3DjGw", "text": ["I go to this cups often and they make really great coffee but I came in 20 minutes before closing (which I hate to do but I have a test I need to study for)...", "Nice local coffee shop in Ridgeland. They have basic coffee, trendy coffee specialty drinks, espresso-based creations,and frappes along with variety of...", "Very trendy local \"chain\" coffee shop. The service is always good, though sometimes it's more cheery than others. They have a lot of options to choose from...."], "rating": [3, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "QBafMkxfovrBwOwpg0IUhg", "text": ["Wanted a different kind of snack today so I popped myself into the Popcorn Place. Not sure why it took me so long. What a cute little place. I believe the...", "I absolutely love their dill pickle popcorn. It's always fresh. I usually get the large bags so that I won't eat all of my popcorn on the way home lol. They...", "Popcorn variety was OK. First time trying this place, always enjoy eating good tasting popcorn. The flavors I had wasn't bad, but something was lacking in..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["snack"], [], []]}
{"id": "WzBBndEC-QHbNWl3z-kEQA", "text": ["It's small and not a huge selection but has a lot of Asian cooking essentials that I'm always looking for. Good price for tofu as well. The people there...", "Not the best selection ever after living in Asia and on the west coast, but it will do for Mississippi. They are literally the only place around town we...", "Small little store, great for picking up your Asian snacks. It's right by my house and very convenient when I need spices for my dishes. Not a big selection..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["snack"]]}
{"id": "ICSOYfIDR4cWn7nZ5gkktw", "text": ["My experience today at this McDonald's is very similar to my usual experience at this McDonald's.  Pull up, place order, drive to have my money taken....", "The staff was friendly.  Food came out quick ( for an order for five people). However the order was incorrect. I didn't turn around to take it back and it...", "Never had a problem with the service here. They are always fast and the order is accurate. One of the better McDonald's in the area."], "rating": [1, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "-w-8TNPMSuFEuPMSf3u5Zg", "text": ["They are beyond slow and it's so hot in here! Not sure how they can breathe! This is unacceptable for McDonald's!", "This is the kind of care that goes into your food. A man is spray painting above the food assembly line with zero regard to customer health. Major violation...", "Wow prime example of laziness. From the girl in the drive thru, to their machines \"not working\", their soda machines not being changed and having to drink..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "dZDcK1UayqAq1qTH-Q9KwA", "text": ["This McDonalds in the morning has great service and my grandparents friends come here. But don't come on afternoon shift because they don't care about you...", "The cashier couldn't be bothered to speak to me or look at me. I ordered a McChicken meal and she didn't have the decency to tell me that she couldn't make...", "This place is very bad. I ate here 4 times and 3/4 times they got my order wrong. Last night I came here and I had to wait for over an hour for what should..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "mIx_DSGmpB-W0mX1iADVIw", "text": ["The manager cussed out my grandmother and bold faced lied to her.... all over a fucking sweet tea. Barely had any tea in the cup...mostly ice\n.. then...", "Food came out fine, and we waiting long enough that it had no other choice... However, the playroom had not been looked at all day, nearly every table was...", "Great customer service I have ever experienced from a McDonald's. We were just passing by go to Texas from Florida and all the ladies working were so..."], "rating": [1, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "_zditP-j1kBtspA_9wt8bQ", "text": ["Everything was hot good and fast today! The place was clean and the food was a great value. This experience was much better than many experiences we have...", "Every time I go here there is a problem. Last time they gave me and one of my kids food but not the other. Fast forward 20 min later the girl hands my...", "I used to eat there a lot so now I don't like it anymore but I mean go ahead most people like it why not"], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "SoS8BRBdp1E3SVeVZ97csQ", "text": ["One of the slowest McDonalds ever. Then the food is cold and lines for days. These people need to step across the street to the Chick-Fil-A to see how to...", "Don't let the drive thru people tell you to park. That means, \"we just took your money and we have already forgotten you exist.\" At 10 minutes, I called the...", "HORRIBLE!!!!!!!!!!!!\nSLOW!!!!!!!!!!!!!!!!!!!\nCHECK YOUR ORDER!!!!!!!!!!!!!!!!!!!\n\nThis restaurant needs NEW management along with new employees, it just..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "KNe8DrlYUJ7hM1NadVcCjA", "text": ["This place is just cool. Cool in that speak easy way. Cool in that, you gotta walk through the old soda shop to a door in the back to get to it kind of way....", "Very cool spot to grab a few drinks and quiet conversation. Staff has always been very attentive and they have a good drink menu.", "Was great. Finally popped in here after years of hearing a lot of buzz about Jackson's own \"speakeasy.\" I'm a Jackson native who relocated awhile ago I was..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "atBiCABPCSOLZoVtDB7iCA", "text": ["Good food, good atmosphere the band there really Impressed , and the drinks are on point.  Not watered down or weak like some establishments", "It's been about maybe 4 or 5 years since I've been to this establishment. (I live in Nashville). But whenever I visited Mississippi and felt a mood to step...", "Ok so where do I begin?.......\n\nIt's Memorial Day weekend and I've been hearing about \"Freelon's\" the ENTIRE time I've been in MS (which has been about a..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "2nGiO_9nRD8TtE7lbRjmPw", "text": ["Great new modern place for dinner and drinks. Finally an establishment for progressive and forward professionals in Jackson, Mississippi.  Excellent service...", "Nice upscale venue in downtown Jackson that seems like it belongs in a big city with a strip of nice bars/lounges. The place isn't huge and being fairly...", "Disappointed!!!! Wanted to like this place but unfortunately frontline people (ie security) can ruin a business. So, a group of 3 women went there on a..."], "rating": [5, 4, 1], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["dinner"], [], []]}
{"id": "2dcimeYxrRMc5JIYgQZLZw", "text": ["I found this place while visiting with family at U.M.M.C.\nRicky is a great bartender. He recommended the Crowd Control IPA. Its great. Friendly atmosphere!", "So, when you buy a cigar and ask where you can smoke it, and they tell you \"Out back\", DO NOT PANIC.  GO OUT BACK.  Came here with a friend of mine on a...", "I'm a fan of this low key spot in the city. The beer selection is pretty decent and they provide several local craft beers. The staff that work there are..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "ulQ6vZBxBWWTFxMvEuCMcQ", "text": ["Nice location and a great spot for events and live performances. The space offers a lot of opportunities for the planners to be creative. We have had...", "Every single concert has been a good experience. Make sure you always bring cash with you if you are going here for an event. Bring ID as well! I have never...", "Very good event space. The event was incredible and I loved every minute of it. The space was a good event space that should be great for different..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "KKW5fgexs1DvqmrNYmUjKA", "text": ["Great place good environment and good people. I highly it to any cigar smokers looking for a good place to chill.", "NEVER, would I have thought to have a party at a cigar lounge. Upon arrival, there was plenty of parking and security. I could literally hear the music...", "I'm not a smoker, but my besties love to relax in this spot. It's a nice alternative to club life.  At first I was a little uncomfortable with the idea of..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "TC9oLHN789ZeeRA7KTaJ0w", "text": ["It's okay the food is really good but both times I've been the service has been extremely slow expect to bring a good 20 dollars a person to eat and get a...", "Bad experience, I used to bartend in college. Been to many bars in 30 states. Hands down worst bar ever. Would leave no stars if possible.", "Not the best establishment. Food isn't great. Service wasn't the best. I really believe there is only  one tiny stove in the entire place. The food took..."], "rating": [3, 1, 1], "TBscore": [0.0, -0.27, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], ["bar"], []]}
{"id": "RImRLUaAxXXmlaiMfVVOwg", "text": ["Cool Vibes!! Awesome DJ! The Catfish is delicious! Fried to perfection. I was just passing through and enjoyed my time spent.", "Chill place, food vibe, hookah. Crowd is a little younger, but music is good. They also serve food.", "Very cool vibes in this place. I love the look and feel of the atmosphere and the DJ was on fire.\n\nMy rating is so low because of the $10 cover charge. The..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "ohjoqCy1yy18SKvHAQau_Q", "text": ["Friendly to members of the aviation industry (3-2-1)\n\nGood little hotel bar. It's small size means they don't have a wide selection of beers on tap, but at...", "Nikole with a K knowledgeable of her wines and know how to make a good hottie tottie!", "OMGosh!!! This was an unexpected GEM!!! Went for breakfast to find the most courteous staff, and FRESH food, excellent buffet, wonderful choices...was blown..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.6], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["bar"], [], ["breakfast"]]}
{"id": "4BWBR2J-eV2aIdQAawUTVg", "text": ["Great decor and drinks. Great customer service overall.  Baffling security! (Eeek!)\n\nI came to visit Wonderlust with a few friends from Jackson about two...", "The main negative is smoking is allowed inside, but I think that's normal in Mississippi. I visited early on a Saturday before things really got going so I...", "This bar was honestly one of my favorite stops on a tour through the South. The owner and staff went out of their way to make a bunch of out-of-towners feel..."], "rating": [3, 4, 5], "TBscore": [0.0, 0.0, 0.55], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "Sof0JdlsEGMjo1Trs_aDKw", "text": ["If you like a nice, sports bar setting with good food, good service in a safe environment then this spot is for you. It is located inside of the Holiday Inn...", "I was here at the holiday inn for our homecoming (Jackson State University) and this was the closest hotel not sold out. Starving and looking for food and...", "Met a co worker here for dinner the other night and I really enjoyed it. Bar area is nice with a quality beer selection (local/Southern brews) and plenty of..."], "rating": [4, 4, 4], "TBscore": [0.62, 0.0, 0.33], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["bar"], [], ["dinner", "bar"]]}
{"id": "PP_lXsGFNR6CmpwclrLNqw", "text": ["Games...good, obviously. Fun atmosphere. Cheese sticks were good. Pizza is ok if you like a kinda sweet sauce. Ordered a dessert and the bowl had lots of...", "This place came HIGHLY recommended to us for a birthday celebration. He were madly disappointed.  We had a hard time spending the money off our cards...", "Great first experience at Playtime. We came on 1/2 price game Monday and ate lunch around 11:45am. The food portions are greater than I expected (no one..."], "rating": [3, 1, 4], "TBscore": [0.46, 0.0, 0.21], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [["pizza"], [], ["lunch"]]}
{"id": "-0JiB9FIP1ypQ3pmvjjC8g", "text": ["Great spot with a great vibe. A nice selection of cigars and a Davidoff shop. There is a bar, However, there's no liquor served.  It is BYOB but ice and...", "Great selection. Small smoking area but a lot of great cigars to select from.", "I wish I could give half stars because I believe it is better than 3 stars but not quite 4. They have a huge selection but the issue I have is with how..."], "rating": [5, 4, 3], "TBscore": [0.73, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["bar"], [], []]}
{"id": "i8Ciihgkw1mAvtRgui_haQ", "text": ["Great broth. Expect a few min wait. The food seems to be made to order. \n\nAlso just get the small bowl of Pho otherwise way too much. \n\nHave had the spring...", "If you looking for a different cuisine  with amazing flavor try this location. The staff is amazing. The food delicious their portion size can feed two or...", "Since leaving Las Vegas a few months ago, I've been in a culinary depression. There's a dearth of ethnic cuisine, especially SouthEast Asian, here in..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "nGDsHhysToHzsY0vd1pk_w", "text": ["I've been here countless times now and I can say the following:\n\n1. Amazing dishes, so authentic.\n2. Amazing operators - they are just UNBELIEVABLE, kind,...", "Feeling a little under the weather today so decided to get some noodles . My wife came along with me. She hasn't actually eaten inside fortunate before so...", "Great place to shop & eat!! How perfect!!\nA very authentic Chinese restaurant with a grocery store at the front! A very clean and tidy place to shop for a..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.62], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["chineese"]]}
{"id": "5Yci676_-T4bKS-buCicGg", "text": ["The best Chinese takeout place in JACKSON MS! Period the most authentic Chinese American I've been going here since I was 16 and I'm 21 right now lol....", "So my friend was craving chinese last night and this place had a great rating, so I took  a chance and good god am I glad!!! The only negative my friend...", "I love this place!! I've never gone and had a bad experience. The food is always delicious and service is quick. Its not a dine in restaurant, so make sure..."], "rating": [4, 5, 5], "TBscore": [0.39, 0.31, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["american", "chineese"], ["chineese"], []]}
{"id": "FX0J48U-EHPlmFjsSFrs1Q", "text": ["Easily my favorite take out or delivery when it comes to Chinese food in the area. They have some of the best Sesame Chicken you will ever eat and I am...", "This place hasn't changed since day one. The food isn't the best Chinese. They need a class in customer service also. The prices aren't the most moderate...", "Had food delivered.  This is some of the worst Chinese food I have ever eaten.  Sweet and sour chicken was soggy, and seemed off flavor.  The mongolian beef..."], "rating": [5, 1, 1], "TBscore": [0.23, 0.38, -0.28], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["chicken", "chineese"], ["chineese"], ["chicken", "chineese", "beef"]]}
{"id": "ClFFq1QuW9aUsViXCtaazg", "text": ["Everything was delicious. I ordered the cream cheese wantons and the cashew chicken. The cashew chicken had broccoli, celery, carrots, onions, bamboo,...", "Took over one hour for our take out order!  Called it in and when I arrived they had no record of my order.  Then ordered in person and it took over 40...", "Worst chinese food ever. Staying over night in town and my kids were requesting chinese food. Found this place on yelp. We might be spoiled having so many..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["chicken"], [], ["chineese"]]}
{"id": "ODCwZGgAGwSn0xq7Z6lPKw", "text": ["I know, I know. I'm biased; however, that does not change the fact of the matter which is for just a little over $6 for the buffet, you cannot beat quality...", "I hate to say but it just wasn't good :( I got the Mongolian beef extra spicy. I guess in order to make it spicy they just poured sweet and sour sauce on...", "Don't waste your time. This is a hit or miss and most likely a miss. The food has gone downhill and the service sucks. The sauces are too rich, the chicken..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], ["beef"], ["chicken"]]}
{"id": "0WRuSA9rWKEZFzMHf3OSrw", "text": ["Hidden gem! Line at Zaxby's was ridiculous, the I saw TYBowls! Food was hot fresh and really good, a must if you live in Clinton MS or just passing through...", "Terrible. Everything I order is too oily and salty. I don't understand why people have five star review to this place. It has similar menu to Mr. Chen in...", "We checked out Ty Bowls tonite. They have recently been bought by the same people that have Mr. Chen's in Jackson now. The menu is similar to what Chen's..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "KfUdAlipNskPlTTgDfP-cg", "text": ["I go to Panda Express at home with no problem BUT here is completely different. \n\nThey had 2 working the steam table 2 person was helping another customer...", "I've been twice this week.  I can't say enough about the friendliness and helpfulness of the employees here.   I had been to PE in other cities but always...", "We came here on a Friday night at closing. We ordered to go. The workers were great and nice. When we got home to eat, the food was delicious. I can't speak..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "PD7tPE01Q2WVL45_QAhlkg", "text": ["This place is superb.  Comparable to any Mongolian grill I have had thus far.  Was just passing through Clinton/Jackson but will make sure to come back if...", "The good reviews on Yelp made this place a must visit! What impressed me the most was the way the two young kids handled the floor. They were doing a great...", "This was my first visit at this restaurant . It was recommended by a friend.  Upon entering some guy I assumed worked there was shucking peas on a far table..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "MSsLxy6HuudRMBVRul0XzQ", "text": ["Meh. That's about all I can say. If you want hot fresh and semi-authentic Chinese food... don't eat here. We arrived about 1130AM for lunch while we were in...", "Stay away from this place; they have the worst customer service and the food isnt worth the price.", "Typical low cost Chinese Buffet.  The food quality is average but you get lots of it."], "rating": [2, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.2], "keywords": [["chineese", "lunch"], [], ["chineese"]]}
{"id": "9kv-ig0_6rye2FduzMcUKw", "text": ["This place is our go to Chinese. But this visit was least pleasurable. We were greeted with sassy attitudes and not hospitality. Okay so when we get past...", "This is my go-to \"dive\" Chinese buffet when I want good old greasy American Chinese standards.\n\nFood is predictable stuff. General Tso's is very sweet,...", "When i had walked in i was greeted by a kid at the counter. The whole resturaunt had a dirty smell to it. The seats had rips and tears in them. The service..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["chineese"], ["american", "chineese"], []]}
{"id": "5u9IFHxoT6Pb-23wBjkqag", "text": ["I'm not sure why others have had bad experiences here but it's not bad at all, it's small but my family has eaten there for a very long time and always been...", "I love coming here. It's quiet, the food is delicious, and the lady that serves us is so nice! I don't know why other ppl seem to have issues! I have been...", "This use to be a really good place to eat! The last two times have been really bad.  This time, We obviously came right before the change from lunch to..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "nR9-Saf1XK3lMaPE8r8KUQ", "text": ["Their buffet is delicious. There are so many choices and the food is fresh. Very clean and nice staff.", "The quality of the  food is absolutely  disgusting! The fried chicken was salty, the white rice is left out in pan to dry out, the egg drop soup looked as...", "1 star is too much for this place. 10/10 DO NOT recommend. Never eat here. I've never had food make me feel so sick before. Couldn't even finish a single..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.33, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["chicken", "egg"], []]}
{"id": "EQjoJF1BK5bJqLnZbwO72g", "text": ["I really enjoyed OEC's food .And the staff was nice . And I got the chicken hibach and it was ready good . And the prices are really good for the amount of...", "I really thought it hard to ruin hibachi, but now have been proved wrong.  Absolutely horrible meats, only ate rice to be courteous.", "First time here, i was recommended to try the tornado roll and dynamite roll. My husband got the hibachi scallop dinner. Surprisingly it was better than the..."], "rating": [4, 1, 5], "TBscore": [0.35, 0.0, 0.48], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["chicken"], [], ["dinner"]]}
{"id": "-8nPZODubztwxB9cTPeiLQ", "text": ["The food used to be really good here, but it hasn't been the best the past few times I've gone. It's convenient if you live or work nearby, but there are...", "This is a really good place to eat... The food is reasonably priced and tastes great....It never takes very long for your food to be ready... It's always...", "Really good hibachi food to-go.  Yes, you can eat in, but we never have.  If you do eat in, there is no waiter service - order/pay at the counter, then head..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "A-k_-ixQ5rCUdjJZ6EvRuw", "text": ["We were driving on I-20 west and this is a great restaurant just a drive away from highway to stop by for great Indian food. The restaurant is very family...", "Well I honestly know absolutely nothing about Indian food. Never had the desire to try it.\nNow my lady has been eating it for years. So I finally decided to...", "Awesome food and atmosphere. The service is above par and the food is as well. The vegetable coconut korma is amazing!! This place is a must try."], "rating": [4, 3, 5], "TBscore": [0.6, 0.27, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["indian"], ["indian"], []]}
{"id": "qXHLz4chPObaPlibigAXkA", "text": ["I originally wasn't going to review this place because my first trip here left me feeling sort of underwhelmed. Even though I love Indian food, I basically...", "Food was good. Not great. Lot of spice but very little flavor. Portions were small (I had a to-go order). My food was prepared quickly, but when I went to...", "I have eaten food at friends homes who are from India as well as in various countries and states. I compare this as one of the best tasting India cuisine..."], "rating": [5, 3, 5], "TBscore": [0.28, 0.0, 0.5], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["indian"], [], ["indian"]]}
{"id": "cK5WdfR4aFdDTgb-N9-WiA", "text": ["My mum and I arrived at 8:40 pm, when they close at 9:00 pm. The lady at the front kindly allowed us to get some takeout from the seafood buffet.\n\nNow, I...", "Food was horrible..... quality of food went way down,...prices went up since new owners. Was very disappointed and wouldn't recommend this place to anyone", "Things have really went downhill since \"Brando's\" took over. I used to eat there almost every day. New owners are so rude. Prices are higher and quality is..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "j29b946ieBM0MMCOf27AWQ", "text": ["Food is fantastic, but staff is pitiful. We went on a Thursday night at 7 PM and arrived to a bombed out and depleted buffet. Management was less than...", "Save your money, I don't know what buffet is the best in Vicksburg. I have eaten here and Magnolia Hill before. Today Heritage Buffet didn't make the trip....", "I am glad we did not let the 1-star reviews dissuade us from visiting. We stopped overnight in Vicksburg and decided to try the Heritage Buffet. The food..."], "rating": [1, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "PwDRHR0Fj9bBxKm67A3tXQ", "text": ["DELICIOUS!! My husband and I were passing through for the night and wanted something local. Jose's was perfect. I always rate my mexcian restaurants on...", "I've heard terrific things about this place for years... I found myself in Pearl around lunch, so I decided to stop in and try the tamales that I've heard...", "Excellent!  Best Mexican I've had since leaving Los Angeles! My boys and I discovered this pave in a Mexican food wasteland.   They had the best food!..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.6], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["lunch"], ["mexican"]]}
{"id": "nLQfR_k_ZbBHtEfKmWKJww", "text": ["This is Tex-Mex.  It's great food that is more authentic that you will find in most Mexican Restaurants around the metro area.  The staff was very helpful...", "I loved the food here.   Great service.  Friendly people.  Portions are huge.  Laid back atmosphere.   Ordered the shrimp and beef chimichanga.  Plenty of...", "Worst Mexican I've ever had. Had an awful flavor and smelled like a dirty refrigerator.  Chips were not freshly made. Margaraitas were okay.  Very..."], "rating": [4, 5, 1], "TBscore": [0.42, 0.45, -0.29], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["mexican"], ["beef"], ["mexican"]]}
{"id": "qx21zOcXjHnAOjxd_CPpuQ", "text": ["I'm a sucker for wings and Mexican food. The first thing that I look for in a Mexican restaurant is if they offer a \"Speedy\" plate. It can be lunch or...", "I love to eat here. Margaritas are great! Food is very good . Sometimes they rush you at near closing time and that's why only 4 stars.", "I have lived, worked, and ate at Mexican restaurants in Seattle, LA, and Mexicali MX, so please continue reading this review. \n\nFirst finding a restaurant..."], "rating": [3, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [["wings", "mexican", "lunch"], [], ["mexican"]]}
{"id": "FKMFCOnVRrDLBDaJU9okmQ", "text": ["Out of all of the Mexican Cuisine restaurants in Clinton, this one wins BY FAR on cleanliness and friendliness!", "Over it was ok, got seated pretty quickly and chips and salsa was served right away. The service from then on was spotty. The food was pretty good and I got...", "Good food. Fast and friendly service. #56 Pollo Loco is my favorite. Can't go wrong with their queso - ask for them to add pico de gallo to it! \n\nBut back..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["mexican"], [], []]}
{"id": "-jmlwdkVWL-j1_B_5V3FtQ", "text": ["We tried Sombra LATE Friday night... They close at 10, we got there at 9:50, my husband went in to ask if we could still dine, and were told yes, so that...", "I loved it!  I've been here twice now and the chimichanga is stellar.\n\nThe price is a rock high for tex-mex but it is a little more \"fancy\" than your...", "There are not many places that I can go to and the service along with the food have consistently surprised me. When I come up and visit from the coast, I..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "GTE5xb7uChqBuG7mbb6_eQ", "text": ["Very good service and margaritas ! What else matters !!! Lol  The food is great !!!  Love this place! They don't rush you out!", "This place needs to find another hostess. The lady that seats you has absolutely ZERO personality! No type of greeting as you walk through the doors. She...", "Food was bland.  Chips tasted burnt.  Food took forever.  Poor waiter.  I think I am done with this place"], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "gPvxkCPMuDTe5f_yWKkJAQ", "text": ["Today I ordered the margarita fajita chicken salad. My chicken was seasoned to perfection, however my tortilla was a bit stale. I think we may have come...", "Las Margaritas Mexican Restaurant address 1625 E. County line road Jackson, Ms . \nIn town for a wedding so we decided to grab something to eat. \nOriginal we...", "Was in town for a wedding on Cinco de Mayo. Of course it was busy but we were seated after 15 min. Regular menu not available but a hand written piece of..."], "rating": [3, 1, 2], "TBscore": [-0.36, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [["chicken"], ["mexican"], []]}
{"id": "wLxC67ZBsbwsQSNpNZV0vA", "text": ["Atmosphere:\nIt was a big place. They were BUSY. We were sat in a booth, secluded from the madness. I was glad of that. They had someone making tortillas to...", "This place has nice atmosphere but it's dirty. Needs a major clean up. The food is hit or miss. Last time I eat there the meet looked & tastes old so I sent...", "Been eating here for over 10 years the food is great! They will make your order however you like! I ask them to hold this and that and it's never a problem!..."], "rating": [3, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "Q_IeazfOC9Q8_0MGOIMg0Q", "text": ["We come here often. They have the best outdoor patio. Their flavored margaritas are delicious. One fajita portion is enough for two people. Service is...", "The service was absolutely horrible. Then on top of that, they OVER CHARGED me and refused to give me my money back. I will NEVER go back there.", "Had a birthday lunch at Papitos in Flowood this past Friday. It has seem to go downhill...they no longer serve ceviche too.\n\nThe service overall was decent..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], ["lunch"]]}
{"id": "Y9gQllEEO6fTy-GY-CaAsQ", "text": ["Great lunch specials! Supper is a little expensive but there's plenty of quantity (can usually get a couple meals out of it). \n\nRedfish is top notch! Check...", "We love Sombra and were pressed for time and ordered through Waitr.  The order was wrong, missing paid for extras, and there was hair in the food.  We...", "The last time my husband and I ate here it was so delicious that we did not want to stop eating. Unfortunately, I can't say the same about this time. The..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["lunch"], [], []]}
{"id": "iJEOlQOOlsMKrlnjCg0hnQ", "text": ["This place is much better for lunch than it is dinner. The portion size for the price at lunch is a deal that you can't beat. Compared to the many other...", "This place was beyond bad.  A general guide for Mexican restaurant quality is the salsa.  We should have left after trying it.  Tasted like canned tomato...", "A co-worker and I went for lunch at 11:30, not sure if it was just a bad day or if this is the real ElSombro.   I ordered the chimichanga with Rice, co..."], "rating": [4, 1, 2], "TBscore": [0.29, 0.0, -0.25], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["dinner", "lunch"], ["mexican"], ["lunch"]]}
{"id": "dYNv-B4dOLWoiflMJkrVZw", "text": ["Ok I have ate here 4 this in the past month and I must say that there food is great! Excellent service, with a clean facility! Food is all ways fresh, hot,...", "My wife and I go here for lunch all the time. I like their lunch specials, their chips and salsa are good. Two people can eat here for lunch under $20. It's...", "We passed this place lots, but tonight is our first time. My husband were craving for Mexican food, as we're heading home, I decided to give them a try...."], "rating": [5, 3, 4], "TBscore": [0.0, 0.7, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["lunch"], ["mexican"]]}
{"id": "bWWSZE5oScyl5fxMgt_HYQ", "text": ["Three of us had Sunday lunch there yesterday. The place was pretty empty when we arrived at noon but full when we left an hour later.\n\nChips and salsa were...", "It was one of those Friday nights when Mexican food sounded great to me, but I think my boyfriend wasn't sold. I've been to Cinco de Mayo 3 or 4 times over...", "We stopped here as we couldn't decide on what to eat with a large group. Very friendly and attentive staff. The food was ok with normal to large portions...."], "rating": [4, 5, 4], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["lunch"], ["mexican"], []]}
{"id": "iAx4ldbexPA7oyxxFFll6A", "text": ["Ordered a chicken enchilada with verde sauce and a chicken fajita taco with cilantro, cheese, and onions. They had karaoke on the patio. Service was iffy,...", "This place has gone downhill over the past few years from the lack of attentive service, the laziness of letting the fire alarm chirp for days on end, to...", "Come on guys, fix your bug problem. Was inundated with flies the entire meal. Was also visited by some sort of wasp or dirt dauber. And this little guy came..."], "rating": [3, 1, 2], "TBscore": [-0.6, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [["chicken"], [], []]}
{"id": "mAL4iJobGnV_wvEV3PC3Kg", "text": ["Found King Fish Grill on Instagram. I was interested because of the daily specials and the pictures and advertisement looked nice. I expected a restaurant;...", "Overpriced and underwhelming food choices and taste. I wanted so bad to like this place but unfortunately I went on the wrong day. \n\nI finally went on my...", "Had the catfish plate. Everything tasted fresh & the fries are so good! I will be back for more. Looking forward to trying other items on the menu."], "rating": [3, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "vOFbtolKc6Cvkjco1cP2HA", "text": ["Thank you to Yelp, we found this small hole in the wall that was packed with cars in front and the side. Heading on the way to Dallas and I didn't want...", "When ever I'm in Jackson Ms I gotta get some good ol Catfish, and Shrimp. Great prices and good food.", "Fish is always fresh and tasty. Best I've ever had in the Jackson, MS area. U don't know why they have this as 3 dollar signs. Prices are pretty cheap and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "qSadXf5pYUmO5XLXn59eYg", "text": ["Locally owned little bakery that bake up some killer cupcakes. Cupcakes were very moist, frosting was smooth, no complaints! I don't like when I order a...", "Best cupcakes I've ever had in my life! They will ruin any other cupcake for you. I love sweets, so take my word for it ;)\n\nPS: cash/check only.", "If you're looking for cupcakes that taste homemade then you have to visit this place! I'm not sure if they have anything other than cupcakes but the..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "ymFQzTWjSMLLukiHaS-mfw", "text": ["Once again it was a beautiful cake and just what my 94 year old requested.  The Italian Cream cake was delicious even those who were not a fan  of Italian...", "I just purchase my first cake from That Special Touch.  The cake was beautiful, moist and delicious.  I got the Coconut (it was a birthday cake and not my...", "First fact...I have ordered birthday, baby shower, wedding shower, wedding cakes, anniversary cakes from this establishment for over twenty-seven (27)..."], "rating": [5, 4, 1], "TBscore": [0.39, 0.61, 0.25], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["italian", "cake"], ["cake"], ["cake"]]}
{"id": "Vmi2jkrVtneZXRz5S3Dt4g", "text": ["You talkin bout, GOOD?! One bite, and you'll sing. I got the dozen minis with a variety of lemon, vanilla, red velvet, chocolate chocolate chip, white choc...", "What ever you do DON'T WORK HERE EVER!!!  The owners are rude they don't speak are introduce themselves to you when they come to town. The woman that they...", "This is one of my favorite places. We visited my dad one weekend and we were so excited to be able to place an order for 2 Bundt cakes online and just go in..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.46], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["cake"]]}
{"id": "IUS0mnHYBzWd9VQR3DM5_g", "text": ["Let's talk CAKE!  I placed an order about three weeks in advance for a shower after simply googling local bakeries online.  I connected with other bakeries...", "We (group) ordered a cake for a birthday celebration. The first cake pictured was previously ordered from them. We placed an order for an exact replica with...", "If I could give no stars, I would!!!  Service is horrible!!!  The absolute worst customer service I have ever in my live experienced!!!  They don't make the..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["cake"], ["cake"], []]}
{"id": "OWzIcGiFjRJxENJhm9Q5NA", "text": ["I was not the biggest fan of Gigi's but they are a nice go to when I want to sate a sweet tooth. The over abundance of frosting is not my favorite. But the...", "These cupcakes are gorgeous. However, they don't taste as good as they look. \n\nWhen I bit into my cupcake, I was expecting to experience pure cupcake bliss....", "Please try their new Black Forest Cheesecake. It is the yummiest. So smooth and light."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "FpkK93kCbsTmMWRuZopPtg", "text": ["Where do I begin? I have tried all of the barbecue places in Rankin County and this was the best by far. The staff was so friendly and could not have been...", "Mississippi-style BBQ: a not-so-good blend of different styles. The brisket was chopped instead of sliced (usually a way to hide that it's not tender), and...", "Not impressed. The ribs seemed like they were boiled in water instead of smoked, not much flavor and the sides were nothing special but the tea was good...."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "D5tUJh-3XvpN4EOxC5z1YQ", "text": ["I've been wanting to try this for some time and today was the day. I ordered the pulled pork sandwich, a sausage plate, and sliced beef brisket sandwich....", "There  are 4 restaurants in the Outlets of Miss. food court; had not tried this one before today...it was awesome. Very tender pulled pork on the sandwich,...", "While exploring the Outlets of Mississippi.  I came across this place at the Food Court. Which has only 4 restaurants.  Choices were Chinese, Pita Pit, some..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.6, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [["sandwich", "beef"], ["sandwich"], ["chineese"]]}
{"id": "rMWSCxY1q8cI1qsw3ZjysA", "text": ["We had 3 adults and two kids in our party. The pulled pork nachos were amazingly good. I got the honey smoked ham, which was some of the best I had ever...", "I absolutely ADORE this place! My waitress is always the same girl and she knows exactly how I want my food and how my kids want there. The food and...", "Divine!! Have eaten here several times and get take out at least once a week. NEVER had a bad experience!!! Food is amazing, portions are generous! LOVE,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "ytSPvY3bXbsEmZt4so1m6A", "text": ["We had hoped for much better.  My wife had the chicken plate, and the chicken was so dry she had to smother it with sauce to make it somewhat edible, but...", "Tay's is not bad, but not great either.  I got the 4 rib combo.  The ribs were a little overdone, but still tasty.  The BBQ sauce was decent, the potato...", "Tay's has some real good food.  Real nice people at the front counter.  Clean facilities and fast service."], "rating": [2, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 0.6], "keywords": [["chicken"], [], []]}
{"id": "eA1riC5yLz1rMrlP6oCNjw", "text": ["The pulled pork, pulled chicken And brisket was moist and delicious. I didn't care for the sides and the ribs that much. Sides was bland and ribs was a tad...", "Next time I go there I will make sure to shake the cooks hand. The food here is delicious! Plan and simple. I had the chicken with baked beans and cole...", "Triple A is excellent! The sliced brisket is amazing, the white meat is always smoked to perfection and never dry. I can't eat the potato salad because it..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["chicken"], ["chicken"], []]}
{"id": "NDdKh5qodNCiLv63KHmyPw", "text": ["We had not had Sonny's in a long long time. But the food was even better than I remembered. The sliced pork was just right - smoky, tender and wonderful....", "Haven't been here in a number of years and could not have been more pleased with the turn-around !  Top quality food, expanded menu, great service & a...", "First time visiting since the remodel. Beautifully done. Very impressed. Sat at the bar because I seen the football game playing #rolltide\nAtmosphere:..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.43], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "SeMYh71rS00ySKeeracciA", "text": ["I am a very frequent Flier with Wendy's across multiple states. However, my family and I stopped at this Wendy's and by far this one was nasty. Multiple...", "Right off the highway, entrance is a little weird at night drive in carefully. Restaurant is clean, food was as good as any other Wendy's. Service was fast...", "Waited in line inside forever and never was able to order.  Staff falling all over each other and made no progress.  Finally gave up and we up left.  It was..."], "rating": [1, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "pcKEBVFJXIFW2FkhA8kRfA", "text": ["The place says it's 24/7. It's not. Wasn't open @6 when I came by to get breakfast. But when I finally got my food 30mins later. The bread wasn't toasted,...", "I don't know why I continue to abuse myself by going here for breakfast when visiting my Dad.  Oh, I know why!  It is because my options are seriously...", "1 Star for the failure to light up the outside of the restaurant; really how was that a possibility?"], "rating": [1, 3, 1], "TBscore": [0.0, -0.33, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [["breakfast"], ["breakfast"], []]}
{"id": "t4tOtV7vzlUwJJ9C-G5ULQ", "text": ["Stopped here on way to North Carolina, ordered  the 6 pack burger special.  For some reason it was not as good as it normally is.  They must have had a bad...", "I don't know what the fuss is all about, but I had to give it another try...bad idea, I'll go to a real burger joint next time I'm craving a burger.  I'm...", "Went here for nostalgia sake as i used to get taken there as a child many years ago. Dining room was clean and large.  Burgers taste as i remember them with..."], "rating": [3, 2, 3], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [0.2, -0.2, 0.2], "keywords": [["burger"], ["burger"], ["burger"]]}
{"id": "fPLdxwyPxsK_ORiLzlbtQg", "text": ["This Wendy's was disgustingly dirty. It was not crowded when we went probably about 2 on Black Friday. It looked like they must have had a HUGE CROWD at...", "I'm on a road trip and I decided to gas and gulp. Filled up at the Shell station and drove across the street to Wendys for a quick bite.  Well, my stop at...", "Lots of issues with this location. We stopped on our road trip home. I was told the men's bathroom was completely flooded, and one of the women's stalls was..."], "rating": [2, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "hzKXd9W_A_KcVJ7sY3GaeA", "text": ["Waited for 20 minutes for food that was not very good. 1st they made it to go instead of eat in & they dropped one meal. Ordered 3 chicken strip meals with...", "Clearly the service is horrible. The lady they had floating around up front was not customer service oriented whatsoever. Got dirty rice instead of mashed...", "If I could give it -5 stars I would. I've been three times and every time it's absolute awful service. I was told they were out of chicken one evening. I..."], "rating": [1, 1, 1], "TBscore": [-0.43, 0.0, -0.47], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "r4uRil2OD4ITO5u-oVJgnQ", "text": ["I'm giving this location 3 stars strictly for the chicken. It was fresh and very flavorful. However, the manager was so unprofessional and rude to say the...", "This was the best Popeyes I've been to. Their drive thru speaker was broken so I pulled up to the window and was immedaitely greeted by one of the...", "Love that chicken from Popeyes!  And the mashed potatoes and gravy.  Hubby is especially fond of their cajun rice.  \n\nThis is a really nice Popeyes.  Very..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "WXPouznxIQhjKGA3VaOHCg", "text": ["Seriously?! We ordered chilli and we get a bowl of grease. It is HORRIBLE and NOT Krystal's bean chilli.", "This place ain't bad.  It ain't great, but it ain't bad.  You get what you get with Krystal - little burgers, chicken sammiches, etc.  The fries were...", "You get exactly what you expect when you come here.  Poor food, poor service, and an overall stickiness to the place that makes you question your decision..."], "rating": [1, 3, 1], "TBscore": [0.0, -0.28, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [[], ["chicken", "burger"], []]}
{"id": "m-1C8dHP7T9OG_-luVwFEA", "text": ["Apparently, they pull drawers in the middle of the day and my being there seemed like an inconvenience to them. 7 people in a stores and no one greeted me...", "Horrible service, employees should be trained in customer service. Absolutely the rudest I have ever been treated in any establishment. I will be emailing...", "This is a nice more modern  Wendy's with flat screens a fireplace and the works etc.. Unfortunately the service was horrible. Not sure where \"southern..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "HTcumAA1Yu0MroHnGcLscw", "text": ["Yep, I am reviewing a Wendy's fast food chain.  I'm reviewing it because it's a really good one.\n\nI've eaten here a number of times with my parents.  For...", "Went to the drive thru at Wendy's a few weeks ago and there was not a trash can at the end of the drive thru line like there usually is, I nicely asked the...", "New building, well laid out.  Strange service at the counter, order but you can't get drink cups until your meal, now your food gets cold while you wait for..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "cMx24fg19pQewiBEa9wAzA", "text": ["Came here the other day and sat at the bar to watch some football and get wings and cheese fries. Service was good. Wings were pretty good, but didn't have...", "Well, what can I say? This place has the worst service I've ever seen. We had to ask twice for silverware. We ordered before a table of 8 came in. They...", "Visited for a birthday dinner. We didn't wait for a table, but that's the best it got. We had to ask for bread, but that's because they were out of it and I..."], "rating": [3, 1, 2], "TBscore": [0.38, 0.0, 1.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [["wings", "bar"], [], ["dinner"]]}
{"id": "t4EwyRujvPEzkcdqlisaew", "text": ["My name is Nick Cossentino and I live in Hendersonville, TN.  McAlister's opened a restaurant in Hendersonville recently and after 4 orders placed with your...", "Aweful if they got even one order right in the lady six weeks id faint!  No matter what you order something is always wrong. Taco salad no chips....  one...", "I bought a king club.I had no idea how tall the sandwich was. I struggled with half then asked the waitress to add a half a slice of bread to the other half..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "e5yJr0_gCJQJ5V432H0hiw", "text": ["This was an excellent meal most of the time I am suspicious off longhorn because of past experiences. However this longhorn is exceptional. Our server was...", "Ate here with family after the holidays and had (La)Toya as our server--- she was Excellent. Excellent as in: didn't have to ask for refills, up sells...", "Worst service possible. We went at 2:30 p.m., not a prime time, and waited over 15 minutes for our waitress to come to ask for our drinks. No water. Waited..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "rDeMoqWdxmI7bm5LCnz4-g", "text": ["I've ate here before and it was good that time. Today I don't know what happened. The steak is burnt. I said med well. It's well well. Did I mention it has...", "I would leave a  zero star  rating if i could.  This was the worst  experience ive ever had at ANY Logans  location and i have eaten at many!   \n1....", "We visited this Logan's location about a year ago, and things were great. This time, not so much. If I read the receipt correctly, ShacariT/B was our..."], "rating": [3, 1, 2], "TBscore": [0.7, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [["steak"], [], []]}
{"id": "eBdvx1y5pDEX7eBc2D6vrQ", "text": ["Logan's???? Guys come on.  Look at these reviews someone needs to step in to protect the brand. I love Logan's and my Bossier City location. I meet the...", "Upon arrival we were told the wait would be 15-20 minutes because ALL the servers were on break. Yes ALL! There were about ten of them right outside the...", "WOW! Surprised Logan's allows their name to be associated with this place. I have never been treated rudely by the hostess in a restaurant, until now. Asked..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
