{"id": "2EWr7GQz4CNg8TpZ--ytvQ", "text": ["Super fast!  I had enough time to take a cookie and my receipt before walking toward the soda machine and BAM! My order was ready.  It took me by...", "It's  real shame that I have to leave one star, but it is absolutely ridiculous that for THE THIRD TIME IN A ROW, there are no napkins in my bag.\nI just...", "Called for delivery, food was delivered quickly, as ordered, great. Their salt and vinegar chips will make your eyes cross."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "7C2PvA4FO8EUO50POQD_bw", "text": ["Always fast and fresh.  Subway is a huge success for a good reason and this location doesn't disappoint.", "Clean, fast, yet understaffed. They need more staff to keep up with the 5 pm rush. Other than that it's a decent Subway.", "I enjoy a Subway sandwich every now and then and I have had some well made sandwiches from the Subway at the Walmart Supercenter on Supercenter Dr on the..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], ["sandwich"]]}
{"id": "I9YqHFPBBjXDqpIyZOkM0g", "text": ["No. Just no. No nae never no more.\nWent here with guests in age from 25 to 80.  All seemed okay.\nThey took our last drink order and less than five minutes...", "You really can't beat this if you want to experience historic Jefferson City culture. The roof deck rocks and it really gets fun late on the weekend nights....", "Not a bad bar.   This is usually where we end up.   Drinks are reasonable.   Food is decent.   The patio is really nice."], "rating": [1, 4, 4], "TBscore": [0.0, 0.0, 0.21], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "kRKUG1bs38ubGzFvBOUvxg", "text": ["I absolutely love this family restaurant. I might be a little biased as I am the niece of the owner. However, you will most definitely love it too! I grew...", "This is one of my favorite \"on the road\" restaurants.\nAlways have great service and food, and they treat you like family.", "My daughter and I visited Steve's Family Restaurant for supper.  The atmosphere was pretty down to earth.  The staff was very friendly and kept checking on..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "PwhhpEqzF5SS7fjknV02VA", "text": ["This Jimmy John's was a severe disappointment. I've never experienced a slow JJ sammy, but alas - it has happened. Let me explain...\n\nI ordered my wife and...", "Always prepare my subs the way I want and always prepare it fast. I would recommend a turkey sub", "The two words that come to mind for Jimmy Johns are: overpriced and overrated. I have always heard good things about Jimmy Johns and have been wanting to..."], "rating": [1, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [[], ["turkey"], []]}
{"id": "yjvFezV7gczhFaWk_-Ly0Q", "text": ["Not your average ice cream parlour! Really interesting decor- weird art pieces plus some stuffed animals in a fridge? \n\nThe flavors here are always...", "We visited Sparky's June 9th. The place was very small, only four little tables with a couple wobbly, uncomfortable chairs each.\nOn the walls were lots of...", "This ice cream is to die for. Cake batter is chocolate (kids adored it), I couldn't decide on the strawberry lemonade sorbet or the marshmallow salted..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["cake"]]}
{"id": "_NhgsbpeFTbuI2ny6HCZyQ", "text": ["Although most folks say it's a landmark and sacred Eldon / Lake hangout, I can't let the fact that it opened in 1952 influence my first, and most likely...", "The Cree Mee is a historic icon for Eldon. Been there since 1952. I moved out of Eldon in 1968. Has not changed much since I left Eldon. That is part of the...", "Classic spot near the lake!  Don't miss out on the chili dog with cheese and onion. Fries are crisp and salty. Must try marshmallow Pepsi. Sounds crazy but..."], "rating": [2, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "19ZFAwG_7RlIJph2HscQ-Q", "text": ["Pretty good hot sandwich. I got the turkey club with extra meat. Everything looked and tasted fresh and good. \n\nWith a medium soft drink the bill was $11.18...", "Yayyyy a Potbelly's came to Columbia! So happy- I see them all around the US and have never bothered to try them, so finally it came locally and I was able...", "Pretty much an overpriced Subway. Its bougie but you can't see the toppings.  I paid over $6 for a piece of flat bread with cheese melted on it. Service was..."], "rating": [4, 5, 3], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["sandwich", "turkey"], [], []]}
{"id": "tN75o2dbzjfmlD77Injgdw", "text": ["This was an amazing find!! I ordered the Eggs Benedict and had to modify it because I'm attempting Keto (ugh). Instead of biscuits I asked for tomato slices...", "I had Pain Perdu which claimed to be \"Old Fashioned French Toast.\" I felt deceived. It was nothing more than egg dipped bread, nothing custard like...", "98.% of the time, our food here is on point. Today however, it was an off day. I will still give 3 stars but I hope the kitchen mgr realizes that some very..."], "rating": [5, 2, 3], "TBscore": [0.94, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["egg"], ["egg"], []]}
{"id": "D0ZadP5Ogm2fRMJOKEooLw", "text": ["It's the little things that they do so right here and that's what makes this place so unique. It all begins with the outdoor sign that brazenly proclaims...", "What a great burger!  Worth the stop. Everything was cooked to perfection. Just the right amount of fries with the burger combo. Service was friendly and...", "When you order a Rootbeer Float and the owner says, 'let us know if you need anymore rootbeer or ice cream' you know you've hit the jackpot! They have the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.49, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["burger"], []]}
{"id": "5ODV2FJmD8NCHFtWjAJYVw", "text": ["We had a great time dining there. It was the waitress's birthday and she worked very hard to serve everyone in the restaurant.", "Cute little place. Only seats 50 and the booths were filled most of the time we were there. We stopped for supper, but noticed everyone around us was eating...", "Best diner breakfast I have had since I was a kid. The Broadway Diner offers a simple breakfast menu that consists of excellent made to order food. I can't..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.53], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "SbuzuU1f6hMp7Cl0wJNSxw", "text": ["$6 large chocolate shakes...\nYes, it was big & thick (continued to fully collapse cheap straw).\n\nService was very good.  Found out my mistake of ordering a...", "Back in high school Sonic was the cool place to work. Where else can you wear roller skates at work? Sonic was where my friends worked and they had amazing...", "Worst experience I have had in along time first waited 15 minutes waiting to order thru drive still didn't take my order honked I flashed my lights still no..."], "rating": [3, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "0F4X_1MjZfP3F_yKZe2f9A", "text": ["Back in Columbia for the solar eclipse in August, there were so many places I wanted to eat and drink in my former stomping ground--Shakespeare's (of...", "I actually didn't get a chance to eat here.  Went through the drive thru to grab a quick bite. Was told to wait for a minute. After 2-3 minutes I called to...", "This Steak 'n Shake stinks, literally! It smells like a toxic blend of grease and sewage. I'd say the place could benefit from a thorough cleaning, but to..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, -0.75], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["steak"]]}
{"id": "h7wtdzmRDpDI3wuQOJgmdA", "text": ["Amazing service, Clayton killed it. Shout out Clayton. Food was crispy and good. It was amazing. Again can't believe how great this place was.", "I loved the food at this location. It was hot and fresh. The waitress was very on top of things and friendly. Sadly\nIn my opinion this location needs to get...", "Did drive through. Took forever. Then they gave me the wrong food. Bad service. Food was average"], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "OKLbYoHuNwQ-53GkW-8xbg", "text": ["I only took one start away because the place is a bit run down. The ceiling tiles are icky and the floors are sticky....but the food is always great and quick.", "Tried this place 4 times over the last week. 3 out of the 4 times they did not understand simple requests such as 'no onions.' It made it onto the receipts,...", "When we arrived we waited about 5 minutes to be seated. Gave us enough time to read other reviews and we became rather worried about the service after..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "_Cih12-ZxpnDQHPK8iY5eQ", "text": ["Saw this place while looking for Walmart. Came in to do take out. Service and staff was Okay but not bad. Took about 10 minutes to prepare meals. Food was...", "This was only my second time going to Steak 'n Shake (first time was in Ohio--awful as well), and I think my last time.\n\nThis location is right by our home...", "It's ok not sure what the fuss is, I ordered one of their new prime burgers it didn't have much flavor and seemed wimpy."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], ["steak"], ["burger"]]}
{"id": "pwSfRZjsIOU9tUDNBEsiQQ", "text": ["If you're on Yelp looking up whether or not Chick-Fil-A is a good place to eat, I don't know what to tell you. \n\nCFA is the best fast food restaurant in the...", "I am thoroughly impressed with this Chick-fil-A! This is by far the cleanest most modern fast food restaurant I have ever been in. The staff was actually...", "I have a problem because I order from here multiple times a week. Like most Chik-fil-A's, the service is super friendly and reliable, and on the rare..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "4c5ikFQHTURxoqZYKent2A", "text": ["The Gregory's salad was a good start. Especially to help me stop eating the smoked cream cheese and crackers that came before the meal.\n\nThe Hook's Milan...", "Went here for my birthday 10/31/18 and was very happy about the decision to dine here for several reasons:\n\n1 - Beautiful venue (and they are working are...", "I give this place a two because of their good views and the nice server we eventually had. \n\nWe came from out of town at 9PM and they server said they are..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "iPhLOQZun2nmX7-CTNjTyg", "text": ["The salads with Honey French dressing are my go to lunch. We don't forget to snag our $10 Tuesday pizza every week as well!", "We have always had good experiences with everyone at this establishment. The employees are always kind. The food is made fresh. We love getting the kids the...", "Thanks, Darian, for an amazing pizza! I haven't had Papa Murphy's in 10+ years... But you can bet I'll be stopping by your location again! Fresh, flavorful,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.48], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza", "lunch"], [], ["pizza"]]}
{"id": "qpnGhpcFzGefLYuJthytHA", "text": ["For a small town establishment hidden behind the gas station, one could not ask for more. \n\nIn recent years, my grandparents order pizza from here before...", "What a find! Newly renovated, clean, comfortable and has lots of tv's for sports. Now for the food. I love the specialty pies. The Toledo was great with...", "Pizza is always good but they ran out of pepperoni!!  How is that possible?  Someone should run to the store to get some!!!\nAlso, called ahead 40 minutes..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "5sD2SMlL3C0JdBH3LW5B5A", "text": ["Best pizza place in town. I love their ham pizza. Dining room is a bit on the small side. Sometimes they will have patron that sit around and take up space...", "The pizza here is really good and the staff was very friendly. My kids said it was the best pizza they had. I love the flavor of the crust and sauce and the...", "This place used to be a weekly stop, but the quality of service and product have definitely deteriorated over the past couple of years. I haven't been back..."], "rating": [4, 4, 2], "TBscore": [0.42, 0.67, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["pizza"], ["pizza"], []]}
{"id": "c_Whk56eL0UY76cgDuqQkw", "text": ["Yuck.\nThis is \"half-baked\" by literal definition.\nThick, doughy bread, tomato paste everywhere, not even soaked-in. Shredded \"cheese\" not melted. Pepperoni...", "People in the kitchen need to learn to behave .  Talk of people dying after eating pizza is a bit inappropriate. Where is management?", "The pizza is pretty good. Not the best in town but it's close. The cheese pizza is really good and so are the bread sticks. The prices are amazing! Super..."], "rating": [1, 3, 5], "TBscore": [0.0, 0.0, 0.62], "normalisedRating": [-0.6, 0.2, 1.0], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "iKzHhfA_eTFJR9BBGe8YCA", "text": ["DO NOT EAT BUFFET AT THIS PIZZA HUT! This was the worst Pizza Hut I have ever been to. The service was terrible, they didn't put new pizzas on the buffet,...", "We went there on Sunday afternoon, around 2. There was only one table occupied, so we weer optimistic. However as soon as the waitress came to seat us we...", "This is the best PH in the great Jefferson City area. Sure it's not saying much, but if you want PH, I would say go here. I've always had a nice time served..."], "rating": [1, 1, 4], "TBscore": [-0.62, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [["pizza"], [], []]}
{"id": "YxSqEuDbcbE2ulDImbO9SA", "text": ["Some coworkers and I decided to order pizza, we spent about $50. Only to get our pizzas smashed to the top of our box! Not what we appreciate. That's a lot...", "Literally saved our lives. Walking home in the pouring rain and even though it was past their hours these amazing people let us in and even made us a pizza....", "One of the best in town!  If we want a sit-down, then we go somewhere else, but for delivery they are fast and polite, always.  Appreciating you Fulton..."], "rating": [2, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], []]}
{"id": "bhZM-E1t3Zlwm6XNLZGb6w", "text": ["Fun stop on our way through Jefferson City! Cute store and super friendly baristas. Coffee was yummy and espresso was on point. Christmas in July FTW!!", "Stopped in over the weekend with my stepdaughter and had a really tasty cup of coffee!  The guys there are really knowledgeable about their brews and that...", "One of THE best cups of coffee I've ever had. A bit pricey but well worth it. Small joint, cavernous so a quiet laid back this ain't.\nThere was a man there..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "vSKeaMCQ4_hbF0GzWJ5OFA", "text": ["Delicious food, coffee and wonderful service. This place is so cozy and iconic. You have to try it! They have a warm atmosphere on the inside and there's a...", "3.5. Deeply in like, but it's not love. Product (latte + breakfast) was perfectly \"very good\" but not excellent (ham was of the pre-sliced deli variety,...", "Came here to grab a latte while in town. We ended eating breakfast. The space is large with different sitting areas for large or small groups. The space was..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["breakfast", "deli"], ["breakfast"]]}
{"id": "CeIzByFvoOKCek_Y3bKkNA", "text": ["Excellent sandwiches and prices are reasonable .always have gotten my food in 5 minutes or less good quality food and great service .cappuccino cheesecake...", "This cafe is located in the brick district of Fulton. The cafe is very clean and pleasant. The staff are very courteous and polite. The breakfast dishes...", "Love the coffee! I moved here from a much more populated area and have a slight coffeehouse addiction so.....YAY! My daughter and also had a very good..."], "rating": [5, 4, 5], "TBscore": [0.51, 0.66, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sandwich"], ["breakfast"], []]}
{"id": "_-oqsW_ieubLq0q8JcyqwQ", "text": ["Damn you Chim's, why aren't you operating in my neighborhood so I can eat here on the reg? Well it may not work out for me to visit this spot often, but the...", "We went to this place with my brother and girlfriend, who live in Columbia. The setting is quite tranquil, as it reminds me of the Thai Temple by the Palm...", "First of all - Chim's is right on the Missouri River.  I mean you can throw a rock into the river from where you order.\n\nSecond - this is a food trailer -..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "MBU3k7vyB4EAM1lGTNolrw", "text": ["I loved the atmosphere, the courteous staff and delicious frozen yogurt! I took my 6-year-old granddaughter and we enjoyed some sweets and learned about...", "Great FroYo- AMAZING prices.. Would have loved to see more flavors though! That being said, I was super happy because this place was open past 6pm, unlike...", "Several size cup options. Lots of topping choices including brownies, fruit, nuts, candies, strawberry sauce, hot fudge, caramel, etc. \nFrozen yogurt was good."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "-_su6V1M_sm1N9kAbxt02g", "text": ["This is my favorite place in Jefferson City to pick up my healthy health needs . \nThe owner and  his lovely wife are super knowledgeable while being...", "JC Health staff make a great effort to answer any questions and are super friendly. They have a awesome collection of bulk flours, beans, grains, spices,...", "I randomly wandered into this little healthy food store yesterday.  I had a great cup of coffee from the \"Boulevard Cafe\" that is now located within the..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "M2FtIDG5skeAOiuFeMxBQg", "text": ["The drinks are strong and the flavors are out of this world! The experience inside is a lot of fun and the staff behind the bar are hilarious and aren't...", "Delightful tiki bar in downtown Jefferson \"Jeff\" City. It's been open five years, and the bartender who served us has been there from the beginning. That's...", "Nice comfortable atmosphere and cheap but excellent cocktails! Only downside is I wish they were open more than they are! But come on in order a drink or..."], "rating": [5, 5, 5], "TBscore": [0.24, 0.5, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "vMNV0sAcnsaEZFsW4bHfNw", "text": ["Great beer place in Jeff City. The owner knows his beers and the regulars are intelligent and friendly. Nice place for a beer and good conversation.", "My wife and I are new to Jefferson City and finally got out on the town for a night. We walked around downtown for a while and found Gumbo Bottoms which has...", "Very happy to find this place can't wait to go back. Great service small cozy atmosphere. Perfect!!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "6nkulgntiEcxXsxwEskSnA", "text": ["Great local spot! The staff are extremely friendly. They make good drinks and have decent drink prices.\n\nLocated in the historic east end of Jefferson City,...", "This is a great music venue! Two bands tonight rocked! Great hosts behind the bar, come on down!! Ran a tab and it was accurate!!!", "Great venue for live music! The owners, Jenny and Tracy, are wonderful people, support local musicians, and take care of performers and customers alike...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.39, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["bar"], []]}
{"id": "n4cXz-xoZ1AV_1qqd8DoJg", "text": ["My favorite bar in Jefferson City! Small and welcoming. Low prices, especially during happy hour which is 3pm-6pm Monday-Friday. Very laid back and fun with...", "Great place to stop and have a few drinks with friends or co-workers. Great bartenders that pour heavy and always remember your drink. Prices are very...", "Definitely a hole in the wall, but it has character.  This pub has memorabilia all over to check out"], "rating": [5, 5, 3], "TBscore": [0.21, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["bar"], [], []]}
{"id": "WAcojnUVPCD4WqaoZxZwiA", "text": ["The worst bar I've ever been to. The owner was extremely rude.  You are forced and rush to buy a drink before you're there and hour. The owner then jumps...", "Much better bars in Jeff City. It's in the back of a few businesses, and you have to see the sign to know it's there.\n I though it was a little on the dead...", "My friends and I went to tg's for New Years and had a good time until the bartender insisted that she had given my friend her credit card back. We finally..."], "rating": [1, 3, 1], "TBscore": [-0.53, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "7S4CG6ZEv4AsY6coNwlAog", "text": ["Always a good time, friendly people, great bar staff. Only downside is they need a vent for all the cigarette smoke that accumulates in the building.", "River town life. A country bar at its best. Come by for a cold beer, a super mixed drink, and step back from the fast pace. Discover the best of small town...", "Cam the guest bartender made sure we were well taken care of. Excellent service and great, comfortable atmosphere."], "rating": [5, 4, 5], "TBscore": [0.47, 0.21, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "9XpOygQJbveHUvJHXPNn0Q", "text": ["Delicious!  If you get extra spicy expect 2x the grease.  I ordered for 3 different people and they were all satisfied!  Meat is plenty and cooked well", "I don't eat here often but I got the shrimp lo mein last time and man it was delicious. The server was friendly. This is a general mall service...", "Location, location, location....\nThat is the only issue for this place other than that it is a small friendly and tasty place...\nAte here one time and not..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "a3tDixarY2HXV7FE68PNBQ", "text": ["I lived in Columbia for five years and never got sushi from anywhere. I met up with some friends from school and we decided to check of Kampai Alley for...", "If I could give Kampai Alley TEN stars I would!  This was hands down the best sushi restaurant that I have EVER been to here in the Midwest. To start off,...", "14 more days until i check out of COMO and its been just about 1 year. ive just finished a fantastic dinner with my boss, the chair of ophthalmology, future..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.28, 0.3], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sushi"], ["sushi"], ["dinner"]]}
{"id": "ozqOKyxbdjb1baL6h91gRw", "text": ["Osaka is so much fun! Great, fresh sushi - and a friendly staff that tells jokes and makes friendly conversation.\n\nThe restaurant is fresh and clean - which...", "YUM. Will return!! I always over eat at sushi places so I had two rolls, chicken teriyaki, and the fried rice (I took most of it home, please don't judge! )...", "We ended up coming up with the on going yearning for Sushi, we had for a few days. \nThat being said, we didn't think to check what time they closed haha...."], "rating": [4, 5, 4], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["sushi"], ["chicken", "sushi"], ["sushi"]]}
{"id": "QlJkfA3fyGse22Arsi8jPg", "text": ["Relaxing environment, good service, and good food. Reasonably priced. I recommend the volcano roll", "We tried this for the first time this afternoon and it was fantastic! The miso soup was small, but delicious and hot! I ordered the white dragon  and the MU...", "This place is pretty neat. The decor is very welcoming and the menus are probably the best I have EVEERRR seen. The menus have pictures of every available..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "ZWgeNNTaenWXNvzQvJTx4Q", "text": ["This was really good tonight. Our waiter was very nice and our cook was extremely funny. I would totaly go there again", "This place is not worth it. The sushi is overpriced and the hibachi dinners run from $20 to almost $40.  This seemed about right at first, but they nickel...", "Food was mediocre. The soup tasted like lightly salted water with 1 mushroom floating around in the bowl. Our waitress told us multiple times that she was..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["sushi"], []]}
{"id": "4AXgVCSsR2lOvatsHonu1A", "text": ["First time to COMO and used Yelp to locate somewhere for dinner. Enjoyed the Mizzou Roll (of course!) and some nigiri. Kyle was our waiter and he was...", "Matt Maselli and his crew absolutely blow it up!  Creative takes on classic rolls, and fantastic sashimi!  Thanks for a great lunch!", "I went for lunch.  Definitely more of an evening vibe (ambience- and music-wise)... it was completely dead when I went at 2:30.  Staff/waitress was really..."], "rating": [5, 5, 4], "TBscore": [0.44, 0.44, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["dinner"], ["lunch"], ["lunch"]]}
{"id": "7d8lqp_oDzZFo-x_GqIOeA", "text": ["I was in town for a conference and craving Asian food. Where do I go for a recommendation? Yelp, of course! Although the food wasn't world-class, I was very...", "We got takeout from Zen Asian for lunch. We were able to order the lunch specials for $6.99. The only difference is that you can't get soup included in the...", "Stopped because of the ratings on YELP. Food was excellent. Vietnamese spring rolls were fresh & Kung Boa chicken had just the right spice. Wait staff was..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["lunch"], ["chicken"]]}
{"id": "JvZitMZZ7nr0u46gErcRrg", "text": ["Didn't get as many pictures as I had planned.\n\nWe ordered take out last night: teriyaki chicken combination, sesame chicken dinner, edamame, California...", "well.... Lets put it this way Rolla is not known for their sushi....", "I really enjoyed the food.  I had sesame chicken and steamed rice with egg rolls.  I was unsure what to expect and I got anxious when it took the food..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["chicken", "dinner"], ["sushi"], ["chicken", "egg"]]}
{"id": "BPUf6dN23zAzfTUKPimuKA", "text": ["I love koi sushi it's one of my favorite sushi places in rolla. I get the Las Vegas roll or the omega roll. But really you can't go wrong.", "Admittedly I was dubious of a sushi place in Rolla, Missouri. Thus far in the trip, I had eaten a fair share of biscuits and BBQ, so I wasn't sure that...", "My visit at this restaurant was nothing short of a distasteful disaster. I was literally infuriated on my way out. Upon arrival everything went smoothly..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["sushi"], ["sushi"], []]}
{"id": "yUWbT4SHHi65N_hN8b1cCg", "text": ["Food was very good, hot and sushi was very tasty. Sure some of the booths could be updated but the tables were clean and so was the buffet. Lunch for two...", "The hibachi chef was great and this was entirely enjoyable, well-minded, well-cooked, well-seasoned.  \nThe sushi was very bland but okay. \nThe entire rest...", "Poor service, poor website with false information on prices. I went in with the intention on spending 7.99 and 3.99 for lunch, got my bill and it was way..."], "rating": [4, 1, 1], "TBscore": [0.45, 0.32, -0.4], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["lunch", "sushi"], ["sushi"], ["lunch"]]}
{"id": "Z4AiKIFwwHzsp79FLP_wxQ", "text": ["I am staying here for a conference and didn't want to drive off site for dinner.  I walked down to the restaurant to get carry out instead of calling room...", "Gorgeous hotel restaurant.  Very elegant.  Was in town for my wife's family reunion.  Not a single person in her family drinks alcohol, at least in front of...", "Cheers to a perfect place to sit and enjoy the ambience, views while enjoying a drink or two while staying at The Lodge of Four Seasons!  Our waitress was..."], "rating": [3, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [["dinner"], [], []]}
{"id": "ZGhDyxRMCZB2_9p88l06ow", "text": ["Food was 4.75 Service was 5 Star. Cool, funky spot. The tacos are total flavor bombs, get one of each.\nThe kimchee was decent. Tortillas were ok, held...", "I'm not a huge fan of fusion food, but given that this is a nice quick place to stop for lunch. Line up at the counter to order your food, it won't be much...", "Great concept. I saw review score were high so I had to try it out! This place reminded me of Asia fast food. Meat and many things are already pre-made.  I..."], "rating": [5, 3, 3], "TBscore": [0.25, 0.23, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["tacos"], ["lunch"], []]}
{"id": "n1Iy1oA2k3LCHzv_ynia5A", "text": ["Food was the most amazing I've ever had at an Asian restaurant. Presentation and service were impeccable. Perfection! Our family will be back...weekly.", "First time here...located where \"Broil\" used to be..across the street from Las Margarita's.  \n\nThe place was full with 3 large groups seated when we walked...", "Just another sushi joint, nothing to make me come back.  It wasnt full of patrons so service seemed slow.  I order take out and waited and waited for my..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], ["sushi"]]}
{"id": "bY9CZAYZ0cSWII8qHbVAFg", "text": ["This is the best sushi ever! Jina is a riot, she is dedicated to her patrons and her staff is great. \n\nThe Sin City roll is my new favorite roll. It seemed...", "Excellent food.  Superior service at the bar from the bartender.  Clean, well laid out.  Just a great spot to have a drink.  Calamari the spicy app is...", "I would give this place another chance. I didn't love the chicken fried rice, it wasn't bad, just different than your more traditional Chinese/Thai cuisine...."], "rating": [5, 1, 3], "TBscore": [0.61, 0.72, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["sushi"], ["bar"], ["chicken"]]}
{"id": "jeaEgIWcU3o9ISfr-0aXhw", "text": ["Mandarin House is one of our favorite's for local Chinese cuisine. They offer a wide variety of dishes on their menu including lunch and dinner specials. My...", "The quality of food is 1.5 stars and the speed/friendliness of service for takeout is 5 stars. It was $12.95 for the spicy sesame chicken that was 80% fried...", "We used to eat here years ago but had some similar experiences as in the older reviews with rude staff - so we stopped coming here.  However, it is..."], "rating": [4, 2, 3], "TBscore": [0.0, -0.6, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["chineese", "dinner", "lunch"], ["chicken"], []]}
{"id": "ewehI578KZ8NpXkWDY3Dwg", "text": ["This is a nice family owned restaurant that has extremely delicious food! \n\nI'd recommend trying everything. One of my favorites is the Cashew Chicken....", "I have been a fan for a long time, but it seems as though quality has been slipping for some time now. It's a crap shoot these days whether or not your...", "I ordered the fried rice and egg rolls. The server who took the phone order and handed me the carry out was polite and mindful. The combination fried rice..."], "rating": [5, 3, 3], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["chicken"], [], ["egg"]]}
{"id": "vt38GQwSR8tPN4Df3qUS0w", "text": ["I was a Zaxby's loyalist for years, but Slim Chickens has turned me. This is the best chicken finger place in Columbia. \n\nTheir food is always piping hot...", "I tried Slim chickens for the first time today and was pleasantly surprised\n\nI ordered a Cayenne chicken sandwich with fries and a soft drink. The chicken...", "Must be a brand new location.  Atmosphere was trendy and relaxed.  I ordered the garlic wings with fries and they were good.  The options on the menu were..."], "rating": [5, 4, 4], "TBscore": [0.22, 0.0, 0.48], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken"], ["chicken", "sandwich"], ["wings"]]}
{"id": "kq1ML9Wjan5Dsj5_eEvBTw", "text": ["After one of my dad's business meetings, we went here for lunch on a quiet, rainy afternoon. He told me it was a good place to eat, and he was right! It was...", "Great servers, cozy little place.  Located downtown so parking is never fun.  We ordered a sampler appetizer and wished the server would have explained what...", "This could be the Olive Garden of indian restaurants. Which is confusing because it's owned by a nice Indian woman. The staff is also nice but the food has..."], "rating": [5, 4, 3], "TBscore": [0.35, 0.0, 0.3], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["lunch"], [], ["indian"]]}
{"id": "PKe9oucNtHN7vva7HSvRiQ", "text": ["Yum. Yum. Yum.  Honestly some of the best Indian food I have ever eaten.  Chicken Tikka appetizer is delicious and the portion is huge. The menu says 6...", "Debatably the best Indian in town. Huge portions!! Get a few things with some friends and explore the menu. Been going for years and have never been...", "$13 for the most oily, gross Indian food I ever did eat.\n\nI ate here two times because I thought maybe I just got unlucky the first time. Both times were..."], "rating": [5, 5, 1], "TBscore": [0.48, 0.48, 0.25], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["chicken", "indian"], ["indian"], ["indian"]]}
{"id": "WrDdve1nKAeQb2eNURLhpA", "text": ["We ordered lamb korma, garlic naan, and daal soup.  The food was fantastic, but beware... \"mild\" will burn the Midwestern American's tongue right off....", "First of all, I'm rating this restaurant based on the experiences we've had at multiple Indian restaurants around the country.  We pretty much only eat at...", "I was in town for a business visit and came here with my business associates. The place was completely empty, may be that was a sign!!! We ordered an..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], ["indian"], []]}
{"id": "HZSstx7hs0zPmbwBDUJQDA", "text": ["Why oh why are you so far away? Why oh why aren't you cloned in KC?\n\nSeriously. This place is amazing. I had the Notorious BLT and a side of chips and...", "This place is great. I work right down the street and I go get my lunch here occasionally! The workers are so nice and so helpful to help me find what I...", "On the lookout for vegan spots as we push across the US!  Found this highly rated spot so we had to try this for ourselves.  We discovered this is a college..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.31, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["lunch"], []]}
{"id": "kar2hUbx3SaW2VR69PGh0g", "text": ["Best chili verde I've ever had. Order the Burrito Tolteca. Such tender, plentiful chunks of pork. Delicious!", "Very cheerful little place!\nStaff was attentive and food was great!\nWill definitely go back when I Get back to Jefferson City", "Went to Mi Tolteca for the first time. I really like the atmosphere and brightness inside as compared to other Mexican options in town. Chips and salsa were..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], ["mexican"]]}
{"id": "iDkKjHInrbgjTUltBHLkJQ", "text": ["After the rude service at Chili's we ended up here at Pancheros great place fast service Marsha got a Chicken Burrito and I got a large drink I tried here...", "I have been to this location twice and I have enjoyed it both times. The restaurant was clean. The employees that have helped me were all very friendly and...", "I have lowered my rating drastically, as they have YET to show an ability to serve warm (much less, HOT) meat. Nice concept, nice atmosphere, helpful,..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["chicken"], [], []]}
{"id": "LURlRUO00Nh2BF_mrpwWaQ", "text": ["I had the Chimichanga, it comes with rice and beans. While my young niece had the \"To Die For\" Steak Fajita Nachos and my other Niece had the delicious...", "Great food and service!  I also left my cell phone at the restaurant the day of our visit. Realizing I misplaced my phone hours later,  my husband decides...", "I ate here a couple days ago.  I ordered the Chori pollo off the menu, it was very good.  This is a new business so keep that in mind.  Every new business..."], "rating": [5, 4, 5], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["steak"], [], []]}
{"id": "xbwRB63TI_Ln4YHUHC4zwA", "text": ["I would give 4 stars except for the fact that my fiancé and I were seated for about 15 minutes before anyone bothered to take our order. Others came in and...", "Very typical American/Mexican, heavy on cheese . \nFood is served hot , quickly, and priced right . I'm kinda hard on Mexican restaurants and go for the more...", "For being Mexican food in small town Missouri, Jose Jalapenos sure does the job. I went with a small group of friends and all had yummy food and a pitcher..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], ["mexican"], ["mexican"]]}
{"id": "nVoMaO6T0jw5Chd1-zl5UQ", "text": ["20 mins spent in line we get to the damn window and they are out of food???  Serisouly!!   Get your shit together", "Ordered the item advertised in the window and told they stopped selling it a week ago.  Asked for a regular taco to find out you can't get a taco at Taco...", "Haven't eaten at a Taco Bell in years, but now I work close to one on Southwest Blvd here in Jeff and I seen they offer a Vegetarian Bowl, so I thought I..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "4Lj3ih05ZimDkwrAXcN9-w", "text": ["Had a really good and fresh dinner here. I had a really cheesy quesadilla suprema with mushrooms. My son is obnoxiously picky and had a burger. The food was...", "Used to be our number one spot for mexican on date night, although the most of staff is kind of unfriendly, the head waiter in the evenings is super nice...", "Apparently through a lack of common sense and a faulty memory, my wife and I found ourselves back here. \n\nThe waiter we got was pitiful. He acted like he..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.41, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["dinner", "burger"], ["mexican"], []]}
{"id": "2zU0we9xPiWys1OfSpyURg", "text": ["We got food poisoning this afternoon.Horrible just horrible.Never felt so bad. We ordered Mexican pizza, nacho bell Grande and a potato griller.", "Good Taco Bell. The staff is nice and they are very fast! The store is pretty clean. It's also nice looking from the outside.", "Fairly nice Taco Bell. The food is good and the workers are nice. The building itself is pretty nice and new. Overall good place to stop and get a bite to eat."], "rating": [1, 5, 4], "TBscore": [-0.35, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [["mexican", "pizza"], [], []]}
{"id": "96juKJqjzBODdeYW41z3tQ", "text": ["Better than most in Columbia! They are always fast friendly and clean. Can't ask for much more from a fast food place we go here a lot. :-)", "Waited for more than 5 minutes while cashier talked to friend in the lobby. Asked twice if anyone could take my order, nothing, so I left. This is the...", "Normal Taco Bell. Very clean and we'll staffed. Have to ask for stuff...senior discount, salt but place is OK if fast Mexican style food is what you like."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], ["mexican"]]}
{"id": "rBmTYPfE9a0rNEpNgKkyyQ", "text": ["Best ice cream in town and the best service. The employees are always cheerful plus the kids love it when they throw the ice cream in the air and catch it!", "Coldstone has delicious ice cream, fun mix-in's and good service. Many different candies and cake items to choose from. The store is always clean and...", "Glad that the CSC in Jeff City seems to be making a go of it. The one in Columbia shut down suddenly, so when we are in the area we make a point to visit..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.48, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["cake"], []]}
{"id": "s62DxLgvCbcIjWnC-RbmAw", "text": ["I'm glad this exists, it's about time Fultonians get to experience froyo in their own backyard. And I'm glad it's a local business instead of...", "The froyo is so good!  They change up their flavors so you always have a decent variety to choose from and my daughter loves it because she can pick as many...", "LOVE LULU'S best desert place near fulton"], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "wrlq9nwzbfHbUDgkdQoCVw", "text": ["I'm from south Louisiana and I recommend Fontenot's Po'boys. I ate the 1/2 shrimp po-boy with cup of seafood gumbo. The flavor of the gumbo was very good....", "Had a great alligator Po Boy, gumbo, and chocolate gooey butter cake. A great addition to downtown Fulton. I'll definitely be going back!", "Thought we would give this a try. We were in the area and the reviews were good. We all got the shrimp po boys and they were great. I had the gumbo with..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["cake"], []]}
{"id": "URkj-mNkGuR6OzqtbYY_Mg", "text": ["Stopped here when passing thru on our way to Arkansas. We walked in barely after sunrise. There were already a few locals here. It's an extremely small...", "I would give it 2 1/2 if I could. There was nothing special about my breakfast, and didn't bother to finish anything on my plate. The pancake was okay, not...", "Everyone we talked to in the Lake Ozark area recommended the Pancake House for the best breakfast in the area. The best I could give the place based upon my..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.43, 1.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], ["breakfast"], ["breakfast"]]}
