{"id": "8DQEvF7e3C6bmT1yIBK0aA", "text": ["This is okay for getting groceries if you don't want to drive too far but it will cost you because the prices are high. You do not want any of the hot food...", "Nice place, love that it is hooked up with ace hardware, prices are a bit high, but very good variety, choice, best looking vegetables in Juneau", "Don't let the outside fool you, there is a very nice grocery store inside.\n\nThe surrounding businesses, parking lot and front facade are all very run down..."], "rating": [2, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "zYifIXh-Fan3Zhpzi8TbZw", "text": ["I had the  1/2 sand and cup of soup.\nThe clam chowder was pretty good and my sandwich exactly the way I ordered it.  Simple but tasty. \n \nFour months ago I...", "This is one of my favs for a quiet place for a early morning business meeting.  I love the quiche and especially appreciate the crustless options!  The...", "Limited menu and ok food. The quiche could be better but the coffee is pretty good. Next to no service once you leave the order counter."], "rating": [1, 5, 2], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [["sandwich"], [], []]}
{"id": "JtTYvaZoMkkEclBN-2Brhw", "text": ["In such a small city with no Starbucks, this place was a lifesaver. They provide Wifi and boba! \n\nI had already eaten some salmon tacos in a neighboring...", "Super friendly staff. Made our order quickly. Only boba place in town with WiFi. A must stop", "The portions were small in comparison to their prices; my Jumbo Corn Dog was more like a slightly above average corn dog, at least as far as size is..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["tacos"], [], ["corn"]]}
{"id": "DjaeeWHTIs59RcQA47bl5w", "text": ["Ran out of reindeer sausage 3 hours before their closing time. Even the nachos and frito pie went quickly after that. I ended up eating a package of old...", "Awesome hole in the wall for a snack by the pier.  Only place we could find moose jerky as well!  Great dog and tasty toppings.", "I had a reindeer sausage that was not worth 7.50. I asked the guy serving me if he could warm up the bun at least and acted like he didn't hear me. I was..."], "rating": [2, 4, 2], "TBscore": [0.0, 0.6, 0.0], "normalisedRating": [-0.2, 0.6, -0.2], "keywords": [[], ["snack"], []]}
{"id": "nimrt4o4Kk5XNXZP0ugw4w", "text": ["Of the few Filipino places I had the opportunity to taste adobo, I think that this establishment has the best balance of flavors, without being salty or...", "The pork adobo is quite delicious. Priced just right in downtown Juneau, where most places add the tourist tax.\n\nFree wifi is a plus for me.", "Conveniently located across the street from the Willoughby Avenue entrance of the State Office Building and next to Bullwinkle's Pizza.  Full Espresso bar..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], [], ["bar", "pizza"]]}
{"id": "21SCBErNc9qgoY8gcWr9zw", "text": ["Great relaxed atmosphere and the food is great! They gave generous portions and the fish is delicious. Also it is so close to main ship ports so you can...", "If you are one of those people who like to share food you won't want to share this. The sashimi bowl is too good for that.\n\nThere are six simple steps to...", "I got the salmon, spicy tuna, and shrimp poke with brown rice, seaweed salad, and onions. It was quite tasty, but the miso soup was salty. When I asked the..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "BIqzbuRpOxr3dqjdQ2yspw", "text": ["We went here for our wrestling trip, and got chicken at the deli for after weigh ins.  All I remember is me and my friends puking a whole lot of chicken....", "Some of the best Chinese food in Juneau. Overall, food prices are a little better here than Fred Meyer's (if you like the expired food you get every now and...", "Good to get groceries but very high prices. I would not go here unless it's the last resort. You're better off going with super bear."], "rating": [1, 2, 2], "TBscore": [-0.33, 0.26, 0.0], "normalisedRating": [-0.6, -0.2, -0.2], "keywords": [["chicken", "deli"], ["chineese"], []]}
{"id": "jc8XIYSJIrY7D2XpdaReCA", "text": ["I love the breeze in's always making dank bagels and donuts and there deli is the hot spot for workers around lunch 5/5", "The people are friendly and for a small corner store it serves its purpose. It is a jumbled mess inside with stale baked goods but if you need anything fast...", "decent pitstop on Douglas Alaska. Nothing special but the staff were friendly. If you need some food on the go theres always plenty of parking so its an..."], "rating": [5, 3, 3], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["donut", "deli", "lunch"], [], []]}
{"id": "Bj_FCFsL8IMIhPaor4m6ig", "text": ["It's just what you'd expect from this chain - they are not the best, nor are they the worst - what they are is CONSISTENT, which sometimes is all you want/need.", "They are very consistent at what they do. Domino's overall is a pretty middling pizza that's fairly greasy, but if you place an order through this location,...", "Eh. It's what you expect, it's dominos. They seemed a bit unorganized, but the staff was friendly. I picked up and had a good experience. The pizza was..."], "rating": [3, 3, 4], "TBscore": [0.0, 0.32, 0.54], "normalisedRating": [0.2, 0.2, 0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "qoifqB7tmWyL94tBYJCtCw", "text": ["Alright I have got to say this pizza surprised!!! I have never thought of a white sauce for pizza but it is amazing!!\n\nThey put the sauce fresh and tastes...", "King crab pizza $19 10 inch ten minutes wait once order put in.  The flavor is nice, subtle, but dough was limp, soggy, not crispy, a let down.  Interesting...", "You definitely need to try their King Crab Pizza.. It is soooo good!!  Minus one star for the small amount of crab on the pizza, but the cust. service is..."], "rating": [5, 2, 4], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "zeVhYj1n8fIWMPaRNTG9-g", "text": ["And Super Bear saves the day! Safeway was out of spaghetti squash that I had planned on using for a chicken parmesan stuffed spaghetti squash tonight. I...", "Prices very and quality too. I do like the live tanks and it's one of the few places in town you can buy odd ball meats/ seafood.", "I have found staff to be helpful and friendly. \nThey carry some specialty items not found elsewhere. If you need lactose free they're your go-to store in..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["chicken"], [], []]}
{"id": "CTcW7ZKy_3xWjktYyageyA", "text": ["So many different choices and flavors! I opted for a white chocolate hot cocoa with soy milk on this cold morning. A little pricey at $4.75 (being a 12 oz,...", "Best coffee I've had in Juneau since I've been back from Sitka . I got a Vannila dirty chai . 4.9/5", "DRIVE THROUGH ONLY \n\nChi tea latte - spiced \n\nMy first time here July 30, 2016 @7:30am I'm visiting Juneau from Baltimore, MD and didn't want the typical..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "7xWL3MEgjrM6V65w1QmEbA", "text": ["This Starbucks is located inside Fred Meyer. Service is hit it miss. Yesterday I got a coffee drink and requested, and paid for, soy milk. Caleb took my...", "Open or not?\n\nThis review is for the Starbucks inside the Baranof Hotel, which does not seem to appear on my search on Yelp.\n\nSure, this place is just...", "This Starbucks location is inside Fred Meyers, small, at the front, near the fresh produce section.  Tipping is not permitted, which I support.  A 16 oz cup..."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "kqXR6PuG6tMsCUbnY75RDw", "text": ["Mostly giving this place three stars for the service we received. The girl and guy who were working didn't treat us the way I feel like you should treat a...", "Walked by here for the first time  in the winter and it was pretty dead. The other night I was eating dinner next door and kept seeing people walk out with...", "Good ice cream and worth the money!  Large serving and great price.  A good selection and the espresso bean was choice!"], "rating": [3, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [[], ["dinner"], []]}
{"id": "bycYVa_n9yjZzd32dr7XMA", "text": ["The retail bakery is closed now, but you can find their handmade organic breads at Rainbow Foods, Foodland, and SuperBear.\n\nEnjoy the bread!", "We got off of our cruise ship and headed into town in Juneau, past the cruise ship owned jewelry and crap stores and on to the Alaska capitol building.  As...", "Delicious food, mediocre service. Hole in the wall bakery, we got a loaf of sourdough sandwich bread, a macaroon, a peanut butter cookie and a chocolate..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], ["sandwich"]]}
{"id": "hFKNPCSux0y-kl5o9kNC1Q", "text": ["The Honey Cinnamon Late!!! Yes it's as sweet, flavorful and smooth as you think it should be. Steamed milk bass is so good.", "Came for the Final Friday bubble tea bar. Cozy shop and plenty of coconut flavors (coconut matcha, coconut rooibos). I wasn't quite sure how the bubble tea...", "I had pita and hummus with my tea this afternoon. Just thinking quick and easy, which it was. It was also delicious. Really enjoyed it.\nMy tea was also..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["bar"], []]}
{"id": "KqgjKDMfUzfkDdOqNLwLmA", "text": ["Oh AFC, you had me at first bite!  My parents are avid cruisers, and the first time they embarked on the Alaskan cruise they received a slice of Klondike...", "Really yummy fudge!! \n\nMinus 1 star because one of the employees felt very hesitant about giving out samples, not sure what the big deal was? She asked...", "OKay, okay I take back my previous review. I finally got my caramel apple. The smell of the shop is amazing and just lures you from the outside. Big apples..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "NrUWvcWhvW8QBTI5H4lmaw", "text": ["Kombucha on tap!! Thank you very much!! Delicious!! I had elderflower rooibos; they ran out of roasted dandelion ginger. Only two flavors on tap, but that's...", "Awesome little shop in downtown Juneau. They've got some really cool shirts, hoodies, and tote bags designed by local artists, among other souvenirs. But as...", "This is a great place to get real local food and gifts made in Southeast Alaska. Free Kelp Salsa tasting, the best smoked salmon, baby jumpers with bears on..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "8E0BXjmeaEu5nmbnI_vNyw", "text": ["My friends and I were so happy to stumble upon this shop! After a long excursion during the day we were ready for a good snack! The service was great, they...", "My wife and I stumbled upon this place after our original Juneau excursion got cancelled and we were wandering around by the docks disappointed.  The scent...", "cute little stand, makes kettle corn fresh the old fashioned way and let us take a hand at mixing the batch! tastes amazing, would 100% recommend"], "rating": [5, 5, 5], "TBscore": [0.43, 0.0, 0.27], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["snack"], [], ["corn"]]}
{"id": "MQEoL-ZEYJ_4HUA02Qi-2A", "text": ["I stopped here to pick up some basic food for the week while I stayed in Juneau. There was a nice selection of everything I was looking for - oatmeal,...", "I am totally confused about the folks who experienced rudeness. I found this place a welcome relief from the horrors of our cruise ship. I could pick up...", "The only place I go for food when I'm in Juneau.  They have fresh produce, as well as a nice hot food bar.  The hot food bar is only open on certain days..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "HM2hJbUhJqG4SA2LKpKYXw", "text": ["I dig this place for the great whiskey selection and chill atmosphere. Juneau doesn't have a lot of spots for mixed drinks and whiskey enthusiasts. While...", "Pros: excellent selection, speakeasy atmosphere, not loud, yummy mixed drinks. I tried the summer smash. Not too sweet and refreshing.\n\nCon: the bartender...", "I met my friend here, and it got busier as the hour wore on. Good view of downtown from the window. It really is \"narrow\" in here and has the atmosphere of..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "mZfYR7aT0ju6ocsbcN57Ug", "text": ["I enjoyed the atmosphere, everywhere you look they have something different, liked the fact that so many people for so many years have left a mark. I did...", "This place was recommended by the Visitor Center as a perhaps not so busy pub for a drink and food, other than the ones by the cruise ships.  We only had a...", "This is my typical go to spot for a Friday night I'm juneau as is for most 21+ as well. This bar features trivia nights, karaoke (I think) and lots of..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], ["bar"]]}
{"id": "jOTD7iWuHVV19AtdIbAkwA", "text": ["Whale Oil Beef Frank*.... this is best dive bar in all of Alaska!!!\n(not that I've been to nearly all of them, or even remotely close, but I bet I'm...", "My two favortie watering holes are good dive bars and good Irish pubs... Lucky Lady was both.  Mostly locals in here when we came, which I appreciated....", "After having a horrible experience at The Viking, I went in to Lucky Lady Pub and got the best service. The bartenders are kind and attentive."], "rating": [5, 5, 5], "TBscore": [0.33, 0.41, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar", "beef"], ["bar"], []]}
{"id": "_ZT42iLx4qi6rzVIFk2Oeg", "text": ["Toby Keith said it best, \"I Love This Bar\"\n\nThe Triangle was a welcome respite from those waterfront establishments catering to the stampede of clamoring...", "I started my two week Alaska adventures with a three night stay in Juneau. The day before flying to Anchorage we decided to spend our Friday evening...", "Inviting place even for a visitor, though it's more of a popular locals bar. Enjoyed the comfortable feel, the pub mix of pretzels and crackers at the bar,..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "qBXE05ITaZSmrCLJNRlsFA", "text": ["I'm just getting time to finally write a review from my trip back to Juneau! I stopped in the Alaskan bar where I was referred to stop after my sister was...", "I've just checked out after an extended stay at the Alaskan Hotel & Bar. I very much enjoyed the time. The music  coming up from the bar below, I found...", "My favorite bar in Juneau (from when I drank). It's probably all locals favorite too. Definitely gives you the Alaskan local experience."], "rating": [4, 5, 5], "TBscore": [0.0, 0.5, 0.25], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "nLkvf2G8i497IVMYT3VYKw", "text": ["Walked past this bar from my cruise ship while on our land embarking and came in for a beer. Location is past the mainstream bars by the pier so vibes are...", "Worst experience EVER! The first time we went in, Windell approached us and made a rude comment about sitting at the end of the bar because he has to walk...", "I've never been treated so poorly. I couldn't even drink the beer I payed for, because of the outright disrespect and unwelcome feeling I received by who I..."], "rating": [5, 1, 1], "TBscore": [-0.25, -0.35, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "lL9DOAKB1FoURBhAXqpnzw", "text": ["Great local ( renovated about 2 yeaRs ago) spot. We particularly love eating outside at Nano's grill and enjoying a cocktail on the patio.", "Despite what this listing may say, this is in DOUGLAS, not in Juneau.\n\nWhat is Douglas?  It's a town across the water from Juneau.  \n\nIt's what I imagine...", "If you are not known and local they won't spend much time making you feel welcome, food and bar are two different service, so you get two bills, not a big..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "uDt3C5h2gi1b3Np2WdYzZg", "text": ["Another \"cruiser\" here seeking to make the most of the in-port experience by ignoring the official excursions in favor of wandering around on our own. Our...", "So many breweries and it is difficult for the little guys like this one to compete with the big guys down the street. Still Barnaby Brewing has its own...", "Cruise ships are known for a lot of things, but good beer does not seem to be one of them.  Although, if you're on an Alaskan cruise at least there's the..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "HpiBCwwxwgrHTML9RBp_zQ", "text": ["Unique Brewery Tour in Juneau\n\nA Brewery tour for $25 per person, Glacial-fed water Beer and a tasting room. Sign me up. After some advanced research, the...", "While we were in Juneau, we went to an Alaskan Brewing Tour. We headed over to their downtown \"Alaskan Brewing Depot\" where you can purchase the tour, and...", "Please for the love of God find a way to ship your beer to New England. We need you!\n\nThis tour starts with a ride to the brewery from the downtown Juneau..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "12AOcAKDBn2WE7I7jp_brw", "text": ["Inside the State museum, adobo burritos to die for at a bargain price. Great coffee bar to boot.", "Raven Cafe is an independent business running inside the Imperial providing a limited menu items to order.  The list is short, and not everything is in...", "I have been to Raven's Cafe a times in the last year... twice during the summer, twice during the winter.\n\nEach time, the service has been good and the food..."], "rating": [5, 3, 5], "TBscore": [0.8, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["bar"], [], []]}
