{"id": "eJfhqaviP8K8iYheD86SUA", "text": ["I love this place and wish they would build them in Northern California.  The subs are awesome and nearly everything is without preservatives.  The chicken...", "Not sure why this place has such poor ratings. I quite liked it.", "Great food but horrible service waited 20minutes for one sub and fries I was the only customer in the store. the fries were cold and soggy and sandwich was..."], "rating": [5, 4, 1], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["chicken"], [], ["sandwich"]]}
{"id": "qUB-6t8QGPfeV9PfimGr6A", "text": ["Fast service and free smells\n\nWe order here a lot at work and they are the fastest delivery service in town.  They are good at what they do, but the menu...", "It's Jimmy John's for crying out loud. You know subs so fast you'll freak. Was in Lansing for a work training and went here. Staff was friendly however the...", "Wow like why even go to this corporate pos franchise when Firehouse Subs is right across the street? Not surprised the food is as consistently crappy as..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "_MY--t7NCdkuOAhfS9GywA", "text": ["This was a complete miss. The sandwich I ordered was delivered on the wrong bread. When I brought it to their attention I was told it would be \"Right out\"....", "This isn't a place I'd randomly find myself, I was brought by a friend. I was a little skeptical. It's nestled in the quaint small pale downtown of...", "I had the What the Heck.  I really wanted to score high. The amount of meat was great.  The bread was good.   It just needed more sauerkraut and thousand..."], "rating": [1, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 0.2], "keywords": [["sandwich"], [], []]}
{"id": "Yw6JvCQZkPZ9xCRCvcq7GQ", "text": ["Potbelly East Lansing is a great community supporter. Thanks to Sam and staff for donating to the Scramble for Scholarships golf outing which raises funds...", "If you gave someone who was a competent cook but had never made a sandwich instructions in making a sandwich, this could be the result, and certainly not...", "Potbelly is probably 4 star food - quality, tasty sandwiches, probably the best of the chains - but relative to other Potbelly's this one was a five star...."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["sandwich"], ["sandwich"]]}
{"id": "T3Zlq_BevSfqijkXYg1d5Q", "text": ["This is probably our favorite BK location. Liz, the manager is courteous and friendly whenever we have breakfast. She always has a smile and talks with my...", "Hey, do ya like your mouth tasting like a dirty sock full of garbage juice? Are you the type who likes to wait a virtual eternity for your \"food\", left to...", "Food was par. Tables sticky. Staff was loud and obnoxious. Lots of horse play and high decibel, unprofessional behavior. Grill crew looked super busy and..."], "rating": [4, 1, 3], "TBscore": [0.44, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["breakfast"], [], []]}
{"id": "h388VToD3yNi9XN5quNB8Q", "text": ["This is a great place to grab a burger or some top notch poutine. The menu selection is vast: from burgers and poutine to fresh oysters and tacos,...", "It is a cute little restaurant. Very nice bar area with a lot of TVS. Menus had a lot to offer. I enjoyed my burger. You can tell a lot of the food is...", "We loved the M43 beer and the burgers! Now slide me those tix for the Rutgers game!!!"], "rating": [5, 4, 5], "TBscore": [0.4, 0.4, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["tacos", "burger"], ["burger", "bar"], ["burger"]]}
{"id": "9YY39G-tmhOflzpAQ6rrhw", "text": ["Delicious food and a nice environment! Though, we weren't greeted when we came in and our waitress wasn't the friendliest at the beginning. She seemed to be...", "Literally the worst service I have ever received. \n\nI am not exaggerating when I say that it took us 10 minutes to even get a menu and over a half hour to...", "Worst dining experience we've had in a long time. First time here and we will never return. There were 5 of us eating, two adults and three kids.  Waitress..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "DiSzgVplRihotLRKnNSffA", "text": ["Newly opened, the Tin Can Bar is a Lansing (and Grand Rapids) staple, now in downtown East Lansing. They only serve beer in cans, but they have an...", "Just had the juicy Lucy with bacon. It was straight fire. 2nd best burger I have ever had. The bun was amazing and the flavor of the patty was mind blowing....", "Went for their stuffed burgers . Burgers were really good . Waitress was really friendly . Kids liked writing on their chalkboard wall ."], "rating": [4, 5, 4], "TBscore": [0.21, 0.45, 0.56], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["bar"], ["burger"], ["burger"]]}
{"id": "q6WmXrYvMg9ODlJR7P6zrg", "text": ["We love this place. The owners are some of the kindest people you will ever meet! They have awesome flavor options and plenty of topping choices, plus they...", "They have froyo, Italian ice, and gelato. Wednesday is no weight, so you pay for the cup sizes, and load up as much as you want in your cup. Thursday is buy...", "Great selection of flavors! This location has some good options, I love there cake batter and the cookie dough. The store is very cleanly and the owner..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.67], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["italian"], ["cake"]]}
{"id": "7Zilxm0V083fR2U0MHxnFA", "text": ["Good Meal. Nothing fancy but exactly what is expected of a chain restaurant. Service was excellent and friendly would definitely recommend", "Out of all the Applebee's you can go to, this is the one. When you walk in you are treated like how you are deserved to be treated. Every single member of...", "Brittany Smith made my dining experience one to remember. Her sparkling personality paired perfectly with the Cedar Grilled Lemon Chicken I ordered (which..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "ExPOlvYamXvvgbljpt_9OA", "text": ["Love the soft serve! Great little treat stand in the heart of old town, I try to stop in every time I drive by LOL", "Always delicious and generous portions. Anticipate a wait, but the servers are always polite and friendly.", "This place has great soft serve ice cream, but they really need to work on how they serve customers. When it's not busy then there are no issues getting..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "I_D7fEc3O4E-YhGdptchgQ", "text": ["I used the on line ordering today \nTook them one hour and 22 minutes to deliver\nOne of the items were wrong my wife called \nThey put her on hold then hung...", "This is by far the best pizza we've had since moving back to Michigan. We've tried a few of the others around town and we keep coming back to Cottage Inn....", "honestly they made me wait for a pizza and breadsticks for about an hour that was ridiculous yall service better speed up"], "rating": [1, 5, 3], "TBscore": [0.0, 0.0, 0.26], "normalisedRating": [-0.6, 1.0, 0.2], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "zarWyUEwbcZmVnYdC5XnVw", "text": ["We came here last night while in town visiting MSU/EL and had Lauren as our server.  She was super sweet and attentive.  We had already had a large meal so...", "This establishment was recommended by the desk clerk of the hotel where I was residing. They also provided a coupon for a free appetizer. The appetizer was...", "They did a fine job. We showed up with 20 ish people and most of the food came right and on time. There were a couple meals that came late. So that was..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "qL-vvLByTrKPQqqZVmzdtw", "text": ["It's been a while I had a whopper 2 weeks in a row.  This Bk, however, has the new design.  It's cleaner than most BKs.  It's nice that it has a play area....", "Great Playland for the kids! Food is always good and good  prices.Only complaint is the nasty bathroom,need to be cleaned more often.", "I think they had to charter a fishing boat to catch the fish for my sandwich. Still waiting...."], "rating": [3, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "DKaCHP-BbChqrUqRT-yuqQ", "text": ["Visited on a weekday night around 6:30 with my family and stayed for a couple of hours. It was busy but not packed. \n\nPlates are huge! Seriously. Unless...", "Was there last Saturday on9-29-2018. I ordered the BBQ Rib full dinner. I asked the waitress if I could have a baked potato instead of fries. No problem she...", "Looove this place. Never thought to give it a try til a friend told me about it. Ideal dive bar with delicious bar food. Actually it's better than bar food...."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.8], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["dinner"], ["bar"]]}
{"id": "BhWOwWcPzLKb0EDZP74kWA", "text": ["Went to this fine establishment last night for the first time as my pregnant wife was having a craving for KFC.. :-D.  Really don't understand the poor...", "This place is exactly why big corporate means poor quality. \n\nFor starters, somehow, despite my efforts to be clear when ordering they make a mistake...", "This KFC was dirty. Tables & chairs we're sticky. Garbage was overflowing. The employees didn't seem to want to keep the dining room looking nice. They..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "_LbYY3doEhSseF9mJPxrkA", "text": ["Came in for the first time today. The first thing you will notice is how good it smells in here. I ordered the lunch special of a Gyro, Fries, and a drink...", "Newest Mediterranean spot downtown! Tried them out about a week ago and enjoyed my entire meal. I had meat grape leaves with hummus and rice. I also had...", "recently stopped by for Chicken Shawarma for lunch.  The owner anf other team member were very welcoming and truly seemed to appreciate my business.  I'll..."], "rating": [5, 4, 4], "TBscore": [0.39, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["lunch"], [], ["chicken", "lunch"]]}
{"id": "AXOGThEgBtk-n81qqt6b9g", "text": ["My favorite Mediterranean restaurant. I usually order chicken shawarma with fattoush salad, pita and hummus. They make a great falafel. They make great...", "Good prices, but very slow service for a place that wasn't busy. It seemed that they were more interested in filling up take out orders than even serving...", "Always really good service. Sometimes I come in and know what I want before they hand me the menu and they prepare it fast. Other times I get here early..."], "rating": [5, 3, 5], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["chicken"], [], []]}
{"id": "zmvZNCFzDkWn1E3tHIQdgw", "text": ["This is basically \"Meijer Sushi\" in a storefront. That being said for quality, I gave it 4 stars because they make your meal fresh to order, it's a clean...", "The sushi here honestly sucks, it's a cheaper option but still not that cheap and not worth it", "Fish isn't the best quality and not necessarily the freshest. It's cheap sushi but tastes ok. I would say it's a bit better than Kroger store sushi but not..."], "rating": [4, 1, 3], "TBscore": [0.33, 0.0, 0.48], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["sushi"], ["sushi"], ["sushi"]]}
{"id": "6ebMMc1hnqWYqSWnKo00WQ", "text": ["Fresh and reasonably priced sushi comparable to the stuff I get back in LA. Came here twice, once for the lunch special and once for a regular item...", "I'm always skeptical of whether or not all you can eat sushi restaurants are good. I was surprised to find how much I liked AYCE and would definitely return...", "Beautifully plated and so fresh! The inside is beautiful too! The only reason I give it 4 stars instead of 5 is how intimidating it was about finishing your..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["lunch", "sushi"], ["sushi"], []]}
{"id": "0PoNOs60NEo-3MRDKbsEPA", "text": ["Applewood bacon from their meat counter is outstanding: 10/10.\n\nFresh Thyme has good quality produce with great sales every week. It's probably the best...", "So pleased to find this store from Sunday paper ads. They have to feature some of the best rotisserie chicken I've ever had. The seasoning of these birds...", "Horrible check out! Very long lines with only two clerks who are slow! Workers standing around and not helping!"], "rating": [4, 5, 1], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["chicken"], []]}
{"id": "gft-KPqtPjOG9L2FuR9lPA", "text": ["The Moveable Feast catered our wedding on 8/4/18, including our cake and desserts. We worked with Misty Rose during the planning process and had a separate...", "Misty Rose at the Moveable Feast and her team put together a beautiful dinner for our wedding in July. She spent extra time on the phone with me while I was...", "I attended a wedding tonight at Greenmead Historical Park in Livonia, and Moveable Feast catered. One of the employees, Nancy, went above and beyond for me..."], "rating": [5, 5, 5], "TBscore": [0.6, 0.34, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["dinner"], []]}
{"id": "EWM6T9YZMvvpAnBPfBvPAA", "text": ["A very delicious dinner with family indeed. A very charming Thai restaurant. They have quite a selection on their menu. We ordered quite a bit between the 3...", "Our favorite place to eat! Awesome food, amazing service, good eat in atmosphere, and fast takeout! Recommend to all of our friends!", "Some of the best pad see ew and fried rice that I've ever had! Tastiest Thai in town. Everything had just the right amount of spice.\n\nThe best part though?..."], "rating": [5, 5, 5], "TBscore": [0.95, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner"], [], []]}
{"id": "N0Ja4RFmHUHbvEHphEbS6w", "text": ["Otherwise great staff and experience here at this store marred by incredibly rude overnight cleaning staff", "The most unpleasant, horrible checkout person I've ever had the displeasure of interacting with", "Go to one of the other to Krogers in the area the Collins kids run rampant in this one"], "rating": [2, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "DHKapIgjw0X9wA7z6QrBzw", "text": ["Walked into this subway and was greeted by Becky, as she is making my sandwich, the other employee (not sure of her name because she only walked out once...", "Was craving Subway  and came in for two subs took over half an hour to get  Subs constant line to the door. He received two online orders while we were all...", "I went to this Subway in the ghost town formerly known as Logan Square on Sunday. First thing I noticed was a handwritten note on the door saying they..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["sandwich"], [], []]}
{"id": "BJarJGTN90MnG-vBppqqyQ", "text": ["Tried this place the other day for the first time.  Not very impressed.  The food was below average for steam table chinese food.  The lunch combo only...", "It's kind of the McDonald's of \"Asian\" cuisine and I am being nice calling it Asian! Perhaps these overly food colored meats are someone's delight and more...", "The fortune cookie said \"be prepared for something special\".  If diarrhea is \"special\" then it was right.  Should have taken the cue from the thick goopie..."], "rating": [2, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, -0.6], "keywords": [["chineese", "lunch"], [], []]}
{"id": "E1xg1Iu84Cwn6kCElHE7nA", "text": ["It's great to see that a Thai Rolled Ice Cream shop made it to this area. I ordered the Cookie Monster and really enjoyed it. The portions are good. You can...", "Put this on your EL bucket list! Everyone should try rolled ice cream at least once because it is so cool to watch them make it and it tastes fantastic! And...", "I got rose Ceylon black tea with red bean bubbles, and the tea itself was good, but the bubbles were chalky, flavorless, and looked like the attached photo...."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "pgNGv7Bn-a6xQpIfk1zFSA", "text": ["My grandson wanted a small cone ($1.65) with a couple different flavors of soft serve ice cream (he didn't want chocolate and/or vanilla)...they add $0.60...", "I've been here many times before but I always get the same thing. I get the strawberry shortcake. It's warm biscuits with sugary strawberries and ice cream....", "Decent soft-serve, but not worth the price. I had the Lemon and Cheesecake mix in a cup, and it was very good. My wife got Salted Caramel in a waffle cone,..."], "rating": [1, 3, 2], "TBscore": [0.0, 0.0, 0.31], "normalisedRating": [-0.6, 0.2, -0.2], "keywords": [[], [], ["waffle"]]}
{"id": "iMPm3qTvA2phBLl4xi7bxg", "text": ["If I could come here every day of my life for breakfast I would. Only mediocre thing about this IHOP is the staff and their timeliness. Sometimes they...", "I should have stuck with my instincts and gotten breakfast food! \n\nI got a smoked turkey wrap with fries. The wrap was flavorless really and after waiting...", "I have been here only a couple times and today will be my last time. We went in and put our orders in, wasnt too busy and we waited over hour an a half for..."], "rating": [4, 2, 1], "TBscore": [-0.25, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["breakfast"], ["turkey", "breakfast"], []]}
{"id": "oHlZ29s7en1AKRQ0yqRBsA", "text": ["The daily scoop is cool and yummy. I like it a lot. Super good ice cream.", "Obviously it's nice to have a local ice cream store in Mason that stays open year around and uses MSU dairy ice cream. However, I've never been to an ice...", "Great ice cream from the MSU Dairy! Loved the coconut chocolate almond. Ice cream was good, staff was friendly, and decor was cute. I will definitely come back!"], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "6NVzypviMJgFDDrKgf6rQg", "text": ["Nice Greek diner-style restaurant.  Friendly service and awesome summer salads.  Try the spinach with chicken, almonds and strawberries!", "Nothing authentic about this place.  Food is average, prices are too.  Won't be coming back.", "Our favorite restaurant in the Lansing area.  Kind people working, great food. Not super fancy, but relaxed atmosphere."], "rating": [4, 1, 5], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["chicken"], [], []]}
{"id": "4lPecf8ObwglNrFPAwUQ9A", "text": ["We had the pleasure of stopping for lunch on our ride back from Chicago to Toronto today. The food was fresh and tasty but the highlight of our experience...", "Food was cold, and somehow over cooked. I gave this place 2 tries, thinking it may have been an off day. It was not. You're better off buying Bob Evans...", "Good food, good management. Majority of staff is young students with low manners. I walked in to meet my family who was already seated and the hostess..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["lunch"], [], []]}
{"id": "kwhs3JkiiiftY87XthzCgA", "text": ["Unfortunately got a shake and soft serve and ice cream was sour.  My daughter and I threw it away.", "We love this place! My son stops at Scoopy Doo's at least a few times per week with friends in the summer. The owners are so kind and always love seeing...", "HECK YEAH LOVE THIS PLACE I go here with Nate all the time and we have ice cream home made cones and then we get one for the dog to eat I love my dog and..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "PTFvWn3wdRMPWFD_jKWzGw", "text": ["We ate outside at tables, because the weather was so great.  Looked great and clean. Visiting family. Food was great, but although it took a VERY long time...", "Just walked out after no service for 20 minutes. A table came in after us and were immediately attended to. When a server tried to drop off someone else's...", "Read the reviews they are all correct. This place is basically a dumpster fire. Slow service marginal food and high prices. Brought me very cold fish tacos...."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, -0.31], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], ["tacos"]]}
{"id": "2qCW4sL4jU7kJtDr_ub8UQ", "text": ["The one thing I like about Cracker Barrel is consistency.\nSame clean and comfortable decor.\nSame good food (nothing spectacular, but always good)\nSame great...", "I've always heard of Cracker Barrel but I've never been to one until we decided to stay at the Hampton inn down the street for this business trip. We came...", "We decide to skip the meal prep and mess for the 3 of us for Thanksgiving and go to Cracker Barrel. Last year it was fun, delish, and felt like a huge..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "pJCV3zBLbbe1wYmy8UCykw", "text": ["They are playing Bob's Burgers on some of the TVs and I've never been happier. 5 stars.", "unreal experience tonight: placed an order midnight, After an hour of wait I called to ask to check the status because I live within in a mile (I order...", "Pizza was overpriced and just plain tasting. , mostly crust! Sent back ice tea it was terrible. Tables were dirty and no one cleaning them. Bathroom out of..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, -0.24], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["burger"], [], ["pizza"]]}
{"id": "6JyQV7OjqLdOlIIm0lEtOg", "text": ["Love this location!\n\nThis is my go to coffee shop in Lansing for many reasons. They have fantastic coffee, homemade donuts (also vegan options!), and great...", "When a small business provides a superior product or service, seeing them grow always triggers a bit of trepidation. On one hand, you're happy that they've...", "Lovely little small business coffee shop. Great mocha and hot cocoa top with cute foam leaf art."], "rating": [5, 5, 5], "TBscore": [0.61, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], [], []]}
{"id": "A322KuYa0DJfgmTkJ_sdLA", "text": ["Went Last night for the first time since elementary school. Double date with my parents, my boyfriend and I. So nostalgic. This time (almost 20 years later)...", "Great hard cider and great regular cider. They make homemade donuts as cider and donuts are a big deal in the Midwest especially Michigan. They had many...", "I showed up at Y'all place to go to the craft show, and I Purchased me a really awesome Halloween wreath. Well I decided to go into your store and check out..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.26, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["donut"], []]}
{"id": "FpARf2Fw4K_aG_UjKgOz7g", "text": ["I'm conflicted about this Dunkin' Donuts. I've had both good and iffy experiences here. I've come in and gotten 50 donut holes, a dozen donuts, and a whole...", "I am writing this review as I am currently sitting in the drive thru line. I have been sitting and waiting for 25 minutes. I would have left, but once you...", "Staff was super kind and delivered my order accurately. Service was just very slow and they seemed extremely stressed. There was only one car in front of me..."], "rating": [3, 1, 4], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [["donut"], [], []]}
{"id": "64_kKsXUJGoF5AbspXZ52Q", "text": ["I have my coffee here daily (usually by way of the drive thru). On occasion I think they are under staffed and as a result have super long lines but the...", "Fast service. Coffee was good. Donuts were fresh. Friendly staff. Clean inside. Clean bathroom. What else can you ask from a TimmyHos?", "Our first time utilizing drive thru AND this Tim Horton's.  Since we only visit TH's when in Ontario, Canada, we don't have a regular order.  The woman..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["donut"], []]}
{"id": "GPKeozWH5eg5vI6WNlwMug", "text": ["OK place for coffee, bagels and donuts, however subtracting three stars, one for taking off their menu and discontinuing the single best donut in the world,...", "My first time at a Time Hortons and the Italiano bagel sandwich I had was very good. I went inside as I had plenty of time to kill and saw no one else...", "If I could find the owner and complain to them I would.   Owner of this store needs to be notified.  They never have enough food, condiments or utensils...."], "rating": [2, 4, 1], "TBscore": [0.48, 0.58, 0.0], "normalisedRating": [-0.2, 0.6, -0.6], "keywords": [["donut"], ["sandwich"], []]}
{"id": "3hYZSQ5GGDzvamiI15ysFA", "text": ["They did their groundbreaking today. I interviewed the CEO and district manager for Q.D. - turns out that when they reopen they will have a drive thru...", "Make sure to go early (before 9am) if you want to have a decent selection to choose from! I usually get the sour cream donuts that are sooo good or just the...", "QD has the best donuts around, period.  There are no better donuts on the planet, outside of the Blueberry Swirl donut at Village Pantry in W. Lafayette,..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["donut"], ["donut"]]}
{"id": "2kWF7o2y2A9lQjNm6TaQFw", "text": ["Ok, so I lived in NYC, and so I love my bagels. I don't usually eat them, except for when I first move somewhere because nothing is good enough. I like to...", "Working down the street means that I come here on a semi regular basis. So far I've been pleased with each experience. \n\nThe staff is helpful and kind and...", "The line was out the door and took forever, but the bagels made up for it. Lots of unique bagel and cream cheese flavors. Bagels were big and soft! They..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "agxrReQnF0VteuryFsQ5Bg", "text": ["The Marathon Gas station on the corner of Trowbridge and Harrison recently got a makeover which included the addition of a Timmy Ho's!! There is no...", "Rarely do I go out of my way to write a bad review, but they ran out of plain bagels, the wait was so long, and the drive thru was so clogged. I got the...", "Great coffee shop. Many times they don't have everything in stock but they always come back to you with alternatives. I met one of the cashiers who left a..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "OjsDTqmWUpc3opQtVYYnwQ", "text": ["I miss QD. Whenever I was in QD on a weekend, you knew it was going to be some kind of night. Just that vibe to the place. Competitive prices, but watch out...", "First and foremost, it's a convenience store. They sell conveniences at slightly higher than normal prices. They always have a good selection of cheap beer...", "Situated directly across the street from my house, Quality Dairy is my local stop for everything from bananas, coffee, and donuts, to snacks, alcohol, and..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], ["donut", "snack"]]}
{"id": "_D1rYMi6IJoWgIAoFx_p2Q", "text": ["I've started coming here with my daughter on the weekends for a coffee and donuts (milk for her) date. We always have a good time, as it's a big deal for...", "This is probably the slowest coffee shop I have ever been to. I've been in line for almost 25 minutes and when it was my turn to order I had to wait in...", "Ordered an iced capp - I definitely had better. The employees were really nice though so it wasn't th worst Tim Hortons experience I had."], "rating": [3, 1, 3], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [["donut"], [], []]}
{"id": "MremSbq2uxqAITkMpliMQQ", "text": ["This location is a little smaller than some of the other QDs in the Lansing area, but I think it makes sense for the area. Love the donuts (paczkis...", "QD what happened to the quality of your milk and ice cream? There was a time when I swore by your dairy products but now the ice cream always tastes freezer...", "How much i wish California had QD stores around here.\nIce Cream is A++.\nGummy worms are the best I have ever eaten.\nApple juice is decent and only 89..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["donut"], [], []]}
{"id": "ZQDPoLkpwTpc-tPjEQ2MYg", "text": ["The last four times I have been here for ice cream they have been out of chocolate ice cream and also coconut. It's not like chocolate is a rare and exotic...", "Has anyone had issues with Tim Hortons in DeWitt Michigan?\n\nHere is my experience. I was given a Tim Hortons gift card from a client of my business for...", "I love THos but this location SUCKS. Apparently they have a limited food menu, and also don't keep the donut varieties available. Came here just for a maple..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], ["donut"]]}
{"id": "ucSu7p6rw7vaUT9FHggPWA", "text": ["A quick hit and run cheese-steak sandwich to go.\nOne thing I need to check if/when I go to one of Big John's places is whether they cook the meat when an...", "The staff is upbeat and friendly. Sandwiches are always great! We stop by a Big John location whenever we are in the Lansing area.", "Good food, but the bad customer service ruined it. Don't go here late at night the women working are not friendly and made me believe they might have..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.46, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["sandwich"], ["sandwich"], []]}
{"id": "pfw6Vp2RG_tGn06ajx-Y7Q", "text": ["There are several locations of Lucky's Steakhouse and the food seems to be consistently good and the service at this east Lansing location was really great....", "Okemos is a desolate wasteland for restaurants.  This new streak place in a convenient location is a great and refreshing add to the area.  Had 4 business...", "Had calamari, which was kinda bland. Dynamite shrimp was very flavorful, almost too salty, but eat it with the calamari, then it's ok. Prime rib was decent,..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "bVCbcOPjVCwIgNYB_a0lSA", "text": ["I have had Thai food all over this area but I think this place is the best.  Cheap, incredibly fresh, and really tasty.  My belly is happy and my mouth is...", "Quick quality lunch meals. The price can't be beat for these quality meals. You get your dish, rice, those amazing egg rolls and a drink. \n\nYes do try. I...", "Overall: 3\nThis place actually deserves a 3.5, but we just couldn't justify giving it a 4. In Lansing, finding authentic ethnic food is challenging, and..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.47, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], ["egg", "lunch"], []]}
{"id": "KMgJL6s0ifOVfGsEtebQAA", "text": ["This is my favorite pizza in town, possibly anywhere. Plenty of options for toppings and crusts and the delivery is always on time.", "Ordered a large pizza and cheesy bread here. The cheesy bread wasn't as cheesy as jets bread normally is, but it was still good nonetheless. The girl...", "Delivered directly to hotel room, & in only 25 minutes!  Food was delicious & not as greasy as other Jet's locations."], "rating": [5, 4, 5], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["pizza"], ["pizza"], []]}
{"id": "1J8yuDNq2EcVDVrEbxkydA", "text": ["It's my go to for pizza delivery in Holt/South Lansing. Staff answering the phone are always pleasant. Delivery estimates always meet and exceed the amount...", "Took them 20 min for the delivery driver to show up when  I already called because it had been longer than they said it would be.  A side note I'm only 5...", "Shoot. After and hour and a half, and 3 calls I hope they follow up on canceling my card"], "rating": [5, 1, 1], "TBscore": [0.73, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["pizza"], [], []]}
{"id": "Kj1Or9MdX1kw7rMnfOfaEQ", "text": ["The food is good most of the time.  It is hit or miss if they will deliver or if they are even open.  Many times I have been told they don't have a delivery...", "While speed of the food to the table was quick, perhaps the kitchen should have spent more time actually preparing the food. Three adults got the spaghetti...", "Very rude. Called to ask if the could send the driver back because he didn't give me my change and the lady that answered the phone was rude. Handed he..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "KhXNUzWcMpDVH2asnCQLAg", "text": ["The goodness of pizza lies in the crust! This place has delicious crust and the toppings we had on ours made this pie so tasty!", "Just left Poppa Chip's and I can't say enough good things about this place. My husband and I were just passing through on our way to visit family from...", "Ima diabetic and seriously need to watch my carbs.  I tell you, this place is worth every carb.  I live in mt  pleasant. My daughter lives in kzoo.  The..."], "rating": [5, 5, 5], "TBscore": [1.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], [], []]}
{"id": "10UaY8EPY-AjiaShx-bI0A", "text": ["Our online ordering process was easy and quick; whether we pick up or use delivery, we get prompt service within 15-20 minutes.  The price is always...", "While the standard crust pizza at Domino's doesn't do much for me, their thin-crust pizza is delicious and the textural contrasts of gooey cheese and super...", "Always gets my order right. And it's on time! I like using the app and getting the rewards for free pizza."], "rating": [5, 4, 5], "TBscore": [0.0, 0.38, 0.38], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "3pOp1tMwQqebj93RxmFVEw", "text": ["I tried this location for the first time. Got a good coupon to use. I ordered online, love their online ordering system. You pick what toppings you want and...", "So I ordered online and usually do delivered but today was different I wasn't just ordering for me but for a big party, as I walked in and took a look...", "The restaurant is not too attractive, but they employee do their jobs great, pizza is good, friendly employees too, and very cheap prices. cons - no..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.64], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], ["pizza"]]}
{"id": "EzpCIleQ5S4o3IefgHicUg", "text": ["Always delicious, always in 15 minutes, always friendly service. When I'm getting pizza it is always from Fat Boys because they use fresh ingredients and it...", "The pizza I got tasted like cardboard box. It used to be better than what it is now. I am very disappointed.", "I LOVE FAT BOYS PIZZA! I don't want to admit it, but I eat their pizza quite a bit. I usually order delivery, my pizza is always hot and perfectly done,..."], "rating": [5, 3, 5], "TBscore": [0.56, -0.24, 0.41], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "JxcUQDcj2NO56f9PEvLotQ", "text": ["Drive-thru at this location.\nIn a pinch, the Deep Deep is a solid value at $8.\nFirst visit was tonight, no issues with food or service.", "Plain and simple,\n\nYou cannot find a deal as good as the $5 Hot and Ready.  Two people are easily fed for a very low price.\n\nNo, it;s not the best pizza in...", "It's little ceasars. My order was correct, and better quality than I expected. Will definitely be back. Also the staff rocked."], "rating": [4, 5, 5], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["pizza"], []]}
{"id": "BWz3AVwX4Ym4h07wH5FSIQ", "text": ["This is my favorite pizza place. Cottage inn has the greasiest most unhealthy, but delicious pizza. Pizza is cheap and quality is good. Delivery is ok, but...", "I typically only eat at Cottage Inn when I have a coupon. But we had parked near here and went the Broad Museum for Family day on first Saturdays.  We saw...", "Their food is normally pretty good. However, a couple days ago when I got food delivered, the pizza was completely ruined. I'm assuming it got that way..."], "rating": [5, 5, 2], "TBscore": [0.46, 0.0, 0.35], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "8CcejMU_c_9-p-hR8QVhEA", "text": ["If you're looking to pay too much for subpar pizza, this is the place for you. I was looking forward to trying it, but like my first kiss, it was a compete...", "Great place in town for pizza.  Everything was tasty!  Was pleasantly surprised by how good it was.  I'm always weary of new pizza places.\n\nThe pizza as...", "Amazing pizza! I'm going to order from there again!  I hope they do delivery soon.  Best pizza in town! Way better quality than Hungry Howies and cheaper..."], "rating": [2, 5, 5], "TBscore": [0.23, 0.48, 0.81], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "gNXF7QhPOAcntQGh-Zvyjw", "text": ["Great food, especially the pasta. Nice staff, clean and fast! Service has always been fast and friendly", "I love this place! Everything is good here. My boyfriend and I always regret it if we don't end up coming here and therefore, we've become regulars. The...", "Nice clean pub with a wide variety of offerings on Their menu.  I had the pastrami and it was great. Started with the stuffed quahog. Tad dry but very good..."], "rating": [5, 5, 4], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["pasta"], [], []]}
{"id": "1cp9tx9MzMU454Efw7xHCA", "text": ["Entered the place and the ambiance is there. I was  told of the history in the roaring 20's as a bar during prohibition. There  were a lot of television...", "This place reminds me a lot of Pizza House.  Really big, nice, clean, huge menu, good reputation, average service and kinda shitty pizza.  I have no idea...", "We had dinner there last night with three grandchildren and everyone of them and the adults enjoyed what they ordered.  My favorite entree was the baked..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.32, 0.33], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["bar"], ["pizza"], ["dinner"]]}
{"id": "OmwcrcosaG2YQNPKPvTu4Q", "text": ["My kids and I LOVE coming here after practice.  I can get my shopping done in the mall and the pizza is always fresh and hot.   The manager is really nice...", "So I went here to get a pizza here because my co-worker told me that the pizza was pretty good when made fresh. So I walk up and order my favorite,...", "Went here for dinner while we were shopping.  My wife ordered her pizza and after getting subpar service sat down for a nice meal for a recharge. As she..."], "rating": [5, 1, 1], "TBscore": [0.41, 0.44, 0.22], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["pizza"], ["pizza"], ["dinner", "pizza"]]}
{"id": "qY3SI0aDv6ObLRBWTWS8sA", "text": ["Brenna and her team are efficient and friendly! I've never had sit down service, but the takeout has always been reasonable, even last night when they were...", "Apparently we got the C Team tonight ( calling them the B team would have been generous). Ordered pasta for dinner, simple enough, told us we would have it...", "Pickup a carry out order and it took a good 5 minutes before any one even came over to help me. The pizza was beyond greasy, like almost soaked through the..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.7], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], ["pasta", "dinner"], ["pizza"]]}
{"id": "fF2EVOSi0qD9p_juVvu02g", "text": ["Came for a date night after hearing good things from friends and I have to say they were right, I can't wait to come back!\nFirst off, I really wanted the...", "I so wanted to give this place a higher score but for the simple fact that the burger, which I was told was one of two menu items that remained constant,...", "Girls night, date night, any kind of night will be SO much better if you end it at Bridge Street Social. I've been here numerous times with my girlfriends..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["burger"], []]}
{"id": "Lw1JiNuyRj9Wpxc43uUhOA", "text": ["This is the place for pizza!!!! The pizzas were hot and full of fresh ingredients! AMAZING! Will definitely order from them again!", "This pizza is extremely satisfying the best pizza ive ever has if you love food order from zanos pizzs", "Last summer I saw the delivery guy put pizzas for delivery in the bed of his truck without anything over it. Gross."], "rating": [5, 5, 1], "TBscore": [0.35, 0.67, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "vNXiV9WLqK8iLmMMqGGkaw", "text": ["Worst experience ordered one thing gave one thing went back and asked them they don't care to respond properly", "First time here but our pizzas were ready in less than 15 minutes of ordering.  Everyone was very friendly and the pizza tasted great.  I recommend the pan...", "I was very disappointed by my experiences with this restaurant. I will admit, it's been a little while since I've eatten there,  but the last 2 times I..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.31, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [[], ["pizza"], []]}
{"id": "L7szFeO_gi-JwBVeSgZZsg", "text": ["Trash. Straight trash. They were willing to put pineapple AND ham on a pizza - yeah its what i ordered BUT the nerve.", "We ordered two pizzas and cheese bread and thought it was just ok. The online ordering process was great, the food was ready when we got there and it was...", "This location is very bad. Dominos is also failing with their ordering via the app. It will tell you that the pizza is ready and when you come to pick it up..."], "rating": [3, 2, 1], "TBscore": [0.23, 0.5, -0.35], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "l2geMR4glDz-Xxt9oVzKGQ", "text": ["Comfortable atmosphere, good food, and an awesome waitress = great!\n\nDinner visit. I ordered the Salmon and it was very good. The lemon-maple glaze gave it...", "If I could give this place NO stars, I would.  I wanted to celebrate somewhere nice on my birthday.  We had a reservation at 7:30pm for 4 people.  We were...", "We had a party of 5 on a Sat evening but nothing seemed available on OpenTable so I called. Explained that though we were 5, we had one guy on crutches who..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "ju2FVhye9vaGfNrMAJAVdA", "text": ["Stopped in for a quick appetizer after a game at The Breslin, and enjoyed my time here. My friend and I arrived before 10pm on a Friday night, and there was...", "I'm an alumni of 10 years and they refused to let me in. I wasn't belligerent or anything but because I said one thing wrong regarding drinking s single...", "Stop being so bad and making drinks incorrectly. So much to say but I'll leave at this. Just bad and sad. Sorry  :( hot mess."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "sma4SrQhsuodWDSMxiWE0Q", "text": ["I wasn't impressed with the shrimp, the noodles although they were limp- put the flavor in my favor of their moscato signature sauce (not sure what rhymes...", "Started with the Lynchburg tenderloin- nasty! Each bite was different from the last. Too much seasoning- struggled to eat it! Tasted like it had been...", "If you are looking for fancy, go somewhere else, but if great food is what you want, this is the place! Checked Yelp for a place nearby for Sunday dinner...."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 1.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], ["dinner"]]}
{"id": "rFLmhYa3qK40SJZIOm3PHw", "text": ["This place doesn't look like much from the outside -- it's in a strip mall next to its big brother, Dusty's Tap Room. But it's worth finding if you're...", "Wholly unremarkable selection of cheese and an idiosyncratic (at best) wine selection. If this is what passes for the area's best international wine cellar,...", "My husband and I like the atmosphere of the tap room and have been going ever since it opened. The menu doesn't change very much and could certainly use..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "I4J9hGrbNqdaRFg4AMEHlQ", "text": ["I stopped in before work to pick up a treat for the office. So many delicious options! I settled on cinnamon rolls. Everyone agreed that they were the best...", "Only serving sandwiches a certain time of the day when you have the ingredients on hand the entire day is an incredibly flawed business model. Thank you for...", "I've been going here for years! I love all the different varieties of bread. Right when you enter the store, they offer you a sample of bread, muffin, or..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["sandwich"], []]}
{"id": "NIkEOk9-anMhOj714_mCMA", "text": ["I just moved to Grand Ledge so I was delighted to find this bakery! Today was my first visit and the customer service was outstanding, especially...", "A co-worker brought in some goodies to share and they were delicious! My husband and I went in recently for our first time and loved it! The store is super...", "This Grand Ledge Bakery has been nominated for \"Best Bakery in Lansing\" and surrounding area on the MLive.com website. Today was my first visit. \n\nAs soon..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "89rBUiOPM3gRrFcQlalCqw", "text": ["I adore this coffee shop! This is definitely the place to go!\n\nYesterday was the first time I have ever gone here at night, and let me just say I was blown...", "I do not crime here as often as I should but for those of us downtown and in the Eastside neighborhood its easy to stay really close to home. We have...", "Solid spot. A decent amount of seating in order to get work done, very cool décor, and some of the beverages are super unique. For the amount of people that..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "aL4fr24I9EHbXpabMJJKnA", "text": ["This is literally the same store layout, same everything that it was seventeen years ago when I'd come to study here.  The only catch is, the world's...", "Had a book I wanted I their website for $16.\nChecked store availability and this location had it in stock.\nWent there and took awhile to find it, don't know...", "I will say ...I was looking for a specific book and the wonderful lady in the customer service area knew exactly where it was, showed me where, walked me to..."], "rating": [2, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "jPxhxCqvabVNfpDes-IFcQ", "text": ["This is the most incredible bread store. The bread is fresh and there is a huge variety. The French Peasant is the best, so is the rye, they're all good.", "The  breads are very good IF you cut the crusts off. The crusts are VERY tough and you will have to struggle to eat them. The loaves are over $5 each which...", "I remember coming here as a kid and getting a sample of their brioche and begging my parents to buy a loaf of their French vanilla. It's been here forever...."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "z7JQ7QV1r4VuPMUt-9fZFA", "text": ["Down on my luck with low morale, I made the decision that I would enter this biggby store on Friday morning. I walked in and was greeted by a female cashier...", "Cute little coffee shop. We went here because we were staying at the Hampton Inn next to it. The coffee was delicious, and the service was good. The workers...", "Great service. Very friendly and quick :) that is the norm for Biggby Coffee, and I really appreciate it. :)"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "NDaVumilc_AMoAkb-0s-mQ", "text": ["Always friendly, good service.  My daughter walks 1-2 days a week after school and gets a drink and muffin.  The staff is always polite and talkative with...", "This place has gone downhill. Seems like the equipment is always broken and the staff is left trying to make the best of it. Great staff doing the best they...", "Friendly service in a welcoming atmosphere with a generous selection of tasty beverages. I look forward to seeing the trivia question of the day. I like..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "faWH3M8cj6QIwNFp5NnGKg", "text": ["Amazing staff and service. Great selection. I came here for a Job Interview with an employer I met on Bumble Bizz and the atmosphere was perfect. I...", "Espresso Royale is an awesome summer study spot and hangout spot in the summer! They have an awesome large outdoor seating patio area. Their drinks seems...", "There is a lot of seating and the service was super.  The coffee was great... The chai latte was ok."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "JBdFrzKuI2B0jYZMkYre7A", "text": ["I Love love this Starbucks Location!!! All the staff here are super friendly and excited to see you when you come in! It gets SUPER Busy here sometimes and...", "This is probably the slowest Starbucks I've ever been too, and they are always out of the food items I want to order, I've basically just stopped coming", "Will definitely update this review with the name of the amazing barista. He does a great job with calling out names. Very entertaining. \n\nThis location..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "OPHdNPvEDtESXgVzKNkGyA", "text": ["Perfect location for studying. It's not too quiet but quiet enough to study even without headphones on. \n\nIt's also in a great neighborhood and close to MSU...", "I love Starbucks but this location is consistently slow, out of my frequent order more often than not, and is just not the typical positive Starbucks...", "Never waited longer for bad coffee. I stayed in the drive thru line just to see how long it would actually take. Took about 15 minutes with 3 cars ahead of..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "uGnJKap-mDyckeiPaz06JQ", "text": ["Not impressed with my first experience at this location. I went through the drive thru and asked for an egg and cheese sandwich and ice coffee with creamer...", "Got to the bottom of my latte and there was a plastic ring like what is on the top of a milk container. No offer of a refund just another coffee. No thanks.", "Terrible customer service. Cashier added drinks to my order that I didn't ask for, charged me for them and acted super confused when I asked for my receipt...."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["sandwich", "egg"], [], []]}
{"id": "1o1GqO5wuAvjHIyu5W9OCw", "text": ["Excellent Mexican style tacos cilantro lime and onion. My favorite was the asada and canitas. Try their baked goods too so good! Tip for new people when you...", "This is a little place near by! Within walking distance actually. They have quite a bit of selection. My room mate walks there quite frequently. Ive only...", "Tacos were awesome, very authentic in an unexpected location. It's a grocery store with everything authentic Mexican from candy to Masa. Tacos are cheap and..."], "rating": [5, 4, 5], "TBscore": [0.5, 0.0, 0.44], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["tacos", "mexican"], [], ["tacos", "mexican"]]}
{"id": "wwqTdr0m1Z357mCbetxjFQ", "text": ["Had 3 asada tacos with avocado and a mexican coke, 9.66.\n\nNew to Lansing area but not authentic tacos, have tried Oasis and the food truck by old town, and...", "How do you go in there to order food and they don't even understand what you're saying and why is this place so dark thanks for the bad experience...", "This is the best Mexican place in the Lansing area.  Just go to the back near the meat deli counter and write down your order (pen and paper provided) and..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["tacos", "mexican"], [], ["mexican", "deli"]]}
{"id": "agf6yIgqs7xvRkQt_q4PqQ", "text": ["Tried the Mason Depot Diner with my DH this morning.  I can honestly say that it was well worth the wait.  We were previously disappointed that it was...", "Breakfast here used to be the best ANYWHERE! Today my so-called scrambled eggs were one puddle of hard rubber (obviously cooked on the griddle). I'm not an...", "The Mason Depot is a very quaint cute restaurant. Obviously loved by locals. I visited the Mason Depot not too long ago impressed with the decor. The..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.24, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["breakfast", "egg"], []]}
{"id": "lXkhjbCwOHI3WguIllweOg", "text": ["I can't say enough about the food & the workers! I'm never disappointed! Great staff! Great food! The best chicken schwarma in townnnn. One of the best...", "Solid Mediterranean choice downtown! It's been YEARS since I've been to Sultans and they did not disappoint! The deboned chicken was delicious, the rice was...", "The food here is so good! I ordered a chicken shawarma plate and the chicken was juicy and flavorful. The rice was incredibly soft. Although the hummus was..."], "rating": [5, 4, 4], "TBscore": [0.55, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken"], ["chicken"], ["chicken"]]}
{"id": "11bDv_27g0xQy4wYJwZJjA", "text": ["Actually a hidden gem in ways....not a huge menu but tasty and always on point. \n\nAwesome baklava and kabob. \nGet the baklava. \nOddly, their burger is...", "The worst restaurant ever! Don't eat here unless you are on a model diet and want to be sick days on end. I ordered from them and ended up giving it to my...", "Ordered take out through GrubHub. Tried the Dinner for 2, which included 2 skewers of Iraqi kabab, 2 skewers Iraqi chicken kabab, 1 skewer of kabab chicken..."], "rating": [4, 1, 4], "TBscore": [0.27, 0.0, -0.6], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["burger"], [], ["chicken", "dinner"]]}
{"id": "aKShwpGVIowNasv1zbmUsA", "text": ["This is the best middle eastern food that I have had in so long. Not one thing was a disappointment. The shawarma, rice, house salad & dressing, hummus,...", "Quick service, good food, authentic middle eastern, good prices!\n4 stars because all their plates and silverware are styrofoam or plastic! Terrible for the...", "Aladdin's is a downtown Lansing staple.  Came into today and immediately found what I wanted. They had a gyro, Fries, and drink lunch special for $7.95...."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "gTbDPP0f3ADs7oM41f5f_g", "text": ["Nice little spot in the Kellogg Conference Hotel and Conference center. I stopped in for breakfast, and it was much better than I had expected! I ordered...", "What a hidden gem!! I have been going to MSU for 30 years. I started as a student, onward to a grad student and then years of teaching at MSU.  I have some...", "This is the kind of place where the old folks hang out.  The menu is totally old school and uninspired.  Heavy on the wine and alcohol offerings and pricey..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["breakfast"], [], []]}
{"id": "ac1RH8bVXPpaaUm9wunuog", "text": ["The popcorn that comes out of this place is nothing short of a miracle. Every time I visit Michigan, I have to stop by. Their white cheddar popcorn is so...", "I love popcorn so I squealed with delight upon finding this store. Lots of fun and unique flavors. Bought a bag of Carmel and Dill Pickle. Dill popcorn is...", "Great variety and great prices. This popcorn is addictive, I love to mix a caramel flavor with a cheddar flavor. They offer refillable tins and they are a..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "x63-FLzgSllEqQANxjQQkw", "text": ["What a fun store with nice things,things made in Michigan and free coffee!! The store is great for locals and tourists alike. It's not cheesy it's so cute!...", "I loved this little store.  I was visiting from Arizona and didn't have time to visit all the towns I wanted.  It was great having a store concentrated on...", "When I heard about the Old Town General Store, I immediately wanted to love it -- and on visiting, in some ways I did.  It has the small town vibe that's..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "tq4qvOn87-4mVwwrWR7NCg", "text": ["I like this place. I like the nostalgia. I like that they've been around for 80 years. I like the prices. I like the product. I like that they weigh the...", "Super fun little shop that smells amazing! Treats for everyone, from lots of different nuts, candied or roasted to chocolate covered coffee beans. Trail mix...", "Addicted to this place... Huge variety of nuts and sweets and the staff is great. 5 stars :)."], "rating": [2, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "zSgY4-QubsPVzPEK4nq5Jg", "text": ["Stopped into this McD's during dinner rush. Not a big McDonalds fan but was tired and hungry enough to eat the arm off a rag doll and it was on the way home...", "I'm writing this after being burned at least 10 times here (closest location to me)\nWithout fail something is always messed up in my order and they...", "So the kid who thinks he should get $15/hour forgot to put the cheese and pickles on my Big Mac or the manager who does make $15/hour forgot to order them...."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [["dinner"], [], []]}
{"id": "iv4bhtw3a_pEZKl3lrdPxA", "text": ["I stop here several times per week and am happy with the service.  The staff is very courteous and polite.  The orders are usually correct and, on occasion,...", "I'd give zero stars if possible.\n\nThis store and the employees that work here are not a good representative of the McDonalds brand. Ray Kroc and the...", "Good food ok service. Wish they still had power aid. Messed up my order then made it right. Can't complain. thank you!"], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "RzuPH1a3H2OWd-AcY8IbPA", "text": ["Ordered a mcchicken and when I got to the window the manager told me they didn't charge me for the mcchicken so when I said I'd pay for it he said I would...", "This is the slowest McD's I've ever been to. They consistently get orders wrong as well. We also witnessed the manager on duty walk out from his job after...", "Was there for lunch today! Order wrong again! Always out of something food cold. No more for me .this MacDonald's is to rough for me"], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, -0.39], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "uBll5LGfbyUUMCd-hwHY7w", "text": ["Said straw was in bag, straw not in bag\nMade me mad, this is really bad.\nI just wanted water, but I did not get it\nNow I am thirsty", "Ordered a mobile order waited 5 min and went into the store and stood under the \"mobile order pick up\" sign. No one even acknowledged me for about 4 minutes...", "It's hard to mess up McDonalds food, but it's very easy to mess up an order especially at this location. This is the closest McDonald's to where I live and..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "OhxKeSotrnM5jeF4TMvlqQ", "text": ["This is a great Asian supermarket. The only thing they were missing was soju and makgeolli. What they do have is everything from fresh tofu to cosmetics to...", "Typical Chinese grocery store... you walk in and you are welcomed by the typical Chinese store smell... why not a big issue, if you never been to a Chinese...", "Pretty good selection of things. Will probably return sometime just because they have so many ingredients I typically need. I didn't feel rushed or stared..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["chineese"], []]}
{"id": "di5-GKpYk2kt-8YArF3ouw", "text": ["Another great experience.  I think a new ordering system is settling in.  I was greeted in front of the counter by Viola who was helping to answer...", "update 6/7/18: \nthe doughy bitch with the bad attitude who works the front window almost every night can catch these hands honestly i'm over her smart...", "I love their fries and chicken mcnuggets and their snack wraps I just get the plain wraps though and I get 2 of them the staff are nice mom doesn't like to..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["chicken", "snack"]]}
{"id": "0VuUb6uOXzB8-WndHXdsYg", "text": ["Place is cute, clean, and well decorated. I like their tea-based bubble tea. The tapioca is smaller than the average bubble. The tapioca consistency is...", "This place is complete rip off.  \nOverpriced mediocre food, nothing to rave about.  \nWe got Oreo signature mille crepe.  mille crepe is suppose to consist...", "I love this bakery so much.\nLove their drinks & foods.\nTheir atmosphere, it is so perfect if you wanna just sit down and chit-chatting with your friends. \nI..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "OT5DpmCl17OTrGGzvxxSdg", "text": ["Definitely the best organic/natural grocery store in town. It's cheaper than Foods for Living and also gives a 10% discount if you have a student ID.\n\nTheir...", "Updated:  Sadly I went back and the milk that expired 5 days ago in my last review (now 13 days ago) was still on the shelf this week!!!! I wish I could...", "The remodel is nice. I've only had the Hot bar a few times in the cafe. It's been good. They have a frequency punch card for soup salad and smoothies. The..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "fOs94C0KH6Zrs6XdhmEIbQ", "text": ["Cute little bookstore... They don't have a large selection, but they do have a little bit of everyting... Fiction, children's books, cooking, gardening,...", "I ordered a double espresso and it tasted sour..no amount of sugar could remedy that. I think the barista did not have much experience brewing. But my mom...", "Bestsellers has a small but relevant selection of books, magazines, and local gifts. They also have a coffee bar with locally roasted and Intelligentsia..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "V1Fy1eFANZEac3NCFw_c5A", "text": ["Usually about once a week my girlfriend and I hit the drive thru here for something quick and easy for breakfast just before work. HOWEVER, usually about...", "Stopped at the drive thru on the way to Kalamazoo and made the mistake of getting back on the highway before reaching in my bag to discover they had given...", "This place screwed up my orders at least 5 times... If you get a sweet tea... make sure it's a sweet tea before you drive off.. Oh and check your bag before..."], "rating": [2, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.2], "keywords": [["breakfast"], [], []]}
{"id": "vA0ho_xcrE1oVH1dVK_gCA", "text": ["I like the taste of McDonald's, but it's so unhealthy! Some foods are made of fake ingredients, and are REALLY oilly. But Tom, the waiter was amazing", "This location is pretty swanky looking inside, but beyond the exterior looks it's still a McDonald's. \n\nIt's the typical McDonald's food which we all come...", "I had a one star experience but senior management / \"owners association\" quickly took care of my concerns on their day off - I even got a phone call from..."], "rating": [2, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "pwu86lZfo2edYn8vfShIIw", "text": ["Best MCD in the area. Good staff. Fast service. The cold drinks are still cold by the time you get them.", "I usually hate to post negative reviews but this McDonald's was just horrible. We went through the drive thru and we waited well over 7 minutes in the...", "Waited for 15 min to get 2 breakfast sandwiches and / hash browns. Then had to wait another 5 as they forgot half the order. Waste of time and never coming..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["sandwich", "breakfast"]]}
{"id": "RcFqI1X86mXxEmWwk2Kv7A", "text": ["I do a lot of my shopping at natural food stores.  The Foods for Living staff are the friendliest and most helpful folks I have ever encountered.  I don't...", "Don't fool yourself when it comes to selecting the right spice for the right dish! So I would love to share this with you. They got the most exotic spices...", "FIVE STARS because they genuinely have good stuff here. However, Whole Foods kinda destroyed them.\n\nI go to both because this place really do have some..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "GFIPFnk5dVnsfyyIMfEyig", "text": ["Edru promotes sexist policies that allow random, teen girls to be kicked out AT NIGHT for \"distracting\" male customers without refunds..\nunfair. Maybe...", "I really like this place. Lots of fun to be had, and it reminds me of my teen years in the 90's skating at our cities skate arena. The only real issue I...", "First off..let me just say, BEWARE!! They will try to get over on you if they can. Somehow I don't get how their 7 & under crowd price added up to $15.00..."], "rating": [1, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "JmS0pUrKMu8FFHABTMmqZQ", "text": ["This food is delicious! This was my first time ordering from here and I did so because the other Ethiopian restaurants that I visited were great. I ordered...", "This was my first experience trying Ethiopian cuisine and I was not at all disappointed.  It reminded me of a few of my favorite Indian dishes with an...", "Just tried to have dinner here. Told to have a seat anywhere. Waited 15 minutes and no one waited on us. The same guy that asked us to take a seat watched..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], ["indian"], ["dinner"]]}
{"id": "hB8GBZeUn3Goo9TGvUesHw", "text": ["Terrible customer service. Employees are more concerned with personal conversations. Four incorrect items on my order is unacceptable, especially when it's...", "Every time I come here they always seem to already have there ice cream machine off.. it's 10pm and you don't close until 1 am.. riddle me that", "Oh boy. I live 400 feet from this place. My daughter loves their hash browns. This is the only reason I go here. It's dirty and the employees are rude as..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "i4PFn5TJYck7Ws6uzrGpXA", "text": ["If I lived in Lansing this would be one of the my regular bars. With not just one shuffleboard table but two pristine well taken care of full length tables...", "Stober's is my go-to Lansing bar. The staff is friendly and attentive even when it's super busy. They have a decent selection of craft beers and a classic...", "Another Lansing gem! I love the decor, the centerpiece over the bar was originally designed for Robert Plante, and somehow ended up here. I was pleasantly..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.26, 0.54], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "QAhZ4r0dI3Phrx2Z-0BObw", "text": ["We decided to come check out this retro arcade and bar on a Wednesday night and had a fun time. Not busy but not awkwardly dead either. Drinks were good and...", "I'm really teetering between 2 and 3 stars here. Like others have mentioned, the drinks here are very overpriced. They pour a snifter of M43 for $8. EIGHT...", "You get a few tokens per drink purchased. Busy little bar - if you are looking for a different bar night out, there is only one of these in the area."], "rating": [5, 3, 4], "TBscore": [0.26, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "2g4dwQ1E0-AIm3SdvW0jzg", "text": ["This is one of Lansing's premiere alternative lifestyle destinations: it caters to the older crowd but is now and has always been a hip bar with a...", "I was wondering if this friendly neighborhood bar was a gay bar or just gay friendly in an open minded community when one of the bartenders turned around...", "It was the only bar open on Christmas at 11:00pm\n\nToo liberal for my taste"], "rating": [5, 4, 2], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "g62rTzQ129KR4k-zAc3Y6A", "text": ["CASH ONLY\n\ngreat dive bar.\n\nwent there for live music on a thursday night.  open blues jam.\n\none pool table and a good time.", "If Ed Hardy needed a safe space. This would be it. If you wanted to be told how to be cool you could go here read the stale masculine utterances on the...", "what a HOOT!! décor inside totally lives up to the gigantic unicorn bust jutting out from the outside (i'm talking an ASTROTURF stage for live music,..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "C1gtGb3PVLSvCI7I85Uy1g", "text": ["Great, good bad and ugly...\n\nNoise level was terrible but if you research and notice the trend it seems all places are trending that way for various...", "3.5 s. This actually is pretty good pub but I have my concerns. No beer menu, only a wine menu. And they need more beer options. Service was great. Food was...", "Art's recently re-opened after a change in ownership and rebranding. The business looks fantastic inside and out. The remodel was a total success. We..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "pbDS5_9MUElFyeDz3PYMSg", "text": ["Yes yes yes. Don't knock beer in a can. Can get beers here that you wouldn't even find in a liquor store. Always look forward to my visits to the tin can...", "This Tin Can location is right downtown and while it is small, you can venture off to one of the other bars that are connected to it. You can also step...", "Tons of beers and cider, all in cans. They also have a big list of shots. You've got to try a faygo bomb, they were actually really yummy."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["bar"], []]}
{"id": "1jh3SzFonJq9joWGkhHpUA", "text": ["Nothing fancy, but the food is good. There is a nice selection of burgers and sandwiches, but everybody is talking about the burgers. It's also pretty...", "One of the best places in town for burgers. They use fresh beef. I always feel comfortable and welcome here. Very friendly waitstaff. Just a good old...", "Awesome burgers! I ordered the double cheeseburger deluxe. It was fantastic not just the regular old food service hamburger but an honest to goodness hand..."], "rating": [4, 4, 5], "TBscore": [0.52, 0.54, 0.39], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["sandwich", "burger"], ["beef", "burger"], ["hamburger", "burger"]]}
{"id": "AZzP9Dm0M5Qwc9hnGKBnvA", "text": ["Highly recommend. Excellent service by an educated staff. Customer service is clearly a priority. The spirits are very delicious & unique. The craft...", "Not our cup of tea. Or glass of cocktail.  Expensive, watered-down cocktails in an overly pretentious atmosphere.\nOur server was aloof and unfriendly,...", "Was highly impressed on my first visit here recently. Came here on a double date and it was such a fun and interesting experience. Staff were friendly,..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "8wkwfvXKPODX52HZjQeabQ", "text": ["Great local bar that has the look of a sidecar or train style diner crosser with an opulent 1920's speak easy. The wooden shelving for all the liquor is...", "What's not to love about this pub? The bartenders are cool, the cocktails are delicious, there's a good amount of tv's, and the patio is beautifully...", "it is a decent bar, though I just grabbed a quick beer.  it was nice drinking a beer with the BBQ next door.  The bartender kept watching netflix with the..."], "rating": [4, 5, 3], "TBscore": [0.31, 0.0, 0.28], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["bar"], [], ["bar"]]}
{"id": "vLbftIJ5q6ZET6sz9LciAw", "text": ["Low key martini bar in downtown Lansing. Pluses include great martinis and occasional live entertainment. Service is hit or miss depending on the night....", "Challenge accepted!\n\nYou want me to try all the different Martini's---sure why not?  Great for the Lusho's at heart.\n\nWas in town for work and decided to go...", "For Lansing, this is a really good nightclub.\n\nAny decent city, anywhere else, this would be a minor establishment, with little to say.\n\nBut for the Capital..."], "rating": [3, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 1.0], "keywords": [["bar"], [], []]}
{"id": "6LubEt9Ytd6ACi4O_-cVfA", "text": ["A hidden gem in East Lansing. Great beer selection, good food, a nice patio and some TVs for catching your game of choice. Their sliders are basically the...", "We liked the welcoming atmosphere, good vibes, and great service. We got the adult grilled cheese and black bean burger. Both came with choice of side (we...", "Sidebar is actually an adult bar in East Lansing! Granted, it's not exactly next to campus, but close enough. It feels like a small neighborhood bar should..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.41, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["burger"], ["bar"]]}
{"id": "aihUz7Nw8GtBW5p-6tgevA", "text": ["One of Lansing's Premiere dance clubs, Spiral has been around for generations. \n\nDespite the sometimes younger (20's-40's) clientele that keep this local...", "Spiral is a good place for techno lovers; I read dance club and expected a variety of music. The place is great, I love the set up, however the \"dance\"...", "Used to love this bar and now they are pretentious pieces of shit who took my moms legal meds. Go to esquire instead."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], ["bar"]]}
{"id": "0sgowsF1ujZNzAD-78sdjw", "text": ["Great local bar!  The bartenders are attentive and very friendly.  They have great drink specials, and their regular drink prices aren't bad either.  \n\nI've...", "Staff was terrible and rude. Food was terrible. Had a very very long wait for everything and the bar wasn't even busy. Tried to get staffs attention and the...", "We love jazz, my wife and I. And Mort's has Tuesday Night Jazz and is really the only reliable local venue for this music in this area. Which is shameful..."], "rating": [5, 1, 2], "TBscore": [0.26, -0.45, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["bar"], ["bar"], []]}
{"id": "TPiMnKNy4hv2CjPrgYldYA", "text": ["I met here for a gathering with local businesses and MP Social was more than accomodating. They had some great shareable food items and the drinks were very...", "This place has potential but it's not there. We were the only customers there on a Friday night for happy hour. Ordered martinis, the waitress told us the...", "Lindsey was a fantastic and knowledgeable bar tender. Beautiful and delicious charcuterie board. We ordered shots but they were served to us in regular..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.56], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "eOomW2yemywfydN4VgwXuw", "text": ["Smells like farts. Ive seen a few shows here now, the sound quality and service are great but the whole place smells like a big fart every time.", "I visited Mac's on 9/15/2017.... We were just exploring the area.... Sam was our bartender and he did an awesome job! Everyone there was friendly and I will...", "Went here with a couple friends, place is terrible. Dirty, disgusting, and weird crowd. Completely dead inside, other than tons of 15 year olds underage..."], "rating": [3, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "OoBc9sXU-J4OAfyX_1ovqg", "text": ["One of the bouncers is a registered sex offender and it's on public record. Matthew Prather. He was hitting on a 16 year old who snuck in with a fake ID. I...", "The worst sound system I have ever experienced, sounds are like you are hearing it from under the water!\nTerrible bathrooms,  \nThe drinks was cheap tho,", "Lol. Its proably what some people are looking for. Not me. Warm beer, cowboy hats and people puking on the outside patio."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "IVSoVuJsQ-Lwp_s-OxcOMg", "text": ["First timer. The food was just delicious. The staff was very focused and friendly. I was here with a party of people. We did outdoor seating. Everyone...", "Will never be back to this establishment. Service was terrible. It took 30 minutes for 8 chicken wings and about an hour for a pizza and it wasn't even...", "Great service and pricing, food really good!\nClean large seating areas and tv's on every corner for the sports minded!"], "rating": [4, 1, 3], "TBscore": [0.0, -0.53, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], ["chicken", "wings", "pizza"], []]}
{"id": "7ZwepEkkA0VyzX_igPoHMw", "text": ["If you are looking for a place with great craft cocktail, friendly staff, and an awesome atmosphere look no further! We will definitely be back.", "So wonderful. The cocktails are crafted with a careful hand and I love the ambiance. It's a great break from the traditional bar scene and such a nice,...", "Amazing hidden gem in the Lansing area.  Absolutely top notch handcrafted cocktails with impeccable spirits and ingredients.  Super friendly staff,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["bar"], []]}
{"id": "_lkkndCQI5DOkON8G7qwyw", "text": ["Too bad you can't give this place 0 stars.\n\nThe female bartenders are pretty terrible. Was here Friday night, and we have 1 bartender give us the wrong...", "Too bad you can't give this place 6 stars.\n\nThe female bartenders are pretty terrific. Was here Friday night, and we had 1 bartender give us great drinks...", "Happy hour discounts on tequila also applied to mixed drinks- can't beat a cheap tequila sunrise :)\n\nOverall, a decent spot to get a drink.  Pretty average..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "ogJMObLMZLsUwk1OuIXAbw", "text": ["Quaint ambience with a friendly and helpful staff. Clean facilities with ample parking. \n\nThe food is good and offers another great cuisine choice in the EL...", "You don't see a lot of restaurants that serve Himalayan food. I was pretty excited to try this place out, especially because it had good ratings. I came in...", "I would give this place lower stars based off of just today's experience however, since the restaurant is brand new and the food was amazing, I don't want..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "fsPYFI5Dcz9EFRx8bBo_3w", "text": ["Absolutely in love with Crab Hero! We had the crabs, mussels, crawfish, shrimp, and calamari in the restaurant special sauce at level 3 heat which was...", "It's really good but not good enough for how much we paid. Our total came to a little over $70. So around $90 after tip. \n\nMy fiance got king crab with...", "Talent chief with magic seafoods anyway. You must have to try the secret sauce but baby spicy just pefect. The seafoods almost mad my day when i was so..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "z6utdG2eRy9BZJKwJEKaTg", "text": ["Authentic Chinese dishes OR dishes that many Americans think are Chinese, like sweet and sour chicken. Take your pick. You can have both here. I'm American...", "We've been coming here since we moved to Lansing 3 years ago. The owner has always been very pleasant and although their wait staff don't speak English...", "I recommend this restaurant for all the people. I have been in MSU for 5 years, I always go to Kungfu for dinner and I have to say this is the best local..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken", "chineese", "american"], [], ["dinner"]]}
{"id": "Fku_4AzREJ4JNcJDD0IfUg", "text": ["Definitely a solid choice on the South end! The Tom Yup soup is delicious. I always get it extra spicy but that's me. The menu that's online isn't updated btw.", "WARNING: This was my second visit to ming dynasty. My first visit was great - nice girl who worked the front and the food was classic cheap Chinese food;...", "The restaurant is under new/old management.  We were there tonight and the veggie egg rolls were good.  We will make it a regular stop now that Mama is back..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.32, 0.23], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["chineese"], ["egg"]]}
{"id": "yHhqkgd67qj-FIXFsnlGqg", "text": ["This is by far one of the best takeout places I have been to.  The staff was very friendly and the foods is phenomenal.  We used them to cater a couple...", "Great family restaurant - best chicken fried rice in town! Great staff, and it is conveniently located on creyts rd and st joe.", "We just tried Canton for the first time. The food is made to order so it takes about 15 minutes, which isn't too bad. We tried the General Tso and the..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.46, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["chicken"], []]}
{"id": "7IhkJp8sB3kO_047DWf-xw", "text": ["This is my favorite Chinese food. To be fair I haven't tried many others, I'm always happy when I go to Fortune House. Mom and pop restaurant, very nice people.", "Very fast service even during Friday lunch hour rush. I got the sweet and sour chicken with wonton soup. The soup was excellent.  I wasn't a fan of their...", "Two stars for the large portions and the food being hot still when it got home.\n\nHowever. If you want Thai food, I do not recommend this place. I can't..."], "rating": [5, 4, 2], "TBscore": [0.55, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["chineese"], ["chicken", "lunch"], []]}
{"id": "jG9GmxiWP9aIQpyzCSqt_g", "text": ["Really good Chinese food, especially for the area. The chicken was good quality and the portions and prices were great. $15 for two, can't beat that.", "I had a hankering for Chinese food and don't normally eat it, as a matter of fact, this will be the 2nd time this year and it's August. I found this place...", "I wholly recommend this restaurant! Their General Tso's Chicken, fried rice, Mu Shu Pork, and hot and sour soup are really great."], "rating": [4, 5, 5], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["chicken", "chineese"], ["chineese"], ["chicken"]]}
{"id": "LB0SUGbvUQscVnf_MfFWxg", "text": ["Place is run down and not located in the most elegant neighborhood-- but, a good Chinese-American option! Friendly service and yummy food. I asked for...", "Came here for lunch with a colleague and the establishment didn't look very inviting. I've been taught, never judge a book by it's cover; so we decided to...", "Best Chinese food I've had in a long time! Great portions, good prices and super fast delivery!"], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.43], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], ["lunch"], ["chineese"]]}
{"id": "S5MwIvQYHNPXQA66LVlu6A", "text": ["Decent for what you pay. Good variety of classic Chinese dishes. Egg drop soup is my fav", "Went for buffet for takeout around 5pm today. This place changed hands in the Spring and the new owner could not care less if they are successful.\nThe food...", "Got 2 appetizers and 2 meals to go. The dumplings were undercooked (and not fried like we asked for. The Hanan chicken was tasteless, rubbery, and not spicy..."], "rating": [3, 1, 1], "TBscore": [0.26, 0.0, -0.6], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["chineese", "egg"], [], ["chicken"]]}
{"id": "vBNWEG1sct6mmFc3mllwPA", "text": ["This was one among the best Asian cuisine I have had in the Midwest. We had the Seafood Combo and Beef Tendon soup. It was delicious!", "I really like the concept of this restaurant -- what's there not to like about individual hot pot?? The first time I came here, I got the Taiwanese beef...", "If you don't know what your eating or picking from then it's hard to get a great first time experience. I've been here a handful of times and each time was..."], "rating": [5, 4, 5], "TBscore": [0.67, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["beef"], ["beef"], []]}
{"id": "l-3w1xAovlH-XLo-RRmN3Q", "text": ["Stopped in for the first time this evening hoping to find a good spot to start ordering from. May have found one. \n\nCame in around 7pm. Few people in the...", "Well I'm new to town and stopped by to get some mei fun noodles and streamed dumplings. Nope sorry!! The steamed dumplings had a good flavor, however, the...", "I've opted for pick up a few times as I work nearby. The customer service and promptness has always been great. The food isn't particularly the best Asian..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "2gOH7HGzPopH8mSx1lrDlQ", "text": ["Went here for a late night dinner with my partner and friend. We had such a good experience and the food was so tasty! I ordered the Hong Kong tofu and it...", "I use to go to this place all the time when I use to live in EL. Recently visited once again and it still has Amazing authentic Chinese food. I can't say...", "The flavor of their food has gotten better the past year. I'd recommend getting the Hong Kong Style Fish Filet and the Sichuan Eggplant Garlic Sauce. The..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner"], ["chineese"], []]}
{"id": "aQr-rYsV1dkB0wB2OHC9YA", "text": ["I tried this restaurant today and am so glad I did! It was quiet and clean, and smelled great. The staff was friendly and efficient, and the food was not to...", "what a disappointment !!! I guess my expectation was too high after i read good reviews.  \nIt is nothing authentic about this restaurant.  \nnoodle soup is a...", "Food had no taste at all. Waitress never came to refill our water. And super expensive. They also charged a standard 22% tip on our order which I think is..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "TF4vFoALXoOSGAwR4XhdEw", "text": ["I have been coming here for the last 15 years growing up in Grand Ledge. I have since moved away (Chicago) but when I come back to visit I call in an order...", "Worst Chinese food I've ever had. The flavor was bland and tasted like it just came out of a freezer that it sat in too long.", "One of my favorite Chinese restaurants in the Lansing area. It's consistently good and not overly greasy, and fresh, unlike many places around here."], "rating": [5, 1, 5], "TBscore": [0.0, -0.3, 0.4], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["chineese"], ["chineese"]]}
{"id": "jDO7O7dGf1oLQD_CqWTxUA", "text": ["I've loved the basic hot pots at Royal Pot for a solid year. Our last time there we saw a definite difference in the selection. The broths have spicy butter...", "Super Love it！！！\nU can choose the spicy level that you could accept!\nI always have great experiences and I go there every week\n And I will pick up to...", "I know this is a Hot Pot restaurant but I'd have to say their authentic Szechuan dishes are way better than their Hot pots. I have heard a lot of rumors..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "KqQt_kp6qE6CG7fJyf4UyA", "text": ["If you want the best Chinese food in the area, look no further than House of Hsu.  Seriously, this place serves up the best dishes, regardless of what you...", "Love this place!!! I have been coming here for over 20 years!!\nMy favorite is their princess shrimp plate.\nTheir egg rolls are good!", "Easily the best Chinese restaurant in the area. I've been coming to this restaurant for so long that the waitresses know and talk to my kids every time we..."], "rating": [5, 5, 5], "TBscore": [0.33, 0.79, 0.35], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chineese"], ["egg"], ["chineese"]]}
{"id": "SEzA6pHedHqXoxa7kGSu_Q", "text": ["Without a doubt the BEST Chinese food in the greater Lansing area. They have the BEST, authentic lo mein noodle I have ever had and the service is top...", "I was excited to try this based on the ratings left by others. But after the service & food from this place, I have no idea how it is so highly rated. First...", "So based on Jo S. review we decided to try China Express tonight. Having lived here for 3 years we have yet to find a satisfactory Chinese place. We have..."], "rating": [5, 1, 5], "TBscore": [0.58, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "28fSKok8JocK7b_FCsGYfQ", "text": ["I have been going there for years. The rice is not burned and never has been.  \n\nThe prices of the food is great!  Service for take out is fast! \n\nThere is...", "First-time here. Very authentic Chinese cuisine, reasonably priced, NO mandatory 18% tipping (which is a very irritating phenomenon in some Asian...", "After forgetting my Sweet and Sour sauce, delivery guy calls me repeatedly.  Eventually tells me I'm an asshole.  Comes to my place of work and creates a..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["chineese"], []]}
{"id": "l_M52MZNTlJp9rXcqy7D7A", "text": ["You know you came to the right place when 1) you are greeted in Chinese, 2) asked what you want to drink in Chinese and 3) the only language you hear is...", "This place is great. I've tried a few hotpot places in the Lansing area, and this is the best so far. It is a bit pricier, so it's great in groups. I went...", "This is most authentic hot pot I've had outside of China. The waitress was incredibly friendly and helpful. She answered our questions and was very..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["chineese"], [], []]}
{"id": "88AKWckvQBuWq6HhM4OE-A", "text": ["We've been looking at this place for a couple decades and finally tried it, since we've been branching out from out mainstay take-out spot. We were very...", "Had hotpot dinner. The beef tasted bad. The another day I had diarrhea, vomiting, and uncomfortable feeling. Other than the high price, at least you...", "My Chinese friend brought me here and really liked this place. I had spicy fish, dry hotpot and some vegetable dishes. Although I'm not an expert in Chinese..."], "rating": [5, 1, 5], "TBscore": [0.0, -0.29, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["beef", "dinner"], ["chineese"]]}
{"id": "QgaVWvsvwGIwrDrzRFbyNw", "text": ["When I walked in I felt slightly overwhelmed by the menu and somewhat accosted by the overly enthusiastic staff eager to serve me and offer recommendations....", "Usually decently good, but have been finding hair in my food lately which is an extreme turn off. They also tried serving me inedible chicken - just look...", "I am so disgusted. I would give this 0 stars if I could. I was halfway through eating my lunch and found a finger condom in my food. I went to the..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, -1.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], ["chicken"], ["lunch"]]}
{"id": "jijhk4EnBeiNB5V9zYcrjQ", "text": ["The Mac n' Cheese was excellent. It was pretty busy, but the service was quick. It had a pretty chill atmosphere, which made it very enjoyable to relax at....", "Love the food at Noodles, especially WI cheese and stroganoff. The service is very good. Restaurant is not up to previous standards, however, when it comes...", "Haven't got the bugs out yet.  The booth with the fly was the cleanest in the place.  It was 730 pm on a Monday.  Plenty of learners.  No cleaners.  Food..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "U0H_AEu7PP6DxiXJAAp2Yg", "text": ["I visited recently for the first time and had one of the best meals I've ever had in my life! I got the Den Jang Ramen. It had a kick to it, but the flavor...", "I always walked by this place not thinking much of it, but don't let the name \"teriyaki and gyro\" fool you! It's pretty clean and cute on the inside, and...", "I ordered samgye tang, absolutely the worst I ever had among all the Korean places I have been to before, the broth taste like a lot like just msg, and..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, -0.4], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], ["korean"]]}
{"id": "Xn3Y6XWtn1xeKvUK3r5mvQ", "text": ["My husband and daughter and I went to this restaurant for dinner tonight. The food was excellent, however the affect of the owner, the woman, was beyond...", "Bad service! Bad price! No good environment. Even charges for side dishes! They will stare you when you pay and when you tip! Super bad place. I will never...", "Although Three Times Cafe boasts a nice variety of authentic Korean dishes, Three Times is (Doggy) Trumps favorite place to get gamjatang (pork bone soup)...."], "rating": [2, 1, 5], "TBscore": [1.0, 0.0, 0.53], "normalisedRating": [-0.2, -0.6, 1.0], "keywords": [["dinner"], [], ["korean"]]}
{"id": "naDwM_LVBg3QsYiEg-I1IA", "text": ["If I can choose, I would give Limit a 3.5 stars. A room that fits about 6-7 people comfortably is $40 per hour. A large room, good for a group of 8+, also...", "Went to this place the first time and it was decent. As you walk in the door you can tell they cater to mostly Chinese students. The room was large and fits...", "Top notch place reminiscent to the cash box karaoke I've been to in Beijing. \n\nThe Karaoke system has everything written in Chinese, thankfully I was here..."], "rating": [3, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.6], "keywords": [[], ["chineese"], ["chineese"]]}
{"id": "4HUigI9BmajbwkJTLhOIHw", "text": ["Love Swagath! Their service is great and their buffet is amazing. The options are great and flavors stay true to South Asian culture. \n\nI tried Swagath both...", "Stopped for lunch. You would not know this place was here unless you looked hard or unless if someone told you about it. Lunch buffet was so good. I don't...", "amazing food, great price. best indian food i've had in a long time. the service was nice and friendly. will definitely be returning here every time i visit..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.48], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["lunch"], ["indian"]]}
{"id": "JR4Tw4-MxmZ1IAlVKwkgXQ", "text": ["I was skeptical to come here because of the reviews but their lunch buffet saved my budget as a student. It is close to campus and quite a lot of people...", "Finally the best flavors this Texan is use to!! Perfect balance with spices, heat, and excellent prices!!  When all you experience is heat and over flavored...", "I tried the lunch buffet. The price is pretty decent - $9.50 per person. The food, however, fell short of my expectations. I think they probably go light on..."], "rating": [5, 5, 3], "TBscore": [-0.5, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["lunch"], [], ["lunch"]]}
{"id": "q2KnWAx4P3OCRqznx2k2Pg", "text": ["Excellent lunch buffet! The spice level is medium. Love how the naan is brought in a basket to the table. \n\nBest Indian I've had in the East Lansing/Okemos...", "The best Indian food I've had in years!\n\nI have never had Indian food as good as this in Michigan, and I've been looking for a long time. The hot curry was...", "This is our new favorite Indian restaurant in the East Lansing area! We've been there 3 times in the past month (going again tomorrow!) and everything we've..."], "rating": [4, 5, 5], "TBscore": [0.83, 0.47, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["indian", "lunch"], ["indian"], ["indian"]]}
{"id": "4AKnqk4Gm__zruVMcRpafg", "text": ["Persis was an indian spot nearby that came up with high rating and good reviews when I was looking for places to eat. I am not going to lie, I thought the...", "We went to Persis on a weeknight for a team dinner - our group has a mix of ethnicity, dietary preferences, and spice tolerance, and Persis did not...", "And two stars is being nice!! Too much heat y'all!!! And stop with the Cardamom!!! When the dishes are too hot to eat, you can't really enjoy the flavors...."], "rating": [5, 3, 2], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["indian"], ["dinner"], []]}
{"id": "llCWU8Q3Bcc1eCwCSkdAxA", "text": ["-vegan options\n-high quality\n-accommodating staff\n\nWe eat here regularly, meaning once or more a week on average. At the top of the list as to why is that...", "I don't know if I could ever love an Indian restaurant as much as I love this place. I now lived in Philadelphia and Queens, NY and I still can't find a...", "Not bad at all for an Indian cuisine restaurant in Michigan! I'm used to the multitude of Indian restaurants in the Bay Area of California so this was..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.5, 0.44], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["indian"], ["indian"]]}
{"id": "y9RDecVz-h-AaLItFPpgcA", "text": ["Delicious! We tried the Indian restaurants in the Kalamazoo area, and were eventually disappointed each time. We heard about Lazeez a few days ago, drove an...", "Oh my word, first time here and just loved it. Can't wait to come back and bring friends/family. It's so good!!! We just had Puri for an appetizer and...", "They randomly open and close and do not work the hours published! very strange! This is in line with several prior review as well looks like..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["indian"], [], []]}
{"id": "JYVEbPp67apiT7ksupQl-A", "text": ["UPDATED REVIEW:\n\nThe manager, Scott, reached out to me regarding my previous experience and offered a complimentary meal (and drinks!) for two people to...", "Stopped here for a drink before going to dinner. Had a blood orange Mojito which was fabulous!\n\nThe bartender was very attentive, and did a good job keeping...", "Went here with some friends last week.  I sat at the bar, waiting for the rest of the group and had a blood orange mojito.  The bartender has been there for..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.57, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["dinner"], ["bar"]]}
{"id": "1Qg4on8FTh6Yi27Eyuxm7w", "text": ["There are quite of special places when you walk into and take you by surprise. Everest Sherpa was one of them. It was the kind of surprise as soon as you...", "Made a couple visits so far. Can't really say much about Nepali cuisine or its authenticity because I don't really have anything else to compare it...", "Loved loved loved this welcoming Nepalese eatery. Wanted to try it out after reading amazing reviews about this place. \nOrdered Lhasa chow mein and chicken..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.42], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "Mz5UUb4-MMUwsl2Sr34tYQ", "text": ["Delicious! This is my favorite lunch spot. The lamb chili is amazing!! \n\nThe staff is very friendly, and quick to give refills of drinks, pita, and garlic...", "Was looking for something different to eat and found La Marsa.  This turned out to be a great find.  On a monday night this place was packed so we figured...", "I'll start by saying that I love La Marsa and the convenience of ordering via Yelp. Unfortunately, this visit didn't live up to expectations. \n\nWe ordered 3..."], "rating": [5, 4, 3], "TBscore": [0.65, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["lunch"], [], []]}
{"id": "eIKmHdaHzQWZxs1wrXfuLg", "text": ["What a terrific brunch spot.\n\nMy husband and I, along with a friend, dined here about a week ago. We grabbed a late brunch here after deciding the line at...", "So I'm definitely not a vegan or a vegetarian- actually about as far away as you can get; however, Seva had good reviews and I was looking something quick...", "I'm glad my friend picked up this place otherwise would have missed this awesome spot coz I'm a pure Non-vegetarian .\n\nBeen here on Sunday night for dinner..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.57], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["brunch"], [], ["dinner"]]}
{"id": "nVr3cZhZxj_W-QTyISWXqQ", "text": ["After my first visit to Sinbad's yesterday I couldn't understand why other reviewers were giving such low scores. Other Mid Eastern stores that have come...", "Came here by recommendation to find some supplies for something simple (cardamom, clover, and mint tea...good stuff) and I will certainly be back after my...", "I found this little Middle Eastern-style grocery store just by chance after stopping into Great Lakes Sandwich Co. and Cafe, also located in the same strip..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], ["sandwich"]]}
{"id": "j7Ukf82vXmCYImj2smZkWQ", "text": ["\"Positive Food...Positive Life\"...that's the motto of this new organic food 4.0 breakfast and lunch spot on Main St. in the Deuce. \n\nFirst Bite opened just...", "I was in Ann Arbor stopping at the bank on Main Street when I walked by a sign saying they had avocado toast two different ways.  I don't usually order...", "We came in dubious. It had a 5 star rating which is why we were there at all but we defintely had a \"show me\" attitude.  And boy, did they! Wow.\n\nI will..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["breakfast", "lunch"], [], []]}
{"id": "O6no8GwkxmxS_vSmRdsFiA", "text": ["This place is a new favorite. Best potato hash I've ever had. Amazing omelette. Friendliest service (especially if you say it's your first time). I had the...", "Very outstanding place that obviously takes pride in their food and serves high quality meals! They are conscious of nutrition and also add pizazz and oomph...", "Cute brunch spot in the middle of a small strip mall in the suburbs of Ann Arbor! Glad my friends and I came across this place on Yelp on our visit here...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["brunch"]]}
{"id": "rawViXLlIs9aVfEYBDGniQ", "text": ["I come here all the time for lunch. It's usually pretty busy during lunch the lunch hours but the wait is not bad at all. The staff is very friendly and the...", "Is more Tex-Mex than Mexican... so not really Mexican at all, big disappointment and not many food options before 11 (so, even if it's open, not a good idea...", "Very very stingy.  Wrong order, or don't like what you get, they are not nice at all about it.  Want extra chips on your salad?  Yeah, right.  Even though..."], "rating": [4, 1, 1], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["lunch"], ["mexican"], []]}
{"id": "HVEUfy-D6y0ZLDRojg6bGw", "text": ["This is my favorite Mexican restaurant around here. Super authentic and the staff is nice. It's also clean and the food came out very fast! I got the shrimp...", "Good Mexican atmosphere with authentic music and decorations. The staff were super friendly and attentive. The restaurant was well-kept, modern, and clean....", "Live in the area and this is truly the best Mexican food you will find. This is always my first recommendation and everyone raves about it. Nice staff,..."], "rating": [5, 4, 5], "TBscore": [0.38, 0.36, 0.4], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["mexican"], ["mexican"], ["mexican"]]}
{"id": "k2DdCvMagEguUKC761K8aQ", "text": ["Yes you Can-cun! Had a hankering for a visit to our friendly neighbor south of the border but didn't feel like scaling the fence so we went to Cancun...", "Stopped here again after visiting friends in the Lansing area.  It's a beautifully decorated restaurant with brightly painted table, chairs and murals. The...", "I've been going for over 10 years and it's by far the best Mexican restaurant in the area. We start off with the house salsa and queso. I either get the..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.37], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["mexican"]]}
{"id": "TIEHdjnBSVmau6M3xGSGxQ", "text": ["I grew up in mid-Michigan. In 1976, as a high school freshman, my Spanish class went on a field trip for lunch to a dark restaurant in the basement of a...", "There's no place like El Az. We love it so much we went there on our wedding night 22 years ago. \n\nFood is pretty good Mexican. Topopo salad is huge and the...", "Came here with a friend and got chips & salsa brought to us when we sat down. Good salsa, weird, stale-ish chips that are unlike any corn chips I've had...."], "rating": [5, 5, 2], "TBscore": [0.0, 0.34, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["lunch"], ["mexican"], ["corn"]]}
{"id": "-Vpr-HHYfy6t0gXWxeMQ7A", "text": ["Mexican food is great and this place is high quality with great service. We love it! I always enjoy their chimichangas. I have never had an order where...", "Incredible dishes, and the servers are so nice. When I was here I saw no less than TWO people being rude to the staff- seriously people?? Stop! But the...", "This is My Favorite place to eat Mexican Food. Everything is Delicious. From chips and salsa to the yummy cheese sauce. Fajitas are my favorite at Fiesta..."], "rating": [5, 5, 5], "TBscore": [0.46, 0.0, 0.5], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["mexican"], [], ["mexican"]]}
{"id": "pdwrVfxFq1h49RvnXxiKlQ", "text": ["Good food is like a Mexican version of subway would eat here again. Love the smoked Tabasco pepper sauce.", "Walked in today and asked if they did anything special for a birthday. The manager, offered me a free burrito. I explained that I had never tried Chipotle...", "Terrible service and attitude. The manager deserves to be fired. Im not surprised that this chain has food poisoning incidents."], "rating": [4, 5, 1], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["mexican"], [], []]}
{"id": "kbBpQh5YpbCWKS80bhdvlA", "text": ["Los Tres Amigos is a Duffy family favorite. We have lunch or dinner here at least once a month and we have never had a bad experience. Whenever we have...", "Prices up, service down.\n\nThe Mason Los Tres Amigos was a favorite whenever my son was in town.  After our last meal there we aren't so sure anymore.  Much...", "This los tres is not like the other stores we wouldn't return server was rude it was dirty and when we asked for are food to be done like at the other..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["dinner", "lunch"], [], []]}
{"id": "AGKRyctYMa5ZYf0lYwdAVg", "text": ["Staying at a hotel down the street. It may be in a strip mall, but don't let that fool you! It was pretty busy inside. I had great service, my...", "The food was great here but the service was terrible. I don't think the waitress came by once to see if we were okay.  She took our. Order and that was...", "Nice atmosphere and friendly staff. Tacos and steak a bit too spicy. Went here w friends and they said the menu changed. Anyway our order was a bit mixed up..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["tacos", "steak"]]}
{"id": "7i-hbFnrRxzoTtvDo8O6Rg", "text": ["We stopped in for a later lunch and loved the surroundings!  The decor was very attractive and colorful.  Scope of the menu was impressive and service was...", "This establishment is not the best and not the worst. It has an inviting, fun decor that makes you feel like you are in a Mexican-inspired restaurant. It...", "For what it is ... a Mexican restaurant across from a frat house on a busy street on a college campus ... it gets the job done. I remember when this place..."], "rating": [5, 3, 2], "TBscore": [0.64, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["lunch"], [], ["mexican"]]}
{"id": "zIdlFvRQfPefjgGfY22j8w", "text": ["My husband I came here while on vacation and it was awesome. The service was great, food was delicious, and the atmosphere was nice (relaxed but not dead)....", "The service was pretty good here compared to other mexican places in the area. I liked the food, I had an enchilada, taco and tostada. This location is...", "Love this place! Great atmosphere and everytime we come here food is excellent and service is fast! Hands down the best Mexican Restaurant so far!"], "rating": [5, 4, 5], "TBscore": [0.0, 0.28, 0.46], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["mexican"], ["mexican"]]}
{"id": "Vd2Xxf6nQ-ZcnqNEuqww8w", "text": ["Very busy downtown lunch spot. Came in today and ordered a Cobb salad. When it came it was in a bed of greens and had a good portion of vegetables. The only...", "We love Kelly's. It's right downtown, with plenty of parking. The sandwiches are fantastic, both delicious and cheap. Lynne has been our bartender and she...", "With so many great places in downtown Lansing, don't waste your time on this one.  The place was not that busy when we arrived.  We ordered, then the place..."], "rating": [4, 5, 2], "TBscore": [0.28, 0.52, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [["lunch"], ["sandwich"], []]}
{"id": "lW_edjIBVLt5HGrWLTFLzQ", "text": ["Fun place to eat! They have the BEST cheese curds outside of Wisconsin! I had the Irish stew and the Shepherds Pie ($8). They were both decent. The lunch...", "Came here for my grandparents' 60th wedding anniversary dinner. We had made a reservation since there were 20 of us, and they made it seem there was a...", "Had the legendary monte cristo and a pink guava martini overall my food was pretty good and I enjoyed my drink however the service was awful and the..."], "rating": [4, 3, 2], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["lunch"], ["dinner"], []]}
{"id": "1HPV8BThYqud2S3z44tepg", "text": ["I'll keep this short and sweet- after leaving Relli's because no one acknowledged us after waiting for lunch- we opted for Mancino's and we're so glad we...", "Great pizza, grinders and even salad! But what really sets this little chain apart if the local ownership and employees they hire.  Great bunch of people....", "We are frequently searching for a pizza better than Mancino's in DeWitt. There are very few. The secret is in the sauce, and Mancino's has it in spades for..."], "rating": [5, 5, 5], "TBscore": [0.28, 0.36, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], ["pizza"], ["pizza"]]}
{"id": "ZqfrgwICvUlynE0sOru1GQ", "text": ["what can i say! this is a cute, quaint cake shop! They have various flavors such as salted caramel, passion fruit frosting and carrot cake.  The sour cream...", "Such an adorable cake shop, though you'd never know it from the outside. It isn't much too look at from the parking lot but they've done a beautiful job...", "Not a sit down bakery, geared towards events. Very nice, standard bakery. Could use a bit more lighting. Not much of a selection for cupcakes but very cool..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.31, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["cake"], ["cake"], []]}
{"id": "jIQvIkJWRgpGLaNJ7_AMVA", "text": ["It won all those pie awards for a reason!\nWe drove out of our way home from lansing to stop here and it was ll worth it.  It's sort of a rushed, chaotic...", "Stopped by after seeing this place on Under the Radar Michigan. Took a pie home, haven't tried it yet. Good homemade turkey soup and Cobb salad.", "Only reason I won't give them a five rating is because they are closed in Sunday's.... and because many of their lies you have to order them in advance :(..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.7, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["turkey"], []]}
{"id": "aB7fZcNdVBWq_G7F51bmUg", "text": ["Honestly, the best ice cream in the area. Their flurries are delicious and very reasonably priced. They even have doggy treats! I also like the convenience...", "My boyfriend and I are loves of Dairy Queen's blizzards until we had Dairy Dan! Lucky for us we stopped at DQ to order blizzards with snickers. They told us...", "Love love love this place! I mean can you go wrong with a small personally owned ice cream place that has a drive-thru?-!?!? I got the cheesecake flurry and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "zqHhd0DtDvK3rRl8TN9b_w", "text": ["Great cookies but the milk is way overpriced. Shouldn't be $3.30 for a small bottle of milk.", "Yummy special treat. They have window seating with high stools only. But you can window watch people. There's a public bathroom. So good when you go in....", "Place stiffed is only giving us 15 when we ordered 18. Customer service was unapologetic and crass. Would not go back again."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "MuoNljobLBR-ZMKJdBIecw", "text": ["Not really impressed. The perky turkey was anything but. It was essentially turkey lunchmeat grilled on flatbread with a LOT of salad piled upon it. My...", "Good Bbq not great Bbq. The Cuban sandwich however is one of the best concoctions I've ever had close to my body. I'm gonna go out on a limb and say the...", "This place was good. The food was good and the service fast and friendly. There wasn't anything that jumped out though. I had the pulled pork flatbread..."], "rating": [1, 4, 3], "TBscore": [-0.25, 0.43, 0.0], "normalisedRating": [-0.6, 0.6, 0.2], "keywords": [["turkey"], ["sandwich"], []]}
{"id": "y5ToGQgiNyd8GPOaHDcnNQ", "text": ["This is the best BBQ I've had in a long while.\nBetween 2 people I tried the pork ribs, the beef brisket and the pulled pork.  As sides, I tried the pork...", "OK, where do we start?\n\nOh, yeah, beef rib bbq and bell's on tap!\nPromising start.  $22 for a beef rib, small scoop\nof cornbread/jalapeno plus home-made...", "Saddleback simply gets five stars because it's the best in the area. Finding legit bbq in the middle of Michigan (or anywhere in Michigan) is tough...."], "rating": [5, 5, 5], "TBscore": [0.47, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["beef"], ["beef"], []]}
{"id": "TFpGITaO7ZvOJDCNUkfs-Q", "text": ["We were in the mood for some BBQ, but didn't have a lot of time to stop and eat. Backyard BarBQ helped scratch that BBQ itch while filling our bellies and...", "No flavor at all and very poor service. Took forever to get my food and the bread was very soggy and cold. Employees were very unfriendly.", "Found this place while we were in town for a wedding. The pulled pork sandwich is on a flatbread and it is amazing! The mac n cheese was perfect. The perky..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.88], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], ["sandwich"]]}
{"id": "BUiVl6QDRGGiHyZmI5ZOmQ", "text": ["I do not understand that most of the reviews are negative, I find the food really good and anabundance of choices. I eat there 6 days a week most weeks. Do...", "OK, I have been coming to Lansing to visit my wife's family on several occasions recently... we have heard many negative things about this golden corral...", "Breakfast is over cooked and if you like frozen milk then go hear. The only fun part was listening to the servers talk about the fight one of them got into..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], ["breakfast"]]}
{"id": "Re5TiorrSo1nkJcJFcmhqA", "text": ["It's never a dull moment in chuckies house. Games,prizes and the pizza has improved. It used to be 4 tokens for a dollar now it's five. Giving kids aliitle...", "If I could give this place negative stars I would. Disgusting filthy with THE worst employees on the face of the planet. Of you can avoid this place AT ALL...", "The food was good, we were the first at 1130 AM, and the only ones in there. There is cleaning needed in the main play areas. Pop and general filth. The..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [["pizza"], [], []]}
{"id": "0K6iZh1XBGZoyfD3v6Wcyw", "text": ["Very friend man served me and gave me samples of whatever I wanted to try.  \nThe chicken shawarma was moist tender and delicious. Good price and food choice...", "Not sure what has happened to this place but I just threw my to go dinner in the trash. The tabouli was warm and smelled bad. The chicken shawarma was not...", "He will try to push the chicken shwarma, and it's good, but go for the kafta instead, it takes 10mins to cook but the flavor is fantastic and well worth the..."], "rating": [5, 1, 5], "TBscore": [0.33, -0.24, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chicken"], ["chicken", "dinner"], ["chicken"]]}
{"id": "qupveeWUxEyWYDs_DOQDmw", "text": ["This Wendy's location in Grand Ledge is the slowest I've ever seen.  Be prepared to wait 10 minutes or more if there are\n just a couple cars in front of you.", "This Wendy's is always fast. Really fast. And they are clean. It's easy to get in and out of and they serve quickly which is really what is important.  It's...", "Standard. Plus a star for fresh fries. Plus another star for the smile at the window. I definitely disagree w the other review."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "45QFFWZ5CjywfP1ujekNrQ", "text": ["My wife and I (and several of our friends) have always enjoyed eating at this Wendy's. The food was good and the staff was very friendly.\n\nIn the past year...", "SLOW !!!! Every time I'm here I'm waiting in a line and it's not because Wendy's food is suddenly attracting the masses. \n\nThe food is just typical fast...", "Wendy's in Mason has a cleanliness problem. I'm here on a Saturday around 1 pm. The floor is filthy. There are at least 4 flies battling it out for king of..."], "rating": [1, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "P_XjOYxzTcrOaYgnW5G8vQ", "text": ["Slowest. Fast food restaurant. Ever. I don't understand why it takes them so long to make food every single time I'm there.", "I LOVE Wendy's!! But this one is SO SLOW :( I was in the drive thru for 12 minutes.. I'm assuming they're short handed, but it happens every single time I...", "This Wendy's has the slowest service through their drive thru imaginable. Just waited 25 minutes with 4 cars in front of me for a meal. \n\nFood is hit or..."], "rating": [1, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "HtkIcN66Lws79hsGl9hjlA", "text": ["On a road trip for my daughter's swim team and found a cool corner in the town of DeWitt housing a brewery in an old church.  Amen!\n\nSaw a great assortment...", "I had high hopes and expectations for this brewery.   \n\nThere was a pretty good selection of beers on tap.  I tried four of them during my visit. All of...", "Went here for the first time for dinner and trivia night. They serve great beer and cider. I had their amber, which seemed more like a brown ale that wasn't..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.52], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], ["dinner"]]}
{"id": "XuT3WMhA5Xp3X0bcXq_zpA", "text": ["The root beer is always good. Service was okay but slow. Coney dog was the worst I've had. It tastes like hamburger mixes with ketchup or tomato sauce. I...", "Well, we came thru the drive thru as we passed the town and got two coney dogs. One with onions and one with out.\nThe dogs were not that warm and their...", "Typically A&W has offered  the best Coney dogs I've had anywhere. Yesterday I visited the Mason, Mi A&W where I ordered a couple coneys. Not all A&Ws are..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [["hamburger"], [], []]}
{"id": "IGbGE0tOjAfB3qeYSo-hEA", "text": ["This isn't the fastest, friendliest, or anything-est place in town. But I like the cheesecake & a decent steak at a decent price. Staff is hit or miss- had...", "Don't waste your time this place is a shit hole horrible service the chef sucks the manager is a young boy", "Ordered curbside to go. My order was ready & brought out immediately. I ordered the 6 ounce sirloin with a wedge salad & loaded baked potato. My daughter..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [["steak"], [], []]}
