{"id": "cWexh1bexD3mQSBx5ovlMw", "text": ["Wasn't impressed. My Reuben was super soggy straight from the carton, although it was huge and packed with meat. I liked that they had a drive through....", "I love McAlister's! It would get a 5 star, but for some unfortunate, unknown reason, this location does not do punch cards like all the other locations I...", "The manager at this McAlister's was extremely rude to my friends and I when we walked in. We wanted to order lunch for our group (granted there were about..."], "rating": [3, 4, 1], "TBscore": [0.0, 0.0, -0.3], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "T5Mrp1ByRCjOE7M9DKW9cg", "text": ["As a frequent late-night diner, I have found myself at this jimmy Johns dozens of times. Talk about freaky fast! These sandwiches are always made to...", "I ordered lunch to be delivered between 11:30-11:45 because that would be the break time from the class I'm in.  The driver was calling my cell at 11:07 and...", "The location is great. However the people in this location don't seem happy to be there. We all have bad days but geez. Basically take your sandwich and go..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.3], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["sandwich"], ["lunch"], ["sandwich"]]}
{"id": "zsN0JE9noXH3TOuEvzu11Q", "text": ["I stopped here on Fourth of July after a round of golf.  Its basically a subway with less options.  It feels the same and arguably looks the same as a...", "Very friendly staff who asks how your day is going. Had to wait a while in line, but it was over the lunch hour. I got a sub that was very tasty, very...", "Good meats, cheeses that taste like cheese.  In my opinion a much better sandwich than Subway.  My kid likes the kids meal pasta dish too.  Good chain and..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.3, 0.63], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], ["lunch"], ["pasta", "sandwich"]]}
{"id": "vf3eWFQpN7qLitDQx0VxKQ", "text": ["Walked in at 2:00am and asked for an easy order with a couple modifications. After repeating it 3 times, they then double checked with me twice while making...", "I had my sub delivered to the Holiday Inn. It took less than 8 minutes to get here including my order. Great job and service, sandwhich was perfect.", "friendly staff, but the sandwiches barely have enough meat on them. 75% lettuce."], "rating": [2, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 0.2], "keywords": [[], [], ["sandwich"]]}
{"id": "LE_xvd1YIumNGfZ_qdyIdw", "text": ["They forgot my jalapeño on my sandwich. So you get one star. Thank you! It took over the expected time, and then the driver smelled like he was smoking some...", "I order from here pretty frequently and have had no complaints for the last 4 years. They've even had a delivery waiting for me when I was on my way home...", "This store wouldn't deliver 1.5 miles away because it was in one of their other store's zones. The other store, whose \"zone I was in\" was closed. This store..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [["sandwich"], [], []]}
{"id": "Kgh6n6LZ08zKHg-9fUHYUQ", "text": ["Ice cream with REAL ingredients at a very reasonable price. Love supporting this place verses always going to chain places! The strawberry banana shakes are...", "Had meals and shakes for less than $10 apiece. Simple meals but clean food. Will make a regular habit after baseball when I am too hot to cook. Shakes were...", "I'm not even much of and ice cream person but the ice cream here is amazing. We were visiting Nebraska and we went everyday we were there. Awesome food and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "W3ItmLZCaDjt1LCRAKGLdg", "text": ["I was extremely excited to see a Goodcents open in our neighborhood however, since ordering over half a dozen times, all of my experiences have been very...", "Their automated order menu is the biggest pain! If you don't get close enough, you have to hang out of your window and push buttons until your arm gets...", "I was glad to see the building go up! I had been ordering from Mr Goodcents from another location. Have tried new location many times, in hopes of a good..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "6L8krZeWPBarEZrCRnr9OA", "text": ["Terrible food. Chicken bites were expensive. I took one bite and knew its been sitting around all day. Tasted freezer burned. Very few options for sauces....", "Something seriously wrong with Amigos in Lincoln. Absolutely cannot get a hot, quality product. There is one that is consistently good. 27th and Capital...", "Teen staff having petty argument in the kitchen rather loudly and the manager dealing poorly with a customer that got shorted with his drive-thru order have..."], "rating": [1, 1, 2], "TBscore": [-0.59, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [["chicken"], [], []]}
{"id": "KZC7B-Xg8yDSVq8OYQhUqg", "text": ["I don't really like to eat  out or fast food because the salt and fat but when you are traveling your options are limited.\nMy spouse went to Burger King for...", "This high rating is due to the fact that I enjoy Burger King, but this establishment sucks.\nThey have screwed up my order more times than they've gotten it...", "THE CONS: If you like cold soggy fries, nuked burgers and chicken sandwiches that taste like cardboard, this is your place to go!\n\nAnd don't even get me..."], "rating": [3, 2, 2], "TBscore": [0.0, 0.0, -0.68], "normalisedRating": [0.2, -0.2, -0.2], "keywords": [["burger"], ["burger"], ["chicken", "sandwich", "burger"]]}
{"id": "wVCgPhjOTjy1HkeZBzEUYg", "text": ["I now know why they call this place Runzas.....it is because it runs right through you.  Think of a runza as a hoagie length White Castle.  You get the same...", "Honestly, this was the worst Runza I've ever been to. I stopped by with a co-worker and when I got back to work, the fries were so greasy that it was...", "Small location, drive through and sit down. The original Rina was excellent and I also ordered the spicy hamburger, had heard that hamburger is good here...."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [[], [], ["hamburger"]]}
{"id": "tXggxygrFqd2E5Qws3wTXw", "text": ["Omg. Serious. Go here. \nThis place was incredible. The beers were phenomenal. We fell in love with the Apricot Blonde, Cinnamon Toast, and the Elderberry...", "We came here after a Huskers game and really enjoyed our time/beer and food here.\n\nDespite the craziness of downtown Lincoln after a game, we managed to...", "This establishment offers a wide variety of beverages and such a cool environment.  Was in town for a wedding and had to get some drinks beforehand, so we..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "U6zxy8yTFivF3vFPGDVD4g", "text": ["First time here.  Going to a movie and didn't want anything too much.  This seemed like a good spot to try.\n\nCurrently waiting on our food.   Pepperoni...", "Waited 30 minutes for 3 orders. 1 Pretzel bite, 1 Pepperoni bite, 1 mini pretzel dog. We were never offered an explanation, or an apology for the wait. The...", "Union my girl arrival at pretzel maker I was excited to try their pretzels. I ordered a regular pretzel bite and a mango smoothie. I though that they tasted..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "0VJIfw-EWA5XT1Y3Ur9Y4w", "text": ["I was highly impressed with phone service I got today. They were kick ass and I am so excited to eat my food. The end.", "I went here 9-15-2018. Sign is still on 24th Street, but the store is closed. Parts of the stove are laying out front. No one home.", "I would give 0 stars if I could. There are currently 7 people here and I have been waiting nearly an hour to get our food. Yet I still come back with the..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "EzO5LcNWO5MaHoBpqY1aOQ", "text": ["Very nice outdoor venue to watch the Nebraska football games or catch a band or dj at night.  Free to attend. Lots of picnic tables and drinks.  Can get...", "As an outdoor space with a big screen with access to decent beer/food selections, it's pretty good. Overall, though, I think your experience at The Railyard...", "The Railyard is comprised of a two story squarish building with a hollow center. This center courtyard can hold events such as concerts, big screen movies,..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "lISo3ouP0DO9jkYhuZXu1w", "text": ["Towels and free wifi !  This is only the third one of these AFs with both.  Yes !   Nice size.  Equipment in good shape. Descent showers too.", "This is an unprofessional gym. The weights do not match and vary in sizes. It is difficult at times to find matching weights for bench / squat and weights...", "NEARLY IMPOSSIBLE TO CANCEL.  I had been a member for 2.5 years in college and went in one day to cancel my membership.  The owner was there and made the..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "nkMOO0Dz8JqB16bCUAfiiA", "text": ["We were in Lincoln for a swim meet and needed to grab lunch somewhere close.  We saw this place and decided to give it a shot.  Noticed an outdoor patio...", "I am allergic to onions so I requested no Onion's and for my bun to be grilled... I wish they would be honest and tell you that they can't accommodate your...", "I am not sure why this place has such low stars. It is a very decent place for lunch with great service!"], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [["lunch"], [], ["lunch"]]}
{"id": "zA1VWGzyG10fiNJNNb9Ldw", "text": ["If you like cold food,\nyou will like Tanner's chicken. \nBut they are tasty.\n\nIt was neat to see \n1990s furniture.\nGolden oak tables. \n\nHaiku review.", "We are moving to a home near Tanners and decided to eat there tonight. My wife ordered the Asian chicken salad which turned out to be pretty good. \n\nI...", "It's you typical sports bar. They have a variety of foods to sample. It's mostly what you would expect. I have been several times and the service is really..."], "rating": [3, 2, 2], "TBscore": [-0.3, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.2], "keywords": [["chicken"], ["chicken"], ["bar"]]}
{"id": "tVYj_vmZO916gzBAKUEbqQ", "text": ["The manager that works here is amazing!\n\n\nThe runzas have gotten smaller and smaller over the years but that is what you would expect from a company that is...", "Kinda the staple in nebraska lincoln there everywhere great for that cold winter day or drunklny craving for one. The fries are good here crispy low salt...", "I needed to try this--a Nebraska classic--for my first time. Sadly, I was disappointed. I paid $6.65 for an original runza and a large order of frings..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "fqKwqy7bGIfBYgQ1jJpdZg", "text": ["Cold cheese slices makes for a bad runza. I asked an employee about it and he said that's how they're made. The fries and onion rings were good.", "So I have been eating beans and rice a lot lately, and shooting little critters outside of town and eating those too. Money is so hard to come by sometimes....", "Great sandwich! I had cheddar cheese added to mine. My husband tried a sandwich with Swiss cheese and mushrooms."], "rating": [1, 2, 4], "TBscore": [0.0, 0.0, 1.0], "normalisedRating": [-0.6, -0.2, 0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "Ns6y-Q-H1g_ORoypArkOBg", "text": ["This location in particular has steadily been going downhill. They've reduced the size by half on their onion ring dip and still charge the old price....", "Ask any displaced Nebraskan what they miss most about their home state & the name Runza is almost always sure to be high on their list. \n\nIt is simply a...", "Runza is a must when I come home to visit. This is the location I always seem to end up at."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "qzY4RUopevZ_eMbooi5vIg", "text": ["Well everyone from Nebraska, seems to love this place I didn't really get it the first time , so I tried again and I wasn't impressed at all the bacon on my...", "Wet breaded ground beef and cabbage ... I've never gotten this even when I did live here.", "Awesome! A Runza's is perfect cold weather food. And really great after a few beers too. A Nebraska institution. Thank you! And the fries with Ranch, yum."], "rating": [2, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 1.0], "keywords": [[], ["beef"], []]}
{"id": "Zq6GVNVaVctzJ0TD_j09Vg", "text": ["No matter how far and wide you search, there is no better Mediterranean food anywhere on the planet. Except of course, the Sultan's downtown location. The...", "A focused menu of Mediterranean favorites, Sultan's Kite is a great place to go if you're in the mood for Shwarma, Gyros, or Falafel. They also serve...", "The place is plain Jane inside but don't let that fool you. You great great food at a great price. \nWe go here often and enjoy it every time."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "OuVj5SjpIf7WX2TIQOcSyw", "text": ["I love this place because it is wonderful for portion control and the people who work there are incredibly knowledgeable and so much fun!", "I try to pack a healthy lunch as often as possible for health reasons and to cut down on costs.  However, I could see myself stopping in to Eat Fit Go for...", "Easy and convenient way to eat healthy! They have delicious, fresh and nutritious food. The staff is very knowledgeable and helpful as well :) try eat fit go!"], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["lunch"], []]}
{"id": "cp3-CLEBbcF2oIkmo84Hhw", "text": ["Wow this place gives Sultan's Kite a stiff competition. But I only speak of their falafel because I like vegetarian. But dear God is it goooooood. The...", "Place was clean, but didn't enjoy the food. Everything was dry and the meat was tough. Kind of sad because this is right around the corner from our house....", "Shawarma and Kabob were both delicious. Hummus was creamy. Service was prompt and professional. The decor leftover from the place previously being western..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "05yiuXToIA4HDVRZvobDZA", "text": ["Fallbrook, Super Saver Deli - Of special note in the Deli is the recent addition of 'Sushi with Gusto!' The head sushi preparer Mung (pronounced Moon), is a...", "My review is primarily in regards to the meat department. A few years ago it was always well stocked with meats ready for the smoker. Bins of tri tips,...", "Wow. Never been to one of these. Prices are great, awesome and wonderful. Brand name foods.  \n\nAlso got their ready made chicken... For an inexpensive..."], "rating": [5, 2, 5], "TBscore": [0.23, 0.0, 0.42], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["sushi", "deli"], [], ["chicken"]]}
{"id": "chYKB0gfr9vT0BgssrTTTw", "text": ["I shouldn't go to a place where I'm about to spend my money and get nothing but attitude. I won't be going back this this location at all.", "After getting home, I looked at the bag of chips that came with my meal and noticed it expired over 1 year ago.", "Awesome for a subway. The staff is always polite and friendly. The food is as fresh as can be expected from subway. The ice cream is delicious and the..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "08-wApgrlCAa79tFmU67Ag", "text": ["I really like eating at this particular Subway.  The staff is always cheerful, courteous and patient.  They take the time to let you decide what you want...", "Best Subway in town. Yes it's a franchise chain so it's NOT a deli. And I see mustard. Right there. Behind the glass...it's oddly marked..mustard.", "I don't know what kind of a sandwich shop would not have mustard, but this one does not.  If you want regular yellow mustard, go across the street to good..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.32], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], ["deli"], ["sandwich"]]}
{"id": "rT57PiJbl3TlG67DmVGUXA", "text": ["Open in a new location just off of 84th and Holdrige street. \n\nToday had the, as expected first day open waiting line.  Fifteen minutes later, we had a 16\"...", "Do not even attempt to eat here if you're vegetarian. They will NOT clean off the slicer for you. I won't go back.", "Adding to the the poor and dysfunctional drive service. \nDon't know if it's the communication from the kiosk order or lack of interest, but no..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "OiACEYq_G6QhY-nz6AU58w", "text": ["Stopped here on our road trip east. Easy to find right off the freeway exit. Lots of parking and very clean inside. There are single bathrooms for male and...", "If I could give this location a zero, I would. First, I order an Italian on wheat, they're out of wheat, so I chose a different bread. Then, my boyfriend,...", "Really clean, friendly staff, hot bread, fresh veggie. I been to a lot of Subway, and i know that the quality and services differ from place to place. But i..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["italian"], []]}
{"id": "Lha2Ha2ypTgZ8xMO_tk_qw", "text": ["Even tho I went to UNL for 3 years of college, I ever ate there once. I've now been 3 times.\n\nI like how the flavors change and that they also sell cheese,...", "Great selection of homemade ice cream. The flavor of the day was shark week I think and was interesting but really good. I love ice cream myself and if...", "A good variety within the 16 daily flavors at this wonderful campus creamery. My husband got the Butterscotch frost (vanilla minty chips added the coolness)..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "tqjQU0EygFF_yaogwoM0wA", "text": ["Last week was my parents 59th wedding anniversary. I knew they would be going to Granite City for a little celebratory lunch and decided to treat them as I...", "The staff at this location was extremely friendly and accommodating of our group.  The waitress was quick with our beverages and very helpful in her picks...", "I was looking for a lunch meeting spot and saw Granite City near the Gateway Mall. Parking was ample during the later morning and I was greeted promptly and..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["lunch"], [], ["lunch"]]}
{"id": "dhkN86zfWuBZaGx4PBK_qw", "text": ["Slow drive through but one of the best blizzards I've had in a long time. By \"best\" I mean the most loaded with gigantic chunks of my selected ingredient...", "Took forever to get our order cause your employees were messing around with each other while making the order so not impressed with their service tonight....", "Do not go to this place if you have an allergy requirement.  We decided to do an ice cream cake this year for our kids combined birthday party.  Asked them..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["cake"]]}
{"id": "MByRaWa_mf1IRjB8n2UezA", "text": ["I wish I could give zero stars. Hey say they are open everyday until 11pm but here we are at 10:18 and they are closed. I drove half way across Lincoln to...", "Blizzard and food was amazing but the service was horrible. My grandmother asked what drinks they served and the lady said Coke products, my grandma asked...", "Employees lounging in the best seats in the dining area while all tables dirty.  Burger had an enormous amount of mustard.  No greeting by anyone.  Terrible..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], ["burger"]]}
{"id": "7ehYq6dC7iURBv3Uq2q9ZQ", "text": ["I have been several times and had a good experience bit find it a tad overpriced. I'd go more often if it was a few dollars less per item!", "Oh yes Rita's is indeed as good as it gets!!  I drove all the way from Omaha to get my greedy self some Rita's.  I was soo excited they were in NE.  You...", "Tried the Juicy Pear Italian Ice last night - delicious! Super refreshing and just what I needed to cool off on a hot Nebraska summer day. Staff was..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["italian"]]}
{"id": "XuIBHMePRf18-2LzzG3O-g", "text": ["A new outpost in Lincoln for fried dough. Welcome to Lincoln, I've missed you since moving away from civilization. \n\nNeedless to say, I've never met a...", "I love Krispy Kreme donuts and have had them in the south and Chicago.  Service, quality and sampling have all been consistent, except for Lincoln....", "Recently had my frost Krispy Kreme. I would say the highlight of the visit was actually the ice coffee. The glazed donuts we ordered were cold like had been..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["donut"], ["donut"]]}
{"id": "iNRtRa3FRSDNm0L0hMXauw", "text": ["Great Villain Chi Late and great Donuts! Love the staff all of them are super sweet and they keep a very clean location.", "We often visit DD because our little one loves their double chocolate donuts, last night we went to KOHLs and when we were coming back LO decided that she...", "Why do people rave about this place? I ordered breakfast, egg, sausage, cheese croissant, hash browns, and a coffee. Coffee was fine, it was coffee.  There..."], "rating": [5, 5, 1], "TBscore": [0.45, 0.0, 0.42], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["donut"], ["donut"], ["breakfast", "egg"]]}
{"id": "iYG4izTVKbcU8xbbOZMp1Q", "text": ["My favorite cold brew coffee!  ... but extremely disappointed in all the new staff changes, my order hasn't been right the last 4 visits... and on top of...", "The wrap was good. It was cold in the middle and rather than warming it for me, they replaced it. That was nice. They replaced it with a flatbread, though,...", "They have yet to actually get my order right. \n\nAll...tried to call to order donuts...no answer...EVER!\nYet every time I'd drive by I'd see plenty of..."], "rating": [3, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "htOwhUB42JcZb1re_HHSBg", "text": ["20 minute wait for 3 hard shell tacos.  2 other tables waiting for food and three tables with their food when I sat down. Drive thru had 2 cars go thru...", "If you never been, I will help you out. Some must try items are: crisp meat burrito, yankee burrito (if they still have them) or a cheese frenchee. You will...", "Was in the mood for tacos last night, but lost that craving REALLY quick while waiting for our food to be prepared at the drive-thru window.\nObserved an..."], "rating": [1, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [["tacos"], [], ["tacos"]]}
{"id": "OcaZiel-25gysQokse2zew", "text": ["The ONLY place to get fresh seafood around here!  I crave the salmon and crab cake for days between purchases, and have been spoiled past purchasing shrimp...", "Yesterday I stopped at Surf and Turf to pick up a couple filets of Turbot. I have eaten this fish a couple times but never prepared it myself. Once again...", "Surf & Turf Food Company is the real deal! I bought a Cod Fillet that turned out to be the best fresh seafood I have found in landlocked Nebraska. It was so..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], [], []]}
{"id": "S-3DwBBaeGPDGLb27RQPqg", "text": ["We came here because we had some time to kill before getting ready for a wedding.  The atmosphere in the area, and inside the restaurant is amazing.  We...", "Pretty good food and service.\nMost meals and apps delivered timely and the right temps.\n\nWe dined in the fireplace room and it is a loud dining room in our...", "Excellent service!  The barkeep was helpful on beer selection and made sure I had everything I needed. Wasn't just me as he treated everyone that way. Food..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "n_d1hONHFaZ0mdrtRwb8sg", "text": ["I'm a big fan of this pizza, and having worked in the food industry for about 5 years, I understand closing early if the restaurant isn't getting business,...", "Well I wish I could review the pizza but I never received it. Sooo disappointed and frankly if they can't handle a busy night, they should just close and...", "Tried to order but they said order was out of delivery range yet I've ordered here multiple times and they've delivered to my address...said order range was..."], "rating": [4, 1, 2], "TBscore": [0.0, -0.33, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["pizza"], ["pizza"], []]}
{"id": "6bhCmV4xj61J1mhmpJt8Pw", "text": ["We got into the hotel late and to be honest I would probably give this place a 2.5.  The pizza we ordered was half cheese and half pepperoni onion and it...", "This is really a standout Lincoln Business. The cream cheese flavoring is one of a kind, and they are always attentive and courteous when you dine in. Tons...", "Old-school, classic Pizza Hut converted to more of a bar/grill.  Pizza was great - wasn't sure if I'd dig the cream cheese (seems that may be their or a NE..."], "rating": [2, 5, 4], "TBscore": [0.0, 0.0, 0.49], "normalisedRating": [-0.2, 1.0, 0.6], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "pvR3yY1b_5wk0stIpuUMjA", "text": ["Fresh ingredients,quick delivery, and great online deals. When stuck at home with school work papa johns is a great go to. If you login and save your orders...", "I haven't been to Papa John's for a while, and when I ordered from there I was a bit nervous. However, I'm happy to say that they are the only one that has...", "Papa John's has gone downhill.  It is See to be much better than our last two experiences would suggest.  Our previous order did not have the toppings that..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "Z-f41x6MKSVVufIg7D4pjQ", "text": ["Recently built location. \n\nI used the online app to order my pizza. That process went well. Unfortunately there is not a choice for pickup in 15 minutes....", "I can only hope this 2nd time ordering pizza will be correct. We ordered online, how can you get it wrong? We paid in full and picked up exactly when we...", "Great pizza, fast friendly service. They listened to all of our requests and did a great job. Will continue to revisit."], "rating": [4, 2, 5], "TBscore": [-0.25, 0.0, 0.54], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "qDtcB72TB1xAVVIQc3gmgw", "text": ["It's pizza, and that's about all you can say. What happened to the iconic pizza restaurant? Crust is simply terrible and the sauce is sweet. Definitely not...", "After reading the only two prior reviews I really needed to post mine! It's a Nebraska football game-4th quarter and ordered our pizza. When we order any...", "One of the worst experiences, I have had! I ordered a pizza for the first time for pick up. When I got there, things seemed kind of crazy, but I picked up..."], "rating": [2, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "PTKrJvHb5UKW-ztvIEJs3A", "text": ["Great pizza and awesome service. I had a medium sausage and banana peppers pizza delivered to the airport. It was quick and quality.", "This is as consistent as it gets! I always order PJ's in Lincoln and they never fail. Great food and VERY inexpensive! Keep up the good work guys! Thanks!", "Consistently late on their delivery times. I called to see what was wrong when they were 30 minutes past the eta and they hung up on me after saying the..."], "rating": [5, 5, 1], "TBscore": [0.71, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["pizza"], [], []]}
{"id": "BnE-J-WzQfzkuOjYI5AdWQ", "text": ["We ordered the meatie with parmesan and butter crust.  It is one of the best pizzas I've had!  Will definitely order again.", "Raymono's is a pretty good place to get a pizza. The weekday, large specialty pizza for $10 are a super deal. \n\nA \"buffet\" is offered on the weekends, but...", "For a small village, we are very lucky to have this gem of a pizza place here. The pizza is fresh, fast, and hot. There are many specialty pizzas to choose..."], "rating": [5, 5, 4], "TBscore": [0.5, 0.37, 0.24], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "eTZkwG4iy5-cKwlAJRIGgQ", "text": ["I love Big Mama's Kitchen! I wish I could eat breakfast here everyday. All the food is good but I love the banana bread French toast. The restaurant is in...", "Oh my gosh!  When the food brings tears to your eyes because it reminds you of your Grandma's cooking, you know you're in the right place.  The oven fried...", "Why did it take me so long to eat at Big Mama's? I guarantee it won't take me near as long to come back. I had the fried catfish and I can't even describe..."], "rating": [5, 5, 5], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["breakfast"], [], []]}
{"id": "O8nFLXji_AKarKgN6mX0hg", "text": ["We searched for a Starbucks and found this great Coffee Shop!  Coffee flavor is spot on!  We ordered a Mocha and a Cafe Americano.  Served surprisingly...", "Best coffee west of California that we've found! Spread the word. We are from Santa Cruz, CA and they use Cat & Cloud beans from our home town! The gas...", "This is the best coffee ever!!! \nTry mocha latte with oat milk, hot or cold... the best!!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "yZovdlxBTfeoNdvqNc2IyA", "text": ["What an adorable bookstore. The staff was really friendly. The coffee shop within the bookstore looked lovely, and the woman behind the counter there was...", "I've always loved this place and keep finding more and more reasons why. First, the location. The old rickety wood floors, the wood paneled walls, the smell...", "We love story and craft time. It's a great time for mom to grab a latte and relax while the kiddo has fun with stories and crafts. Afterwards we go to the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "QYqK7u5PVA6kOZDiaIRQCg", "text": ["Beth and myself here now for after dinner drinks and apple pie. Unusual apple pie, made from fresh slice apples and not from canned filling yuk stuff. Just...", "After being closed for a couple months this winter due to a tax issue, Meadowlark is open again under new ownership. According to the Lincoln Journal Star,...", "When you can get good coffee early in the morning it can make you smile. Meadowlark was open we were served promptly fact is who are the only ones in when..."], "rating": [4, 5, 4], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["dinner"], [], []]}
{"id": "dHE4ueB4aVt_bTmAjTcpLA", "text": ["I have not been here prior or even known of. Some special chocolate housemade candies here also which are most excellent. Expensive however. Most wonderful...", "Popped in right before close, so I didn't get a chance to sit and enjoy my cappuccino or peruse the pastries. This location is where they moved the roasting...", "So,  I may be a little biased, BUT Randolph is my favorite location of the three Cultiva's. Since Cultiva Labs is the roasting facility I really enjoy the..."], "rating": [2, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "FqzZfwqC5cg3l23D6wI32Q", "text": ["We waited for 10 minutes on coffee and saw the workers sitting down in the back. Then when the workers got out they were all crabby and not very welcoming....", "I'm always amazed at people who struggle with requests for limited amounts of ice in a cold latte. Even more when they then have to be told to fill it up...", "Scooter's is a simply amazing, locally owned and operated coffeehouse who usually competes well with national/larger tea and coffeehouses. Service at this..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "jQFppZIC-RqP3y1m04xWRg", "text": ["Never have enough staff-5 min wait for service and you are the only one in line. Ordered a white choc mocha-tasted like soap-could not drink. Nice location...", "Trying hard at proving why the systematic approach Starbucks takes to production and customer service works well. \n\nStaff does a great job of fulfilling the...", "I stop at this location quite frequently before heading into work and appreciate the convenience of the location for when I want a nice, sugary coffee fix..."], "rating": [1, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "tVn-ysMPyvB49uwYXi_K4Q", "text": ["I grabbed a drink here this afternoon.  And you know what, it's a Starbucks.  If you like them, then you're in luck.  If not, I'm sure there are other...", "Always a big fan of Starbucks, always consistent and always tasty.  A little annoyed I had to get a code for the bathroom, seems a little silly.", "This location can get very busy at times, but the baristas are friendly and effective, so the wait won't ever be too long. It features a decent sized dining..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "Iyl-XpwnaNw6bnXBGAE1bw", "text": ["Stopped in for lunch today with a friend.  It's Tuesday, it must be taco Tuesday. \n\nThis place is clean, neat and tidy. The staff was friendly and after...", "Wish we had Taco Johns in KC. Step up from TB and a lot more flavor. Love the sauce bar with sliced jalapeños. My wife tried the carnitas breakfast taco...", "Overpriced, bland, and disgusting. Similar to all of the better-than-taco-bell places (del taco, taco bueno, taco casa, etc.), except it's actually WORSE..."], "rating": [5, 4, 1], "TBscore": [0.45, 0.5, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["lunch"], ["breakfast", "bar"], []]}
{"id": "qTw8ly_pLED-SPMmsnv-dw", "text": ["Ohhhhh Yesss a Taco John's!!!! LOVE this chain. Always a 5 star---Always expect awesome, hot, fresh tacos here. So goood. I always add peco in my salsa....", "I love Taco John's, but this location just can't get it right! I'm a frequent customer because of the proximity to my house, but they can never get my order...", "This was a terrible Taco Johns experience.  Drive thru attendant was rude and interrupted every time I talked.  Food was not what I ordered and was cold and..."], "rating": [5, 1, 1], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["tacos"], [], []]}
{"id": "uorVtzYkFh8b2PdZahZ7PA", "text": ["Gave 4 stars because they were out of a highly marketed item (nacho fries). Can't really go wrong with a taco surpreme ever here. The cashier was named...", "One of the most efficient and tasty Taco Bell experiences we've had. Friendly, entertaining service. Big servings. Everything grilled and melted nicely. All...", "Harold is a fallen angel, an angel that fell from heaven. Thank you so much for your kind worlds about my mother in the hospital. I don't know why but..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "iC8lfyki-cln2W1z2Qg57g", "text": ["This is the slowest fast food restaurant I have ever been to. The food is average Taco Bell quality (however my nachos once came without cheese, but they...", "I found an ant sitting on top of my cheese sauce with my nacho fry. Delicious. I called to let them know they need to get the ants out of their cheese sauce...", "I've waited in the drive through for more than a half hour at least 3 times during 5-10 pm. I understand if they have a bad night but this is consistently..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "WYbg8eKUDAYgch9mSLjMDw", "text": ["I started coming here because the location on 56 and O had some strange barbacoa. Anyways, the downtown location was my hang out place for the year that i...", "This was my first time at this location. I came during lunch time, so it was busy there. The workers were just rushing to get everyone out and seemed to...", "Fantastic dining experience and great food quality :) Manager Rina provided us with top notch service when we were in a time scramble. I recommend!"], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], ["lunch"], []]}
{"id": "8OClBDPPJI7720hJlv1kgg", "text": ["Great quality food here! Had a ton of options on the menu from all day breakfast to Mexican to Italian. Really good cappuccino as well!", "Great breakfast. Portions are huge and very inexpensive. I would definitely recommend the stuffed French toast, the pancakes, and the skillets.", "Terrible service outweighed the very good food. Upon entering the restaurant, no one told us whether we should seat ourselves or wait. Woman behind the..."], "rating": [5, 4, 1], "TBscore": [0.47, 0.28, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["italian", "breakfast", "mexican"], ["breakfast"], []]}
{"id": "ezuajlVkgVubiUidPIX6sQ", "text": ["Five of us met for early lunch. I had avocado toast with blueberries which I loved. One friend had potato soup which she loved. The Miller and Paine...", "We stopped for a quick brunch this morning.  The Breakfast sandwiches were really good.  The Miller and Paine cinnimon roll was excellent.  Highly rwcommend!!!", "I visited this site last weekend for lunch. I had the caprese chicken salad. It was extremely disappointing. It was very bland; the \"fresh\" mozzarella had..."], "rating": [3, 5, 2], "TBscore": [0.5, 0.59, -0.22], "normalisedRating": [0.2, 1.0, -0.2], "keywords": [["lunch"], ["brunch", "breakfast", "sandwich"], ["chicken", "lunch"]]}
{"id": "LKHycGXuDBA_MBAzpxafHw", "text": ["I'm fairly new in town and just discovered this market close to my home last week. Did a week's worth of shopping and discovered I could not take the cart...", "This has become the worst deli in town!\n\nVery rude employees..refuse to assist with salads after 7:45 pm ...I stopped by for the   \n$.75 tenders today for...", "Checkers friendly.  Staff treats customers like they are valued.  They go out of their way to help people with mental and physical challenges.  \nIf one asks..."], "rating": [1, 1, 5], "TBscore": [0.0, -0.7, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], ["deli"], []]}
{"id": "bU6m2_Qv-mysK1kNTp1GjA", "text": ["Damn good BLT and Voodoo Ranger on tap. Good prices, keno, and a jukebox. Worth stopping in if you're cruising by for a beer and a bite to eat. Just don't...", "Wings were over done, waited 30 minutes for food .  I told to waitress I did not want there mushrooms on my burger since they came out of can . Kitchen has...", "The spicy chicken sandwich is yummy and I love the interior of this place, reminds me of a lodge. Friendly staff as well."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["wings", "burger"], ["chicken", "sandwich"]]}
{"id": "kNAhKOcrD9MHxvVj5b8N_Q", "text": ["I didn't know I was a loose leaf tea snob, until finding the Green Leaf Tea Company!  I hadn't tried most teas and only knew of the standard tea bag tea...", "Tiny tea shop with friendly service. The location is hiding behind main road. Good for small group tea time. Quite and relaxing.", "I think this place is fairly new and it's nice to see south Lincoln finally has a place with bubble tea. They have fruit varieties and creamy flavors. I..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Frdz6seCKqFwiYPxlY3PiA", "text": ["I decided to stop by Smoking Gun Jerkey on my way to a baseball game. In my opinion the store is clean and set up well. They have samples and a number of...", "The gentleman that sells the smoking gun Jerky at the farmers market in Omaha is a kind guy. =) Most of the jerky products are gluten free and relatively...", "Just got some of their beef sticks when they come to the Omaha Farmers Market. I did not go there  to intention to buy jerky, but I noticed that the line..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], ["gluten"], ["beef"]]}
{"id": "uNwi7XfGD1Dknhmj2pJHTg", "text": ["Check out this Rocket Fizz franchise for all your candy, soda, and unique gift item needs! The walls are lined with vintage-look metal signs that would be...", "Oh my gosh we were dying laughing at this plave. The run signs are both HILARIOUS and Historic. They have some great old signs like the poster for Martin...", "This place is a dentists worst nightmare.  Located accross from Pinnacle Bank Arena,  They have hundreds of bottled sodas and old fashioned candies and..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "H5XI_Nym7Wpmnz1yXMwpvA", "text": ["Disappointment  guaranteed!  2 girls out front, chatting  constantly in their native tongue while we & the next few customers waited & waited & waited for...", "Drive thru lanes do not coordinate.  Do not use the outside lane. Manager Maria was less than caring.", "Worst place ever!  They need to clean this place up!  This burger taste funky!"], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, -0.21], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], ["burger"]]}
{"id": "ZLWqWT1AzAf2TydXw_6bXA", "text": ["Great place with great owners! I take my kids here on little dates and it's always pleasant. Good seating, very clean and convenient location to grab some...", "This place has sadly gone down hill the last few years. The fruit selection on the toppings bar is essentially nonexistent. For example, tonight all they...", "I went to this place on 7/12/18 at approximately 815pm and when I went to pay a group came in with 4 or 5 kids and the cashier completely ignored me with my..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], ["bar"], []]}
{"id": "epEbwCEvCQ3qEbHOF0QuuQ", "text": ["Part of the greater \"Saigon Plaza\" this Little Saigon Oriental Market is everything but little. It goes far deeper than the outside would suggest,...", "Good vegetable and fruit selection, but limited with regard to other general Asian products. Looks to be mostly Vietnamese items.", "Little Saigon has improved over the last couple of years. Better selection, and tidier, more organized atmosphere. Also, a lot of fresh produce. I have been..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "hNTv60EaOMGOtiDfPd0OXg", "text": ["McDonald's McDonald's McDonald's how I love you but hate you at the same time. Got the filet-o-fish meal which had a special for another sandwich for a...", "Shake machine down again. When this happens I don't order.  No luck with the shamrock shake for me.", "Its McDonalds people.  This is one of the busier McDonalds in town and I really only eat here for breakfast, so this review is for breakfast only.  They..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["sandwich"], [], ["breakfast"]]}
{"id": "XCrdrT_3fM-5QC_G48IZOQ", "text": ["I love Smoothie King smoothies but I have a problem with one of the employees always locking the doors about 15 minutes early. Several times I have arrived...", "Personally think it surpasses the juice stop! Cheaper price, bigger portion and more options! I love this place :)", "Yummy smoothies, lots of healthy snacks (trail mix, energy bars, PB2) to choose from, & generous with coupons.  Service is always very friendly, & it takes..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.0, 0.49], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], [], ["bar", "snack"]]}
{"id": "5fQBb3HHdN0n11WDiQ3psA", "text": ["One of the great things about this gas station is the size of the lot. There are plenty of pumps to choose from, and they're spaced far enough a part that...", "Staff didn't offer a bag for my food- going out in the rain. I had a question about the app- staff didn't care, just kept chatting with each other. So not...", "Gas prices are the same as any other station in the area, so you go with what else they have or don't have. They're always sending out flyers about their..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "5SMZTmwN84KcOc50NsSZkQ", "text": ["New to Lincoln, Nebraska - I was more than excited when I discovered Juice Stop was so close to the University, where my event takes place every year! It is...", "Stayed in Lincoln while traveling on business and I was surprised I couldn't find more places like this. Seemed like they had a lot of good options for...", "Love love love the Gnarly. So sweet but not overpowered by the lime It's perfect. The need to open this in Fort Collins Co. I'd be in everyday for one of..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "QTPOn0NRhhQRWwDUwyopfA", "text": ["I ordered a fish fillet chicken tender sandwich and a burger and they only gave me the fish for in the burger and when I went back in they called me a...", "You may say, why, John Marston, would you call McDonalds \"A-Ok?\"\n\nWell, my Facebook feed is full of people that seem to literally worship the McRib, and...", "There are some creepy creepers working up in there. Stay away!!"], "rating": [1, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [["chicken", "sandwich", "burger"], [], []]}
{"id": "GYJDrXV4FUvDH0gOzqngkQ", "text": ["I do my best not to rate fast food because you know what you're getting when you come to a place like this.  This place never gets an order right.  Today...", "We stopped in there for a late night supper after doing all day moving the service was really bad people at the winter window just take your money give you...", "This restaurant's night staff couldn't problem solve their way through the front door. Gave us every condiment in the restaurant for asking for every..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "lqWaGcn6LmjKmqfuZs53cA", "text": ["Just went in through the drive thru, spent 15 minutes waiting to find a burger with a piece of wax paper in it. Thanks.", "I am never coming back to this McDonalds. I ordered two cheeseburgers plain, two orders of fries, and a coke. What do I get? Cheeseburgers with pickles only...", "When I got to 2nd window to get my food had to wait and watch and listen to girl employees socializing with young man running the window. He looked about..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["burger"], [], []]}
{"id": "HLTYrM-iVSbIGpQj50mnPg", "text": ["I'm visiting from Boston and feel crazy that I'm leaving a review on yelp for McDonald's but this was THE BEST experience I've ever had at any mcds...", "Went to grab something for breakfast on our way to the airport. It was 3:30am and there was a drunk guy passed out with his mouth open at the speaker box....", "Best McDonald's visit ever, fittingly next to a gas station with a sign reading \"YOU ARE NOWHERE.\"\n\nShout-out to the cashier \nwho took our ice coffee order..."], "rating": [5, 1, 5], "TBscore": [0.0, -0.25, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["breakfast"], []]}
{"id": "Hv1hNKEYk6iVWaCaf1zMaQ", "text": ["This is such a horrible McDonalds. I usually go to the location at 56th & Old Cheney, but brought my kids to this one to try the play place. They overcharge...", "This is the worst McDonald's ever....  even if there is nobody in line, expect to wait for at least 10 minutes even for a pop.", "Absolute train wreck of customer service. Employees openly arguing with each other. Left waiting forever at the counter. Not enough staff support to provide..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "zo8xwH2uwCI_JjI_qfBJRg", "text": ["I've eaten three meals from Source. Eat Fit and enjoyed all three. The Complete Combo is the tastiest breakfast I've had in a while. The Chicken Salad was...", "One of the parts about working in Lincoln!! This place has made it pretty easy for me to stay on track for my diet and fitness goals. Breakfast lunch or...", "First timer. Good people, good recommendations, and good food. I got one meal for for a quick bite and 2 more for later. I will for sure be back."], "rating": [4, 5, 5], "TBscore": [0.0, 0.34, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["chicken", "breakfast"], ["breakfast", "lunch"], []]}
{"id": "vmtln2lmQcfK_pHutoXVVA", "text": ["Whenever we travel to Cedar Rapids, IA, we make our way to the local coffee house nearby. On our most recent summit visit they were closing their doors to...", "This seemed to be a fairly popular coffee chain throughout Lincoln. It's a little building with a drive through, but don't let that fool you - the menu is...", "So disappointed in this particular location.  Paid for a hot latte and when it finally was prepared, it was cold.  Had to wait for another one to be made...."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "bi54Gvdsb7Sr0fgo6IVoig", "text": ["Reading the other comments I almost shit my pants laughing.  Sounds like some one shit there and they just haven't found it yet.\nIf you're still eating at...", "I've given this location more than a few chances...and they've disappointed me every time. Took the drive-thru last visit and the guy on the intercom told...", "Last night my roommates and I went through the drive through, we did two separate orders for the car as we were each paying for our own meal, which I..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "TehW9VAA184OpDvDKR69dA", "text": ["I've been here twice and haven't had any real issues. Fast, friendly service inside and kept clean. Drive thru service was fast but they never smiled or...", "Ordered a Hot Fudge Sundae: nothing hot about the \"hot\" fudge. Ridiculous. Couldn't they have at least warmed the \"hot\" fudge? Chocolate chip cookies: hard...", "Went in for lunch around noon on a friday, the lobby was an unorginized mess.  Could not tell who was in line or waiting for their orders.  No..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "hUib4rTey_txdQXTWlpa5g", "text": ["Came in to celebrate a special occasion in my life and was treated to the best cocktails I've ever had  and some solid conversation thrown in. Its not a...", "A not so secret but clandestine gem in Lincoln. I think most know of it, but haven't been. I finally made it here on my dirty thirty after years of knowing...", "Looking to impress customers or just meet up with an old friend. This little gem is perfect for both.\nAll hand made stuff....drinks rock. Cash only. \nCheers !!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "7FltNi-UBz9OkSCnCuxAug", "text": ["Top notch service, drinks, location and decor. So glad they fully remodeled before opening. Really beautiful inside. Some of the best made drinks in town too.", "This establishment is exactly what Lincoln needs; a great place to go for drinks that does not have loud music and a tv on the wall. \nWe stopped on our way...", "Highly impressed with alchemy. This place puts the former establishment that resided here (Doc's place) to shame. They have done an exquisite job in..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "G3UNyqStYEohXzGJm5s0zQ", "text": ["Stumbled upon this place before an early kickoff of a Husker game. It was a pleasant surprise. It's a good vibe for those of us that are a few years out of...", "My husband and I love popping in and getting a drink before a movie or dinner! Their happy hour is great and their beer selection is better! Service is...", "Quality draft and bottle selection in a comfortable space in downtown Lincoln. You'll also find a clearly marked \"game vault\" located in a..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.71, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["dinner"], []]}
{"id": "eZF6It5JNipY1oFG5krCrg", "text": ["Found this place on the internet and was not disappointed! Great dive bar with keno and pull tabs. Owners where there and made us feel right at home. Lots...", "Oh yeah....another dive bar. Most of the beer and liquor is fairly cheap. There's a touch tunes jukebox. The service is good and the other patrons are...", "My go-to bars are usually dive bars. When searching for \"dive bars\" in Lincoln, Harry's Wonder Bar appears to be the dive-iest (in the best way). \n\nI went..."], "rating": [5, 4, 5], "TBscore": [0.52, 0.37, 0.38], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "vDPN2pR1d1hDeLqdHA6Ssg", "text": ["My brother lives in Lincoln and I look forward to going to this place every single time I visit. I couldn't believe how whimsical this place was when I...", "Guessing this place has changed ownership lately. We stopped by on a Thursday night during the holidays and didn't find the old black and white movies...", "We came here before a huskers game and had a few drinks.  Located below Buzzards, this place is a hidden gem, the drink prices are very affordable and the..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "dxgY7TPxarkbfT2uzHKAiQ", "text": ["When I wanted a refill, they would only give me a refill in my original drink, which is against code. Plus when I wanted beers to go which was before...", "One of the best bars in Lincoln. Live music every night. And it's good stuff too, not just local cover bands. Touring blues guitarists have been some of the...", "4 Stars is a bit lower than what Zoo Bar should be.  5 is close, but probably a 4.8.  Zoo is a place I love to visit during many weeks in Lincoln...."], "rating": [1, 5, 4], "TBscore": [0.0, 0.46, 0.5], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "844QElWPtfoifoFQ7yX0sQ", "text": ["Nebraska - The Good Life & The Good Brews!  I love the interior of this beer hall as much as I love your beers.  4 pour flight - you cannot go wrong. Got me...", "To truly appreciate this you have to have an understanding of the German style of Oktoberfest.  This is a relatively small venue but great for groups and...", "Knowledgeable bartenders are a must in craft beer and it is appreciated by those that enjoy local beer. \nNeed to stop by if you are in the area."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "EL2ToO-V8u-nCTCm4gVCUQ", "text": ["It's a cool bar but nothing special. Decent prices. Hot chick was tending bar. Jukebox has some good tunes. Very limited parking because it's downtown. I...", "A great spot to watch soccer matches with a crowd that is into the game as it unfolds.", "Captain Jack's is home to the Lincoln Chapter of the American Outlaws (Supporters of US Soccer). Come check out all of the US Men's/Women's soccer games..."], "rating": [4, 5, 5], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["bar"], [], ["american"]]}
{"id": "rWJxiRj-BXwJTG2TmCd3sA", "text": ["Been here a few times including New Years. We paid a cover but didn't stay for the band but we ate the food they offered. Really great Nowhere pizza. We...", "This is a dive bar on the north side of Cornhusker Highway. Usually there is a band or Karaoke on the weekend nights, Friday and Saturday. A small dance...", "Great dive bar, but I believe in taking care of the customer so the 3 star review. If you put in money to TouchTunes and their karaoke guy comes in to do..."], "rating": [4, 4, 3], "TBscore": [0.25, -0.25, 0.8], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["pizza"], ["bar"], ["bar"]]}
{"id": "auBzYelU3RdlLfyXqa7zFg", "text": ["Just your average joe bar. A buddy of mine and I stopped by and got a few shocktops. Reasonably priced. Waitress was pretty friendly and we got to play a...", "Have been to this bar a handful of times during the week (never on a weekend) and it always have quite a few patrons. Was last there on a Tuesday and it was...", "Nice and clean. Good price, fast service. Nice for the local, it seems clickie. No food but you can bring in your own.  I will be back with some friends to..."], "rating": [3, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [["bar"], ["bar"], []]}
{"id": "ndsqtdf_9Afjklvgz678Tg", "text": ["Stopped in here for a drink while down in Lincoln for a show.  It was pretty empty, but it was a Thursday afternoon.  Drink was poured well and the barkeep...", "Good place to quench your Irish bug. This is my first time and I just wanted a Guinness. Good place with friendly staff and good Irish stew!", "I went to this bar with my gf and some of her work friends last night and it was a fun bar.\n\nAfter a work get-together at around 9pm, we ended up on the..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "WysW9kdt4bye3kqS_euKyQ", "text": ["With a tap list that is diverse and local but not extravagant and bar food that is consistently what it promises to be, Grata is a good choice for happy...", "Way too much salt on the food. When the staff agrees with that assessment, someone needs to have a chat with the kitchen.", "I love this place. On Tuesday the tacos are average but they are still worth it. The margaritas are AMAZING but.. we want in for dessert before the Tuesday..."], "rating": [4, 3, 3], "TBscore": [0.44, 0.0, 0.31], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["bar"], [], ["tacos"]]}
{"id": "mgfD9p_44hbGQR18fU2DOw", "text": ["Easily the best bar in the Haymarket and maybe Lincoln. I'm not sure who may have rated this lower than a 4, but I'm sorry to say they're sadly mistaken. Do...", "I imagine this place is quite the crush on football Saturdays, but on a recent, unseasonably cool Friday evening in the summer, it was not at all busy....", "Some people will probably think this is a ridiculous complaint, but this place over pours their cocktails. When I order a vodka soda and you charge me for a..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["bar"], [], []]}
{"id": "ODXBVLlRdH_rND5cclfmGw", "text": ["By far the most fun place in town. Misty, the GM, is the best! She went above and beyond to make our experience amazing. Ill be telling everyone to go there...", "Friday night, most of the beers are out New general manager said it was the distributors fault :( Saw at least 4 people leave after finding out there was a...", "Terrible service. Bartender was a complete pompous jerk when I tried to order food and told me despite that I'm 33 I can't be in the bar with out an ID in..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, -0.45], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["bar"]]}
{"id": "gQ_Cqp5D-faT5deR1Jgiqw", "text": ["Stopped by to have a beer...if you're into going to a bar and seeing kids at the bar and running around, then you'll like it . Not me. Tried to shot pool...", "A friend recommended this place today to us, he plays Volleyball here sometimes.  Yes, Spikes has indoor and outdoor Volleyball courts. They offer leagues...", "This place is awesome.  Regular bar type food, but I love the atmosphere!  If you're a volleyball freak, this is your heaven in Nebraska!  They even treat..."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.59], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [["bar"], [], ["bar"]]}
{"id": "Aeq71KNWSer-pHPO6KLv3Q", "text": ["I really liked this place...perfect locals joint...divey in the best possible way, though from outside it looks a little iffy, once you step inside you'll...", "Arnold's is a traditional tavern, it reminds me of the Cheers bar from TV.  It's a local bar where everyone knows each other and is a real neighborhood...", "Arnold's is a down to earth, friendly,clean bar with awesome service and people. The decor is nice and inviting,comfortable booths and tables. Accomadating..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.48], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["bar"], ["bar"]]}
{"id": "6LBq8UN61C25MY0jZ84ISA", "text": ["Almost every year I was in Lincoln, Nebraska I stopped here at Barrymore's. It has a rich history as it is a theater as well as a bar/lounge that exists...", "Waited 20 minutes for waitress to come back to take our drink order.  Waitress too busy taking pictures and posing with her Husker tickets.  Staff annoyed...", "Been sitting here now for well\nOver 30 minutes with an empty glass. 5 guys sitting at bar. Bartender guy, glasses, balding, is not paying attention to..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["bar"]]}
{"id": "sFXHc1Xt_L0bYrbKI3Mb1Q", "text": ["This is the best bar my wife and I have been to in Lincoln since moving here. I felt right at home, like I was back in Louisville, KY, which had a large...", "Panic offers excellent live performances. Music, comedy and drag to name a few. It is a comfortable and welcoming atmosphere for people of all walks of...", "Love this bar!\nBeer bust on Sundays! $6 pint then a quarter each after that!\n$1 beers on Monday!!! And cheap Jaeger on Thursdays!!!!"], "rating": [5, 5, 5], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], [], []]}
{"id": "LkNok2JEr0SdLeTEhYiD-w", "text": ["We got an amaretto sour fish bowl and it was made well and tasted great. The bar skewed older for sure, didn't seem like a place for 20-somethings, and we...", "The only bar I make a point to visit every time I travel to Nebraska. I don't think I visited a bar more frequently than Duffy's while in college. Best spot...", "This is my favorite bar. I frequent bars. Frequently. If you also frequent bars, you'll sincerely appreciate the ambiance, televisions, taps, games, darts,..."], "rating": [4, 5, 5], "TBscore": [0.33, 0.4, 0.26], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "ni_WDa1XG2otbosIHWMRcw", "text": ["What a fun place! \n\nI came to Bodega's Alley for the Nebraska Funk & Soul Alliance Benefit/Concert to see Josh Hoyer & Soul Colossal. This was my first time...", "Came to this bar from out of town and it was great! Fun atmosphere and laid back feel. \n\nThe bartender Alex was great and recommended some tasty drinks. My...", "Bartender is rude. I asked for change for a 20 so I could tip him and he literally threw my money at me. Bartender was middle aged man and very..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["bar"], []]}
{"id": "ZLPw1eRlLHIYRjqdUgHJ_Q", "text": ["Are you kidding me?!?! Cheap ass drinks in the haymarket?!?! Accept it, go with it, take it for what it is and enjoy it.  You're welcome.", "What can j say about Jacob Holigans. Cross training? Hide. $1 beers. HIDE AS FUCK. Skeet ball, where you don't think it be? Hide.", "JJ Hooligan's is your typical dive-bar with cheap drinks and a loud jukebox. Just my kind of place! Seriously great service too. The bartender, Kris, even..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "WhOH44ESXkO6psWMFzqNdQ", "text": ["Delicious local beers and liquors! Bartenders are very knowledgeable about what all they have and what you would like. Plenty of games - did I mention they...", "It smelled like a sweaty mildewed locker room at this bar. It was seriously so gross that we left before even ordering anything. They need to figure it out.", "Pretty good spot for the night.  This location has been a few different places before 1867 and I hope this one stays.  Entering through a smoking section (A..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["bar"], []]}
{"id": "lbEEFQu8nbU-acLp7f6e8Q", "text": ["Iguanas is the classic college bar. The drinks are cheap, served quickly but attentive and young staff, and overall fun. Grab some frog sperm - low on...", "They got popcorn, that puts them above the rest. i also like the frog sperm shot, but the popcorn is prime.", "My favorite in lincoln! The overall atmosphere is great. I'm from Seattle Washington so I know a good bar when I see one. They have a popcorn and nacho..."], "rating": [4, 4, 4], "TBscore": [0.21, 0.0, 0.53], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "b96J5LsEFPYRfiDObw6Oaw", "text": ["My favorite place to grab a casual drink with my husband and friends! The drinks are always made perfectly, it's well priced, and the ambiance is really...", "Meh. There is nothing positively remarkable about Marz. The cocktails are ok. The price point is not that great for what you get. In the world of craft...", "Lousy bar. Terrible service. Sky high prices. $8.00 for an amaretto sour that's mostly ice?!?"], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], ["bar"]]}
{"id": "KAMncGjnKKfSByuBo2cxOQ", "text": ["Like any smart tourist to Lincoln, I came here by mistake, believing it was the Starlight Lounge (https://www.yelp.com/biz/the-starlite-lounge-lincoln-30),...", "In town for business and every white person in our group was admitted without an issue. The short overweight bouncer refused admission to one of our senior...", "Assaulted by bouncers and they were unable to provide their security footage after we called 911. Absolutely worst experience ever."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "iUlfs8XbOIQvRWQmdCd1kg", "text": ["A gratifying mouthful of flavor and texture with the Panang curry with tofu as protein. I like it spicy and the waiter asked a few questions to get the heat...", "Most delicious Thai food I've ever had!\n\nI was just passing through Nebraska with my friend and we picked this place at random as we were driving down the...", "Been here a few times for lunch now and have to say I'm beyond impressed.  Amazing flavor cooked to perfection, fresh ingredients,  clean meat, they know..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.41], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "iebogl98hQAOrd6JlylqJA", "text": ["Lunch today, on July 4th.  \n\nMet a couple of friends for lunch today.  The place was busy,, but no waiting line. One in the group was not familiar with...", "The soup is good but not good enough to account for the slow and inattentive service. Waiting to be seated because host isn't paying attention to door,...", "OMG!!!  I have been craving pho. This place is the bomb.  I had the rare beef pho, hubby had the short ribs & we split an appetizer sampler.  It was all..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["lunch"], [], ["beef"]]}
{"id": "Los6Bqb57zh-JEMTpgta8A", "text": ["This is my favorite Vietnamese place yet. It was fast service, pleasant atmosphere,good service and lots of good food. Thanks.", "I was very excited to try their Pho. Unfortunately, it wasn't my favorite. Very greasy. Other than that small detail. I would say, go ahead and try it.", "Pho14 was my fav in south Lincoln that I visited once a week or so for a year straight .Lately the food has not been as good, tofu bun was lacking cucumber..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "yNAIQIZC2XyBoQCLSZuHzw", "text": ["Best Chinese food I've ever had in the Midwest and I've had my fair share. Super authentic, so delicious, fast and affordable!", "This has been a nice place for Chinese delivery in Lincoln. Food has always been great! Typical expected dishes, plus some their own style. Delivery speed...", "This is the first time I have ordered from here and the last the food was not good at all. Chopsticks is a hell of a lot better"], "rating": [5, 5, 1], "TBscore": [0.54, 0.32, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["chineese"], ["chineese"], []]}
{"id": "qdw0KNLBVPX2AHX5lod4lw", "text": ["Whenever I want comfort food this place is one of my favorite places to go. Most of the front house staff are friendly and welcoming, and if you start...", "Called for carry out, they messed up my order because they don't speak english. It's like I asked for 1 soup, the guy yelled \"okray you get thfree suups\",...", "We've just moved from CA to NE... we'd been on the hunt for an amazing Chinese food place, and we stumbled upon Golden Wok. \nWe were seated right away, food..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.3], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["chineese"]]}
{"id": "mEsvFnScpg9q1OBxq_Pm9Q", "text": ["I'm declaring this the best Chinese place in Lincoln. Sure there are others with some authentic dishes, but for consistency, price, speed, authenticity, and...", "I LOVE MINGS!!! Sometimes they have 10 year olds working the phone and it's kind of sketchy but the food is the BOMB", "Stopped in the other night and got cashew chicken......it was HORRIBLE!  It didn't taste like chicken it tasted like burnt chicken skin.  Super gross, I..."], "rating": [5, 5, 1], "TBscore": [0.5, 0.0, -0.33], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["chineese"], [], ["chicken"]]}
{"id": "-6GBcupNyUWaEvUMhUYMgg", "text": ["Helllo DELICIOUS GOODNESS! My hubby and I have found our new favorite Chinese Food place! Service was amazing, staff was SUPER friendly and prices were...", "We had a nice surprise yesterday when we went to the Great Wall this past Saturday. I ordered the Hunan chicken meal, my wife had chicken fried rice and the...", "I have known about this place since 1999. It is my favorite non-buffet Chinese restaurant in Lincoln. My favorite dish here is the Mein Fun. Not every..."], "rating": [5, 5, 5], "TBscore": [0.42, 0.0, 0.33], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chineese"], ["chicken"], ["chineese"]]}
{"id": "4wKbtDKvCsYwS3YsYmAXAg", "text": ["I'm going to try to hold myself back from writing this review in caps, but THIS IS THE BEST CHINESE FOOD IN LINCOLN. \n\nI love me some Chinese food, so I've...", "Ok y'all...  So this place was suggested to my hubby by a co-worker. I checked out the Yelp page before we went. Looked like great food, good prices,...", "The food is average if that, they don't accept cards which is an inconvenience. They are not flexible with substitutions."], "rating": [5, 2, 2], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["chineese"], [], []]}
{"id": "oC5hLJFRcN5rDuaftRMYMg", "text": ["This was my first visit to Hong Kong restaurant on 27th. I ordered Singapore Noodle for lunch and Kung Pao Chicken for dinner. \n\nI am a voracious eater,...", "This is a great place for dinner. The portions are big and the flavors are fantastic, and they are willing to accommodate your tastes by adding or...", "This is an average Chinese food restaurant.  We thought the food was cooked well, but bland.  This review includes the garlic chicken and chicken lo mein."], "rating": [5, 5, 3], "TBscore": [0.0, 0.36, -0.3], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["chicken", "dinner", "lunch"], ["dinner"], ["chicken", "chineese"]]}
{"id": "GTBAIwu3EPlpc1jVxoe__g", "text": ["Glad to have this on south side, they don't deliver ( I think delivery companies do) but I eat here inside or pick up my own carryout. Simple and perhaps...", "Shen cafe does not honor yelp orders\nBut I was charged $32 for an order I\nWill never see\n\nVirginia long soldier\n\nRefund my money ,", "The best Chinese food I've had in lincoln!! They accommodated all of my modifications to the best of their ability and THE FRESHEST THAI TEA!!! It is to die..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.67], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], ["chineese"]]}
{"id": "Wm9goeNF9zeCquiwBFXUhA", "text": ["Excellent local Chinese.  My family and I love this place.  Eat in or carry out, great quality and prices.  Highly recommended!", "I ordered food for pickup at 6:30 and I am still waiting for it...currently it is 7:30.  Horrible service.  Much better options in Lincoln with businesses...", "Love the food here.  Dishes are not over sauced and have just the right amount of salt.. great meal at a great price.  My fav now"], "rating": [5, 1, 5], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chineese"], [], []]}
{"id": "CS8HHWAOCDVDPm_HyaEBOg", "text": ["Food always comes out hot and fresh.  The crab rangoon is pretty good here as well.  It does take awhile for food to be served since they cook it fresh....", "We ordered takeout from Zhang's tonight and was a little disappointed. I ordered our meal online using their Menufy service and it was ready within 15...", "This place is pretty great for quick takeout Chinese. Ask them to make the general zaos spicy, it's the best thing on the menu."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.41], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], [], ["chineese"]]}
{"id": "-oNyx4ge4Xmv-60nV3VloA", "text": ["Good food , great prices & a clean friendly environment they were also quick with my take out order . Szechuan beef and broccoli with lo mein.", "This place is pretty popular!-I had never been . I am into traditional Asian foods and flavors so I was hoping for something spicy. I ordered the Thai...", "Reallly  good and extremly fast good food and fast  need say more worth going out of way great rice hot sour soup"], "rating": [4, 3, 4], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["beef"], [], []]}
{"id": "_c6yeAJVyMDOleReRqf8Gg", "text": ["This is our go-to Chinese takeout. Everything is great honestly. They are a bit stingy with certain things like sauce etc but good portions and delicious.", "Excellent food. Large portions at a reasonable price with great customer service. I always get Kung Pao chicken, and it is some of the best I've eaten....", "This is probably my favorite Chinese restaurant in town. They make fast and delicious meals at a good price. You get a ton of food in each order and the..."], "rating": [5, 5, 5], "TBscore": [0.55, 0.44, 0.48], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chineese"], ["chicken"], ["chineese"]]}
{"id": "weAYjccL9VMLY9_qb9ZfBQ", "text": ["Simply fantastic.  Love Chinese and will only eat Chinese at China Wall.  The people there have always been so good to us too.  I tried others and nothing...", "Customer service is absent. Food is far below average. Avoid. I went in to get a late lunch and the cashier didn't say hello or pretend he was happy to see...", "Yet another onion and celery laced meal.  Ugg this place sucks, I'm not sure what part of authentic they are talking about.....do Chinese people really eat..."], "rating": [5, 1, 1], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["chineese"], ["lunch"], ["chineese"]]}
{"id": "3kb-FdF3P1aWrjsoSzKpqA", "text": ["We were sorely disappointed with this food.... We ordered crab rangoons... all of the cream cheese and crab came out, leaving just a soggy wonton shell in...", "First impressions..... The crab cheese wontons and egg rolls were good. Greasy, but tasty. The sauce on the Orange Beef was AWESOME! They need to rename the...", "Pretty yucky food. The General Tso's chicken is all breading no chicken, and tastes like disinfectant. The Mongolian beef has no little noodles and was..."], "rating": [1, 3, 1], "TBscore": [0.0, 0.65, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [[], ["beef", "egg"], ["chicken", "beef"]]}
{"id": "uE88ubraPk_gzEYK6eTJQg", "text": ["HuHot is my favorite non-fast food restaurant. \n\nThe most popular meal is comes with a soup or salad, and the ability to go through a set of various bars...", "Newest review: STOP BURNING THE DAMN FOOD \n\nNEW REVIEW Sep 2018: 9/10ths of the time I come here, they refuse to use my rewards, or claim they do and it...", "I'm giving 5 stars for the extremely awesome service. I have a shellfish allergy and anytime I come here, every single person is beyond amazing at taking..."], "rating": [5, 1, 5], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["bar"], [], []]}
{"id": "-2OvyVdwsfQOk4yqRPm6rw", "text": ["Well we walked to here from Lied Center for dinner time around 5:00. Several trays were empty... like 4!!! What?????!!!! They said they could make some...", "A solid 3 for sure. Wait time is minimal and staff is friendly. I guess their meat is just too lacquered for me. Soooo sweet and almost like it's covered in...", "Tasty Chinese and fast.  Try the Orange Chicken. It's yummy. So is the string bean chicken.  Their catering is also very good with 3 entrees and 3 main..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["dinner"], [], ["chicken", "chineese"]]}
{"id": "ib-g98Gi2ni_mg6_rXCN9g", "text": ["My wife and I walked here after yet another day walking around campus getting ourselves set for the school year.\n\nThis place is walking distance from the...", "Noooooo.....\n\nWhat a waste of a meal, money, and time.\n\nThe pad thai and pad mee were tasteless and filled with oil. \n\nthe egg flower soup: I ate 2 bites...", "DO NOT EAT HERE.\nThis is for sure, the worst Thai food I've ever had. And not just that, it's some of the worst food I've ever had in general. It was..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], ["egg"], []]}
{"id": "NLQH3H_3wO4ig-HGzGYOag", "text": ["Always a delicious choice for a quick lunch buffet!! Great service to.    Been here six times and always liked it", "Ordered the vegetable fried rice and there were pieces of beef and chicken. Not really happy, sick all night from it, when a vegetarian orders a vegetable...", "I've been here many times. My favorite is Hunan chicken. I was running errands today and was starving but had recently started a diet. I pulled through Wok..."], "rating": [5, 1, 4], "TBscore": [0.73, -0.57, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["lunch"], ["chicken", "beef"], ["chicken"]]}
{"id": "G_VPa0GvHC77E8vORIZHEA", "text": ["I'm so excited that Waverly has a Chinese Restaurant now!  And a good one, to boot!  It's located in the strip mall next to the 4-Star Drug (where Doozy's...", "I have been a patron of this restaurant since it opened. It is just a few miles outside of greater Lincoln, right off HWY 6 in Waverley. A great local...", "I ordered lo mein with shrimp the lunch special and it had beef pieces in it clearly showing the back kitchen cooking is that sanitary.  Not a place for..."], "rating": [4, 5, 1], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["chineese"], [], ["beef", "lunch"]]}
{"id": "IfsAjpssRVNFjoyDWZO_4A", "text": ["This place has really good food! I was first introduced at a celebrate Lincoln event where they were one of the street vendors. So I came to the resturaunt...", "Every time I go to get my ordered the music is blaring loud it's cussing music they always forget an item of mine it's just ridiculous it's so...", "I'm giving a 2 instead of a 1 ONLY because I used to really love this place. We went on a Thursday at 7:56 pm and almost turned around and left because all..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "ISSoJ3Mo_c676yU9BLmcsw", "text": ["Well, a simple honest review, this place is not really a Hibachi place. Putting stuff on a hot plate doesn't make it hibachi! Whatever they serve is not...", "I ordered the steak meal. 75% of the box was big chunks of cabbage and very few amounts of zucchini. All the steak was fat. Every bite was fatty. I do not...", "Its hard to be disappointed by food court food simply because the expectations are so low. I am always amazed at how these places exceed my expectations for..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["steak"], []]}
{"id": "DxVEft4SAzKezgv2i5dt-Q", "text": ["The quality has dropped at this Noodles. To start, one of the employees was wearing a flannel shirt over her uniform, very unprofessional. My husband and I...", "Not a bad little joint at a very affordable price. Noodles across the world is the theme here with plenty of offerings to suit every palette.  We ordered...", "My family loves the food here. I feel the quality of the food is decent and has great flavors. For a family of 5 to have all the members of the fam like a..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "aRjBrBAyT1uM5aWbnzN3NA", "text": ["What I liked about this place is it had clearly pointed out vegan dishes in its menu. We ordered some pakoras, the chana dish and a sabzi curry. The spices...", "Indian Food???!! Where's the Indian food !!! Goodness this is the worst I've ever had ... definitely doesn't cater to Indians and this is not authentic...", "Open on Black Friday, but not crowded at all. Ample parking, friendly staff, and a much bigger serving of salad than I remembered. Food is pretty flavorful..."], "rating": [4, 1, 4], "TBscore": [0.0, -0.42, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], ["indian"], []]}
{"id": "X1KfyvH92W-X87Ef5yoXXQ", "text": ["My family and I love Indian food and I was suggested to try this restaurant by someone from India, who indicated this is as close to authentic Indian food...", "A - fish appetizer, naan, dal, samosas. \nB - curries, biryanis, Service\nC - chicken 65 (lacked masala, should be red in color)\nD- The wait time between the...", "Hyderabadi biryani is  my favorite. They never go wrong on that dish. Even naan and any entree dish is always fresh. Kudos to chef..."], "rating": [5, 3, 5], "TBscore": [0.5, -0.3, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["indian"], ["chicken"], []]}
{"id": "Nt5QI61cIuE8hpqPaS0RvQ", "text": ["Declining service and consistency in the food downtown. Rude, inappropriate employees and sauces that taste rushed are not the standard I'm used to at the...", "The Oven is a semi-schwanky Indian restaurant that caters to the local tastebuds.  It's a nice place for a date night with a few things to keep in mind:...", "This is a place I visit when I'm back in Nebraska.... I absolutely LOVE the maligawtny soup!! And the garlic naan!! I ordered the chicken tikka masala but..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], ["indian"], ["chicken"]]}
{"id": "7Ntu912xNdur871dL7JH2w", "text": ["Excellent Indian / Bhutanese cuisine.  We go at least every month and we love the food, service, ambience and servers.", "I have been only once but it was an excellent experience.  The flavors, temperature, textures and options were spot on.  Our server was attentive, warm and...", "Who knew that some of the best Indian food I've had would be found in Omaha?!\n\nI ordered the shrimp madras upon the recommendation of the waiter, and the..."], "rating": [5, 4, 5], "TBscore": [0.4, 0.0, 1.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["indian"], [], ["indian"]]}
{"id": "tdv5Bn3vSyBmmA3BNmeWsw", "text": ["I tried the reshmi paneer (vegetarian dish) with naan. Initially I thought the gravy looked watery and had lower expectation. But the taste was quite...", "I have been trying to find a good Indian food buffet in Omaha for a while now... Flavors you've done good!!  The lunch buffet is GREAT.  At $12.99 (possibly...", "The sauce for the Reshmi Paneer dish (vegetarian) is one of the best Indian sauces I've ever tasted. The paneer, however, was a weird squeaky texture and..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.62, 0.25], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], ["indian", "lunch"], ["indian"]]}
{"id": "_qpjUsF8m3Ahk7wT2VM-zQ", "text": ["Chicken tikka masala and lamb vindaloo were both amazing! And course you can go wrong with garlic naan!", "I have been going here for 4 years now. In my 4 years it has been a true pleasure for a quick delish Indian meal the wife a kids enjoy. However, as of...", "Amazing changes and updates. I was so impressed with their service and wonderful food tonight! Greeted at the door and had a complimentary some sort of..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.36, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chicken"], ["indian"], []]}
{"id": "8J0qbcj_VjrXT_Xs09WySA", "text": ["Nice location , ample parking and reasonably good decor. \nI had butter chicken with naan. The butter chicken came with rice. \nWell if an Indian restaurant...", "Wow this place is bomb!  I'll admit for those that know Indian food in Omaha they know the Jaipur does it right. I was craving the Acadian grille an...", "EVERY DAY LUNCH BUFFET! Need I say more? I mean, why decide what you want to order when you can have it all! Put on your stretchy pants and speed on over to..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken", "indian"], ["indian"], ["lunch"]]}
{"id": "aPc1yFNzATocowYErcRPhQ", "text": ["It has been weeks since Mother India closed and I have been hoping to find a good replacement.  Went in for dinner on a Monday night about 6:00. From the...", "Very good curb appeal. However the entrance is confusing. There is a gated patio with an entrance ...not the main entrance. Small potatoes I know but it...", "The tiki masala was really good, came out quickly and the portions of food were very big! Definitely recommend."], "rating": [5, 3, 5], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["indian", "dinner"], [], []]}
{"id": "4E62x93p1MMr8VfmmVb0JQ", "text": ["Excellent meal all around.  Great service and atmosphere.  The menu is very diverse but offers explanation for the rookie indian cuisine.\n\nI ordered the...", "Simply cannot go wrong with Jaipur. It will satisfy your Indian cravings.\nFried Momo is delicious. Lamb Korma was very tasty although I expected a little...", "Disapointing.  Don't waste your time or money.\n\nIPA not even \"meh\".  Barely any hops taste.  \n\nWaiter unaware what entres unavailabe @ 6pm on a Saturday:..."], "rating": [5, 4, 1], "TBscore": [0.53, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["indian"], ["indian"], []]}
{"id": "cIDaOIddvtAxJDhD6GOmDQ", "text": ["The kids and I had such a fun experience for dinner tonight!  We saw that Astoria Biryani House Omaha has a special on Wednesdays for unlimited dosa. What's...", "Food is good. They have a decent lunch buffet with a wide variety of entrées for $13.\n\nService could use some work. The guy at the counter (the only...", "If you want authentic Indian food at a cheap price, try Astoria Biryani for their lunch buffet. This place is packed. I am one of two non Indian people here..."], "rating": [5, 3, 5], "TBscore": [0.24, 0.0, 0.45], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["dinner"], ["lunch"], ["indian", "lunch"]]}
{"id": "8hvuy-LVKoSyKEwKTEq_FQ", "text": ["The food here is way better than it was when this place was Tanduri Fusion! And the atmosphere isn't so dark anymore. Much less bar-like. \n\nMy friend and I...", "Good food, great service, and fast. Thanks for a wonderful lunch.  Garlic naan was great, and we got the dal and saag paneer. \n\nUpdate: After going here a...", "Treasure in Nebraska \nWould recommend you try their signature dishes. \nI am from NJ and am here for a few days. The food would meet NJ standards. \nI had..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.62, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], ["lunch"], []]}
{"id": "zhiPFf6aSnQR6d5Tn1km4Q", "text": ["The service was absolutely gracious. The facilities are is disarray - the floors are buckling from rain and when we entered we were advised to watch our...", "Once again hitting on all cylinders!  Gorgeous new decor that really says Indian!\nFood wonderful from Starters of Spinach Pakora and Chicken 65 all the way...", "Visited here last night late (9pm)  we where excited to be served so pleasantly by the staff.  the menu was very thorough and explained well by our waiter...."], "rating": [4, 5, 4], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "DHWqRnHPD46qOwO-z8u2-Q", "text": ["Absolutely incredible. They go above and beyond to provide delicious food and a great customer experience. My significant other and I are frequent customers...", "My daughter and I tried the Taj for lunch. The restaurant was clean. It was not very busy. The server did a great job keeping our drinks filled and removed...", "A genuinely traditional Indian menu with good presentation. The highlight definitely being their rich and flavorful sauces which can be tailored for your..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.38, 0.27], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["lunch"], ["indian"]]}
{"id": "b8IFGf4r7JzbzzBWDHPqrA", "text": ["This is THE BEST Indian restaurant in Omaha, hands down. I've only been there at lunch time, if you go then, go early and expect a wait to order your food...", "I'm a little up in arms Persis isn't rated higher. While I do think the service has some room for improvement, I have not had a meal I don't love here. My...", "Tldr - don't order, terrible customer service, served meat to a vegetarian.\n\nWe've been regular customers at Persis but I had the worst experience ever..."], "rating": [5, 5, 1], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["indian", "lunch"], [], []]}
{"id": "UCaXR7DlHPqvJEPNIEFZlw", "text": ["I have nothing but good things to say about Modern Love. I love everything from the interior to the comfort food that I convince myself is calorie-free...", "We don't get out often because of a newborn so we were really looking forward to returning to MoLo since our last visit a couple of years ago. This time it...", "I am overdue in writing this review, as I got to be there in Omaha for the grand reopening of Modern Love. What an absolute treat!\n\nFrom the ambience (check..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "9IEccYvSU81HTMjvMDwdAg", "text": ["Could yelp please correct hours?  Only open until 7:00pm. Just sayin. \n\nReally don't have much else.  Just wish yelp would update the site. I'm kind of...", "The Best Chicken Kabobs in the WORLD Right here!!   Also want to also say some of the best rice as well.  You can not go wrong with anything you order here....", "We were the only ones here and it took over 30 minutes for our food to be done. Literally, straight out of the microwave and piping hot. The shawarma..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["chicken"], []]}
{"id": "6giHA540M4evdGW0Po_2Vw", "text": ["Laibela is a hidden treasure in Midtown Omaha.  Nestled just off the road near Saddlecreek and California, this family owned business puts the emphasis on...", "This is one of my favorite places in all of Omaha. The food is fresh and flavorful. So many layers of delicious tastes. \n\nWe enjoy splitting a combo platter...", "This place is fantastic! I went with my boyfriend and we ordered the combination platter. It was plenty of food to food two people and we even had a little..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "1GcILsSMaph24VpIypdIOg", "text": ["Located smack dab in the middle of Benson, this place will have you smacking the person seated next to you it's so yummy!!!\n\nThe menu has just the right...", "I'm a fan of Benson Brewery. In my experience dining there, they have two to four vegan options at a time, and all the ones I've tried are good.\n\nI've tried...", "After giving Benson Brewery several chances, tonight's meal was the final straw. We arrived around 6:45 with our three hungry kids. The restaurant was 1/3..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "4FYQoKJhVTWWf9qAK82nbA", "text": ["A quirky set-up that doesn't scream good food from the street unless you're thinking \"I want to eat in the side room of a generic ethnic market\" in which...", "The food was very good but the wait time for the food was a bit long and they make you pay for bottles of water. They will not give you a glass of tap or...", "When I went the place looked kind of beat down and the service was so-so and on top of that the food was weird tasting"], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "IMhHF36P4PnD3_vhq3RBXw", "text": ["Went to this place for my son's birthday. It was great :)\n\nMy son has a blast and all the other kids and parents seemed to enjoy themselves.\n\nStaff was...", "Okay my kids had fun but they are 3 and 5, doesn't take much to impress them. This place was bad, makes pizza machine look like a golden gem, Dave and...", "If you are looking to go somewhere that will completely disappoint you...like in every way possible, then I can't recommend this place enough. \n\nHalf the..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["pizza"], []]}
{"id": "N5NcqoTJjn-ZjSJjVGvx1g", "text": ["This is our first time eating at Crystal Jade, and I was very happy with the food! We got our order delivered, and it got here sooner than I expected, and...", "So good! I highly recommend this place. I LOVE that they have a special vegetarian section on the menu. We got sweet and sour chicken, chickpea masala, and...", "I'm not the biggest fan of Chinese food, but every now and then I'll crave it and this has been one of our go-to places for it.  We usually do carry out or..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["chicken"], ["chineese"]]}
{"id": "OdhD0spoS25p8k23qMUm1g", "text": ["Service or a lack of service in this place.  I did go back 3 Times though, the food is good.  First time, sit outside and 10 minutes later had to go ask can...", "Service was so slow!  Granted it was after a Husker football game so I was more patient but 2 hours AFTER the game?  When we finally got seated there were...", "The food was okay but the service was terrible. We were seated, ordered food, and then our food was brought to us all done by a different person, then..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "QdSuz2HkxaHC0Z8iiI8vBA", "text": ["we eat there almost every friday always good never a bad time........", "I cannot believe this restaurant was recommended to me by a local resident.  I don't know if it was an old cow that was used in the fajitas.  The beef tough...", "A Mexican restaurant perfect for the Midwestern palate, beginning with free baskets of housemade chips and salsa served with two levels of heat. Many combo..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["beef"], ["mexican"]]}
{"id": "Szq4fctH62Ay56Ug8fBBVA", "text": ["The trick to Las Margaritas is to get yourself an Abrham's margarita and then skip the Tex-Mex stuff. Instead, order from the part of the menu that has the...", "Worst tortilla soup I've ever had.   Barbecue pork was not barbecued. No flavor. \n\nCamarones a la crema shrimp very fishy. \n\nLousy service. \n\nGood...", "I visited this restaurant on 07/25/2017 @ around 6.30 PM. I am giving one star for ambience. My experience was the worst  as you see. Below are the..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "IK6MQPMIEe1movtCD3qb8g", "text": ["Awesome food and service.  Nisha is a great waitress!  Our food was timed perfectly and everyone enjoyed their dinner.  I had the El Dorado chimichanga and...", "A couple of friends wanted to go out for dinner tonight. One of them suggested Carlos o Kelly's for dinner\n\nWe arrived and the place is 10% full. There...", "Make no mistake, the service here is EXCELLENT, if I were just rating service, it would be five stars--hands down.  The food, unfortunately, is..."], "rating": [5, 3, 2], "TBscore": [0.88, 0.35, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["dinner"], ["dinner"], []]}
{"id": "BcLELSTGFaMy7qyi8CQPRw", "text": ["Kinda what you expect a low key bar to be. Cheap drinks and super strong. Definitely a low key place where you should t dare dress up to go to. Pool tables,...", "At 2:00 am some random guy comes up to me and tries to take my half finished drink. First time I ever went to this bar, only ordered one drink. He tries to...", "Really? This place is a sh!thole. We walk in and sit down, wait 10 min for service, decided to just go up to the bar and get our own drinks.  Lesbian..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.21], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "OJ8mhr5ne5x9K2I_j8Bg9g", "text": ["I don't know why people jam on this place.  It is my regular spot when I want some pizza.  They make it fresh and the only drawback to that is you wait 8-10...", "So I stopped to buy a bacon wrapped pizza and drove home to find out that it's not bacon wrapped it's just a deep dish. Called the store and they wanted my...", "Hot-n-ready usually isn't the case at this location. It's always busy it seems but a benefit of waiting for your pizza is that the pizza is fresh when you..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "ugmjvVdGLUJy8rrHZVl7QA", "text": ["Very tasty, if you've got a serious sweet tooth.  A lot of very sweet desserts end up just tasting like sugar, but some of these have delightful flavors....", "First time there tonight!  Great customer service and gave me some birthday love.  Wonderful carrot cake!", "What can I say? Best little cakes ever! When my family flys up to see me, they bring up these cakes. We're visiting for the holidays and this was on the top..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.65, 0.42], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["cake"], ["cake"]]}
{"id": "m_uAggyo30Uk1w6K9Kw0lw", "text": ["If you're searching for a cake in Lincoln, the search is over unless the \"Cake Lady\" goes out of business. \n\nIf you're searching for a cake in Omaha, your...", "Best in Lincoln!  We ordered a small cake for our anniversary and could not have been happier with it.  We are pretty picking when it comes to baked goods...", "My wife and I heard the \"Cake Lady\" did great cakes so for our wedding we ordered two. A chocolate one, and a \"wedding cake\" flavored one. We were old..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.33, 0.45], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "tooeUKcfEeu62NotnjjchA", "text": ["I really hate leaving reviews like this but I hope I help someone. \nI was not pleased with Cupakes and More and their products for my wedding. \n\nWe decided...", "Nicely decorated, but I hate to agree with others who said it tastes like it's from a box... but that's EXACTLY what I thought when I tried them. Chocolate,...", "Our family loves cupcakes and more!!  The cupcakes are amazing (the wedding cake flavor is my favorite, as are the cheesecake and lemon sunshine ones)...."], "rating": [1, 2, 5], "TBscore": [0.0, 0.0, 0.63], "normalisedRating": [-0.6, -0.2, 1.0], "keywords": [[], [], ["cake"]]}
{"id": "xasQMAKGIK4KypdQ-CxpDw", "text": ["Kolaches! A delicious welcome to any out-of-Towners.  Also try their donut holes that are huge.", "I finally did get a call back from this location.  When I was explaining why I thought it wasn't up to standards.  Sarah asked me if I was a cake decorator....", "Great baked goods! My favorite is the baked apple turnovers, they are so flakey & not overly sweet! I like supporting a family owned local business, both..."], "rating": [5, 1, 5], "TBscore": [0.73, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["donut"], ["cake"], []]}
{"id": "QZyondc6ZVc1DdyPNxT5pw", "text": ["They were nice people.\n\nI only ate their once.  The food was okay~ish.  If it had been extraordinarily cheap I'd have been fine with it.  But for the $9 it...", "As an avid cupcakes lover, I got excited as I heard about all the different types of cupcakes this place had to offer. .They had several unique flavors such...", "These cupcakes are just not good. They taste like something I could make from a box."], "rating": [2, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "VcNjg8MAQxwINdpO3lSFWg", "text": ["Ordered a small cheesecake fantasy which was served as a runny mess dripping down the sides.  The employee proceeded to place it in a larger cup with the...", "Took my kids for ice cream here after getting great reports at the dentist. We have had issues with the staff at this location in the past, but this visit...", "I ordered two \"Ready to pick up\" cakes at 9:30 am... I requested to pick up my cakes at 2:30pm that day. I showed up at 3:30pm and the workers said they..."], "rating": [1, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [[], [], ["cake"]]}
{"id": "gxMmVME4J7upB0ceeYGAUg", "text": ["HORRIBLE EXPERIENCE! Went to Dickey's on Apples Way in Lincoln. We haven never tried it. They advertise the kids meal for free on sundays so we ordered two...", "Went to this place for lunch. The special today was the beef brisket sandwich along with two side dishes. I selected the potato salad and baked beans. The...", "Sad excuse for BBQ; not worth the free ice cream cones you get for stomaching their so called barbecued meats. Management also leave much to be desired as..."], "rating": [1, 4, 1], "TBscore": [0.0, 0.36, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], ["sandwich", "beef", "lunch"], []]}
{"id": "Py0smEULn4MOZXmKsvgRqg", "text": ["Wow! Just wow, the food, the atmosphere, the friendly service, all fantastic! We ordered a family feast for 3 adults, 2 middle school kids and a toddler....", "I've been wanting to try Lippy's for some time now and we finally made the short trip from Elkhorn to Malcom last night.  I wish we would have done this...", "I was traveling through Nebraska trying a few BBQ joints, and someone on twitter told me I had to try Lippy's. They said it was the best BBQ in the state. I..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "qurSv3_eYaJ3zZBllMRTZw", "text": ["Stopped in for a burger about 9pm on a Saturday. This Burger King has been around since my college days (forever). \n\nFirst impressions, clean but older....", "Family came in for lunch and we had about 14 orders. The cashier, Alfonso came out with our food and we were missing about 3-4 of our meals. My sister in...", "I don't know what all the bad reviews are about. Quick, neat and accommodating, best Burger King I've ever been to."], "rating": [2, 1, 5], "TBscore": [0.26, 0.0, 0.21], "normalisedRating": [-0.2, -0.6, 1.0], "keywords": [["burger"], ["lunch"], ["burger"]]}
{"id": "5OL_f-HJ56TzZaxm3Fmd4Q", "text": ["I've been coming to this place for a while now because I love Popeyes and this is the closest to me.  Needless to say I think the food is great.  Anyway the...", "It always tastes old, cold, the staff is rude, and our order is always missing something or altogether wrong. I also watched an employee wipe her runny nose...", "My favorite popeyes in town. Where I come from all the popeyes are ghetto so I am used to them being the way they are!! Just good ol fast food."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "SFy05PFr7AMevzSvWHpgJA", "text": ["Good food and a quick drive through. It's also close to the highway and is attached to a Phillips 66 gas station. Great place to stop on a road trip.", "Cold fries, chicken tenders were dried out, cold like the fries. Burger had a quart of mayo on it. Awful trip through the drive through.", "This is without a doubt the worst Wendy's location in town.  It is the worst Wendy's I've ever been to, period.  I used to live about a mile away from this..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.6, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["chicken", "burger"], []]}
{"id": "eKQn8HDf3O1m514RECwTyg", "text": ["My wife and I drove to Lincoln from Council Bluffs last Friday night to purchase something and we stopped here on the way back to grab a quick bite.\n\nThe...", "This Wendy's really struggles with taking orders correctly. Every time I come, I always order Jr bacon cheeseburgers and every time I get regular...", "I stopped in for lunch. Upon walking through the door, the first thing I noticed was that the restaurant was freezing. The second was the smell. I don't..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["lunch"]]}
