{"id": "3MYybuoKVWvlMDgpvPyCOg", "text": ["Literally sandwiched between 2 other sandwichy spots, Newks and Panera, I heard they make a good Italian sub. The Sub was delicious. With added mushrooms...", "Good, not great, but as fast food goes, they're better than a lot of sammich chains, so there's that.", "Tried this place for the first time yesterday and I was impressed. Very delicious sandwiches with great quality ingredients. The atmosphere was very laid..."], "rating": [4, 3, 4], "TBscore": [0.39, 0.0, 0.65], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["italian"], [], ["sandwich"]]}
{"id": "qhjaBdN0UB2TRmG1Fbqw-g", "text": ["My wife and I regularly visit this place on the way to dropping me off at work to get a Blueberry Bliss and Chicken Bacon Ranch flat bread sandwich. The...", "Try the blue berry blitz with Splenda for only 150 calories !\n\nI added whey protein\n\nStrategically located on bowman and Kanis roads \n\nFriendly staff \nClean...", "Really good prices and delicious food. Took longer than expected, however (no line at all... but still waited a bit) but all in all pretty decent."], "rating": [5, 4, 4], "TBscore": [-0.21, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["sandwich", "chicken"], [], []]}
{"id": "qb40SEr9Pk2SdhZbY7nTpA", "text": ["Went there for lunch with a co-worker today! I got the herb roasted chicken sandwich with pesto sauce. She got the cashew chicken sandwich. We both got a...", "Used to eat lunch here a lot because it was close to my work. At first, I wasn't sure because of the name- sounded country. But my friend suggested it and...", "This is my second catered order and each time they have done a fantastic job!  The sandwich bread have bigger slices and are so fresh.  They had tons of..."], "rating": [5, 4, 5], "TBscore": [-0.6, 0.38, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch", "chicken", "sandwich"], ["lunch"], ["sandwich"]]}
{"id": "4CSTZAa9xFjJBBObnY7Bfg", "text": ["Whenever you are craving pizza but you don't want pizza. You come to Newk's and order their pizza because I don't feel so bad after eating my favorite five...", "I love the food at Newks, but\nThe service is not good.  Walked in today and one at the front register was on his phone.  Then a girl walked up and just...", "Not a bad place for a quick meal. I joined Newks email club many years ago and on my birthday I get a free meal from there. Only thing better than free food..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["pizza"], [], []]}
{"id": "O3iY6Is0vDyRMjcodwuCWQ", "text": ["The consistency and reliability with which this place manages to get my orders WRONG is astounding.When they first opened up, I attributed it to growing...", "It takes WAY longer than it should to get a smoothie at this location. If you are in a hurry, forget it. I just waited 15 minutes for a smoothie. Another...", "The Owner/s think not of their employees and their welfare or their pay. No...I'm not a former employee. I just happen to know a person that was a manager..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "aQ1W0kPHVoNuMQaMRlE_zA", "text": ["The app makes ordering very easy.  The sandwiches are average, except for the tuna..it's really bad.  REALLY bad.  Awfully bad. Disgusting.  Threw it away...", "Fast. Good. Its a samich shop. Lettuce wrap is why i went. It was delicious. Will be going back. The guy at the register made an attempt to joke with my son...", "Great Food! Great Price! And always quick service.\n\nI like to enjoy the #7 on wheat bread. \n\nThis location is perfect for anyone downtown little rock or..."], "rating": [2, 5, 4], "TBscore": [-0.45, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 0.6], "keywords": [["sandwich"], [], []]}
{"id": "1Kshl2Uw8U1DsjMmGlGa3w", "text": ["Good Hamburgers Fries and Onion rings cooked to order\nFriendly ladies working out of a hole in the wall roadside stand worth the drive if your out in that...", "Yummy burger.  This place is easy to miss because it is a little shack with faded signs next to an abandoned carwash.  But it is there.  And it is open.  So...", "It's everything you want in a dairy bar. Awesome burgers, yummy shakes, and quick service. A real hidden gem"], "rating": [5, 5, 5], "TBscore": [0.46, 0.0, 0.36], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["hamburger"], ["burger"], ["bar", "burger"]]}
{"id": "PiVQ5C7e3IxTc1uK7ieOQA", "text": ["Located at the back end of the outlet mall. Great space for parking and good lighting for the parking lot. \nThe screens here are huge and the seats are nice...", "Horrible. I will not return. I don't write many reviews. I hope this helps someone.\n\nOur movie was at 6 PM. According to their website you should arrive 45...", "How disappointing!\n\nSpouse ordered the chicken fingers and they were over cooked to the point they were so hard they were barely edible and that was the..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, -0.4], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["chicken"]]}
{"id": "bYFJjTLBY3b2N3HWKUWe0A", "text": ["So they forgot the cheese on my cheeseburger... no big deal. When bringing my food back with the aforementioned cheese, the cashier bumps into another...", "I love the smothered burritos. The cheese dip along with the chips included in the dinner is a excellent way to finish off the meal. The dinner comes \"A la...", "Ate there weekly for four months. Sorta hidden as it is in the Baptist Tower II by the right entrance. Very crowded as it is small and only open for the..."], "rating": [1, 5, 4], "TBscore": [0.0, 0.75, 0.0], "normalisedRating": [-0.6, 1.0, 0.6], "keywords": [["burger"], ["dinner"], []]}
{"id": "A2G05iqQFeDGz3--NBHNuw", "text": ["We decided to drive over to Little Rock and check one of their craft breweries out. We chose Rebel Kettle because of their beer selection. They delivered...", "Rebel Kettle is exactly what this road-weary old douchebag needed to quench his thirst and slake his appetite! And -- oh my! -- what fantastic service from...", "We stopped by to have a late lunch and realized it's brunch only till 3:00. I didn't want breakfast food but they had this amazing Brunch Burger on the menu..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["lunch", "brunch", "breakfast", "burger"]]}
{"id": "iQMbYBlVw09Vl7L0J4UUzA", "text": ["I love that this place is so close to home. My son loves to eat the fries that are provided to each table as we wait for our food. The staff is always...", "Menu is not very extensive. Burgers & fries primarily, which they do really well!  Be prepared when you walk in the door for a cacophony of \"WELCOME TO...", "I had heard excellent things about David's Burgers. My brothers, Dad, and I went to get ice cream at 3 in the afternoon.\n\nUnfortunately, it took over 20..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.36, 0.25], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], ["burger"], ["burger"]]}
{"id": "LNlC9dt2036cxsMBmj2YdQ", "text": ["Why have I not ever been to this place before today?!?! It's fantastic! I got a small chocolate concrete with M&M's and my husband got a small chocolate...", "Tried the Kansas City dog, chips and a strawberry lemonade. \n\nThe dog had kraut and cheese and lots of mustard and was very good!!\n\nMy lemonade also hit the...", "My family and I have patroned this place for years.....and I do means years.  I've literally seen the owner's children grow up (family works there).\nIt's..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "d-D5znLziRf9VkQS6qaQnQ", "text": ["Incredibly, incredibly, RUDE staff and personnel!\n\nI will be mentioning race/skin color in this review because I believe it was one of the reasons why we...", "One of my favorites spots since we've been in AR. Just a fast-food chain with some ice cream. I mean, custard.  still don't really know the difference. \n\nI...", "This place is always super busy. Could be because they don't start your order until you order it. No cold burgers, no cold fries! Freddy's also gives you a..."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.28], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], [], ["burger"]]}
{"id": "Bdxo6GVlmCjdmTPCUQjJYg", "text": ["I give up on Sonics in s.w.l \nBad experience at this one and the geyer springs unit. Ordered barbeque  boneless wings and got home and they were dry with NO...", "Not very quick, but 1/2 price shakes after 8pm. You can't go wrong. Service took forever and staff is rude,", "I have been visiting this store for 2+ years and recently, upon the installation of the new stalls, my enjoyment of this place has dwindled. The staff is..."], "rating": [1, 3, 2], "TBscore": [-0.38, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.2], "keywords": [["wings"], [], []]}
{"id": "yPykiQ1R5Wd8fVYZSIzUZA", "text": ["El burrito es grande.  Bueno. Great selection. Every Monday I'm there. Fast food mex at its finest.", "I have never seen this establishment struggle so much. So disappointing. The staff was working incredibly hard but could not keep items on the line. I...", "I'm a fan of Chipotle but when you order the tacos, you do not get as much meat as you get when you order the bowl. For the tacos, they grab the meat and..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], ["tacos"]]}
{"id": "yq9GWszuAX338F7m0bVIKA", "text": ["Seriously?  Right next to a brand new hotel, right off the Interstate, a multi-thousand square-foot establishment, and can't manage to bring in a crowd?\n\nI...", "Excellent staff! Very friendly and accommodated my request for a steak even after they turned the grill off. They changed Monday hours to close at 6 PM....", "I come here for free Texas Hold'em poker on Tuesday and Wednesday. Today I happen to be able to come for dinner and happy hour. They have great prices on..."], "rating": [1, 4, 4], "TBscore": [0.0, 0.74, 0.62], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [[], ["steak"], ["dinner"]]}
{"id": "dT4ELKAjfsEajXKI0I71Vw", "text": ["Typical visit as normal. Food is barely edible. Wings were about 50% cooked. Not safe to eat. I ate the ones that were cooked and they were decent. Not good...", "I'm only giving 1 star because I have to. This location might be worse than the Markham Rd location and that's saying something. People are incredibly rude...", "Service is terrible. Wings are still decent but don't expect the employees there to be in any type of rush to get your wings. When they say 13 minutes to..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, -0.42], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [["wings"], [], ["wings"]]}
{"id": "pHOr9BVr-yBJGsHI8e2tQg", "text": ["I mean come on people! Who goes to hooters for the food! You go for cold beer, sports on the tv and well let's face it.... Great looking girls serving said...", "Poor service. 2 of the girls had bad attitudes with surrounding tables because they requested for the TV to be turned on outside. Several items on our order...", "This place is terrible mismanaged. I went yesterday evening to eat dinner and had to stand there for awhile due to no one at the hostess stand. Not one..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, -0.56], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], [], ["dinner"]]}
{"id": "fwpaGObLK628fXI4950IFg", "text": ["Excellent wings, they make their buffalo wings a bit on the spicy side but they have many many choices.  Fast and Friendly service.", "My wife and I went to Buffalo Wild Wings in Bryant, AR on Tuesday night (November 6, 2018). There were several issues during our first visit at this...", "This was the worst experience I have had at any buffalo wild wings. It took a while to seat us (party of 5 and it was a slow night) and get our drink..."], "rating": [5, 1, 1], "TBscore": [0.52, 0.0, -0.4], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["wings"], ["wings"], ["wings"]]}
{"id": "n7m0RoMtButWndrYxl6qbw", "text": ["No NFL package. What a shame. The food here is terrible too. Bland chain restaurant crap", "I used to love the food here, but have finally learned my lesson...this is the third time I've been so disgusted with the taste and quality that I won't be...", "Happy hour 75 wings on Wednesdays! I have been here a few times and we usually sit in the bar area. The food is good. I like the nashville grilled chicken..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], [], ["wings", "bar", "chicken"]]}
{"id": "y2gC1r95q2IMP-Vki_aCeg", "text": ["Went through drive thru and the lady was rude and rushed me... got my order wrong and boxes were greasy. I was missing a box of fries and came in and told...", "Ryan made our visit great! He was friendly and made sure we were well taken care of. Our food was good and i had the caesar salad. It was huge! Thanks again!!", "My family loves this place I really don't understand why. The chicken was just ok nothing special. The fries were cold but my husband and daughter liked theirs."], "rating": [1, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [[], [], ["chicken"]]}
{"id": "jTcSNDu5RsF7q0iSoYtg1g", "text": ["I always get dry wings with buffalo & blue chi on the side. My fave for sure! They have tons of other great menu items as well. Staff is always nice.", "I hate that you can't smoke cigars there anymore but times are changing. Aside from that great atmosphere, great bar, great food. And the best Halloween...", "I ordered chicken wings and a Cobb salad (but without the bacon) for pick up. I picked the food up and when I made it home, I saw that there was bacon on..."], "rating": [5, 5, 2], "TBscore": [0.31, 0.52, -0.6], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["wings"], ["bar"], ["wings", "chicken"]]}
{"id": "zkwIO1WUGDqranPGn_EGWQ", "text": ["Walked in and got seated right away for supper. Server took our drink orders and went to find out the answer to some questions we had. Questions answered,...", "I try to find ways not to write a negative review of a business, but this one needs to be what it is--there's nothing positive I can say about Boston's.  My...", "This place is great. Has over 10 TV's (thus the Sports bar). Lots to choose from Pizza, Wings, pastas, ribs & burgers and a full bar. The service was really..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["wings", "bar", "pizza", "burger"]]}
{"id": "Lsk3tBLrM--cUT6UTlhicA", "text": ["My understanding is that this is owned by the same people who also run Santo Coyote further east on Cantrell. Little Rockers who fondly recall the...", "This is a nice neighborhood restaurant we go to when we don't want to cook. I cannot judge how authentic the Mexican dishes are and I assume they are more...", "Great place for vegetarians!  They were so accommodating!  The poblano grill veggies and the bean tostadas, and the bean chalupas were exceptional!  The..."], "rating": [3, 4, 5], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [[], ["mexican"], []]}
{"id": "zmxppcw1XlXck6IgP5P29A", "text": ["Everything perfect. \nManager is helpful", "Infinite ringing never an answer. Oh well try the next location. Good luck anyone else that pays for delivery.", "I placed two timed orders, one for 3:15pm and one for 4:50. After placing the order, I called the facility to confirm they got my order and would deliver at..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "eTOqd9RFuwv8ygBFgcgb-Q", "text": ["I've had a lot of good experiences at Zaxby's in general, most of which were at this location specifically, so it's going to hurt my heart just a little to...", "I have gotten takeout several yines from this restaurant.  The food was good and the service was great! I will be going back again!", "I wanted to go to another place to eat but a friend kept suggesting this place. So after about the fourth time I said hey, ok! Let's try it out! It was..."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "u_KgUCzbITYjo7eepyRtiA", "text": ["My husband and I stoped in here on our way from TN to petit jean park. It was amazing! We wanted to get some lunch in Memphis but the restaurant we tried to...", "BJ's is one of our favorite restaurants to go to when traveling near one. There are always tons of options to choose from on the menu and I've never been...", "Great service, clean restaurant and nice atmosphere. We started with the Honey Sriracha Brussel Sprouts. They are so tasty, the lightly spread sauce is just..."], "rating": [5, 4, 4], "TBscore": [0.75, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["lunch"], [], []]}
{"id": "AHe2CCzTSgtfjbl2Kh4neg", "text": ["The food is ok, but we always have a great time playing the games! If you do get food, you should def get the packs that comes with food plus play cards, it...", "I have to echo many of he reviews of bad service! The service is horrible and no one even bothers to make it right! \n\nOn my visit; the place was not packed...", "We went to the Little Rock, AR location for my birthday 11-24-18, we were looking forward to playing the games which looked really fun but we weren't able..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "zhNBoWSEhji1eq8WzDzLVw", "text": ["This Pizza Hut is just a carry out place. We've ordered pizza here a couple of times to serve at our Bible Studies. The pizzas are good but fall short of...", "Got my order wrong twice on a delivery ordered a dinner box with cheese sticks and got bread sticks and  the manager told me They would send out my cheese...", "I am traveling through Sherwood, Arkansas and staying at a local hotel.  10:30 p.m. and I called PH to order delivery.  The employee answered politely..."], "rating": [3, 1, 1], "TBscore": [0.35, -0.5, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["pizza"], ["dinner"], []]}
{"id": "ftAXrY41DfnCzIIbBebTFA", "text": ["Very friendly staff.  The food is average.  They use to have all-you-can-eat wings for for 9.99 for lunch, but it's a lot more than that now.", "This actually takes the prize for worst dining experience ever. The wings were small and tasted awful. Wait staff was in no hurry to take orders or deliver...", "This was terrible! The wings look like they came from a baby chicken.    Maybe it was a bad chickend week."], "rating": [3, 1, 1], "TBscore": [0.28, -0.56, -0.77], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["wings", "lunch"], ["wings"], ["wings", "chicken"]]}
{"id": "F0YLLYQp87liKJ3Z_EdX3g", "text": ["My husband had the chicken and shrimp dish. Chicken was tough, could hardly cut it. I was given a plastic spoon to eat my spoon with. Salads were fine....", "I can never understand why they want to seat you at the kitchen door, even though there are only a handful of people in the restaurant. Waiter was very...", "While there , we witnessed four sets of people leave. It took us about 15-20 minutes before we even saw a hostess. The hostess then proceeded to be racists..."], "rating": [1, 2, 1], "TBscore": [-0.29, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [["chicken"], [], []]}
{"id": "2cVeqr6b1azzrYGERpjPOQ", "text": ["I chose this place because my meat and potatoes man is picky. Also he was scheduled for surgery so I was trying to be considerate. I however am more...", "Saw the low ratings here, but due to being on a time crunch, we decided to give this place a chance.  Big mistake!  The service was good, but the food was a...", "The place was near empty on a Sunday...during football season (which should tell you something).\n\nEven with it being near empty, food wait time was longer..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "U4PcdjfUq3SC6I-h8JwX0g", "text": ["I went in last Friday and ordered two double cheeseburgers and a medium onion rings. I got back to my office, and discovered that they were just regular...", "Do you like cold starchy fries?  Neither do I however, that's what I was served at 9:45 this evening. The Whopper was cold and the cheese wasn't melted and...", "I order two whoppers combo with no cheese and no onion,this employees up here they don't care they rude and if you tell them about the order been wrong they..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "E0dZhe9AI8eMElAO68zu4A", "text": ["This Sonic is down right atrocious. The food is unbelievably awful. The only thing that was right was my Sprite. I wish we could give zero stars. Don't ever...", "Took long for our order, staff was not the nicest, and don't get the coconut shake because it is just vanilla sprinkled with a pinch of coconut. We will...", "Chilli cheese coney is pretty on the spot."], "rating": [1, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "Tw5eiQNX-6KU3fuL9XbdDQ", "text": ["Very friendly , very clean , and very consistent food! Been to this location 5x so far since moving to NLR, A+++¥¥", "What a revelation!  The Original Recipe is awesome and so delicious.  This location has clean tables, floors and an amazing staff.   I love it!  I will...", "Wow the black lady working the buffet is super pissed off today.   Don't know what her problem is but stay away I herd her snap at a customer for asking for..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "eYpIU7orWerpCz7Rq9k36A", "text": ["Go there often when in town. Great home cooking and delicious pies. Reasonable prices and great service. It is cafeteria style and soooo much to choose from.", "Okay, let's be real, they're only open 5 days a week for 4 hours. AND they're still in business...it's got to be THAT good right? YES. If you're in the mood...", "Ah, Holly's. The one place in Conway where you can drown your sorrows or celebrate your successes in southern food that is piled so high, it will be falling..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "PaEzGxuCflE-WsRsUCU-iQ", "text": ["My Wife and I moved from West Little Rock to Conway a few Months ago and were excited to see there was a Slim Chickens located near our Apartment. So...", "Slim chicken strikes again with the bad tasting soda. How they get it wrong so often I am not sure. \n\nOrdered waffles and chicken. They put the butter in...", "Ordered from their League City Branch last night - first time.  I repeated the order twice at the speaker, repeated it again at the window.  When the order..."], "rating": [4, 1, 2], "TBscore": [0.0, -0.53, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], ["waffle", "chicken"], []]}
{"id": "UPquuUsw18g4QdBWeWc9zQ", "text": ["I really have no complaints about this place so 5 stars it is!  I decided to try this spot while in town for work, looking for vegetarian, healthy, take out...", "The gyros here are delicious. Plus, I love the atmosphere. Good restaurant for a casual date night, and it's also a good place to get takeout.", "I've never had a problem eating-in at Taziki's but take out or using a delivery service such as Bite Squad has been a different story. For the third  time,..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "Iv079B1pgBWxp6AlWlaxZQ", "text": ["Love this place.  Drive over from Sherwood regularly.  All the products are  first rate without the Whole Paycheck prices.  Everything is quality; meats,...", "Everything is extremely overpriced. The off-brands at Fresh Market aren't even good. I would have rated one star, but there is a wide selection of food and...", "Their service is terrible, especially if you're dealing with the butchers in the back. TWICE they messed up our meat orders. First time, there was pieces of..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "IuwjQBO4qOT10NTSZyakrw", "text": ["So good! The food was amazing and the service was even better! We got crab legs, shrimp and corn. Garlic sauce was my favorite but Cajun was good as well....", "The mussels were not West Coast mussels they were frozen New Zealand green lip. The clam chowder was microwaved and not very good. The price points are not...", "I should out by saying that I do not know how to review this. The look of the place seems to be more of a fast food place than a higher class restaurant but..."], "rating": [5, 1, 3], "TBscore": [0.66, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["corn"], [], []]}
{"id": "GPeX9o85mxFOkch2hUdqaQ", "text": ["i live 5 minutes away from this food truck and when i tell you me and my family come here 3-4 times a week, man. the food and workers are amazing. i'm not...", "This place is fast, cheap, and has fried sushi! In under 12 minutes, I got my full order of:\n-Fried california roll for $3! It was sliced and then fried so...", "Impressed!.... My wife had the hibachi chicken and I had the steak and both had great flavor. The rice was ok...a little bland.. However, the crazy crab..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["sushi"], ["chicken", "steak"]]}
{"id": "FktpzaOUbKydNo10ZJP-jg", "text": ["Mmm, Kroger!\nTo some extent, a grocery store is a grocery store. The best one is the one that's got everything you're looking for and you know where to find...", "Extremely poor customer service - yesterday, I was in the self check out line when a machine error occurred - I waited to be acknowledged for more than ten...", "For this to be in a good location, it's really ran down. Don't go there for cake and a card because you'll be disappointed. The lady at the bakery was..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["cake"]]}
{"id": "ve8m_oGaXZVteqfA91nbfQ", "text": ["My fiancé and I come here A LOT and every time without fail it is perfect! The staff are always amazing and friendly, our sandwiches are perfect every time,...", "This absolutely sucked I walked in ordered a simple foot long Italian herb and cheese pizza sub and the woman at the counter threw her arms in the air...", "This is one of my favorite Subway Restaurants in Little Rock.  When I came inside the store, I was in a short line.  I bought and received my food quickly...."], "rating": [5, 1, 4], "TBscore": [0.49, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["sandwich"], ["pizza", "italian"], []]}
{"id": "CXYa-VQ4uR7kmeuKEDkTuQ", "text": ["I am starting to wonder if I am eating in the same place as many of these reviews?  I became a fan of Firehouse Subs when I worked in Conway, Arkansas and...", "IF I COUKD GIVE A ZERO STAR I WONLD AND HERE IS WHY! I went here for lunch and my food had hair in it! I gave it back to them to remake. However, when they...", "The food tasted good as always, and was at our table quickly. However the staff was anything but friendly and many tables were dirty, even though there was..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], ["lunch"], []]}
{"id": "9naS8KM35ozFG8UMQ8ft-A", "text": ["It could just be me but I don't feel that the sandwich had much of a taste. I also don't feel like the sandwich Had enough me the bread was kind of stale...", "This was my first time going to a Jimmy Johns with a drive thru. Surprise! They are not very good at prioritizing between lobby and drive thru customers....", "Went to the Jimmy Johns For the first time today and was very disappointed. Seeing how it was my first time to eat here I wasn't sure what to order. The..."], "rating": [3, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [["sandwich"], [], []]}
{"id": "fhu8TQsuSFLuhHofAASCvg", "text": ["Every item on their menu is on average 75 cents (or more) higher than any other Subway location in Little Rock area. I went in to get a wrap. I was shocked...", "Food was fine.   But don't expect a free small cup to drink water with your sandwich.   They want you to purchase a plastic cup.   Nice to know before you...", "This is a typical Subway, but it doesn't carry the veggie patty sandwiches, which is a bummer."], "rating": [1, 1, 2], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], ["sandwich"], ["sandwich"]]}
{"id": "I0VUPSz6OVH1-3tcfSmnyA", "text": ["I've used Catering to You many times over the past three years and always found the staff to be very helpful and friendly until two days ago.  I called and...", "We had breakfast catered for a meeting. It was wonderful. Helpful staff, and the food was AMAZING! I will definitely choose them again.", "Catering to you is an excellent place for any of your catering needs.they catered my wedding reception the food was delicious my guests loved the..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.58, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], ["breakfast"], []]}
{"id": "XeCCX_bJ3482Qa09vY4IGw", "text": ["I love Pita Pit. The service and food is always great. I usually get the chicken caesar pita with my favorite veggies, secret sauce and I ask to grill the...", "I made a to go order online and it said that it would be ready in 20 minutes. I showed up, asked for my order and the guy pulled my ticket out of the...", "Talk about an amazing service. Food taste great and amazing service on top and you get a repeat customer."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["chicken"], [], []]}
{"id": "UKraISh3GwVAhniAnxrO4A", "text": ["Dine by the flight line!  Top the mains is in the old historic Central Flying Service / Flight Deck location so wether your a seasoned pilot or an aviation...", "Wow!  I expected The Flight deck, but I stayed for Top the Mains Café. Excellent food!  Had the pastrami Ruben and sweet potato fries!  Cooked to...", "Wendy and Augustine do a fantastic job. They have elevated airport dining to a new level! There's nothing better than eating great food and watching..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "XL2gx-LVWzh8f-sNEzyzrA", "text": ["If I had written this review at any time prior to this summer, this restaurant would have gotten four stars from me.  It has been one of my favorite lunch...", "I really like Panera but this location has changed. Service is slow, almost deliberately slow, and most of the service staff is not friendly.\n\nDone with...", "I just had such a satisfying meal! The black bean soup is absolutely delicious! I had the Turkey, Avocado BLT that was so packed with yumminess that I..."], "rating": [1, 2, 5], "TBscore": [0.25, 0.0, 0.36], "normalisedRating": [-0.6, -0.2, 1.0], "keywords": [["lunch"], [], ["turkey"]]}
{"id": "m8JbAcLzt6u2MTkAcxkRbA", "text": ["I use to love subway the people who made the sandwhiches was nice but when this lady came and check us out Friday I think it happen last week my aunt had...", "Just had the most cringeworthy experience I ever had at a Subway. I have been coming here for over a year now and the owner (who works there) knows me well....", "I wish I could give 0 stars.  \n\nI had a worker lie to my face, charge me double, and then WINK at me after she did it tonight.\n\nI wanted to order one of the..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "hYLI14wGF_XKB-x-NGrI0g", "text": ["I've eaten here twice out of necessity-  overpriced buffet with C- food. Will do in a pinch if you can tolerate over cooked southern food from a buffet....", "Sometimes I wonder how long Franke's can stay open. It's timeless, but it's also like going back in time. I would like to bring more people here, but I...", "I had fried chicken, greens, mashed potatoes, and a biscuit for lunch. Absolutely delicious! Fresh, real food and a great value. The berry pie was just..."], "rating": [2, 5, 4], "TBscore": [0.0, 0.0, 0.34], "normalisedRating": [-0.2, 1.0, 0.6], "keywords": [[], [], ["lunch", "chicken"]]}
{"id": "kySqUeAUnNPeHxSb82rL1A", "text": ["Came in for breakfast and the place was pretty busy.  Got waited on immediately- even though she apologized for being short handed. Clean, efficient, great...", "Walked in today with my family and only seen three tables were filled so it wasn't busy as usually, we were given dirty silverware's and was given our...", "By far the cleanest Waffle House I've ever been in! The workers were very nice and polite! Whether I'm dining in or taking WH to go, it's extremely fast!"], "rating": [5, 1, 5], "TBscore": [0.3, 0.0, 0.45], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["breakfast"], [], ["waffle"]]}
{"id": "8M6yx81Q5dIWaz_p1Jh0YA", "text": ["Quick stop for breakfast in Little Rock. This place is small. Menu is limited. But...good food great staff. Our waitress was funny and informative. She...", "The worst.   Horrible wait staff.  Asked for sweet and lo, and there was none - until a regular came in and then they had so much of the pink stuff.  Asked...", "Everyone was polite, service was fast, the booths were clean, and the food was fine. The only thing I had a problem with was that they don't put blueberries..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["breakfast"], [], []]}
{"id": "9rVxlsLShjjBx0XNa0FMoQ", "text": ["Hannah Banana gave us great service with a smile! The place was buzzing with energy from the happy employees. They were having a lot of fun which was...", "Hubby & I have never understood why Waffle House gets a bad rap?? Well, since they're no longer giant ashtrays - thank you, smoking laws! Always a solid...", "I have a weakness for Waffle House. Took our youngest for her first time. The waffle disappeared. The staff were very friendly and helpful. The food was great."], "rating": [5, 5, 4], "TBscore": [0.0, -0.23, 0.51], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["waffle"], ["waffle"]]}
{"id": "TTYFBRQctqhIbVtSOKIrJQ", "text": ["This is the worst Waffle House EVER! I came on the night shift and the waitress was rude first off, the cook was outside selling drugs to a car parked by...", "This is the worst Waffle House that I've ever been at! If I could rate it less that one star, I would! Due to poor service alone, this establishment should...", "It's the Waffle House - it's good for breakfast or a late night craving, and it's inexpensive. What more can you say? Well, plenty in this case.\n\nEvery time..."], "rating": [1, 1, 2], "TBscore": [-0.26, -0.43, 0.3], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [["waffle"], ["waffle"], ["waffle", "breakfast"]]}
{"id": "Af47nvJhP7diqKkQaElQFg", "text": ["The service is terrible; that's why I like this location. Nine times out of ten, something about my order will be fucked.  I keep coming back because that...", "So, I got here at 10:15 to place two to-go orders. It's now past 11:00 and I only ordered two hash brown bowls. Absolutely the worst service I've ever seen...", "What an awful experience! ... We (party of seven) visited on a weeknight. There were a number of staff present, and the restaurant wasn't overly packed with..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "ODJnOfS04x4E_Pvd3zyWrg", "text": ["They place was packed and we stood in line for our turn to be seated, they even had a door greater taking names.\n\nAfter 20 minutes most of the restaurant...", "FOR A WAFFLE HOUSE, excellent experience and deserves four stars. \n\nThe waiter was kind and helpful. The food was served quickly and was all delicious....", "This Waffle House is very good\n\nKind of dirty but the waiter was nice\n\nGood food. \n\nQuick service. \n\n:)"], "rating": [1, 4, 5], "TBscore": [0.0, 0.73, 0.43], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], ["waffle"], ["waffle"]]}
{"id": "1qYkXOsSO33u_XrpHXrsdA", "text": ["So we opted NOT to eat the motel complimentary breakfast (my belly does not compliment that breakfast). Instead, we walked the 50 steps over to the Waffle...", "Little upgrades have helped this place substantially! \n\nNew Menu was a much needed change!", "Great food. Amazing cook. Nice hosts. Clean interior. Very much the diner feel I enjoy. Great for breakfast."], "rating": [3, 4, 5], "TBscore": [0.3, 0.0, 0.55], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [["waffle", "breakfast"], [], ["breakfast"]]}
{"id": "SQAuVfTy72U1A40xxrAN8g", "text": ["Came to this location for my cousin's first time while she was in town visiting from CA. The one off Main Street was packed and seemed to be moving SLOW....", "waitresses were talking and several tables were uncleaned..they were not busy.....been eating there a long time...not so much anymore", "It's waffle house........\n\nLet's face it, we don't go here for their fine cuisine!! I will say our Waffle Houses here in Cabot are always consistent and we..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], ["waffle"]]}
{"id": "15q3XqdDRIR_WRB4VZC4dw", "text": ["This is my favorite place to go on the weekends after being out late with friends it's a friendly place and is open late the food is quick the waiters are...", "I've been stuck out West for the past 2 years. I'm originally from the south where a WH is on every corner. First it's great to be home!!!!! Second this WH...", "Waffle House is the type of place where you eat if you have nowhere else to go. I came here for a quick bite with a friend, ordered hash browns (they were..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], ["waffle"]]}
{"id": "Tk7rH56axK3ZFnQoOq-ocw", "text": ["I was excited to try this place because there isn't one where I'm from. We ordered the buford combo, a baconzilla, 5pc medium hot wings, and 5pc Asian kick....", "I called to see if they were open and was told they're out of food and nothing is left. They're close at 2:30 30 minutes before they were supposed to close....", "Waited 20 minutes for the employee to finish smoking his blunt in a car full of people to order, only to find out there was another employee in there who..."], "rating": [2, 1, 2], "TBscore": [0.21, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.2], "keywords": [["wings"], [], []]}
{"id": "p1sAjNKhKoNGWWfRPpZzPQ", "text": ["Came to this unique restaurant after hearing about it from my mom! This place was recommended in the \"only in Arkansas\" magazine and has been around since...", "I loooove their burgers and shakes. Their seasoned fries are out of this world. My mom's favorite (if she doesn't get their all day breakfast) is their...", "So I've seen this place on a few of those \"interesting restaurants in Arkansas you need to try\" lists on Facebook and today decided we would run out there..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["breakfast", "burger"], []]}
{"id": "CVbx0gKMXPfefEOKeBlZbw", "text": ["1st time trying Red Robin and hate that I've missed out all this time. \nGreat atmosphere inside. It was a busy Saturday lunch rush and we got seated right...", "OMG! I have no idea why I didn't come here sooner! The bottomless fries were enough to keep me happy. They were delicious and our server was so attentive to...", "This was only my second Red Robin experience. I have to say that both location I have been to have a friendly atmosphere and most of the staff are welcoming..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["lunch"], [], []]}
{"id": "7VKUDMYhG4icxVo0QAvi7w", "text": ["The staff was occupied with other workers and their dates than preparing my order correctly. The french fries were cold and my drink had very little ice. No...", "Took forever and ended up throwing most of it away. Gross. Super messy, could hardly eat it.", "I spent over $30 on food just to receive it COLD, HARD, and Nasty!!!!! I no longer like Rally's."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "XAsOTnMs5LVFgMIMSsSWwg", "text": ["The worst ever, Mcdonalds rib sandwhich has a 5 star rating compared to Smitty,s. Smitty,s meat was so fatty, I spent more time spitting out the fat then I...", "Great food and good prices. Serving sizes are just right. Service is excellent and atmosphere is nice and quiet. I'm so glad we tried this place. \n\nFood we...", "Stopped in on a Wed at 2pm.  Not too good so far.  Was seated at the only table without bbq sauce. (Turned out to be catsup)  Asked for  root beer and told..."], "rating": [1, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "9_i3C3nBD3N7yUGLkZUlxQ", "text": ["Was on the quest for the best cinnamon roll in Little Rock today, and two friends recommended this bakery. \n\nIt did not disappoint!\n\nWe got a variety of...", "Fresh bread and friendly service! As soon as you come in you get greeted by the staff and the smell of freshly baked bread. I love this place! Their...", "This is my favorite bakery in Little Rock and has been much needed on this side of town! Their cinnamon rolls are huge and delicious. My husband commented..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "ZC3VUQ4WTeahTHH3g_chcA", "text": ["Shipley's is a nostalgic straight forward donut shop.  Great sausage kolaches, cake donuts, and even breakfast tacos! If you want good donuts, without a...", "Best donuts in the world! Sometime they give you extra donut holes for free. The staff is super friendly and fairly quick in the morning. This is by far my...", "Holy crap. Expensive, small donuts. The woman who checked us out padded one dollar to our bill! She silently removed it when we mentioned something. Will..."], "rating": [5, 5, 1], "TBscore": [0.35, 0.36, -0.4], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["donut", "cake", "breakfast", "tacos"], ["donut"], ["donut"]]}
{"id": "zi461E41ihVc5P2Af6Qf4A", "text": ["I had a apple fritter and a chocolate cake donut. Best donuts of my life. I am 31 and a donut snob. Donuts are my favorite indulgence. Apple fritter was...", "I've been to Shipley in Houston and was so happy to see they had locations in Little Rock! These donuts are the marriage between Krispy Kreme and Dunkin's....", "GO HERE!\nShipley's is my All Time Best Donuts Ever place! \nI now live in Seattle near some fairly famous donuts places. Here in town we have the \"hand..."], "rating": [5, 4, 5], "TBscore": [0.75, 0.28, 0.43], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["donut", "cake"], ["donut"], ["donut"]]}
{"id": "gFMLM5jLgGFUGDr7fkTx2A", "text": ["We got there about 5:20am. Jalapeno kolaches were awesome! We got them as they were coming out of the oven. Mini kolaches were eaten up by my 6 yr old....", "Fun selection of donuts that are fresh and delicious!  They also have several selections of pigs in a blanket.  Good prices and friendly staff/owners.", "Love this place! The donuts are delicious and the staff is great! Best donut shop in Royse City!!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.45, 0.91], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["donut"], ["donut"]]}
{"id": "Bt5ixZeVmvw-KGQiipyJYg", "text": ["I hit the jackpot!! I came in at just the right time! Freshly baked Kolache right out of the oven!! The dough is so crunchy and the hotdog cooked perfectly....", "Wow, the Kolaches are so good. The kolache dough was light, airy, and cheery. The sausage in the center was cheesy and juicy.\n\nThe family working here was...", "Great donuts!! What I enjoyed best about this visit was the EXTREME friendliness of the employees! Very hospitable and inviting, just a great way to start..."], "rating": [5, 5, 5], "TBscore": [0.53, 0.0, 0.56], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["hotdog"], [], ["donut"]]}
{"id": "zvTKIQqxtuR4waJuoB9Z2g", "text": ["Nothing is made fresh daily, you walk in and don't smell any fresh bread or donuts . The display case is empty , they microwave your food for like 10secs in...", "You will never find a better donut. They do charge extra if you pay with card. Try to go before 10 am or the donuts just aren't the same and they might...", "They always sell cold donuts. One time she gave me a bag of thawed out donut holes that weren't frozen solid but were ice cold and when I went back in and..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, -0.3], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "FTKM3cjtzygGNd-Ft_a7vg", "text": ["My family LOVES Daylight! The donuts are always soft and fluffy, the people are super nice", "Not a local - stopped in as they were closing and the friendly staff gave us more donuts than we needed but we were happy to try what they have to offer...", "I have had daylight donuts on a whim. They were pretty good. The glazed is pretty much sugar coated with sugar crystals. The jelly filled were on point though!"], "rating": [5, 4, 4], "TBscore": [0.21, 0.42, 0.38], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "FMTvLvzAuQL7f98u-YQ9mQ", "text": ["Great donuts. Had a nice selection and open early.", "Open early. Good doughnut selection and breakfast sandwiches. Staff has always been extremely pleasant and helpful! They work hard to make you feel like a...", "Love this place! I used to stop by here every morning on my way to classes when I lived in the area, I still come by, but not as much. Everything is always..."], "rating": [5, 5, 5], "TBscore": [0.38, 0.28, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], ["donut", "breakfast", "sandwich"], []]}
{"id": "onEEk7hpyE1hMocnJ2ZUQg", "text": ["Awesomeness. Really that is all that can and should be said, AWESOMENESS! Best donuts around. If you want one for you, or 3 dozen for the office, they got...", "Best place for the freshest donuts in saline county. They're hot, fresh and not brought in frozen off a truck.   The apple fritters actually have chunks of...", "We have four guests staying with us so we were on the hunt for donuts for a morning treat. These are definitely some of the best donuts I have had in..."], "rating": [5, 5, 5], "TBscore": [0.62, 0.39, 0.5], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "_TIpvUUhjiLI8x-QVEB9ZQ", "text": ["My favorite donut shop in Saline County! I buy from them once a week for the fam and we love eating their donuts. The weekend staff is friendly and even...", "These donuts are delicious! The donut holes, glazed yeast, and maple iced were our favorites! We stopped in on a long road trip home and the ladies here...", "Best around, when I take my Grandkids they always say they are having the best day ever...love the strawberry  covered glazed,  cinnamon rolls, Apple..."], "rating": [5, 5, 5], "TBscore": [0.5, 0.47, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["donut"], ["donut"], []]}
{"id": "_s0Xi59c7AfmJA2JGgIjMQ", "text": ["Not quite sure if it's because I bought some munchkins and donuts at night or if it's just this location, but the donuts were not impressive. I've had a...", "Waited in line for 15 minutes for a bagel with cream cheese and large black coffee.... \nBagel only has cream cheese on half... Tried to spread it out to...", "For the second time in one week, no one is at the store at six let alone their opening time of five. If you arrive at five, they usually aren't ready when..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["donut"], [], []]}
{"id": "rCNp_UWuW3rlhJ03nbvywQ", "text": ["I am not a huge donut lover, but this is the best glazed donut I have ever had in my life. I am currently, very careful of my sugar intake, so I only eat...", "I live on the other side of town. When I visit family late morning. I live the fact that they still is open and serving. The staff is very sweet, coffee is...", "Amazing melt-in-your-mouth doughnuts. Awesome service. The doughnuts are well above average and they sell an assortment of other breakfast items. The..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["donut"], [], ["donut", "breakfast"]]}
{"id": "j8iI8fCNWe4KRNHKKsdk_Q", "text": ["The best Kolache's in town. This place is often imitated but never duplicated. By far the best shipleys around.", "Whenever I go home to visit the fam in Arkansas I have to get a donut from the best donut shop in all of the whole wide world!!!!!!.SHIPLEY'S DONUTS! I'm...", "Omg the donuts are amazing. The owner is so friendly always has a smile on. We got strawberry filled, raspberry   Filled coconut glazed and cinnamon sugar...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.36, 0.42], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["donut"], ["donut"]]}
{"id": "LbCqoAszV0XRfbCrtvkJtw", "text": ["I got the donut holes and jalapeño cheese kolachi and the kolachi was absolutely awful, like the bread was just so thick when it's normally flaky bc it's...", "Even though this place is busy, the girl here seems really enthusiastic about her job. She's really happy & cheerful to serve you. :)", "I went in the other morning around 6am and wanted a biscuit and gravy. I asked if they served this and before I even got my question out the woman snapped..."], "rating": [2, 5, 1], "TBscore": [-0.38, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, -0.6], "keywords": [["donut"], [], []]}
{"id": "maQZ_xzuCLYEhcjGXpK7-Q", "text": ["I've been to this location twice. Once on National Donut Day (June 1) and it was packed with people inside and in the drive thru yet they were very...", "Brand spanking new and doggone GOOD! \n\nI'm a (unapologetic) sucker for the \"hot sign!\" (Lucky for me, I can eat just ONE!) I literally can't drive by, and...", "Donuts are very good!! I went for a new speciality donut and they were out when I arrived.  The young man at the counter ask the manager or person in charge..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.41], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["donut"], [], ["donut"]]}
{"id": "wD02BoJ14aVi_4xzJxHMhA", "text": ["This place caught us TOTALLY by surprise! We were in England on a job asssignment & didn't have much hope for lunch options, other than the regular boring...", "Ah, Cajun, my favorite cuisine.  \n\nI ordered Duck Drummettes with Red Rooster Sauce ($7.99) & a bowl of File' Gumbo ($11.99).  \n\nThe Drummettes put chicken...", "Great food and great service    Thank you Makayla and Ms Denise for a delicious breakfast.  Y'all this is a great place to eat.  Stop in and get full.  We..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.75], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], ["chicken"], ["breakfast"]]}
{"id": "OfkSQljv3WcCR-eisHvF-g", "text": ["Most definitely my favorite Moe's! Friendly service, relatively clean, but the steak is Yuuuummmy!  Earmuffs with steak and cilantro rice! O.M.G. Good!", "My husband LOVES Moe's! He works crazy hours so I normally have to go get us dinner. It seems like lately when I go there it is a lot of high schoolers who...", "Moes is the bomb dot com. Excellent service and the restaurant was very clean and well put together. The salsa bar was delicious and the chips were fried..."], "rating": [5, 1, 5], "TBscore": [0.59, 0.0, 0.83], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["steak"], ["dinner"], ["bar"]]}
{"id": "ifhKNi44S2tB0-4uHK1ZIg", "text": ["My husband and I stopped here for lunch on a long road trip and are not disappointed. I'm writing this as he's scarfing down his crunch wrap type thing...", "Fresh food. Greater with a smile. Always quick and happy to help. I would recommend this location to anyone.", "Where can I begin after my cold burrito. Yes we have no steak, guacamole, cilantro or the hatch chili sauce. They found some hatch sauce in the back and I..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, -0.3], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["lunch"], [], ["steak"]]}
{"id": "8Vxw0EJ9MurpFvy3h2SpJA", "text": ["Other then being a very load atmosphere food is excellent. Had a bit of everything NEVER disappointed.", "There salads are so fresh ( tell them you want them before you get your steak or this is not guaranteed because the kitchen can get behind )  The rib-eyes...", "Have waited 1 1/2 hours. I'm disabled and a diabetic that took my insulin before the wait. Staff showed no compassion or offered any help. Was with family..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["steak"], []]}
{"id": "v31sFnAGfGO5JhdVSR1kRA", "text": ["After my first experience, I wanted to go back and give it another try. I tried their Meatlovers this time, and it was REALLY good.  The place has a cool...", "Love the pizza here. It's like a NY pizza which is my favorite. Been here like five times and my go to place. I love the create your own pizza theme.", "I liked their thin crust it was just right and the flavors were awesome.   I really enjoyed this pizza joint. Art Lovers w/ pepperoni just tasty."], "rating": [5, 5, 4], "TBscore": [0.0, 0.53, 0.4], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "xSablXdV3BdCN3pCCFFO2w", "text": ["This place is part of my hood. Dont go to hating on this place. Seriously. The owner is a St. Louis Cardinal fan who loves Jerry!! Gotta step back and...", "This place is 5's all the way!!!  We showed up 15-minutes till close and they were happy for us to be there....the pizza was fantastic!!!  The 10\" deluxe...", "This is our go-to spot for picking up pizza to go! The pizzas are delicious, as are the salads. Service is great, whether we're carrying out or eating in...."], "rating": [4, 5, 5], "TBscore": [0.0, 0.73, 0.9], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "fIoJOHJYu9CoGj4XPf6x3A", "text": ["The lunch buffet is amazing. They don't pinch pennies and have a steady stream of pizzas of various flavors. The standards cheese and pepperoni but also ,...", "I wept.  It was beautiful.   The pizza parade made my eyes well as they brought pizza after pizza hot from the oven through to the tables.  A buffet that...", "I usually travel with someone or on foot. This day I ran and walked.  When I made it downtown, I decided to eat at Larry's Pizza.  The buffet is always..."], "rating": [5, 5, 5], "TBscore": [0.26, 0.28, -0.25], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch", "pizza"], ["pizza"], ["pizza"]]}
{"id": "HN--TfnSuPYIE8JQxvSpJg", "text": ["Great food! And a to-go cup!!! \nThe staff are wonderful! \nAnd the environment is awesome!", "This is one of the friendliness places I been to in awhile,they seem happy to be at work. When the waitress took our order, she recommended what she thought...", "Slow service, bill was brought with two items missing one of which was the dessert I ordered. Had to wait for a new bill and for the dessert to be made..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "uGEs-Kq1QkpOT4iq8ehGOw", "text": ["You want what on your pizza? You can get it here. My kid's favorites are the Cheese Alfredo and Snickerdoodle pizzas. The adults like the baked potato with...", "this place is right by my job and they're always smiling when i walk in and know i want my cheese pizza. they also have a blt and cheese & pineapple pizza...", "Five stars for this place!!  Every time I take my boys here for pizza the manager and staff are amazingly nice to us!!!  They have some weird pizzas, but..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.29, 0.25], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "I3dpi03_CNt-gM_X40yZ-A", "text": ["Wow didn't expect this coming....\n\nMy friends came here to order pizza, little did I know the content that would be inside the 3 pies. Before I get into the...", "Super friendly staff! This place gets 5 stars for the customer service. Pizza was great too but the service was off the charts! Restaurant was clean and the...", "Everybody knows about the pizza. Very creative. Consistent. As the Bible says \"if it were not so I would have told you\".  My favorite thing about this..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.54, 0.47], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "u9gqSOho2cR-RIF7NcQJjw", "text": ["Favorite pizza spot in Little Rock. It's delicious every single time and the crust is something everyone needs to experience, they even give out honey to...", "Friendly staff \nQuick service \n\nThe seating area indoors is smaller but the patio is beautiful and welcoming. The pizza I tried was the spicy chicken which...", "Love this place. There are many pizza options. A wide selection of salads too. The only appetizer is cheese bread. It was good. The veggie alfredo pizza was..."], "rating": [5, 4, 4], "TBscore": [0.31, 0.0, 0.32], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["pizza"], ["pizza", "chicken"], ["pizza"]]}
{"id": "RIn-FbAx3pR3bphtKjgY8g", "text": ["I agree it is a dive bar but I think the atmosphere is great the drinks are great and some of the best food in town definitely worth it.", "Tried it a couple of times.  Disappointing food for brunch.  The champagne bucket is a very fair deal, only $6.00, and it comes with a carafe of OJ and...", "All these people giving Pizza D a bad review are not being objective.  If you don't like cigarette smoke or smell then don't go. Pizza D has been a smoking..."], "rating": [5, 3, 5], "TBscore": [0.72, 0.0, -0.35], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["bar"], ["brunch"], ["pizza"]]}
{"id": "Je3vGIGfb7UDXOFUUNeKVQ", "text": ["Great place for a quick bite. Great concept and good food. It is obviously not gourmet pizza, but it is good for what it is.", "Manager had an attitude when our family came through the door\nShe didn't address us when we came in \nLooked at us rolled her eyes \nAsked us what kind of...", "Came in with my family after eating at a Pie Five in Branson a couple of weeks ago. The location in Branson  was awesome!!!!   This one in Little Rock by..."], "rating": [4, 1, 1], "TBscore": [0.56, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["pizza"], [], []]}
{"id": "-dLVN4yDsozkQMxH4U2LgA", "text": ["Had a thick crust pizza with some veggie toppings. Wanted it delivered, but at 8pm it was an hour wait for delivery. So picked it up- not a huge deal just...", "We decided to give Marco's a try based on positive reviews.  We were blown away by the quality of the pizza. The sauce was very smooth and tasty, like it...", "While looking for a bulk order on Father's Day, we decided to try out Marco's Pizza, for two reasons: \nA) They were actually open on Sunday. \nB) We had..."], "rating": [4, 5, 3], "TBscore": [-0.25, 0.37, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "7jVA2C2mNibuXPCDp3HU7w", "text": ["We get pizza from here all the time. It's basically supplanted cheap delivery for us. The ingredients are top-notch, the price is fair, and pizza tastes...", "I was so disappointed this trip. I have been going to THIS papa murphys since it opened and have absolutely loved it. The staff has always been so kind and...", "My new favorite pizza place! Fresh ingredients and neatly made. Only thing i do not like is transferring the pizza, the dough usually comes apart but once..."], "rating": [5, 1, 5], "TBscore": [0.7, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "0MWucDxouXPuAJtdaT2Vtg", "text": ["Still waiting on my delivery order has been over an hour called into to see about my order the gentleman answering the phone had a I dont care additude mor...", "Came here due to the location being right across from THE WELL which is my bf's favorite.  \nThey have specials so we got a large supreme pizza which was...", "Another great pizza and delivery??? Nope they are better than that!!! Timing is great and good exceptionally good!!"], "rating": [1, 3, 5], "TBscore": [0.0, 0.22, 0.86], "normalisedRating": [-0.6, 0.2, 1.0], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "BagEbc16vKxr9Sd5Phf1OQ", "text": ["Is this the best pizza in North Little Rock, no, but is it a solid option with incredible customer service and a great value for some darn tasty pizza?...", "Ordered from Larry's for the first time this evening. We've found our new fav pizza place! Small taco pizza, large pepperoni pizza, Small cheese bread and a...", "We love ordering the Buffalo Chicken Ranch here to go, unless we do the buffet, which the kids love. Such a great variety and fresh to order! Glad it is so..."], "rating": [5, 5, 5], "TBscore": [0.5, 0.0, 0.3], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["chicken"]]}
{"id": "XWWFXNYPEjDPddt_yEKwKQ", "text": ["If you are a pizza lover, your going to want to stop in and get a pizza for sure! I get the loaded barrel (it's a supreme pizza). On the thin crust which is...", "Verdict: If you can shotgun a pizza like you can shotgun a beer, that's what I'd be doing here.\n\nMy Shotgun pizza was fantastic. I'm picky when it comes to...", "This is an interesting review. Shotgun Dan's is not the best pizza you've ever had. It's honestly not even 4 star pizza if you are ranking pizza by 1-5..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.4, 0.4], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "nI1n2U93gVTB6lIDGwQQ0g", "text": ["I've been eating Larry's Pizza for over 20 years.  We recently moved to Bryant and now we live less than a few minutes from this location.  Super...", "On my way to Texas, I stopped in Bryant to stay overnight. I checked Yelp for some recommendations. I decided on Larry's because it's a buffet and I didn't...", "When you want to see everyone else in Saline County Arkansas, go here on Tuesday and Friday nights, for the buffet... When you just want a yummy pizza..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "0rVjK4-VsVJYStV9RLywYA", "text": ["This is a bullshit establishment!! these no cooking mf'rs put beef on top of cheese on a 16 inch hamburger pizza, and that shit rolled right off when I got...", "Had the Philly for lunch, and sampled a small piece of Hawaiian and BBQ chicken.\n\nPhilly steak was amazing, the bun may have been a bit older than ideal,...", "We had Philly Steak Sandwiches and they were great!  Good food, cooked to order and reasonably priced!"], "rating": [1, 4, 4], "TBscore": [0.0, 0.0, 0.65], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [["hamburger", "beef", "pizza"], ["lunch", "steak"], ["sandwich", "steak"]]}
{"id": "nJ34AP2EFEcD8LbjjAlMhw", "text": ["The pizza from this location is always wonderful. I love to order from the app and when we pick up our orders, it's always fresh, staff is really friendly...", "I am very grateful that they deliver in East End. I have never had a bad experience with them. We order fairly frequently as well.", "Last night was our 3rd order from this East End Pizza Hut - won't be our last. The pizza is very good - love the hand tossed crust. Delivery is fast &..."], "rating": [5, 5, 5], "TBscore": [0.54, 0.0, 0.27], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "SxXyjjrksk8B5qQJvMZ0Lg", "text": ["Just discovered this gem recently. Amazing pizza! Best in Benton/Bryant. We have ordered this pizza three weeks in a row and can't stop. Keep it up Paxton!", "Decided to try the place out. It is carry out only. Make sure to go to their Bryant location. Their website still has there old location on it. I got the...", "I am a pizza guy...I have been working with youth for 18 years, so I eat A LOT of pizza!!  So it has to be really good for me to want to eat it and I have..."], "rating": [5, 3, 4], "TBscore": [0.88, 0.0, 0.7], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "ZLzfciCbG2J3j9d7CGEwTQ", "text": ["Visiting town,  I found a want for italian food.  Looking around,  I found this little place that was completely empty.  I went in with my friend,  and...", "I saw the google reviews here it was a 4star so I thought I'd try it. There aren't many pasta places around here. So I walked in. It's not fine dining....", "Pasta J's has been a hit and miss on quality of food and service.  Cantrell location has wonderful service and food is consistent.  The Bryant location, I..."], "rating": [3, 4, 2], "TBscore": [0.0, 0.0, 0.62], "normalisedRating": [0.2, 0.6, -0.2], "keywords": [["italian"], ["pasta"], ["pasta"]]}
{"id": "5ReNbIeQ9paeMPEZ5zoHIQ", "text": ["Took the advice of Yelpers and tried this spot. Since I was a single diner, I can only report on what I ordered, but it was very good. I had a cup of the...", "The 3 stars is for my Shrimp and grits only.\n\nTheir service was great, appetizer of jalapeños poppers were good and my husbands crawfish \nÉtouffée with...", "Nice hang out or dinner spot... The bar is full due to great happy hour prices.  We to Boudreau's at about 5:30pm, right on time for Happy Hour.  It was..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["dinner", "bar"]]}
{"id": "UsaqusYrtn9kyOvngTuxHg", "text": ["I am what I like to consider a regular customer at this location. But I may have to start going to a different one. The food here is fine although I can't...", "Waited 35 minutes for half a sandwich that I finally cancelled because I had to get back to work. They never apologized, and it took two people to ring up...", "Dined in this afternoon ... Waited 45 mins for a 10\" ... Wishing I had of just driven off rather than giving them time I'll never get back ..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], ["sandwich"], []]}
{"id": "oILFC6VpuNMjqOS0qIPzmA", "text": ["I got the spaghetti with meat sauce (it was ok) and my date got the chicken Alfredo which was amazing! And the tiramisu was phenomenal. My recommendations:...", "I have spent hundreds of dollars at this place in the last 6 months alone. They have good food BUT I ordered 2 kids spaghettis for a total of over $10 and...", "Nice place. Friendly, courteous staff.\nPasta well prepaired, sauces were spot on. I will return. If your in the area it is well worth your time."], "rating": [4, 1, 5], "TBscore": [0.29, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["chicken"], [], []]}
{"id": "Uxg8EcEW7z3f6T6HqwZQvw", "text": ["I read the scant reviews,and while I didn't expect much I hoped for the best..well EXCEPTIONAL is what I received!!A piping hot delicious pizza with extra...", "Have ordered on line from this place three times.  Would use the one on University Ave but when ordering it asks for your zip and this place is the one you...", "This is stupid. I waited more than two hours for my order. And I got bad \"service\" when I called. Shame on you ."], "rating": [5, 3, 1], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["pizza"], [], []]}
{"id": "1x5BW7HNHIypHCkUSa8cxg", "text": ["I've been here a few times for the buffet, and have not come to expect greatness...today was no exception. I arrived around 11:30 or so, and there were 3...", "Had a great lunch buffet on a budget, I tried some pizzas I've never had before $4.99 buffet was a great price.", "Yall, what had done happened to Pizza Hut? How are they even open? It's 8:00 and not a single person any where. Server/ employs laying in the booth on..."], "rating": [2, 5, 1], "TBscore": [0.0, 0.8, 0.0], "normalisedRating": [-0.2, 1.0, -0.6], "keywords": [[], ["lunch", "pizza"], ["pizza"]]}
{"id": "k592wazn6dN8UT6sdF-MlQ", "text": ["We were looking for a good dinner our only night in Little Rock, and decided on this restaurant. We were nervous going since we had read the negative...", "Each and every time I go here things just seem to get worse.  You would think I would learn and not come back, but it was my wife's birthday and for...", "My husband and I went in tonight and waited approx 15 minutes to be seated. When we were seated we were told our waitress would be right with us. Another..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["dinner"], [], []]}
{"id": "viCHVtEW3Xz1kE3p_JZ1zg", "text": ["Driving through from Houston to Nashville and stopped in before day 2 of our trip. \n\nBarista was super friendly. My family used to be regulars at the...", "Holy poop-nuggets, y'all - GO TO HERE!  Totally original & ingenious material, some locally targeted as a plus.  We've been to Second City in Chicago a few...", "This place was extremely entertaining! I came to Little Rock with a friend for a quick vacay and used yelp to help us find some cool things to do and this..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "A_iTaAk4SEINA8vwoBYnkw", "text": ["Near my house and I don't think I've ever waited in a line once here. This is probably the most epic star bucks in the world. I've never seen a Starbucks so...", "They have just renovated this one.  What a mess!  The ability to get a table near a plug is almost impossible.  The design is not functional at all.  High...", "To the young blond man who perfectly prepared my Chai tea latte soy milk 7 pumps: you were incredibly handsome.\nBest Starbucks ever ;)"], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "8TfFiWOb_X8ruD4-h0te8A", "text": ["Great service! Ordered in the drive thru, and drove right up to the window and our drinks were ready and made to order! Very friendly staff!", "Not the best Starbucks I've been to. The restroom was hot (like no A/C in there and it's 100 degrees outside). There was one customer ahead of me and it...", "So my experience today was not as good as usual. The girl at the window was dry and when I told her I had my own Starbucks cup, she didn't offer to transfer..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "LkXSAcmewo4XnCGj-qDMlQ", "text": ["I love my Starbucks here!!!! They all know me by name, SPELL it correctly and take such amazing care of me!\nThey are all so good to me and notice when I'm...", "I always receive great service here. This morning I was going to get the peppermint mocha but my Barista suggested the chair mocha and it is delicious! New...", "This is my morning stop. I can always count on them for timely service. Another great thing is the consistency of their great drinks keeps me coming..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "qfNFFaK4MSfoQwtanvWLSA", "text": ["This Starbucks doesn't have a drive thru, so I had to go inside, but it wasn't busy at all and I was able to get in and out in under 3 min which is a huge...", "Friendly staff, but like all Starbucks, they have extremely bitter coffee that feels like it is rotting the enamel off my teeth. Most people don't notice...", "A Starbucks, is a Starbucks, is a Starbucks.  And this is a Starbucks.  The only thing that really makes this one stand out is the very limited parking in..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "Xa8sasPIlCxWqpJ_sLHDoA", "text": ["Just like any other central Arkansas Starbucks. Rating based on Starbucks coffee, quickness, and efficiency.", "Except on rare occasions, this place reeks of the bathrooms. \n\nWhat's the point of remodeling and getting a mural and new furniture and everything when it...", "every time i come in here my socks are knocked off and they are so nice and charming and cute and beautful and i wish i had a family that's why i come here..."], "rating": [3, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "ut8sb5PB3TK8M05xLjNVEg", "text": ["Soooooo we just drove through our trust old reliable pal, and I hate to review this, but we are sadly disappointed. All we wanted were some quality vanilla...", "Went in for coffee and they were understaffed for a football weekend the line was long and when I did place my order they were out of coffee. Horrible....", "15 minutes to get to little speaker box to order my drink with 3 cars in front of me. Another 25 minutes to get my drink. Not fun.\n\nNot sure if it's due to..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "Weex5Cl2rqYAtSy-8SiLVA", "text": ["This Starbucks has been around for many years. A lot of times, more so than not, I drive the extra miles to get my morning latte at this location. Creamy...", "I went inside and the baristas were all talking to each other ignoring my whole group at the counter. After waiting 5 minutes just to have my order taken,...", "Can go here IF you can find a place to park. Stopped yesterday because found a spot open at far end of parking lot. Went inside & discovered I was the ONLY..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "QNdzSS9aWs-L_tqmIFcAdQ", "text": ["All the usual SB things here. And I try to find other coffee options. Not anything else open today sunday. No problem. Always really good coffee and latte...", "Nice employees but nearly everything is overpriced money in the trash. Terrible, uncomfortable seating, worst of any Starbucks, certainly of any coffee...", "Somewhere between the cash register and the ten steps to where you pick up, they lost my order. I stood there as others got their order. 7 employees behind..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "BBCaCGe1nct4K7t1hoEZcQ", "text": ["Liam was wonderful! After a long drive of 8 hours. Liam's attitude was appreciated! His cheerful demeanor and his efficient was very well appreciated!! He...", "There's this woman that works, I'm not going to mention her name for her sake, but she has the worst attitude! I pulled up to the window and she started...", "What an awful experience stopping for coffee on our road trip. We ordered ahead and thought we would be quick. The order was ready but they didn't have any..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "YRV-67FxTUs1A7aiNcTsag", "text": ["Love this locally owned coffee shop. Owners are so awesome and sweet. I also like the relaxing welcoming environment inside.", "Best coffee around. They take great pride in everything they do. They have begun roasting their own beans and take many chances that bring a little extra to...", "Brew Yaya is beyond amazing!! We held my sister's surprise bridal shower there and the owner, Barry, was an amazing help. He came up with a personalized..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "_MqqT_YDH63nlj-VcsTKBw", "text": ["Yelp picked us a winner when we wanted a coffee shop in a small town.  Great coffee, great tea, excellent pastries and plenty of space to sit and talk a...", "Staff was really polite and the chicken salad wrap is made fresh in house and was really good. Black and white kochi was amazing and they don't play the...", "I love going to Grinds , I always get great customer service and a small hometown feel. Good prices for what you get."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "QeDB-7tCN8ymlt0CdQ8VBg", "text": ["I travel a little bit farther to come to this Starbucks location. They make the creamiest lattes around! I have a Grande with Splenda and extra whip. No...", "This Starbucks like most is busy in the morning.  They have several spots to sit and enjoy the ambience.  The majority of the staff is friendly.  They have...", "So friendly! I'm here almost everyday. It's a home away from home. They remember me and my drink!"], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "wtmr2UrPcQ1QjDuQlr6Y4g", "text": ["My favorite item on the menu is the Nacho Salad.  There are no beans on it. Thank goodness.  It is just the right size and cheap.  The cheesecake chimis are...", "Ehh. Not much flavor. On a positive note it wasn't greasy. Nor was it hot or flavorful.", "Most excellent! Wife and I stopped in for lunch. The food, the service, the atmosphere all 5 stars! We can't wait until North Little Rock's location opens up."], "rating": [3, 2, 5], "TBscore": [0.0, 0.0, 0.44], "normalisedRating": [0.2, -0.2, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "sDvUqiFiL18EDziZX86kKA", "text": ["My family had an excellent experience at Tacos 4 Life!  We ordered almost every taco on the menu and each one was truly excellent.\n\nWe order to go, and...", "Best taco experience EVER!!!  Not your typical taco shop.  Such creative combinations and variety.  We tried three off the regular and summer menu.  \n1)...", "Let me just say that I am in the process of listening to a friend's complaint about the location in Benton.  Your employee (John, badge said trainer) he..."], "rating": [5, 5, 2], "TBscore": [1.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["tacos"], [], []]}
{"id": "c1TUJYm5A2UDxJqlEAsrZg", "text": ["I'd heard good things about this place, but I was surprised at how great the food was!  It's truer Mexican (not Tex Mex) so I sampled the tacos and tamales....", "Absolutely dynamite flavor. Very simple menu: tacos, tamales, quesadillas and soup.\nI had three tacos: adobada (pork), carne asada, and pollo asada. I had...", "So I have been driving by this place for a month or so and on a whim pulled in to check out the tacos. \n\nSo I get to the counter and check out the menu...."], "rating": [5, 5, 4], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["mexican", "tacos"], ["tacos"], ["tacos"]]}
{"id": "tMAL35BYJu9Pjt-6dqBh-A", "text": ["Best taco truck that I've been to. Quick service, great tasting food ... always love seeing the flag flying when it's lunch time. The chorizo streets are...", "This has become one of my favorite food trucks!  The tacos are top notch and the prices are very reasonable.  The portions are very generous in size with...", "Awesome street tacos and quesadillas- excellent green salsa- red salsa way too hot for my taste buds- but I know others love it.. She has added queso and..."], "rating": [5, 5, 5], "TBscore": [0.66, 0.4, 0.42], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], ["tacos"], ["tacos"]]}
{"id": "95r7AUkJi9E9gf_V7zVtJw", "text": ["This is my brother and niece's favorite Mexican Spot and I can see why. They have a very tasty white cheese dip that is smooth and rich with flavor. Also...", "I would say it's just okay. We started with the cheese dip which was very watery and the horchata which was good. My husband really liked his steak fajitas...", "Had a great serving of Carne Asada great flavor, large portion. Loved it. The Kids meals are not typical but good- a ham and cheese grilled (quesadilla)..."], "rating": [4, 3, 4], "TBscore": [0.25, 0.5, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["mexican"], ["steak"], []]}
{"id": "Mq9dZPs-kfXzWxadoedjsQ", "text": ["My first time at Blue Coast Burrito and it was awesome! My dad and I stopped by before heading home. I wasn't expecting what it looks like on the inside but...", "Not the best carnitas I have had, flour tortilla could barely hold all the goods and I went light on the toppings too. (Carnitas, cheese, pinto beans, green...", "Fast, friendly, and delicious. I go here for lunch alot but great any time of the day. The food is fresh and very good!"], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.61], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "KSGRfIIhJNd_dNJTaEa8Ig", "text": ["This was our first visit and it was awesome. When we came in the line was all the way to the door and they were slammed with a large group. No worries...", "I love this place - the mission, the staff, the queso. The chips/queso is addicting - I find myself craving it often.", "Eat to heal the world, and help end childhood hunger???? Don't mind if I do! \n\nWe were 1st time visitors and I must say that the tacos (Sidebar: I love..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["tacos"]]}
{"id": "7_0yBi-xMdDaQmWDvgLmvg", "text": ["After coming here with my uncle I can say that I was pleasantly pleased. The food was filling and reasonably priced (also, quite good). On a side note the...", "We shoulda trusted our gut and turned around when we got a weird vibe outside. We came here because of the high reviews but woof. We spend 2 hours here,...", "This place is amazing! Great service and the serving sizes are huge!!! Food is great! They are clean and always so nice!! I def recommend them!! Their..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "ewESv6DYksEiLtNH9gRcfQ", "text": ["They have a great cinnamon brown sugar coffee, and fresh baked items. Empanadas too!!!", "Love the vegan sugar cookie. They have 8 vegan items as of today. Carrot cake, strawberry cake, chocolate cake, energy bar, and a few others. They have many...", "Good food, but the customer service was rude!  Rebecca, one of the staff behind the counter, apparently thought that I had touched one of their muffins..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], ["bar", "cake"], []]}
{"id": "5yIC61CJFQoX5IcqWz-ILQ", "text": ["Really great service! For a busy weekend morning, food still came out in a flash, and food was amazing (for a mom and pop establishment).  I would highly...", "A local spot in Cabot across from the post office. Decided to check it out for breakfast since it's one of the few places in the area with the most...", "Amazing food. Plenty of options. Super busy. Plenty of space. Friendly staff. Quick service. The biscuits and gravy were awesome. Full of flavor. The..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["breakfast"], []]}
{"id": "P1UCG6ayeoq_9OrcXjQU3g", "text": ["Super fast service and the waittresses are friendly. Kitchen is average speed, not bad for this busy crowd - but seriously good wait-staff!\n\nI lived my...", "Great Breakfast\n\nI discovered this place on Yelp and stopped in this morning on my way to Little Rock.  Glad I did!!  I had the 18 Wheeler breakfast that...", "So I am first customer today and others are soon arrived. Have asked for a Sweet Cream Pancake, 2 eggs over medium, burned hash browns with lots fresh..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.46, 0.3], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["breakfast"], ["egg"]]}
{"id": "2sNRDfUxL-7hMnt3xvI9jQ", "text": ["I'd give this place a 3.5. I got the falafel Sandwich with a side of tabbouleh. The pita was a little hard and chewy.  The hummus in the sandwich was good...", "A very colorful and clean Mediterranean restaurant in downtown Little Rock is a welcome addition. You walk through a line where they build your custom...", "What a great find this was. It's super close to my work and never disappoints. I often get the combination plate which has both gyro and chicken over a bed..."], "rating": [3, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [["sandwich"], [], ["chicken"]]}
{"id": "HB2c8sLvI2Ob0pBgRGRbWA", "text": ["We stopped here on our way to El Dorado, because the reviews said it was the best catfish.  I have to disagree, the catfish was just okay and pricey. \n\nBut...", "If you are a fan of fried catfish, buffalo ribs (the fish not the mammal) and the traditional sides, please ignore the outside (and inside for that matter,...", "Staple in Little Rock. Enjoy the best catfish and buffalo around while you listen to the jukebox play. Love this place."], "rating": [3, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "WRRKCpSd7B_goEbBXhAkSQ", "text": ["I was eating at the Root Cafe and spotted this place across the street. I knew just by its' name I would like this place and I was right! \n\nSuper friendly...", "Mmmm, the Green Corner Store! The kind of place where you walk in the door, and at least two happy fountaineers will greet you, ask how your day is going,...", "Got a Dreamy Lavender Matcha tea and it was delicious! Excellent customer service and cozy atmosphere. Will visit again."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "sK99t21TLMPwql6TtyjRKg", "text": ["A bit hard to find (it's next to Lane Bryant and close to the food cart), but it was worth the walk into the outlets. The service was friendly, the drinks...", "I'm a former barista and a frequent Starbucks customer, and one of the things I've always loved about their stores is the consistent level of costumer...", "Just wanted to let everyone know the hours are wrong they are open Monday through Saturday from 9am until 9pm Sunday until 6pm"], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "j3EL9p3VhuX6SGCc23NZ6g", "text": ["It's a good thing they have a snack size, because some of the flavors they have make me want to keep eating it. It's all so good and flavorful. \n\nMy husband...", "Everyone is nice and they have such a diverse staff. Mia is really sweet and super knowledgeable about everything regarding flavors, sizes, and which ones...", "So far so good.  I bought some jalapeno cheddar popcorn and chocolate drizzled caramel popcorn the other week and finally finished it all.  Took me forever..."], "rating": [5, 5, 5], "TBscore": [0.7, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["snack"], [], []]}
{"id": "Xmj7hmbuQThZBTvjLMysZA", "text": ["A frequent stop on my many trips through Little Rock, this Whole Foods has all the usual offerings on hand at any of the chain's other locations. With a...", "My husband And I frequent Whole Foods quite often since our family of 5 is slowly incorporating more plants in to our diet. The experience is usually...", "Sooooo Bitter. Both the espresso shots and the service. Amazon has really drug this organization into the dirt. I hope they realize that Customer service at..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "_jy5GYR6a-9lIcX11RhcEw", "text": ["YAY\nits good to eat.rgrebglrebgbrgq", "Food was hot fresh and fast. Not the location closest to me so I don't go here often, would t go out of my way to come to this one specifically rho", "This place has problems, especially in the drive-thru. They get my orders wrong well over half the time. Minor problem: today I ordered burritos with hot..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "ROTsm3E3G4ktqgO4Ofl0yQ", "text": ["Sweet ladies helping me take my order. They're nice about me asking for a cup of water to go with my order.  Usually the line isn't too long at Little Rock...", "There are two Starbucks locations at the LIT airport, one groundside and one airside. This review is for the one near gate 5. It's a typical airport...", "\"I'm tall, dark, and fantastic in the morning!\" ... thanks to you, Starbucks! lol! \n\nLet's cut to the chase, shall we?! I always receive FAST and friendly..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "6IReZT2_2qLgPvylQUZ_nw", "text": ["The breakfast burrito was so small. And the tortilla was a little stale..Smh I went to a better Mcdonalds better then this one.", "We went in at 6:30 AM and ordered breakfast.\nThe first thing I noticed when I went to get my drink was alot of gnats flying around the drink area, followed...", "I came in ordered my food got it the Fries were so over cooked they were like sticks they were so hard. As I was eating the burger that was so dry I..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [["breakfast"], [], ["burger"]]}
{"id": "lHpe4TEDg_WoCy-VQNN30g", "text": ["Hot fresh food that was top notch for a McDs.  Best part was the staff.  Super friendly and accommodating.  The place to go when you have a late night craving.", "Leaking roof in lobby with bucket on the floor, charged .50 for a package of mayonnaise!!  Food was ok...", "Stopped here on my way to Ponca, AR for vacation. This was a very clean and well-kept-up McDonald's. Clean restrooms, which for travelers is GREAT, and..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "H7VYEj8NcyAj68-NChMMtg", "text": ["I really love this location but I had lost my debit card and called. The girl told me it was in the safe and to call back to because there was no manager...", "The whole place smells like toilets and the woman staff member seemed to be barely suppressing rage towards all the customers. She must be overworked....", "Absolutely the WORST Starbucks location I've been to. They are ALWAYS slow!! Today was a 35 min wait in the drive thru and you are prisoner there bc you..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "GFDf6zHbFShq7SjKaVqhpQ", "text": ["Kids walking through the food area behind the counter. Loud staff joking and goofing off, customers walking out and my order completely wrong. Manger making...", "The dirtiest McDonalds I've ever been in. No toilet paper in bathroom. Avoid this location!", "Back a while ago I would have gave them 0 stars but they have definitely stepped it up! They have new people working there. Everyone is nice they take there..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "9vAv3nlTFw81qnWHGnWObA", "text": ["This smaller market a few minutes away from Mr. Chen's has a lot of the snacks and stuff we can never find there. They even have ube flavored treats! Nice...", "CASH OR CHECK ONLY!\n\nNice store with great offerings including fresh items, products, condiments, and even sushi grade seafood (!!). Highly recommend for...", "this is amazing and has a lot of stuff we can't find at other stores. Great place u should come here too!"], "rating": [4, 5, 5], "TBscore": [0.0, 0.41, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["snack"], ["sushi"], []]}
{"id": "OddpKCTNka3idgERjdhpkQ", "text": ["From the time you pull up to the drive-thru, \"take your order\" to not having any eye contact being made to you, to throwing food and drink out the window to...", "Very slow service and prices are higher than at the McDonald's location I usually visit. I will avoid this location in the future.", "Super slow service. Equipment is broken, they take about 5 minutes to greet you at the speaker. I was in line for 20 minutes for one item: a Large Coke...."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "sWdpEIuu8l3Cl15qlBBi-Q", "text": ["The McDonald's on McCain which is where i usually go is great! The place is always clean and the staff is great! If there is ever a problem they immediately...", "This is one of the worst McDonalds my family has ever been to. My wife worked at a one before too. She loved working there in high school. She had a passion...", "This has to be the absolute worst McDonald's I've ever been to in my life. I lived in NLR for almost 3 yrs & went there about 6 times;  I would never have..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "Y2fYOdJBxW7HSLZ1KDWbaA", "text": ["Constantly, I give this McDonalds more and more chances like it'll ever change. It has the worst service and very rude employees. I'll order a Big Mac and...", "Worst customer service. Slow cook staff who argue with each other rather than fill orders. Has a\nManager who spends more time leaning on counters than...", "This McDonald's consistently gets orders wrong. The teller taking the order records it perfectly and then upon delivery I find my drinks are never what they..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "K9HsfVSVjfSEChKSPstmmQ", "text": ["Well at 10:44pm August 19 I order 2 triple cheeseburger, after getting my food I saw it was 2 double. I drive back around again, was told am sorry about...", "Construction has been a pain! We went through the drive through and with all the noises we were unable to order our food. Will not visit until after renovation!", "Sign said all day breakfast. I ordered two egg McMuffins, the kid looked at me like I was crazy. \n\nOrdered both McMuffins w/ out Canadian bacon, got two egg..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, -0.6], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["burger"], [], ["breakfast", "egg"]]}
{"id": "dDEDxr_cL17wO01-bLH2xw", "text": ["This is my favorite burger place love the number one big mac combo meal it's fun to take my nieces and nephew because there's a indoor playground and I can...", "We stopped by for a bite before a road trip and they had quick service and honestly the best McDonalds breakfast sandwhichs I have ever had. Good job guys!", "After dark they lock most of the doors to the lobby. Staff told me it was because of local armed robberies. I asked about putting a sign up that mentioned..."], "rating": [5, 5, 2], "TBscore": [0.33, 0.7, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["burger"], ["breakfast"], []]}
{"id": "5P9tPFFCvyTI5FwJI0y-3Q", "text": ["I always fine something good at McDonald's and it is an easy stop when we travel.  Employees are very nice and helpful.", "Wow!! Cool new order and pay kiosk inside. But where's the beef????  Hummm, seems to be a bit slow getting my meal. Should have ordered from the counter...", "This is the top level McDonald's. Best Big Mac I've had at any McDonald's establishment in years. Fries were perfectly normal (could have been better I..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["beef"], []]}
{"id": "pvu7kpF4YEOw3MJu3juw0A", "text": ["This review has little to do with The food at this particular McDonalds; its McDonalds after all.\n\nWhat irritates me is the lack of donation drop in the...", "This is the Worst  McDonalds in the country (USA)\nALl the tables were dirty.  We asked them to clean one but they never did.  There were no napkins in the...", "I was very disappointed in the level of unprofessionalism  I saw and end endured in this establishment today. The staff was slow paced and rude. I wouldn't..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "q6fylI6W4NKrbB1U_iBf-g", "text": ["Quick service and clean restaurant.  The double drive-thru makes it easier to get in and out quickly!", "I gave \"1\" because you have to choose at least one.  Today was the last straw for me...the McDonald's at this location has never been a very pleasant...", "Don't waste your time if on lunch or in a hurry, ordered and sat for 15 minutes when I got up to ask they told me my order was thrown away because they..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "mr5sO4OS0AQSbFcGj1PERw", "text": ["McDonald's has pretty much always set the standards for what to in the fast food industry. I pull up today and it's no different. Dai dai was on the drive...", "Terrible location! Came in here one night & the whole staff treated this restaurant as their personal party spot. They were loud, ghetto & were playing...", "Took a little longer to get my sausage mcgriddle meal, but I think the cashier was new. Otherwise, standard fare for a Mickey D's. Conveniently located just..."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "RFGm0SxnIfQhC9ymzuldWA", "text": ["Chili, burgers, and live music of world-class quality located in the heart of Little Rock Arkansas. Whitewater is home to my favorite metal shows and food...", "I was there when the jukebox finally died. The sign of the cross was given as well as the last rights. Rest in piece. Kitchen isn't open unless there's live...", "A friend and I were roadtripping across the U.S.A. in a 25-foot motorhome with a bag full of mushrooms, and stopped off in Little Rock to say hi to another..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["burger"], [], []]}
{"id": "yWgY-qsGRpFAhJkAdxeKYA", "text": ["This is a great retro themed bowling alley! We got lucky as a walk in on a Friday night. We got the last lane available before a reservation. The party...", "I haven't been bowling there yet. I just went to grab and drink and to check out the new place downtown. The workers are very friendly and welcoming. Great...", "Went for a work meeting on a Tuesday night, from around 6:00 to 8:30 or so. They weren't incredibly busy, but all but one lane was in use most of the time I..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "s7C4KPGhvzS_j-iJr0_m6w", "text": ["We ordered a bottle of wine. Seems pretty normal for a wine bar. She brought us out a bottle that had the cork already sticking out of it and had already...", "Great time with absolutely wonderful setting the service was spectacular and extremely accommodating.", "Great wine bar.  The staff is very friendly and they have a wide selection of wines."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [["bar"], [], ["bar"]]}
{"id": "MLG8-7xBU-vbqWUMoq-xtg", "text": ["Drinks, awesome bar tenders, awesome security, awesome burgers.  I love them all!  While writing this up, I'm enjoying an awesome cheese, eggy, gooey, hot,...", "Perhaps I am bewildered because I have never encountered such ridiculousness, however; I am nonetheless bewildered. After acquiescing by agreeing to pay...", "This was not a good dining experience. Very short handed. Long wait fir this famous burger. Not worth going back to"], "rating": [5, 1, 3], "TBscore": [0.77, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["bar", "burger"], [], ["burger"]]}
{"id": "uGLiU9yUVdFc6CL8AeeaVQ", "text": ["I'm not a wine guy, so this place was very cool to check out. Friendly staff and a great vibe, with basic finger food available (hummus platter was...", "I loved this place. Cute wine bar. Tracey was super friendly and she's so cute. Owners are nice polite guys. I'll come back", "The wine was sour and flat like it had been left out for days. The back bar lighting drew us in from the street but the glasses on the shelves weren't..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "yWdl3D_1KFkYgnFRAUn6Mg", "text": ["I went to this club when I was younger and it was my regular Saturday night hang.  Over a decade later my husband's band was booked here, so I will give you...", "Don't play shitty thugs music you won't get shitty thug crowds. I had to empty my fucking pockets THEN get searched to walk in. And this place is prolly...", "I wouldn't really recommend this place to people who are familiar with: 1. Good clubs 2. Good drag 3.good service \nThe black room is ok at best and you can..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "lHJUGK34AU1EOwC9w5ho3A", "text": ["Working downtown, this is one of our 'go-to' places for lunch.  While I can't speak to the 'pub' side of the restaurant, the food is almost always...", "This is a fun little place downtown with great service, food and drinks. We saw quite a few people ordering soup but we had already eaten. I'm guessing it's...", "I was visiting Little Rock with some friends and I really needed food and it was after 10 p.m. On the advice of the bartender at another restaurant, I ended..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["lunch"], [], []]}
{"id": "dFZu_O1avutQTDfYuryxKA", "text": ["A very cool sports bar in the Heights ...wonderful place for games, food and chilling out. . Very cool atmosphere. Love the Interesting architect. Really...", "It's a Sports Bar!\nAs such, it has tons of bright TVs and games going all the time - as should be expected. They also have some cool, gimmicky-yet-private...", "I've tried and tried here, but the food is the absolute worst. I cannot comprehend how they continuously screw up the food. I keep thinking to myself they..."], "rating": [4, 3, 1], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["bar"], [], []]}
{"id": "sHRDQImgKmARn-eekepw_A", "text": ["Amazing!!! The food was so good we were miserablely full. But it was worth it. The Irish bread pudding is the best bread pudding ever. Wonderful friendly...", "This place has been one of the worst bars I've tried in town. Got there about 7pm on a Tuesday and 1 person was in the bar. Completely dead. Still took the...", "Best Fish & Chips in town, bar none. The Irish Curry with Rice is my favorite. Always something new on draft or on call. Facilities need an update, but..."], "rating": [5, 1, 4], "TBscore": [0.0, -0.6, 0.41], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["bar"], ["bar"]]}
{"id": "jNWbfR5vbq5iTZQnhik1Bw", "text": ["For a dive bar/pool hall, it's great. Tons of tables, lots of greasy food, surly bartenders. \n\nThey have a TouchTunes machine so you can play music all...", "This is my favorite pool house, but!.... not my snacks or bar provider.  The bar doesn't pour correct amounts and supports it. I usually let small stuff go,...", "Our server suggested this place after we had no luck at the 3 others we tried tonight.  We were hopeful that this was the place for us to unwind after 8..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], ["bar", "snack"], []]}
{"id": "KO7xnuIwWbHm6_uJwThwLQ", "text": ["Old sports bar with smoking allowed inside.  Old, dated and musty.  They card everyone...I didn't hear door security ask me for my I D but  he chased me...", "This is an awesome place to hangout and have a good time. I had their fries the night I came in with friends and they were good! Karaoke life here is really...", "It is a smoky dive bar. If you don't like that, you should stay away. With that said I think the place is pretty good. The service the few times I've been..."], "rating": [3, 4, 3], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [["bar"], [], ["bar"]]}
{"id": "fF9UyCcTe5kON6D9eCgwcA", "text": ["This right down the road and there is always a fun crowd the employees make you feel like your satisfaction is their goal the crowd that comes there are...", "Good atmosphere. Good prices. Could be wrong but I'm pretty sure karaoke is every night (Thursday-Saturday) locals are the crowd and everyone knows...", "I work and play here. I have not been to or worked anywhere else where the staff... and especially the owner, cares about their customer's experience like..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Sbsr9MyIhM-j9JKkcOJBEw", "text": ["Dive bar! Nestled in the middle of Hillcrest, which people tell me they're \"not classy enough to come to.\" Bah!\n\nSmoky, loud, boisterous, surprisingly good...", "The perfect bar to go if you want your clothes to smell like cigar and cigarette smoke. This is the best place to go if you own a health insurance company...", "Great place to get a beer and have a good time with friends.  Richie is awesome as are much of the staff. It can get a little smokey at times.  Food next..."], "rating": [3, 1, 5], "TBscore": [0.0, 0.87, 0.0], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "qCHeThqtBdKcNdIWGv6QCw", "text": ["Take into account the amount of low star reviews complaining about their experience ordering fried rice and mango smoothies. \n\nThis is not a Sino-American...", "Delicious.... authentic PHO ... it's wonderful, if you haven't tried it .... it's worth a try. Great folks. Good prices. Ill be back to try more.", "Great food, fast and friendly service. Looks a little rough on the outside and the décor isn't spectacular, but you're not here for the atmosphere. The pho..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "MKqRDpPZj4UCQjBeHI0l_A", "text": ["We went to another Chinese Restaurant initially only to find out that despite their posted hours they close at least an hour early (yes, said restaurant is...", "This is my favorite Chinese place in Little Rock. I moved away 10 years ago, but still make a point to eat here when we drive through. \n\nI love their lunch...", "I like their wontons, and steamed broccoli with white sauce, and not much else. But you have to ask for things w/o MSG, which always makes me second-guess..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["chineese"], ["lunch", "chineese"], []]}
{"id": "H1BSE630XTS331II-1XiOw", "text": ["Great food and service. \nWill definitely visit this place again!!\nGot the general tsao chicken and portion was huge.  My friend got the Mei Fun and she was...", "Let me get through making an entire order for delivery over the phone before telling me they don't accept cash.\n\nThey don't accept cash.", "Grrrrrrr! All advertising and signage says they are  open til 10.  The sign on the door says 9.  BUT WAIT~ THERE'S MORE! Actually they are OPEN open til 8..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["chicken"], [], []]}
{"id": "DFEAcx9F97zNiROi2LHcHQ", "text": ["In a galaxy far far away....  a restaurant was placed inside of a mall's food court.  Among the many crap food places to eat....  there stood a restaurant...", "This sure is one odd place. The egg rolls were filled with beef, the hot and sour soup sweet and the chicken and broccoli came with a white sauce.\n\nThey...", "This is a good place for a quick take home or eat in.  My favorite is the Chicken with hot garlic sauce.  I enjoy the beef fried rice for a change up."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.26], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["beef", "chicken", "egg"], ["beef", "chicken"]]}
{"id": "30Iv2ZaUQagg4Z0UJQ-aSQ", "text": ["This is pretty solid \"takeout\" Chinese, made to order in a family owned and run establishment, with exceptionally clean everything, and lunch specials...", "This was a great surprise! Food was fresh and made to order! I got the sesame chicken, it was the perfect texture and broccoli was make just right!...", "Stopped by for a quick lunch and ordered the Hunan Beef. It came with fried rice and an egg roll. \n\nVery tasty Hunan Beef with the right amount of spice...."], "rating": [4, 5, 4], "TBscore": [0.0, 0.43, 0.27], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["lunch", "chineese"], ["chicken"], ["lunch", "beef", "egg"]]}
{"id": "zGeXTCSK32THDGEhxgqLiA", "text": ["We have been here a couple of times now and the food is hands down the best Chinese food in the area! Very generous portions decently priced and staff is...", "This was my first time going to this spot and I had high hopes for it but I now have realized that I was wrong to hope for so much. The food quality is...", "This place was amazing some of the best traditional Chinese I've ever had they even have a great sense of humor  seen the box pictured below behind the..."], "rating": [5, 2, 5], "TBscore": [0.24, 0.0, 0.33], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "qZzXYrBrk94jKFHD3Sg1lg", "text": ["Worst food in the city! No flavor and not sure how they past inspection no very clean.", "Great take out Chinese food at a good price. It's a little place with a couple of tables but it's really a take out place, I always get the pineapple...", "The BEST Chinese food in the state!! I'm a real food snob, always searching for the best places to eat. Don't let the size of this place fool you, they're..."], "rating": [1, 4, 5], "TBscore": [0.0, 0.3, 0.55], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], ["chineese"], ["chineese"]]}
{"id": "qxpsTqMqCMqBXdf6IzpuvA", "text": ["The food here is great. Our order came pretty quickly after placing it, and the lunch specials are cheap!\nEach of our plates came with egg fried rice, an...", "Ordered lunch from here today, the staff was very friendly and helpful. The food was delicious and especially for the price. I will definitely return for...", "Favorite Chinese restaurant! Typically order General Tso's chicken, steamed rice, chicken fried rice and spring rolls- $22- ton of food for cheap. Literally..."], "rating": [5, 5, 5], "TBscore": [0.47, 0.37, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch", "egg"], ["lunch"], ["chicken", "chineese"]]}
{"id": "bk_05XW4zTpgawoYOkDOMQ", "text": ["TL;DR Review: I do somewhat disagree with the other negative reviews; it's not ONLY the service that sucks.\n\nI ordered the following items for my family:...", "I love go go China. The food very good.  A lot the food in here. Fire rice wonthefur. I give for five stare in here . Very clean", "Worst experience ever, also they had a tip cup for the drive thru with a nasty dirty cup. I read the reviews before coming and thought no fast Chinese place..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, -0.54], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [[], [], ["chineese"]]}
{"id": "Y5dCi0Lnj49MQu9ow8hGjQ", "text": ["If you are craving good Chinese food, this is it. A total hole in the wall off the beaten path yet closer to NLR folks than the equally yummy Mr Chens....", "Great food I love the garlic chicken dish, huge portions, the only stable business in that shopping center nothing else remains but great wall. I always do...", "Good little place. Huge portions and the very reasonable prices. I always get takeout so I can't really speak about a dining experience but they're always..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.26, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chineese"], ["chicken"], []]}
{"id": "_IAynxKhWS9UCsNW-e4UBw", "text": ["Well priced for the quality of foods. Friendly worker, their honey chicken really taste like honey. That's what I expecting from honey chicken. Most of...", "The food on the buffet looked good but it was absolutely terrible.  Somehow everything; beef, chicken, broccoli, rice etc had the same bland, oily taste OR...", "I wish I can rate this place zero stars! The owner of this place is so rude that I couldn't believe he's still in business. So, I came in around 8:30pm to..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.21, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["chicken"], ["beef", "chicken"], []]}
{"id": "eQFjrp_0ZiXsHQlcoJI0_g", "text": ["**This review is for a delivery\n\nI called these folks on a random Thursday night, they were fairly busy, but gave me a reasonable estimate for when they...", "We came by last night thinking this was the same as the other chis around town. Unfortunately the Chi family is no longer associated with this location and...", "Would give no stars except you have too. I ordered lunch for my crew today and was shorted.   When I called them back they said there was no way.  Worst..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, -0.5], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "9dWWHlLdOaHf00qzO0cXNw", "text": ["We found this place a few weeks ago. I wish that we had noticed it sooner, being kind of hidden down behind casa Mexicana. The couple that runs China taste...", "Good American style Chinese food. I always grab my order to go and they get it right every time. The folks who run the place are very nice and...", "Clean, delicious, very nice people, decent pricing, and clean bathrooms. I got the combo fried rice and wife got chicken lo mein. Everything was cooked..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.35, 0.35], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["american", "chineese"], ["chicken"]]}
{"id": "DIpisLHUoXqqW4KFDoZlVA", "text": ["Even if there were a lot of good restaurants in Levy, this would still probably be my favorite. The way things are here, this place is a beacon on the hill....", "Chinese food spot in the hood. Can't knock it till you try it. I give it 4 stars based on the portion size : price & the taste. Between this place & Mr....", "Egg Roll Express is awesome! I love going through the drive through and getting a quart of chicken fried rice and egg rolls. That quart will last me three..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.23], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["chineese"], ["chicken", "egg"]]}
{"id": "xt_rvYH9KNA237S2GDEbfQ", "text": ["This place was nasty! Their food was cold and tasted plain. I've never seen fried rice without anything in it. It was just brown rice. Their hand written...", "We went today for the lunch buffet around 1pm (the buffet is served from 11am-3pm).  Everything we tried to eat was lukewarm at best, however,  most...", "Please do not waste your time and money at this establishment. I went there on a Friday evening and had to beg for my drinks to be filled because the waiter..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.75, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["lunch"], []]}
{"id": "Xvm7yUDiSmkSduEkJj7bqw", "text": ["Well this place looked good on yelp. Not often u find a 5star place!  We were greeted by the wife and happy she is!! And funny. Most people get food to go....", "Best Chinese in Benton. Hands down. Sweet owners. Fresh, hot food every time. \nThey usually take a few months off in the winter, FYI. \nI have tried over a...", "Very good flavors,  we enjoyed everything. The 3 musketeers ( no sure of the name...3 something) seafood, very good sauce. House fried rice very good, the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["chineese"], []]}
{"id": "MsA6YWhQRFCycn0vsehmqQ", "text": ["Love this new location.  Very swanky Asian location.  If you want dim sum in LR, this is the only location\nIn the area I know of.  Dim sum offerings are...", "Always have enjoyed the cuisine and location is very close to my house. Very nice and friendly staff.", "The lunch specials are cheap and the food is always delicious. The do deliver in house from 5-9 PM. I always recommend them."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.7], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "zYE5eahmA5bsm6vGlLv-dA", "text": ["Went here on the recommendation of a friend. Excellent place!  Hidden in the south end of Broadway in NLR, this is a rare find!  Fresh cooked veggies, rich...", "It's a small little restaurant but the food is great the drinks are amazing and the waiters and cooks are very nice and friendly! I recommend the dumplings...", "Best Chinese place in the Little Rock/ North Little Rock. Had a small but wonderful lunch buffet. Very nice owners. I will defiantly be back. Best Chinese..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.32], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["lunch", "chineese"]]}
{"id": "HktkVd5w5Q_dMHeP9GakmQ", "text": ["Love love LOVE it! (Drive through only but there's a park not far you can go to.). Food and customer service awesome. Thanks.", "This place is a Bryant mainstay & for good reason; you get A LOT of food for not a ton of money! We always get the shrimp chips & if y'all haven't tried...", "Terrrible the food taste reheated and the line is obnoxiously long. Just try somewhere anywhere else but here. I had the rice and my husband tried the..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "bYcEVQdXwqxDnNUVAtIZ1g", "text": ["Food was great as always, however, the place was not busy at all but our service was poor. The servers were more interested in conversations with one...", "After reading some of these reviews, I'm just hoping my husband and I don't get food poisoning. We originally wanted to go to Crazy Hibachi in Little Rock,...", "I didn't check reviews before I came here. I was really late eating lunch and pretty hungry. I figured it couldn't be that bad if they have stayed open this..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "5ISTU0VVgMYm9mxVPJwsig", "text": ["BEST CHINESE FOOD I'VE EVER EATEN. GREAT STAFF.\nTo start off, the people working there were SO NICE.  I had some questions on what was in a couple dishes...", "In my opinion this is a substandard Chinese restaurant. Their food was average at best and the taste was average at best. Their pricing was not based on the...", "Not really sure what happened to this place. Used to always order their Coconut  Shrimp, but about 2 months ago, it was all mushy. Looks like they are..."], "rating": [5, 1, 3], "TBscore": [0.6, 0.34, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["chineese"], ["chineese"], []]}
{"id": "C9z68Fz0UZ9BNLVYPgJHfA", "text": ["Not the luxury place, but clean. Very small only about 4 tables to sit. But I will say this. Nice peole, friendly. Food....... GREAT!!!  Made fresh to...", "Best Chinese food in the area for the price that I've found. Huge serving sizes. Low prices, and man, is that kitchen clean!", "It was OK ...got the Generals chicken ..large white meat pieces ..rice was just white rice with soy sauce not the pork fried rice I am use to back home..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.37, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["chineese"], ["chicken"]]}
{"id": "Ed2VFjnI3XHqTSZvk8nlaQ", "text": ["Definitely a solid 4.\n I have been burned by too many Chinese Take Outs when It comes to Sesame Chicken. It's my favorite Chinese dish and I get it pretty...", "Everything was delicious. I ordered the sesame chicken. The food is reasonably priced, quick, and affordable. One of the best Asian restaurants in Conway. I...", "We were impressed.  Very small and simple\nbut food was great!  Fresh vegetables and the fried rice was not greasy like you get in some restaurants.  Big..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["chicken", "chineese"], ["chicken"], []]}
{"id": "kaHTSX2iWB1tuPD2R0yUKQ", "text": ["This place has really gone down hill. Everything was cold, what was suppose to be crispy was soggy and really just all out horrible. I ate at the most 3...", "Great atmosphere and service! Other comments that stated their food was cold should have taken it up with the server, not at the register AFTER the fact....", "This place has went steadily down hill over the years. Growing up it was a family favorite for after church lunch. Wife and I took our girls after church..."], "rating": [1, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.2], "keywords": [[], [], ["lunch"]]}
{"id": "ErxtmPyzMEE8ta7eiMougA", "text": ["First time at this little place. I went in to the place, to get a look at interior, before ordering my To-go order. At 1:15 pm on a Wed. The Drive-thru had...", "They used to be amazing they have went down hill their food tonight was nasty . I don't know if they changed owners or cooks but you can tell something has...", "The food is pretty good. It's only real competition is the dragon express about 10 miles away. The prices are reasonable as well for two people it's about..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "BKvfYkAue9gWrNkYz08MBw", "text": ["Great Chinese food on the Mall. Tons of food with two entrees and rice or noodles for $6.99. Would be easy to stop in after work and take out for dinner....", "If you want fresh food this is the best place in the mall to stop and eat or if your near by stop and grab it to go. \nAlways nice and quick service. If you...", "Typical mall Chinese food. Limited selections but it's usually fresh and hot. The usual items are the combo plates. Fried rice or noodles with 1, 2, or 3..."], "rating": [5, 5, 3], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["dinner", "chineese"], [], ["chineese"]]}
{"id": "HsVnCVGj2yeQGKvfh7MnNA", "text": ["Wow, what a great surprise to see this food truck on my way from Kansas City to Little Rock. Reasonably priced Hibachi restaurant quality food on the side...", "This little food truck was on the side of the road in Clinton, AR. We saw it and turned around. So glad we did. The food was great. Since it was the middle...", "Who knew the best restaurant in town would be a good truck?  Prices are great! They have beef, chicken, shrimp, and veggie hibachi. You can get the rice..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.53], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["beef", "chicken"]]}
{"id": "TzVHMsHi0M4K0B3HJDE91Q", "text": ["Came in for lunch on a Monday and never been here. Huge sushi choices for Buffet. Waitress was sweet and attentive. Will return again. My husband ordered a...", "I've been going here for years but the quality has gone down as well as the staff. The girl at the register is so unfriendly. \nIts obvious the lomein...", "Crossing this place off our list. Our last couple visits have been disappointing. The food quality has plummeted but the prices have gone up. The only plus..."], "rating": [5, 2, 1], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["sushi", "lunch"], [], []]}
{"id": "W8IstiI1l64LjGFZ3nyGzw", "text": ["TL;DR Review: My go-to for Indian cuisine.  \n\nSami is awesome, and he remembers you.  Been to Star of India once ten years ago?  He remembers you.  He seems...", "they have private parking. \n\nThe service here is pretty amazing. we were very impressed how attentive and nice the entire staff was, even though we had one...", "One has to look at the individual Desi restaurants in the context of where they are located and the authenticity of the food along with the ambience and the..."], "rating": [5, 5, 3], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["indian"], [], []]}
{"id": "0YBrCO-oZJsIjcrLuERq7A", "text": ["This place is delicious! Located inside a market with several different eateries, it could be hard to make a decision on what to eat. The food here was...", "This place is great! Don't know what I'm having but it's all delicious. The naan is to Di for! Have stopped in here many times just to get my Indian feast...", "This was a fantastic find! I was searching the area for gluten free restaurants & found a few pricey ones, but stumbled upon The Indian Feast when we..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.83, 0.23], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["indian"], ["gluten", "indian"]]}
{"id": "jCI_YMFNqfsigqinCZWY-g", "text": ["TL;DR Review: Customer service is good, food is great, they always keep you wanting more (because the portion sizes are tiny).\n\nIt's in the middle of the...", "This review is for the restaurant in the Simmons Tower, which is a gem of an Indian fast food joint. I work in the building and this is my go-to if I need...", "I've been working in downtown Little Rock lately and tried this place twice now. I've ordered the chicken tikka both times, which comes with a side of rice,..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, -0.36], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], ["indian"], ["chicken"]]}
{"id": "cdRSRWNsVy1h1UlZ6CdiJw", "text": ["Exceeded my expectations. Authentic Indian experience. Fresh, tasty, flavorful. Stopped on the way back to Memphis. If you like Indian food and you are in...", "Also exceeded our expectations! We ordered our faves, mattar paneer and chicken curry, and both were delicious! I laughed when our veggie plate appetizer...", "I love to see Indian beers in Arkansas! One of my top 10 favorite snacks is papadam & this place gave it to me for free to start of my dinner! Score...."], "rating": [5, 5, 4], "TBscore": [0.27, 0.37, 0.53], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["indian"], ["chicken"], ["dinner", "snack", "indian"]]}
{"id": "XjwDuTjsGIEml4YuE7ekig", "text": ["This little restaurant feels like an overlooked gem about half a mile from downtown Hot Springs.  Some of the dining options closer to the bath houses...", "This is 5 star if you're vegetarian.  Halal is printed in the menu though could not be authenticated with a certificate so we couldn't check meat or chicken...", "Very authentic.  Great naan.  Very friendly staff and tasty food.  The portions were small for the price."], "rating": [4, 4, 3], "TBscore": [0.0, -0.6, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], ["chicken"], []]}
{"id": "iJkiwTvkMiglBn9abu4vbg", "text": ["I have been here several times since their opening. The food here is amazing! Be weary though cause some of the items like the chili and the potato salad...", "Ordered Samosas and Soup Momo. The waitress came back and apologized because the Samosas were expired. Then our 'soup' came out. The menu shows dumplings in...", "I was really disappointed with my visit here. The samosas were expired. I ordered the soup momo, but what I got was not soup at all. The sauce was thick and..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "wThuCqBKgiy5AtxhSmdXsA", "text": ["Food- amazing! Restaurant dining area- not so good. We were leaving Texas and wanted to stop somewhere convenient and not far from the interstate as we...", "Wow! I was blown away by this hidden gem!!! It was fabulous! \n\nThe chips and salsa were a perfect way to start this perfect lunch. They were super crispy...", "This is an amazing restaurant! I ate lunch here with friends recently and everyone loved what they ordered! I had the burrito California and it was great...."], "rating": [3, 5, 5], "TBscore": [0.0, 0.44, 0.61], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], ["lunch"], ["lunch"]]}
{"id": "B0y6ZtvuuVnVJh0QickIRg", "text": ["I'm spotting them an extra star because they should be getting a 3.5 star review. The food is a little to yellow-cheese-and-bean Mexican for me than I like,...", "Came here with my boyfriend for the first time. Everything was fine up until it was time to pay for the food.We walked up front and the cashier had a poor...", "I have been to senior tequila a lot because my family likes it but it's always just ok with me. We never go to this location because I have one closer to my..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["mexican"], [], []]}
{"id": "uvnHQbjlv9KsFSfY-quSxg", "text": ["This is my favorite eatery's in town. The food is good and spicy. Hope you like jalapeños because they have them. I have tried several of their dishes and...", "I revisited Cantina Cinco de Mayo with the same friend who previously found the bone in his chimichanga.  It was his idea, so apparently he was undaunted....", "This is the real deal! Great service , authentic cuisine. The Molcajete bowl is fantastic with the rich rancho chipotle sauce. Share a pitcher of Margaritas..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "cJZsc6TTSM7q1i0tpDPyXw", "text": ["Las Palmas is a standard tex-mex place with a decent margarita, a few draft beers and good service. They make a mild salsa, a bland guacamole, but have very...", "I have never given one star before this review. I could excuse the average food or the slow service. The rudeness of the staff though is no accident. Right...", "First time trying this place. It's two star Mexican food. Not too good but still edible. \nThree stars for effort. \nI ordered the deluxe burrito (the menu..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.39], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], ["mexican"]]}
{"id": "nU6rLFgVi5Nu_29VUiVC9Q", "text": ["Used to love going to this OTB but it seems to have gone down in the last couple of years. Service was slow and food was mediocre.", "Cinco de mayo was lot\nThe drinks were on point \nOnly needed 2!crowded but thst was ok", "The food was OK. The enchilada  was a little bland the quesadilla was pretty good   Happy Hour specials on drinks was great. The  bartender was really good..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "rW8Xq0j1Oq7bzCqGvRDVxw", "text": ["Loved the food, everything was awesome! The guacamole was made fresh at the table and was delicious. Some of the best Mexican food we have had in a long...", "So tonight me and my 4 other friends went to go eat at Santo Coyote. The food was fine, service wasn't great, and my boyfriend ordered shots for himself and...", "This place has some pretty good Mexican food. I'm not from Arkansas, I'm from cali but I would recommend this to people from out of town. I had the poblano..."], "rating": [5, 1, 4], "TBscore": [0.56, 0.0, 0.32], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["mexican"], [], ["mexican"]]}
{"id": "TuQmB4nMmG0yZrjFStbkag", "text": ["As for a local Mexican restaurant this place fits the bill. Clean, fast service, and the food is descent. \nWe got there about 11:30 for lunch and not 5 mins...", "I wanted to like this place but I was pretty disappointed...\n\nMy pina colada wasn't all that great to start off... I didn't taste the alcohol at all. I've...", "I'd like to parse this review by mentioning there aren't many restaurants in the area that serve Mexican food other than the drive through version, but I do..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["mexican", "lunch"], [], ["mexican"]]}
{"id": "aXfCQ2OlCy2EvK_TXcrNKA", "text": ["This is the best bakery ever! I walked in and was amazed at how much wonderful baked goods there were in the shelves! I got a tray and tongs and put around...", "Came in with my boyfriend earlier and spent only $6.70 on everything!!!!!!! 5 tacos, a huge bowl of delicious guacamole, and a huge mexican salad!...", "I hope this place ends up in the restaurant catagory as well because there is a really good tagueria in the back that has the BEST tortas in LR IMHO.  They..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.24, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["mexican", "tacos"], []]}
{"id": "T4R5bTSLXlJBcWwdewhd1A", "text": ["Hailing from Texas, I set my bar pretty high for any and and all things Mexican and Tex-Mex. This spans across chips, salsa, enchiladas, the whole nine...", "Love the Casa Mañana burrito!  Made with some of the most tender chile verde I've found in Little Rock!  (Update: sadly, this location no longer carries...", "They serve queso, but they call it \"hot white cheese\" on the menu.  Enough said."], "rating": [2, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, -0.2], "keywords": [["mexican", "bar"], [], []]}
{"id": "HBCYIObatgfXpmd5CuKVow", "text": ["The food and service were great. However, it was so hot in the restaurant I couldn't enjoy my food! It was a good 90 degrees outside and it felt like they...", "We used to like this place but the quality is way down.  Our lunch served today was actually cold. The menus and tables are showing major signs of wear...", "Ordered take out. Food was still warm when we returned home. The guacamole was very good. Ordered the California burrito. Enough for 2 people to eat. I..."], "rating": [2, 2, 3], "TBscore": [0.0, -0.23, 0.0], "normalisedRating": [-0.2, -0.2, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "AacRgevWKVw3xddsOM-Baw", "text": ["This is our new favorite Mexican restaurant.  We live in the area and visit the restaurant frequently.  We've always had good food and fast/friendly service.", "Take out order of Beef Fajitas was a big disappointment. The beef was inedible. Couldn't chew it since it was all gristle. It was almost like they cooked...", "This is one of our favorite Mexican restaurants in the Little Rock area. They offer tex-mex as well as authentic Mexican dishes. Service is fast and..."], "rating": [4, 1, 4], "TBscore": [0.26, -0.3, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["mexican"], ["beef"], ["mexican"]]}
{"id": "CjHs5k3NHOg8s86D19o3nA", "text": ["I really like this place. It has a lot of TV's around this very large bar.  Tons of pool tables.  For this area really the only place to play pool.  The...", "This place is a decent place to come and hang out at. The food is good, nothing exceptional. I had the pick three dinner and chose Pork, Beef and Chicken....", "As a lot have noted, it's smoky. I'm not sure I can judge them negatively for it, because it's not my preference-- but then again, they're not trying to be..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.23, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["bar"], ["dinner", "beef", "chicken"], []]}
{"id": "p2DPxKsB7JLKSzie5eerzA", "text": ["The place to go in Little Rock!  Excellent service, exceptional food!  Best of the best for LR locals!", "First off, this restaurant has a nice ambiance and the staff is friendly. The space is well decorated which is elegant but inviting. I took a glance at the...", "We love the Green Room. We get terrific service every time we go and have become hooked on the grilled lobster. The lobster cakes are outstanding, as was..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], ["cake"]]}
{"id": "62-vpFiJX1JybELXowkUPA", "text": ["Great meal. Fish was excellent, Ribeye was delicious. Hamburger or Chopped Steak was , according to the person who ordered it, the best I've ever eaten. We...", "Great little place to eat!!! Talina was our waitress and she was fabulous!  WONDERFUL food at a great price. Perfect small town cafe!! Thank you!", "Dining venues in Redfield are limited to say the least but this tiny restaurant is a haven for the hungry. Their daily specials are always tasty and..."], "rating": [5, 4, 4], "TBscore": [0.95, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["hamburger", "steak"], [], []]}
{"id": "xkjctgYwchAw-gGcwvAhSw", "text": ["Ordered a supreme pizza.  Waited 45 minutes for a doughy mess. What a waste of time. Manager told me that customers know their pizzas come undercooked....", "This place is a gem!!! My husband and I went to their Cabot location and the food is magnifico!! Our waitress was sweet and on point in serving our food and...", "Not going to lie, I was pretty worried when my sister and I pulled up to this restaurant. The exterior was very low key and located in a plaza. However,..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [["pizza"], [], []]}
{"id": "5uYbJQaCseO6lwOAdGfGZQ", "text": ["While in town visiting family, my grandmother picked Red Lobster to go eat at for lunch one day. I have never been a big seafood fan but I went with it...", "Made a to go soup order on their website for the \"family size soup\" which serves 6-8.  They messed up the order after I arrived.  I waited over half an hour...", "I was just happily eating my seafood bake at the bar when suddenly I'm chewing something that isn't food. I pull it out of my mouth, and unravel it...."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["lunch"], [], ["bar"]]}
{"id": "4kb8jc79i5LsqEYm8C6wng", "text": ["My girlfriend and I ventured out to So for dessert and drinks on a Saturday night. We sat at the bar and really enjoyed the service and conversation woth...", "Gluten Free Review\n+accommodate gluten free very well\n+chocolate sack can be made gluten free \n\nSo making the rounds since moving to LR to all the fine...", "So date night #2 with the wife! \n\nFor appetizers we ordered the surf and turf (crab cakes and skirt steak and beer steamed muscles. \nThe surf and turf had..."], "rating": [4, 5, 5], "TBscore": [0.5, 0.36, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["bar"], ["gluten"], ["cake", "steak"]]}
{"id": "BMZ3hunO8VDAe0SnVASloQ", "text": ["Just passing through and was looking for a good dinner.  I'm happy my daughter and I checked this place out.  Good food and good service.", "Loved the food. I feel\nIt was a little pricey but will definitely go back for another visit.", "Good Italian food in the heart of downtown Benton. I am so thankful for an authentic Italian restaurant in town. I have ordered to-go several times, though..."], "rating": [5, 4, 4], "TBscore": [0.73, 0.0, 0.24], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["dinner"], [], ["italian"]]}
{"id": "TCHg9MXL1m8YpeCmmRRYbw", "text": ["First time at Mickey's, once I walked through the door I already felt welcomed. This place has everything! Just ordered a birthday cake and you can totally...", "HORRIBLE SERVICE!!! My wedding cake was suppose to be delivered to my venue at 4:00 they delivered it at 6:00 which was the starting time of my reception so...", "My mother purchased my 30th birthday cake from here!\nI was beyond impressed!  Once I got there, I looked through the cake books to get an idea of what I..."], "rating": [4, 1, 5], "TBscore": [0.0, -0.5, 1.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "ZHjqJB2ZfY1lfty1F3CROA", "text": ["Wow there cupcakes are delicious here! I went straight for the red velvet, caramel and double chocolate! My favorite hands down was the Carmel cupcake. The...", "Way overpriced for what you get. Their delivery fee for a cake is outrageous as well and the cakes are just okay as far as taste goes. The service wasn't...", "This bakery used to have a good product. I try to support local businesses when feasible. I should have taken the fiasco regarding our wedding order last..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], ["cake"], []]}
{"id": "mRn7Jn_hGW91jBktPzwb-A", "text": ["During my time in Little Rock, I visited Gigi's a few times. \n\nMost importantly, how do the cupcakes taste? Well after trying a variety of flavors including...", "I'm a hobbyist cupcake baker and when I saw this little cupcake shop near where we were shopping, we brought our sponsor child and her family here to have a...", "I was so excited to see that Gigi's was finally open! I stop at the one in Nashville every time I make the drive to & from Charlotte, NC. \n\nThe shop is cute..."], "rating": [3, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "K4plWNONFab71-p3toqh5g", "text": ["Christy and her crew are awesome.  Super fun atmosphere and many tasty treats.\n\nThe shop is clean and bright and the location is perfect for a stroll and...", "After being graciously greeted, I ordered a classic vanilla cupcake with buttercream frosting and it was really good! Not Chicago Molly's Cupcakes good, but...", "Bought 2 cupcakes for my birthday. One was so dense and gummy...it was like chewing bread dough. The other was so dry and crumbly...it was like eat..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "2hLUNvZiQumeD2lmzmUJtg", "text": ["I was in Bryant, AR on business for just one night. I happened upon this place shortly before closing time. Unfortunately, I am leaving town at 6am in the...", "Very good sweets. A definite must go to if you like cake and cookies. Not badly priced either.", "What can I say... Coming from a big city in New York City gives me lots of selections on where to go for what kind of sweets to go for.  \n\nStayed here in..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["cake"], []]}
{"id": "SQWKIIdJxsXdTKM151ts8g", "text": ["Excellent iced cream; the Germanchocolatecake is amazing!!!! Really good , I can eat 2 of it", "Always love to stop by and get my favorite:  sweet cream mixed with strawberries and bananas with extra strawberry juice...yum!!!", "Appple pie ala mode is out of this world.   Worth going out of your way for any of their deserts."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "-CGX-7Z221IyUBSOZRwV3g", "text": ["I always love going!! Tigers blood is my absolute favorite!! I love putting the boba and sour worms on it.", "Not only great yogurt, but wonderful cakes. We ordered a cake for graduation and it looked great and was delicious.", "So many choices and toppings- so fun to create your own or let your kids do their own!  Friendly service, clean, super cool atmosphere!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.72, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["cake"], []]}
{"id": "_PKh4IGKUHvpdvaU1KaB5A", "text": ["Food and service was great tonight. Had the special chicken and dumplings and it was really good. I also had the $4.00 margarita and it hit the spot. Lol...", "We were the only people in the restaurant at 9 am Sunday we ordered some food. 30mins later 3 people walked in order some food. they got their food in five...", "It wasn't perfect but worth a visit. I had lunch salad and sandwich and it was good, not great but good. They were slammed and service suffered but there's..."], "rating": [5, 1, 4], "TBscore": [0.41, 0.0, 0.46], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["chicken"], [], ["lunch", "sandwich"]]}
{"id": "DH7ZFNgC10B_aDAI8OoJDg", "text": ["This nice convenient corner location at Broadway and Roosevelt is a one stop for just about anything you need! Great service and friendly family! I was in...", "I was online searching for local meat and vegetables, when K Hall and Sons popped up as the only local butcher open on a Sunday. I drove my small black bug...", "Its local they have a BOMB turkey burgerand crabboil Saturday Is a must and it ain't just crab."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["turkey"]]}
{"id": "1uAQDkMvhtIRxo_uMJ5wfQ", "text": ["After many years of my grandmother talking about Charlotte's in Keo, I finally made it there during a recent visit to Arkansas. To call Keo a small town is...", "You hear of legends, but until you can actually experience it first hand that's all they are. Charlotte's blew my mind of how magnificent this location is....", "**Charlotte's is housed in a century-old building that was a drugstore, complete with a walnut soda fountain.  Walnut & glass cabinets display a collection..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "NVW-9g4RaqDOXcINEbfSWQ", "text": ["We had Rx Catering, Cater a class today. I don't know anything about the cost so I can't rate on that. We ordered what I was told is the Taco Bar. It was...", "We have ordered from RX Catering a number of times. I got this companies information from one of our medical reps who caters our lunches from time to time....", "I would give this place no stars if I could.  Every time this was provided as a meal I opted out and remained hungry. Its all \"noodle caboodle\". Low quality..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["bar"], [], []]}
{"id": "La7ADE2v2vOeXzNup8a02g", "text": ["Nope, just nope. \nNothing more needs to be said. \nBut they won't let you post without more being said.\nTo much money for something that tastes better from...", "If I could give less than one star, I probably would. \n\nThe cookies themselves are usually yummy.  I worked in the mall for years and purchased cookies all...", "The cookies are good but the service is slow. Orders are never ready for pick up on time."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "3FvrWO54sDOhGMXBlm0qvA", "text": ["Absolutely wonderful experience with Cabot Cafe and Cake Corner.  The service was beyond my expectations and the cake was absolutely delicious. It was a...", "Small little place in cabot, very nice owner. I love to support the small business.it takes a lot to compete against the big places. Breakfast is amazing ,...", "I absolutely love this place. BEST service and best yet BEST cupcakes! I have been eating their cupcakes forever now. However we just picked up my sister's..."], "rating": [5, 5, 5], "TBscore": [1.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["breakfast"], []]}
{"id": "t7PnWELe4SmS8aO4TF8jbQ", "text": ["yup-\nit's in a residential neighborhood. \n This place rocks.\nI had the pork platter w. cole slaw and potato salad-8.95\n mmmmyum! see we don't have this...", "BBQ alert! Melt in your mouth beef, tender pork, and a caramelized smoky sauce. Add some potato salad made by angels, slaw, or life-changing beans, and you...", "You'll find H.B.'s in a converted house smack dab in the middle of a residential neighborhood, where it's lived for over fifty years. This place looked..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["beef"], []]}
{"id": "-ckhSn0YR30oQYALyt3uyA", "text": ["We are in town for business and heard that Sims was a good place to go. Well, we were shopping and lost track of time so by the time we Ubered to Sims, the...", "This place is a hidden gem. You must give it a try.  The food is amazing.  The staff is even better.  The burgers, ribs amazing!!!", "Sims is a small old joint in a small old shopping center, competing for olfactory dominance with the donut shop next door. It's a simple table and chair..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.48, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["burger"], ["donut"]]}
{"id": "ZWtDIwAjiIR0nYUxza_SRA", "text": ["Needed a quick bite to eat before my plane took off. Was in line at burger king and saw they had BBQ at this place near it. Figured I'd check it out. It's...", "I went to Whole Hog Cafe starving after finishing the Little Rock Marathon and waiting on a delayed flight. No surprise there. \n\nI ordered the pulled...", "Maybe because it was in the airport they don't care as much for their food. Not worth it. I should have went to BK."], "rating": [4, 2, 1], "TBscore": [0.22, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["burger"], [], []]}
{"id": "44kPcVYpXNg7kRUkrvnOgw", "text": ["My son and I had lunch there today. We both had selections from the blue plate specials.  Everything was delicious!   It's like Sunday dinner at Grandma's.", "This place could seriously use a complete design makeover, or a fresh coat of paint at the very least. And that's coming from a guy who regularly eats at...", "Not a bad selection. They usually have the BBQ favorites as well as some blue plate specials like fried chicken or meat loaf. Plenty of southern sides like..."], "rating": [5, 2, 3], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["lunch", "dinner"], [], ["chicken"]]}
{"id": "cJTEm4fv0qWJd0QUReHxWA", "text": ["Not the best bbq in the world but not bad. Pretty good infact. But 100% the biggest portions ive had in years. They do not cheat you here.\n\nGot the pork and...", "Needed some good AR pulled pork bbq before driving back to TX where brisket is bbq. Glad we stopped here, they don't make hog like this in TX : )", "The food is good as always. Super fast service. 6 sauces to choose from. My favorite item is the bbq baked potato. The brownies are yummy too. I love the..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "SKylUM3tOU80vVLYgCDZZw", "text": ["Excellent Butcher, Hot Bar Restaurant, Good Deli, Very friendly staff. The meat looked very healthy. They make sausage in house, and the in house BBQ sauce...", "Ok! My first visit. As I entered the shop my first impression was not so clean and aging. I have to assume the meat case display pics on the web site were...", "Well there can't be anything bad or wrongly said about this place. \n\nIf you want some pretty delicious food to go, or sit down. They've got you covered...."], "rating": [5, 1, 5], "TBscore": [0.62, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["bar", "deli"], [], []]}
{"id": "xa3M5oGG4DcxKH-2mpIw3Q", "text": ["Fatboys Killer Bar-B-Q is one of those barbecue joints that pretty much requires an intentional trip. You're not likely to just stop by there on a whim...", "A well-run husband and wife operation that serves really tasty home-style Southern food. I went here two days in a row for lunch while on business in the...", "It's a few miles off of 530 but worth the drive!  The waitress recommended the award winning ribs so we decided to try them.  They were tender, meaty and..."], "rating": [2, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [[], ["lunch"], []]}
{"id": "wbiM8k3Fx7HvoeJvjoaxLg", "text": ["I bought a Groupon for 20 dollars which was equal to 40 dollars worth of food.\nI went with my wife and two kids. I got catfish and grilled shrimp. My wife...", "Cashier placed the wrong order, the food I did receive was bland. Unfortunately, I reside on the opposite side of town which means I was pretty much stuck...", "This place is horrible, let me start off by saying I've ate here several times sometimes it a hit or miss, meaning the ribs are dry, but today I drove to..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "m-fEAkjM4hgtZQ0R-O0VPg", "text": ["My friend and I both have the combination platter BBQ Beef and shredded pork both Meats were outstanding. Definitely get a side of fries cuz that was some...", "If you read any of my reviews, you will find that I love ribs! As a rib lover, I have to rate the ribs at the Smoke Shack right up there with the best in...", "The faux log walls at Smoke Shack were reminiscent of an old-timey cabin, which is what I assume they were going for. Most of the decor is just old license..."], "rating": [5, 4, 4], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["beef"], [], []]}
{"id": "-QGx-EzdcOF7d1snubw8bQ", "text": ["This is officially my most favorite BBQ joint in the history of BBQ joints for the following reasons:\n\n1- I was skeptical of this \"Artisan BBQ\" situation...", "Soon after we heard about this place we discovered they were closed for building repairs. I had heard nothing but good things. \n\nWell, they're open...", "First day checking out the area and my eldest daughter requested pulled pork for lunch. Yelp brought us to this place across the highway from where we were..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "rK_JP7U8FtXUTu_50140aw", "text": ["A restaurant that specializes in BBQ and catfish?  That my friend is a dream combo in my book.   I try to eat here whenever I am in the Little Rock area....", "Verdict: A decent showing from this BBQ joint but Whole Hog is still my pick.\n\nSmokin Buns seems to be a frequent pick for local BBQ for the people working...", "i have heard they have ok food but as of yet i have not been . what is read sad about this sight is i have only looked at yelp a few times and have seen..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "mtHYLYc6e24rZ_MJIT9B2A", "text": ["Along with Layla's, the best middle eastern restaurant in Little Rock. However, I am disappointed to learn that you no longer have beef (or beef/lamb)...", "yeah, I dig it. When I am in \"The Rock\".... (god I feel so douchey for saying that) I seem to find lunch there at least once during my visits. The people...", "The interior won't do anything for anyone although the food will. Went in to grab a gyro decided to do the buffet.... do the buffet you'll get a wonderful..."], "rating": [5, 4, 4], "TBscore": [0.0, -0.3, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["beef"], ["lunch"], []]}
{"id": "L-X-T5GEJd3JJdlbtsmErQ", "text": ["Nice and cozy. Service was pretty quick. Cashier was super friendly.  Food was delicious.", "Stale, bland chips, that tasted like they were prepared days ago and left out for as long.\n\nFruit labeled on the menu as 'fresh cut fruit' was old and we...", "Great flavors to be had here. The Charred Lamb with Basmati rice was super tasty... they got the lamb right. The Beef Tender plate was also quite..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], ["beef"]]}
{"id": "5hb0GuyglThWC2Db1NwKUA", "text": ["Just finished eating on Markham St Wendy's.  Very pleased. Taco Salad is back and very good. Grandson had burger and fries and ate every bite. Employees...", "I am done eating your gristle burgers and picking the gristle from between my teeth for the next ten minutes. Done.  Shame on you for having such a low...", "Ok I was just came from Wendy's 30 minutes ago.  I nearly ate all of my spicy chicken sandwich, but before I took my last bite I looked down and saw..."], "rating": [4, 1, 1], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["burger"], ["burger"], ["sandwich", "chicken"]]}
{"id": "ZOQpHN_YDnQif0u1hVk7sA", "text": ["Food has been good and customer service great nearly Everytime. Great place to grab a quick bite.", "Careful of the time to come to this location apparently they close the Drive when people go on break.", "Great experience at this particular chain..Alicia Brown gave great customer service..she is in the right profession..she understands all about \"making the..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "93Y0Ix_2w3uuo_rH1ZkGgg", "text": ["One the cleaner Popeyes that I have been to. Service is great and food is fresh.  \n\nChicken tenders were ordered spicy and the food came out incredibly...", "Stopped by for the first time since this location opening. I went through the drive thru. The lady on the speaker and at the window was pleasant, helpful,...", "It's been over a year since I've visited this place and I have avoided it like the plague due to poor service and food.  I assume due to management and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "ZLtt5w3rrtPxoP0v7pVDDg", "text": ["I have been using the Wendy's Mobile app and Mobile Pay. I usually go thru the drive thru on Broadway due to the proximity to my work. I have money...", "This was by far the worst experience I have ever had at a Wendy's. My husband and I ordered our sandwiches, paid, and drove up the the delivery window. The...", "Must disagree with the other review. Service was garbage. Parking lot and dining area covered in trash. Stood at counter for almost 5 minutes and didn't get..."], "rating": [1, 1, 1], "TBscore": [0.0, -0.45, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["sandwich"], []]}
{"id": "gs3PMpr7M9g5HuznZHVkBw", "text": ["Salad bar is nasty. Brown lettuce, dried up cucumbers, rotten tomatoes. All for about 9$", "Talk about packed..... It's literally a club up in here lol There are more adults then children, Chucke is dropping it like it's hot lol....\n\n*Staff is...", "I was disappointed at what Chuck e cheese has become - it's sad that kids nowadays won't know how great it was. Hopefully they have done even cooler place,..."], "rating": [2, 4, 1], "TBscore": [-0.6, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, -0.6], "keywords": [["bar"], [], []]}
{"id": "DcuuhJh5rUTR6Sqw5DwmWQ", "text": ["On moving back to Arkansas from Texas just here lately, my wife and I had our hearts and stomachs set on finding some good catfish. We were thrilled to find...", "Great food and great service! We had the fried catfish, which was crispy on the outside and tender on the inside, and the grilled catfish, both to die for....", "This was our first visit to Grandpa's Catfish and we were pleasantly surprised! All orders come with slaw (which was wonderful) and hush puppies (which were..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "4LgkQqsywqO32J4Yz_lw7w", "text": ["When I am in the area and hungry for breakfast or lunch, I stop in here. The atmosphere is down home and so is the food. I normally make it in for...", "NOTE: this review is based on one lunch visit. Bellewood might be a great place for breakfast but lousy for a plate lunch. We went on a Friday at noon and...", "Well I'll be, this is some of momma's biscuits & gravy, spot on tasty good meal! Little Rock's, Arkansas done did well. Me ole \"momma\" had to be in their..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [["lunch", "breakfast"], ["lunch", "breakfast"], []]}
{"id": "v2Gdt5luu01s4fzzASINNw", "text": ["My fiancée and I love this place! Great food and large portions for a good price, not to mention great service, make this place a true treat to eat at.", "Just ate at NLR Chuy's for the first time and am in love! The steak fajitas were great. A friend got the chicka chicka boom boom and loved it too (the sauce...", "Great food and atmosphere. Started out with free chips and salsa,  got a skinny (sugarfree) margarita... Yowzers,  they don't skimp on the tequila. Got..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.59, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["steak"], []]}
{"id": "Wg9rbvgP0Xwc_RPTdNSFKA", "text": ["First things first, I usually enjoy eating at Outback Steakhouse but...BUT, these are Australian themed American restaurants which don't really resemble...", "When I ordered my soup and salad online the curbside pickup wait was 20 minutes.  It was more 50 minutes.  I won't make this mistake again.", "Good dinner , friendly staff, very attentive ,\nGood chicken and vegetables .\nHouse Can was tasty"], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.34], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["american"], [], ["dinner", "chicken"]]}
{"id": "SUYOHqg8Y-z8cdHo9HarKw", "text": ["Ate here today and had grilled salmon. I must say it was best ive ever had!!!!  I am a server so im a bit more critical. Ashley treated me exactly right!!!!...", "Slow on service, food was VERY slow to served, sat at table for an hour before we out right canceled our appetizer and had to beg for rolls twice before we...", "I was watching a weather on local news and the manger changed the channel I asked since I was the only person watching to Chang it back he said no it's..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "oUEIrJABUd5BUqsN4P30jA", "text": ["Our food was excellent, and the service was pretty good. Would've earned 5 stars, except for the fact that about 10 minutes after we ordered - we were...", "I'm guessing this place and Logans try to copy Texas Roadhouse so far they don't compare however this one does a little better steak was good but could have...", "Mostly a family place, Colton's is cozy & warm.  I like to arrive as the little ones are being carted home to bed, so I can enjoy the music & casual mood...."], "rating": [4, 3, 4], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["steak"], []]}
