{"id": "BvyUXno0grQerd5cZGDFPw", "text": ["Love, Love, Love this place!! \n\nI visit every time I'm in Madison and have the pleasure of seeing Winslow's smiling face. In this last visit I was only able...", "Great bar: drive-y atmosphere, with a stellar tap list and great French fries. It's seemingly open all day long -- with patrons the entire time. Service is...", "Great old bar located off Johnson St.. blink and you'll miss it!  Both a back and front door entrance and I think they open EARLY for all you hardcore..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.26, 0.21], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["bar"], ["bar"]]}
{"id": "lMeWUHAkBUXwcuX1tGTdtw", "text": ["This has become a regular spot in our rotation, so I thought it time for an updated rating. My original review still stands true as for the general...", "I may increase this later, but for now Eagle Crest is a 3 for me. Why you ask...well...\n\nPros: \n-I personally had good service. I found a spot at the bar...", "No longer accept credit cards. \nChecked yelp to see if they did in fact take them prior to arriving. \nSign on the door described as of 10/22/18 they no..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.23, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], ["bar"], []]}
{"id": "vrdrPE_IczDTL5aM5f-Tqg", "text": ["Nice atmosphere.   Our server was very friendly and helpful. She brought out a few samples of beer for the table to try. Did I mention they have a ton of...", "I wouldn't eat here again for free\n\nIf you love beer, and don't mind a menu that is inaccurate to the point of not wanting to drink you're also good. \nThe...", "I really like this place...  \n\nThe taps...\nBeing gluten free now, I don't have much expectation when it comes to GF beverages on tap.  There GF tap options..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], ["gluten"]]}
{"id": "X4w6_iAqN8ZqZ15a7YWPgw", "text": ["This place delivers exactly what they advertise. Beer, beer and more beer!\n\nThere Brew selection is obviously going to be over the top. Pretty much any kind...", "Superb beer list and food! Whether you're looking for a fantastic burger or beautiful and tasty salad, Mr. Brews is the place to go. Great atmosphere and...", "I love this bar, it's my kinda place, just walking through the front door puts a big smile on my face."], "rating": [4, 5, 5], "TBscore": [0.0, 0.76, 0.27], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["burger"], ["bar"]]}
{"id": "Q8t-mZxSOh7L07v2_9tH3g", "text": ["You can't miss here. Dogs, Philly action, Italian Beef, Gyros and on and on. This dog joint is too good for The Dells. Great food. Great prices. What more...", "A friend suggested this place. Oh my God! It was delicious-the gyro was the best I've ever had. I got a hotdog with barbecue sauce and coleslaw on it. It...", "Great Gyro, soft pita full of meat, great onions, tomatoes and sauce! Come out and get one you won't regret it!!"], "rating": [5, 5, 4], "TBscore": [0.48, 1.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["beef", "italian"], ["hotdog"], []]}
{"id": "OmBbtgJki_xeYaAVgj6H5A", "text": ["I was happy to find the deli dog, being that I come from chicago.  \nI live in Evansville, so I was happy to get it here in town.  \nI just tried to order and...", "I just tried this establishment out because I do like Chicago style hotdogs.It was not bad but was the best I could get in my location.I do have to admit I...", "I decided to go back to the Deli Dog House, when I saw their Facebook post (that they now have fries).    I was having a hard time doing a Chicago Style Dog..."], "rating": [1, 3, 4], "TBscore": [0.58, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [["deli"], [], ["deli"]]}
{"id": "ibVJ52iBKcheyLNOPGU8jg", "text": ["Whenever we stop by, we have great service, great food and it's very timely! Every time we visit Wisco, we stop at this particular Culver's drive thru. It's...", "A quick pre-show meal with a buddy while in town to a place we always enjoy.\n\nToday was the Triple Deluxe Butter Burger basket. These burgers are so...", "Cashier was very helpful and friendly! We got our ice cream and fries super fast and it was delicious. Fulfilled my craving for sure :)"], "rating": [5, 4, 5], "TBscore": [0.0, 0.44, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["burger"], []]}
{"id": "QxqMKO5IZCQUUWIx8nTDJw", "text": ["Solid coffee.\nSolid pastries. \nNot sure the cashier knew what day it was...\nGreat location in the square.", "Let's face it, sometimes when you're in college a study session at a coffee shop is the complete opposite. It's a time to indulge in your favorite drink and...", "I'll be honest, I'm a basic b when it comes to my coffee (I go to that one huge coffee chain a lot). But, I haven't been there much since I found out about..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "fQ1sYWuXtVVOFWhrC9bTrA", "text": ["On a recent trip I had a terrible hamburger at a out of town  Culver's so had to do a review on the one closest to me this time. I have had problems with...", "They're so nice here. I ordered the strawberry salad and I believe it had blue cheese or some sort of unpasteurized cheese that I know I'm not supposed to...", "I've dined in once or twice, but this location is usually a drive-thru ice cream stop for us. This location seems to be less busy than most, so we're always..."], "rating": [5, 5, 4], "TBscore": [-0.5, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["hamburger"], [], []]}
{"id": "_omjGkkkddnKVWG3Uua9Kw", "text": ["I'm occasionally out by this branch of Five Guys for conventions or other events and it is definitely a guilty pleasure.\n\nThere's definitely something about...", "I have given this location many chances, and I am sorry to report my opinion is officially that they are \"meh\". \n\nThe service isn't friendly. It has often...", "Gotta love the burgers and fries at Five Guys. Simple menu, good grub for the whole meat eating species. \n\nCajun fries are a nice new flavor. Feed me Seymour!"], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], ["burger"]]}
{"id": "oXk1MzdecCd7UfEuaHGONQ", "text": ["This is an update to my last review.\n\nThis culvers has amazing staff members that are always enthusiastic to do their jobs with a smile. I personally think...", "I typically do not write bad reviews however my last two visits to Culver's in Waunakee have been less than satisfactory. Last night, we went to Culver's to...", "On a snowy night I think half the town of Waunakee decided to pick up dinner (our other choices are McDonalds or Taco Bell/KFC).  Thanks to a kind driver I..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], ["dinner"]]}
{"id": "DstV9qkEFmCrB1Zf3Zqfhg", "text": ["This Culver's location is fast and friendly. The restaurant is clean and has a somewhat more modern vibe than other fast-casual chains. \n\nThe food is what...", "I'm a fan of this chain restaurant.  This Middleton location is probably the easiest for me to get too.  I like the chicken strip value meal.  Upgrade fries...", "It's exactly what you'd expect out of a fast food joint. That being said, it's the best one in the area and the service is always very quick. Food is good,..."], "rating": [4, 4, 4], "TBscore": [0.0, -0.6, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "RmwfJrR4__hd5Scae5qsTw", "text": ["While Michael's isn't the best custard I've ever had (sorry - my fav isn't in Wisconsin)... it is quite good!  I visited twice in one weekend and had a...", "These places are scattered across the city. I've driven by them for years. Much to my regret now. \n\nThis place is is top quality. I had the vanilla with...", "Cute little diner with vintage feel and charming outdoor seating. Delicious custard and a decent burger and onion rings. Nothing fancy.\n\nWonderful after a..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.53], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], ["burger"]]}
{"id": "R8L9VLO5jHfzPA5rHiujIA", "text": ["Love it so tasty! Am literally here no exaggeration every day it's not that good for me but i can't get enough of their food. Every time i go the staff is...", "Another fast food option while traveling. Fast food is fast food, yet Culver's can be a step up from many other choices. This restaurant was picked up,  the...", "This was a very standard Culver's.  Everyone was very friendly and the food was out fast.  None of the food is exceptionally good, nor is it very good for..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "8Rydf8hXleCwbCN9nvmZ4Q", "text": ["Chipotle is by far my favorite fast food restaurant! Even if the line looks like it will take forever you usually don't stand in line for a long time.The...", "I had Chipotle for the very first time today. I know... seems crazy right? But it was pretty ok! The service was awesome. The kid making my food was totally...", "The closest Chipotle on the UW-Madison canvas. You get all the comforts of every Chipotle. The mouth watering steak, the killer salsas (I always get all of..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], ["steak"]]}
{"id": "NXTsT01IVpKYPpa_1L-Rlw", "text": ["It looks like this location does not have great reviews. My husband and I​ have been there three or four times in the last couple of months and we have had...", "This apple bees is the worst. It sucks that the food is decent. The servers are slow, and rude. We gave them multiple tries/visits to give them a chance,...", "Eh.\nThat pretty much sums everything up. \nThe food was just ok. \nThe service was just ok. \nI have no reason to ever come back."], "rating": [3, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "HlYzk84INQaNslFT-lyBFw", "text": ["Came here the other night to use up some gift cards we had received as gifts. Overall, it wasn't a bad experience at all! \n\nWe ordered boneless chicken...", "True story, I hadn't eaten at an Applebees since 2005. Specifically this location too. I stopped coming because they had gotten rid of a lot of my favorite...", "There is a reason why I don't go to chain restaurants no more. I was recently here for dinner on a Thursday night with family. There seemed to be only two..."], "rating": [4, 1, 1], "TBscore": [-0.4, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chicken"], [], ["dinner"]]}
{"id": "sOs9goJyHT5Ggu1hTsp3kg", "text": ["The Great Dane never disappoints!\n\nThe menu really has something for everyone's taste (as well as vegetarian/vegan options), but all of the dishes are...", "I must say, I definitely do enjoy the creativity of the menu each time and it's been a while since I was last here but the menu style has always been...", "You know, this place can be nice to hang with people. Outdoor patio is nice and there is no wait to sit on the street side of the patio. For all the Dane's,..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "4kbxhv8dcNHQw5YYjSC3oQ", "text": ["Stopped here for an after doctor treat with my daughters. I don't always review fast food but in this case I am because the servers there were SO nice. My...", "This is by far the WORST Dairy Queen we have ever been to. Do not go here! \n\nSaturday night at 7:00pm, not busy and we were treated with such disregard and...", "When you go to The Queen, you pretty much know what you are going to get. \n\nI've always had good service. Sometimes, there is a bit of a struggle bus..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "soIfkcfwujR-Na1lprr-XA", "text": ["Great time at the breakwater happy hour was great they go all out to make sure everything is good if you don't like something to cook the bartender and the...", "WOW. Absolutely Appalling. My girlfriends & I were in for a quiet night of drinks, possibly a bite to eat. We had a round of drinks & a bottle of wine, but...", "Can I rate this a 3 1/2? I'll make it a 4 as I had a great chicken sandwich which tasted very nice. Nothing at all to complain about. I've been passed this..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], ["chicken", "sandwich"]]}
{"id": "1PUPTbQRums97s6yfTnA5A", "text": ["This place was so much fun for me and a buddy as we had a few hours to kill some time!  We played pool, air hockey, basketball, darts, and played pinball...", "A huge, local Wisconsin and NFL sports bar with pool tables, arcade games, several TVs and lots and lots of sports memorabilia. Literally every inch floor...", "Ah, probably a nice bar if your 21 but for me it is a lot of noise, spilt drinks, shouting to hear each other, slow service.... not a fan. Rather somewhere..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["bar"], ["bar"]]}
{"id": "nnGqETrosXjIcqP4CFUK8A", "text": ["Madison dive bar for sure.  Drinks are reasonably priced. The bar is large so you are never crowded in. They have some pool tables and a dart machine. Some...", "It has pool and darts and decent localized music but the costumer service is ~awful~ I called and checked if they where open the bartender replied, \"I...", "Been here several times...first thing you notice are the bars on the doors, like it used to be a check cashing place or pawn shop. My beer tasted skunky, so..."], "rating": [3, 2, 3], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [0.2, -0.2, 0.2], "keywords": [["bar"], [], ["bar"]]}
{"id": "aaEdLuaBvgNZWdc_I5O82g", "text": ["I recently noticed that this place was reported to be \"Closed\" ,but actually the business is definitely in business. I give this place 4stars on their...", "Whoever the female was took my delivery order on 8/4/15 at 7:15pm was horrible. She made fun of the street I live on with another co-worker as I heard her...", "I get pizza here all the time. Their thin crispy crust is the best. I go there all the time when I don't feel like driving and people are always nice and..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], ["pizza"]]}
{"id": "8z4sC_8dsZiiMWjIPYE_iQ", "text": ["If you like free pizza that is a couple hours late then this is your store! Three strikes and you're out, the last three times I've placed orders they've...", "Do not order pizza from this location.  I cannot speak for other locations, but if you order from this location you risk your order being inedible and...", "My boyfriend and I are thoroughly angry. We ordered some food to get delivered, and asked that the delivery person call when they arrive (we can't hear the..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["pizza"], ["pizza"], []]}
{"id": "CYKvEc30_ujFBfgoSIawUw", "text": ["A quiet place, with a great soundtrack, for enjoying a pint of Guinness and working my my writing.", "A pint of Guinness and a shot of Jamison for $8.  How can this be bad?  Yes it's a dive.  But it's on State Street in Mad City!", "Stopped in the Pub with two great friends yesterday for a couple of cocktails in between soirees - we picked the Pub on proximity.  It was awesome and..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "mZ3l8RpwszlVAKDu7lWEmg", "text": ["Picky pizza fan here, and really like Red's. The sauce is fantastic, overall a great crispy pie (i order thin). Ingredients always taste fresh. Spent 17...", "I was staying at the Hampton Inn for business and ordered a pizza and a salad oh my God the best salad I've had in a long time all fresh ingredients onions...", "Ordered spicy sausage pizza and wings.  They were here in less than half an hour.  Thin crust is the ultra thin crunchy style that I love.  Wings were..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["wings", "pizza"]]}
{"id": "4DtGWbPfvfIL7czgBLPcXw", "text": ["Did an online order for a pickup here purely because I love my teenage kid who really wanted a cheeseburger pizza.  I registered, ordered, paid the bill and...", "This my favorite pizza place.  They have an absolutely mouthwatering house pizza menu! The service and team are awesome. Try them out!", "Tried for the first time tonight. My mouth is on f'ing fire. Legitimately had to get a glass of milk and stop eating fire. \n\nMy husband likes his meaty..."], "rating": [3, 5, 3], "TBscore": [0.23, 0.58, 0.0], "normalisedRating": [0.2, 1.0, 0.2], "keywords": [["pizza", "burger"], ["pizza"], []]}
{"id": "iW0_acsRQtjlpE_8O6l1_Q", "text": ["Ordered pizza. I love pizza but this pizza I did not love. Very floppy and my toppings fell off as I picked it up. Still love pizza but not yours lol", "Placed an order online and chose pickup instead of delivery because the wait time for delivery was almost an hour longer. Arrived at the location at the...", "At lunchtime not at all busy. Kids playroom too loud, echos thru whole place. I ordered a salad with chicken, my date ordered a sausage pizza. My salad came..."], "rating": [3, 2, 1], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["pizza"], [], ["pizza", "chicken"]]}
{"id": "iFlr0eG_qH-cgXFhji7gbQ", "text": ["Cool environment bumped this up from a three to a four. Food is solid, but not exceptional. They do have a good beer selection with some tasty black and tans.", "Very disappointing Thanksgiving buffet.  Advertised chocolate fondue for the kids but didn't have it.  Never filled the whip cream the entire time there for...", "There are two types of Irish bars when it comes to atmosphere.  Those that go for the rustic beat up chic, and those that go for the upscale dark paneling..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], ["bar"]]}
{"id": "_xcDTH9G4LDqADfpmok6SQ", "text": ["Called for take out as specialty pizzas are not listed online. No one bothered to answer the phone, so I tried MOD pizza. Will be going there from now on", "I love to order my pies on their app and then do the quick drive-thru 'drive by' to pick them up. They are done in 15 mins (a little longer for pan pizzas)....", "Wow... total and complete incompetence of the lady taking my phone order for delivery!!!  I was staying at a hotel literally 3 blocks away.  I'm sure they..."], "rating": [2, 3, 1], "TBscore": [0.0, 0.22, 0.0], "normalisedRating": [-0.2, 0.2, -0.6], "keywords": [["pizza"], ["pizza"], []]}
{"id": "9D9VuQW6ysUacf63q-5pMA", "text": ["Typically, I'm a bit of a snob and I shy away from chains.  I tend to think the local pizza restaurants are going to be so much better than any national...", "Called this Pizza Hut at 215 am to get ordered within 30 minutes is what they said. I called them an hour an a half later and they said \"the order was never...", "Ordered delivery, ate a piece each.  It tasted weird, couldn't figure out why. Finally realized the damn thing had NO cheese!!! Who makes a pizza with NO..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, -0.25], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "H_og8Pdq2ijAx1QrWjCMNQ", "text": ["$10 all you can eat boneless or bone-in wings (buffalo, teriyaki, parmesean garlic, sweet chili) during NFL games on Mondays (Sunday for east side location)...", "Service is terrible and unattentive. Restaurant 1/2 empty and took 40 min to be seated, then 40 min more to get a waitress over. Then another 40 for the...", "What a great place for a salad! Plenty to choose from, & you can pile a ton on your plate for a one time go through. It's $5.99 a plate, $2 more for all you..."], "rating": [4, 2, 5], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [["wings"], [], []]}
{"id": "kz5UANVmPxpllcoLnZBNhg", "text": ["*3.5 stars? Man, tough crowd. The other reviewers are MEAN! This place is great!*\n\nHow haven't I reviewed the Great Dane yet? This place is just raw fun :D...", "Have to \"ding\" them on take out from last week. Ordered the Nachos with chicken to go...came out \"to stay\".  No good!  I requested that they start new with...", "We have been to the Eastside Great Dane many times and for the last number of years it has disappointed us, tonight was no exception. \nStaff - poor\nFish fry..."], "rating": [5, 2, 2], "TBscore": [0.0, -0.23, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], ["chicken"], []]}
{"id": "kGmntPru09mK3w8uD8oI8g", "text": ["Great fries. Good food. Good service. Got there just after they opened for lunch, the bartender was the only front of house employee we saw, while we were...", "The food was ok. Nothing to special. I got the seafood Po' Boy (Shrimp). \n\nOur waiter was good. Very friendly, and engaging. \n\nWe had to wait for 30 minutes...", "Bit of an underrated place! This will give you some solid food for a very decent price. The interior is actually kind of cool, kind of feels like there..."], "rating": [4, 3, 4], "TBscore": [0.55, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["lunch"], [], []]}
{"id": "skJ-AlN0DT9pmBDz0ixeJw", "text": ["Perfect for late night cravings. I don't know if they ever close! If you come early enough, there is a second floor balcony with a nice ambience that you...", "Easily the best gyro I've ever eaten. Parthenon is what gyro dreams are made of.\n\nI recently discovered gyros a few years ago when hubs introduced me to...", "This was the worst experience ever.   I ordered a gyro that arrived cold and greasy.   I ordered fries and only received the ketchup packs.  One taste in..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "mzq_UgBRWsxTjb7oBNajWA", "text": ["A fine excuse to eat and drink during the daytime hours, particularly during the warmer times of the year. I've been to all the Dane locations except the...", "I'm always kind of wary about local restaurants that open up multiple locations after one is successful, but they did a nice job with this place. That being...", "The hubs and I love the Fitchburg Sunday brunch, so thought we'd tried the Hilldale location.\nFirst, let me tell you the wait staff was great! I will go..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.58], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], ["brunch"]]}
{"id": "-y8Nz-elBXkUYoIoc9AADg", "text": ["This place is awesome! Came here for the first time and will definitely be back. I went with a bowl and got the pita on the side. I opted for chicken and...", "These guys have the best falafels I've ever had! They pair perfectly with the garlic and tahini sauces. You don't really need anything more in your dish!...", "Naf Naf Grill is basically Middle Eastern fast casual, where you customize your base, protein, toppings, and sauces. I got a bowl with basmati rice, chicken..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, -0.34], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "Y_wVqdHHkmfxdaHGOPffqQ", "text": ["Seriously amazing customer service. Food is great! Friendly staff. I highly recommend", "Had lunch here, and I liked there orange chicken the most. I think it was better then Panda Express orange chicken. However, the ladies who were working at...", "Obviousy the \"bourbon chicken connoisseur\" reveiw on this listing is either from and owner/employee of the location or a person posting yelp reviews from a..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, -0.6], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], ["chicken", "lunch"], ["chicken"]]}
{"id": "49JTxfrT4BnROuk9_RIW6w", "text": ["Hot wings were great. Not spicy as they could be which was ok for me.\n\nGreat temperature\n\nGreat customer service", "I don't know why we keep coming here. \n\nThey are almost always out of something we order. Pot pies are pretty much a myth around here. \n\nTonight the drive...", "Went up to the drive through at about 4:40pm on a Sunday . Me and one other car was waiting for about 10 minutes with no answer from the intercom, some one..."], "rating": [5, 2, 1], "TBscore": [0.63, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["wings"], [], []]}
{"id": "pNgDhHaeFkWQW71NzT9wzg", "text": ["Asked for BBQ sauce through the drive through, when the employee repeated back, indicated \"no sauce\", promptly corrected the employee for BBQ sauce and...", "Suck and suck some more... eat roadkill instead\n\n0.stars I took 15 mins to get the order and missing mashed potatoes in the mashed potatoes... really!\nGravy...", "This place is horrible on a lunch break came to this place for a quick bite second person in line twenty minute wait gave this place another chance went..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, -0.22], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "upI-oDFUBr_P9Q_waV7rmQ", "text": ["I had really good memories of their Sesame Chicken from a few months ago, but when I went there last week, it was actually pretty bad. Did not have any of...", "Why, in an amazing city like Madison with a plethora of delicious ethnic food options, would anyone go to Ginger Root? Convenience, you say? Bah. Ever heard...", "The worst Chinese food I've ever had, without question. Across the board, everything was remarkably bland. The Szechuan Beef had not the slightest hint of..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, -0.39], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["chicken"], [], ["beef", "chineese"]]}
{"id": "7wZgquJ30qkVQbvbJo92ow", "text": ["Tried this place out on a Monday night after reading some pretty good reviews, and having nothing in our fridge...\n\nThe place was pretty empty when we got...", "Overall, my first experience at Mad Shawarma was decent. I went with the Chicken Shawarma sandwich on traditional bread instead of the pita. It is a little...", "I love Middle Eastern food. I crave it. So I was really glad to see when this restaurant moved in. But now the bad news: I've been there twice and I haven't..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], ["chicken", "sandwich"], []]}
{"id": "iyFZ9sfWWeMDNhtmdl9MvQ", "text": ["I admit I'm a big newbie to Puerto Rican food, so when my co-worker told me about El Wiscorican, I decided to forego my usual Friday lunch of Vietnamese...", "I was at Madison Night Market last night pigging out at various food trucks. I came across El Wiscorican and a Costa Rican food truck with very similar...", "Authentic Puerto Rican food it reminds me of being back home! If you go I would advise you to eat the plate of the day with tostones and lots of mayo-ketchup:)"], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch"], [], []]}
{"id": "0au_HRvOYfhQyvdvjZdzUg", "text": ["This place does not exist.   Would greatly appreciate that this be removed from yelp.", "Pleasantly surprised. After plans to see a movie fell through my husband and I decided to grab some sushi. Not being familiar with the area I looked for the...", "Yummy fresh sushi made to order. You can take it to go or sit in the pleasant dining area.  Some nights feature a pianist."], "rating": [1, 4, 4], "TBscore": [0.0, 0.24, 0.52], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [[], ["sushi"], ["sushi"]]}
{"id": "QBDwbEEc9uEnn7dzVZu60Q", "text": ["I've only gotten delivery and takeout here, as a heads up, and I've only gotten sushi and some of the appetizers. However, so far I'm a fan! Delivery was...", "What is the problem to keep the restroom clean???\nLucky you we found it at the end of the dinner and not at the begging because we will not stay in a...", "Amazing food with amazing service. My boyfriend and I luckily came on his birthday, and this place has a wheel of free items you get to spin for the..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["sushi"], ["dinner"], []]}
{"id": "gHVg2CnW8Bw41sKiKi3t3Q", "text": ["Amazing food. Amazing deli.  Amazing bakery. Amazing produce.   Amazing meats. Everything just plain rocks with this place. \n\nThis isn't the Piggly Wiggly....", "This is specific for the cook station:  this has seriously gone downhill since last year. The prime rib that was suppose to be medium was barely rare!  We...", "Okay, we have lived in Madison for just over a year and a half and we have been going from store to store in the area randomly because we haven't found one..."], "rating": [5, 2, 5], "TBscore": [0.46, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["deli"], [], []]}
{"id": "VqmfEN2eiNHEJrVF_NkEjQ", "text": ["We shopped here several times during a brief visit to Madison in early July 2018. It is big and clean and you know what...It *actually* made me envious of...", "Grocery store is always bright, staff are always available and knowledgable for the most part. \n\nWe asked the dining area for ingredients cooked with baked...", "A favorite of my whole family. Food and service are always top notch. Menu had some typical stuff (burgers and sandwiches), but changes frequently with some..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.23], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], ["burger", "sandwich"]]}
{"id": "4Pn83EWDr16n6kU1O6u42g", "text": ["Really liked the subs here.  My husband had the large veggie and enjoyed it a lot, especially the bread.  What he really loved were the cheese curds...way...", "Cousins has always been one of my favorite sub shops, and personally I think it is far superior to Subway. The bread is far and away better. This location...", "Expensive for what you get... It's a sandwich and nothing special to justify the price. You get more for less at other chain sandwich places. Other than..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "Cs7Zny0ijnyE9nZWSLBnAg", "text": ["Always great service. \nThe sandwiches are pretty delicious but more often than not almost taste the same. \nFavorite sandwich - Turkey pesto panini and the...", "My FAVORITE food truck! I love it when they come to my work parking lot, because I always have to fight the urge to go back down and grab another panini....", "Hadn't tried Toast until today- I thought $7 was a little too pricey for a sandwich, but I had a Yelp coupon and I'd heard rave reviews.  The hype set my..."], "rating": [4, 5, 4], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["turkey", "sandwich"], [], ["sandwich"]]}
{"id": "khHxKm1_x6syS5W2LTX0lw", "text": ["We always eat here when we go to the mall.  Love their honey mustard chicken sandwich. A soda and a cookie and you have lunch.  Yum! Always good.", "These guys make a pretty mean sandwich! Have them toast you up a Mesquite Chicken with Zesty Grill Sauce, on the Jalapeño Cheddar bread for a tasty meal! A...", "Terrible! I came there twice, they overcharged me on EVERYTHING I ordered. When I argued, they refused to adjust the charge according to their advertised..."], "rating": [4, 4, 1], "TBscore": [0.0, -0.3, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["lunch", "chicken", "sandwich"], ["chicken", "sandwich"], []]}
{"id": "mEuXIK4Njq37DBLmMlz_0g", "text": ["Closest to home but not usually where we stop for subs. Very friendly staff, answered all questions necessary for coupon, and allergies. \nIngredients...", "The worst subway I've ever visited. Staff terrible, food a disgrace to \"fresh\" and the whole place was so gross to even sit in. Never returning.", "Came in during a lunch rush for my favorite steak and cheese on flatbread sub and the employees were on point-- they were quick but not even the slightest..."], "rating": [3, 1, 5], "TBscore": [0.0, 0.0, 0.42], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [[], [], ["steak", "lunch"]]}
{"id": "5sV9N8rB3TNBkp1K35WM5w", "text": ["Cousins Subs is a Madison tradition.  Something I grew up with and therefore love even if it's not the greatest-- like Rocky Rococo pizza.\n\nMilio's cold...", "Thanks so much again for great party subs for Christmas. You dud a great job. With everything. We will be back again next year for it but also during non...", "I've never been to a Cousins before. As a matter of fact, I'm just biding time until my oil change is completed next door at tires plus.\n\nThe two dudes..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "y2I0Yt6yr48ZgUvR3Pe7Fw", "text": ["Excellent customer service. Clean place. Hardworking people. The only place in town that gets my order right. I will return often!", "Been to this Quiznos a lot in the last 6 months. Why? Well, apart from being really convenient to my house, the food is good and the service excellent....", "Clean, friendly, and a nice location.  Quiznos has very good subs.  It's a reliable grab when you're out on the road and need something to fill your belly...."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "8S-JaDa1tPdAGaQPTUMjaw", "text": ["My first Milio's experience. The Milio's founder is cousins with the Jimmy John's founder, so you'll see immediate similarities off the bat. \n\nI went with...", "Standing in line for a mobile order....really?\n\nMilo's sandwiches are fine and I love that they've added the lettuce wrap option.  However asking mobile...", "While I love Milio's as a chain, I have to give this particular location a lower rating simply because it says they offer delivery and when you call to have..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.46, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], ["sandwich"], []]}
{"id": "kjV76iCWwQedixbRIvC9gQ", "text": ["Great service, super clean and fresh! My sub was perfect!  The employees were happy and fun to chat with! Love the bell ringing for perfect subs!", "Can't complain about the place or the service but this location sucks. It's sketchy around these parts. The staff was friendly the place was pretty clean...", "Shoutout to Sarah for being a very friendly and nice employee! Had a very good experience here and loved the great customer service"], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "byCy8CgQVNDOp1EHNx09bw", "text": ["Delicious gyro sub.  The onions were delicious.  Much better than Subway. I was working nearby, so thought I'd check it out.  Im glad I did!", "Excellent food and service.   Yummy cookies.   Absolutely pass on subway for this place.", "I'd go there more often if the prices were lower, but you get what you pay for.  This place puts Subway to shame."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "DkVmX5Zzx_lvl-2Zzyz3bQ", "text": ["This place is so good, the staff are friendly and deliveries are always less than a half hour. Delivery crew are friendly and very polite. Love these guys,...", "Just ordered online to Cottage Grove location. Prompt call back for credit card payment. Courteous staff over the phone to tell me certain add-on snacks I...", "I love Milios, but this is the most annoying system. You order in the back, pay at the front, and go back to get your food. It's your normal, great Milio's..."], "rating": [4, 5, 2], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [[], ["snack"], []]}
{"id": "NiYjWteYkFwglnlJEDe2BA", "text": ["I only go here for the occasional M-F lunch and at that time, they know what they are doing.  I'm dealing with the same two employees, they are accurate and...", "Always good quality subs when I go there. Ingredients and bread are always fresh. Subs are never made the same each time I go there. Often, the employees...", "It's subway.  It's bland, the toppings must come delivered in bags due to lacking flavor.  They've been out of certain type is bread numerous times...."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["lunch"], [], []]}
{"id": "B2Vh3RyRnLjns4sRMEhmrQ", "text": ["Always fast service! And always excellent customer service. Nate LOVES his job and he is genuinely nice and personable to every customer every time I go in...", "I should've went with jimmy johns two hours late plus up charge my card for a tip I didn't confirm", "Let me start off by saying I haven't been to any milios in at least 10 years... now I remember why. First off, I tried ordering delivery, but it was going..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "8Nu0oc2gCzTG4KA-sHa5lA", "text": ["I walked in to Milio's this evening and was instantly greeted by the sandwich barista saying, \"Welcome in! How are you?,\" standing in front of the register...", "I ordered lunch \"for later\" from this Milio's at a time 2-3 hours in the future. Instead, they brought it right away. Our office orders from them regularly....", "This review is for Milio's in general and not specifically this store location. I don't like Milio's and have never understood why people like these subs so..."], "rating": [4, 2, 1], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["sandwich"], ["lunch"], []]}
{"id": "9BohUwW-fTfcpiBT782Fkg", "text": ["Good subs. If you're looking for a change of pace from Subway and the like, try out Which Wich. Broad menu options and all sandwiches are fully...", "Love this place. Probably only waited 5 minutes for my sandwich. Always get great services. Thanks!", "I cannot believe I have to even explain why this place is pure sh*t. Which Wich? Really? Is that supposed to be witty? Their name is the saddest attempt at..."], "rating": [4, 5, 1], "TBscore": [0.38, 0.39, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["sandwich"], ["sandwich"], []]}
{"id": "z2Etq4K6YwbV7P5ENVYEgg", "text": ["Just stopped here.   I always drive by this location and thought why not spend my money here too. I love subway. \n\nAhhhh bad slow service.   The guys...", "I always experience good service here.  I usually stop in around 4:00 on a weekday.  The female behind the counter in the afternoon during the week  is...", "By far my most favorite Subway. The AM crew is wonderful. Always nice and friendly."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "u5YFVrxuifUxuMRbRVC6AQ", "text": ["Milio's is a pretty good Madison-based sandwich shop. Their spot on East Campus Mall in Madison is always busy, but the staff do their best to get you in...", "MIlios absolutely never disappoints. They care reasonably priced, and quality care service. Even though they took away the zesty mayo, they are still...", "Super quick and friendly service! The restaurant is kept fairly clean (keep in mind that they service mostly college students and most of the workers are..."], "rating": [4, 4, 4], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["sandwich"], [], []]}
{"id": "cRDEkJWuXpKzuSYUpmyX5w", "text": ["Horrible customer service! I waited my turn, guy behind the counter asked me what I wanted and then left to help someone else with what they wanted.  Don't...", "It was fine, but not memorable. \n\nI stopped for a quick lunch recently and left with a fulfilling sandwich. I got the veggie patty and added the sweet onion...", "No, no, and no. Slow service at this location. To be fair, they have a \"Now Hiring\" sign posted, but those that did work there appeared to be on their first..."], "rating": [1, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.2], "keywords": [[], ["lunch", "sandwich"], []]}
{"id": "bqNV9FU60H9BVPJ4kWptOA", "text": ["You can find cheaper, better sandwiches on the block - there's a bahn mi cart up Charter before University. I went to QQ Express a few times, and while that...", "This subway has got it on lock.  It's the fastest, most consistent subway on campus.   With the line going out around the lobby during lunch, I've still...", "While the people working at this Subway are very friendly and the service is good, it appears as though they are clearly instructed to majorly skimp out on..."], "rating": [1, 5, 3], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [-0.6, 1.0, 0.2], "keywords": [["sandwich"], ["lunch"], []]}
{"id": "c_-0jkr-MkK2EdlbJaXgyw", "text": ["A new, lovely space on the north side. I stopped in after a meeting in the same shopping plaza to check things out since it's been years since I've been in...", "Willy Street Co-op\n\nPoor training, impossible for them to correct an error.  I get the feeling employees are hung out to dry.\n\nNeed more food stores with...", "I really like this place. I find things here that other places don't carry, as a vegetarian. People say that they have little selection, which might be..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "MwsLN3Lo2SEbldy0HvBYEw", "text": ["I have no complaints with this Subway. I've eaten here a handful of times now as I work very close, and each time has been just fine. \n\nThe Subway shares a...", "Been here a few times. Parking is horrible. Ive had to skip in several times and go elsewhere.", "I only go to this Subway because it's close to home. But every time I go in there the staff is very un personable and rude! Wish they would hire some new people"], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "MOsFhDVav42shCq9-rgejw", "text": ["I'm Wisconsin for some high speed military training and was tasked out to drop off a rental at Madison airport. We were hungry so we asked the staff at the...", "What an epic fail. Ordered delivery (catering for 10 people) to be delivered at between 11:30-11:45am. Received confirmation email that it would be...", "Ugh. Potbelly. I keep going back, and I keep getting burned. \n\nToday I was SO happy when my food was ready ON TIME. That was a first in a long time. The..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "5sEcWQd9-LqRvE98ouEILA", "text": ["Nathan served me today, he was great!! Made my subs just as I asked & offered deluxe. Very friendly too. Outside light was not turned on, it was dark so I...", "This location is okay. Not as busy and they don't have the 9 grain honey oat bread here. Staff was pretty nice. They really need to pay attention to getting...", "Guy with the red goatee took 10 minutes to put my blt in on the computer and on top of it I had to leave to drive all the way to my bank atm just to get..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "YpsMG1_Vf-rEVjl42Nw8hg", "text": ["I must be getting old as I still refer to Milio's as Big Mike's (the name before the switch).  Yes, you can still get day old bread and I am still a fan of...", "Great food!! Deff worth the drive from FL!!", "Milio's Sandwiches is the national chain of a sandwich shop for the local \"Big Mike's Subs\" that first started in Madison. They have simple, but tasty..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "JvCSGmN8gS-kNh9xLgLC1Q", "text": ["One of the sandwiches we received in our lunch order was completely wrong, we called to resolve the situation and order a new sandwich,  I asked to talk...", "Employees are friendly and speedy.\nIf your order was wring they will remake it for you no problem.\nFood is great!!!! Service with a smile is always...", "Ok the food here you can get anywhere else never felt it was worth talking about to anyone.\n\nHowever today I saw a red hatchback with a Milios flag that..."], "rating": [2, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, -0.6], "keywords": [["lunch", "sandwich"], [], []]}
{"id": "bAu0kP3jyA4qdTzfQqHSmQ", "text": ["If Costco and your favorite butcher had a child together, it would be UW Provisions.  It's for the wholesaler but also non-bulk consumer-friendly. It's a...", "We've been here 3 times now for their cooler sale. The first time was crazy and hectic but since then it's been a LOT better  (probably because they spread...", "This place is amazing, I would never have even found it if my step mom didn't tell me about it. Two of my favorite things from there are \"bitchin Bob's bbq..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "LgfFsCtutx28J_Onmrr-OA", "text": ["I've been to this Subway many times and the service is usually quick and the sandwich artists here are good at making sammies they way you want them. They...", "This Subway Subs location (5957 McKee Road, Fitchburg, WI) is very clean and the people are super friendly.  The breads, vegetables, and meats are very...", "I did not experience the skimping that Leroy J. did. The staff we encountered were friendly and generous on toppings. The customer service did not blow me..."], "rating": [4, 5, 4], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["sandwich"], [], []]}
{"id": "vL2XhH5KWVY9ZV6SCjmwCQ", "text": ["Panera as a company has really come a long way! First off, love that they have higher quality ingredients now (no artificial sweeteners, preservatives,...", "I don't know why I keep trying Panera when despite what location I go to, I get horrible service and long wait times for a small amount of expensive...", "I am officially writing this location off.\n\nI used to work nearby, and ordered lunch using rapid pick-up on a fairly regular basis. I highly recommend..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["lunch"]]}
{"id": "H3mVlmy_Nt9KakdveGO58A", "text": ["HEY BILLY, GRAB ME A CAN OF BUSCH. *hick voice*\n\nI head here when I'm feelin' like a fresh, hot, unique and delicious breakfast with some hick vibes from...", "I have only ever come to the Squirrel's Nest for weekend breakfast, but it is definitely worth the trip. I had passed this place a few times whenever I had...", "I've been here several times for breakfast and it is really good! The bar is pretty small so it can be challenging to get a table or seat at the bar...."], "rating": [5, 4, 5], "TBscore": [0.48, 0.0, 0.28], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["breakfast"], ["breakfast"], ["breakfast", "bar"]]}
{"id": "br1uQbc3YU5jCpYi46nIgQ", "text": ["Cafe Maya is the third or fourth iteration of this space that I've been in. The first thing I remember is a case of fancy chocolates in the back left...", "Cafe Maya has a very cute atmosphere. It is well decorated and quiet. If you want a place to relax, eat and drink coffee cafe maya is the place to go. They...", "Cafe Maya, the newest coffee shop in this location. Not too much has changed, although the inside seems a bit more spacious and cozy. They offer all of your..."], "rating": [3, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "cxyDANKI4ptp9VdbgEtCtg", "text": ["I love this place simply for its Wisconsin beer cheese and andouille sausage soup, which I only find on the lunch salad bar menu. The salad bar is my...", "With a restaurant without walls to a busy (sorry I meant REALLY BUSY) hotel lobby, it was a bit hard to spot the host stand.  We found it and were seated....", "Went for Restaurant Week - not impressed when I walked in. It's really lacking in ambience, especially the lighting, which was too bright and kept it from..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar", "lunch"], [], []]}
{"id": "XFuNeVTGWZ-UOYO58NNmKg", "text": ["Our evening began with excitement as we were celebrating 2 couples' wedding anniversaries, but it ended with nothing but disappointment with...", "My husband and his family were meeting in Madison for his father's birthday.  We were able to stay in the hotel that the Statehouse is in. The food, drinks...", "This has been a previously great spot . Bad service . Cold food. The French dip ( 18.00) was described as prime rib - just processed sandwich meat."], "rating": [1, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "rQl6EuSaEfFLJhMw9lR0xQ", "text": ["It's the day before Halloween and I search for a parking place on a rainy afternoon near Madison Chocolate Company on Glenway Street at Monroe Street. I...", "My friend lives by Madison ChocolateCompany so I have been here a couple times with her.  Staff are super friendly and the location is good (although there...", "This place hands down my new favorite coffee place. I'm obsessed with coffee. In order for me to get through the day I have to have a cup of coffee or match..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "XMEGoJVtQ6EgVox1yTsO8w", "text": ["Can't complain about Perkins. I love going to Perkins. I love their breakfast and their pies! Service is always fast and convenient no matter how busy they...", "Perkins is a reliable choice when dining with my parents.  They like the choices between breakfast and dinner.  The addition of the Coca cola machine with...", "Have not eaten at a Perkins in years.  My husband was hungry for pancakes and we were in the area of this restaurant for dinner.\n\nHe had the two pancakes,..."], "rating": [5, 3, 3], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["breakfast"], ["dinner", "breakfast"], []]}
{"id": "OCytAjNw1jvhfEF7KU43GA", "text": ["I finally made my first visit to a Perkins and I was very pleasantly surprised. \n\nWhile I normally like to opt for local restaurants. Perkins is the...", "The service is horrible.  Would not recommend this Perkins.  Fruit flys we're all over the place.", "Out of all the chain breakfast places, I probably will always pick Perkins. Mostly because they have a large variety of choices and their pies. \n\nIf you..."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [[], [], ["breakfast"]]}
{"id": "MFfVzbVrph4OZ7FNDZdF0g", "text": ["I can't add a star. We are already at 5. Second visit.. SO clean. So friendly. Such great food. Chopped steak breakfast was the best chopped steak ever. We...", "We came here after a intense workout so you betcha we carbloaded after.\n\nI got the Country Fried Chicken & Eggs, that came with a hung of crispy, golden...", "Struggling to find a good breakfast place on the West Side? Look no further! \n\nCame here on a Saturday morning around 11 for some breakfast. Waited shortly..."], "rating": [5, 4, 4], "TBscore": [0.42, 0.0, 0.23], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["steak", "breakfast"], ["egg", "chicken"], ["breakfast"]]}
{"id": "Car4D_KYnNNSxH9NPwcGAw", "text": ["Great place for a truly classic deli sandwich. My partner turned me into this place for one of the best places for a Rueben- and he is right! Plenty of...", "As a vegan I was a little bit wary of Stalzy's Deli, but my non-vegan dad said it was great and so I went too.  They were able to make me a vegan borscht...", "Delicious, if a bit pricey.  You have got to try this local sandwich place.  I especially reccomend their triple decker sandwiches and their salmon bially."], "rating": [5, 4, 4], "TBscore": [0.58, 0.0, 0.33], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["deli", "sandwich"], ["deli"], ["sandwich"]]}
{"id": "NYxVVeeI-zz2qjPKk6FCwg", "text": ["Southern cooking and friendly hospitality right in my hometown. From walking in the store to walking out, family friendly atmosphere, for shopping and...", "Thanksgiving dinner was great here. Vicki the waitress was fantastic. Love Vicki and ms. Lee she was awesome I had to give her a hug.", "Oh my... I love me some CB, but this trip was crazy bad. I asked for a medium burger and it came to me raw. I asked for well-done scrambled eggs, they came..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.68, -0.26], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["dinner"], ["egg", "burger"]]}
{"id": "u84eyOBILlFQIc8fMFCoig", "text": ["Nice place for sandwich, salad, and soups. I got a chicken sandwich, which was surprisingly tasty and a 1-time salad bar. \n\nThe salad bar had your...", "Jason's Deli is just okay, not amazing. The only thing on the kids menu that my kiddos would eat is the bow tie pasta with meatball and half the time the...", "Lets be honest. The food is good, nothing to rave about. It's the price that makes me give it 3 stars. I find that it is pricey for the type of food they..."], "rating": [4, 3, 3], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["bar", "chicken", "sandwich"], ["pasta", "deli"], []]}
{"id": "O615O_US381DcvkxwuEz7A", "text": ["This place is great and always gives me what I want to a \"T\"! Excellent Columbian Dark and two shots of espresso to make my specialty Red Eye! Bummed out...", "I ordered online and probably was one of the first few customers in the weekday morning. \nThey took good 10 minutes after the order was confirmed( they said...", "Wonderful coffee and a delicious cinnamon roll! A great way to start the morning or kill time in advance of an appointment. Barriques never disappoints."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "6MkQ454ElyTcMrMLU3qm3g", "text": ["Great customer service from start to finish.\nI loved that I could opt for lettuce wrap around my Little Bacon Cheeseburger with the works, hubs got his with...", "I love this place. Honestly, you are paying for the quality of food. Although, expensive... it's well worth it. Their milkshakes are sooooo good! Especially...", "After a few visits Im not really a fan, For what you get everything is overpriced. I've had several burgers at regular sit down restaurants near by that..."], "rating": [4, 5, 2], "TBscore": [0.44, 0.3, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [["burger"], ["milk shake"], ["burger"]]}
{"id": "gtcvMLPePKKyXzSroO4J5A", "text": ["This place is so Madison. I love it and the park setting. And the bike trail. And the mint chip!\nLet's not worry about the health content, k?", "Our go-to spot after date night dinners! We like this location better than the Fordem one, mainly because the service is simple: friendly and fast. Wasn't a...", "Fabulous addition the neighborhood. Zanzibar is probably the best chocolate ice cream ever. Pull up your bike, they participate in bike benefits (free..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "Ol4QM1QI5GlK36t2sGC7KA", "text": ["I was debating between four and five stars, but I really don't have many complaints at all so I went with five. The Hubbard Avenue Diner is definitely a...", "Hubbard Diner is a staple in the Madison area, especially when it comes to breakfast and pies. As someone that grew up in New Jersey (the unofficial diner...", "Ya know what you're gonna get. If you want a great basic breakfast, then come here. You want a decent burger, they got them. I give a restaurant 5 stars..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.32], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["breakfast"], ["breakfast", "burger"]]}
{"id": "CpPJ2UKAxDLwj95-HNFPHg", "text": ["I'm in town for work and was looking for a coffee adventure. And I found one! Almond milk honey lavender latte and a beautiful location. Can't wait to come...", "Coffee, wine and hard liquor.  Plus their food is good and does not arrive frozen.\n\nPlenty of seating, staff is fine, wifi is free.  Its not as fun as their...", "Good breakfast sandwiches priced right. I had the Chorizo Huevo Breakfast wrap. This was a full sized wrap cut in half, very delicious and hearty. The wrap..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.43], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], ["breakfast", "sandwich"]]}
{"id": "HO2knNxcc_8lFtgGxN8q2A", "text": ["Scouted this place out when we decided to take a weekend trip to Madison for my bday! Knew we had to hit it up and so glad we did! We walked in and was...", "I ordered a double cheeseburger and a large order of waffle fries from Nitty Gritty on Frances St., in Madison, WI. It was a total disappointment. I had...", "Been here 23 years in a row.  Always fun. Hit every kind of crowd. Have every style and color of glass. Food is great as is the staff. Yearly my one beef is..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.57], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["burger", "waffle"], ["beef"]]}
{"id": "N-fJfsjeZy5FI-_8NfnOhQ", "text": ["After a meeting in Oregon on a warm day I stopped in to OFroyo after perusing the menu and seeing an option for Italian ice soft serve. I was intrigued and...", "Friendly staff and tasty frozen yogurt! They always have a lot of toppings to choose from, and I like that the yogurt isn't too sweet.", "I am so glad we have a delicious frozen yogurt shop in Oregon. I appreciate that they are very active within the local community - the walls are covered in..."], "rating": [3, 5, 5], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["italian"], [], []]}
{"id": "n28_5ElTCVkhP-9BTgQGgg", "text": ["My boyfriend and I received a coupon for a BOGO meal in the mail with the purchase of two beverages, so we decided to give IHOP a go one morning since...", "Woke up suuuuuuper early at our hotel so we stopped at this 24hr location for a quick bite. Mimicking what everyone says, it's dirty, cramped and old....", "Server was horrible!! Coffee cup had lipstick on it (when we asked for a new cup the reply was \"never fails\" and wanted to act like we was an inconvience),..."], "rating": [2, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "u11_SkpIgbVmb3d2suTbmQ", "text": ["I really like the ordering concept and the huge selection of things that you can get.\n\nIt's difficult to pull off having so many options. For starters, the...", "Kids and I have been waiting to come here for awhile... because it looked interesting.  We ordered 4 sandwiches waiting 10+ minutes plus for our food with...", "Nice choice selection for families- many options. One teen greeted us at the door and explained how to order- very friendly. \nBut basically they were..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], ["sandwich"], []]}
{"id": "F2KO-6OpG6F6Hg722IrgOA", "text": ["Though I've been to the W Wash location quite a few times, today was my first visit to the Barriques in Middleton! It's conveniently placed on my route to...", "I love coming here in the mornings and relaxing with a book. My favourite thing to get is a Honey Lavender Latte. The staff are all very kind and friendly....", "Stopped for a coffee when passing through town and HAD to try the spicy Canadian - a latte with a shot of maple syrup and cayenne pepper - fantastic! Just..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "ZEL8SF4BCqYgHyDyDxEUBA", "text": ["We stumbled upon this diner on our way to a bar that served food. Luckily they were open for dinner and we stopped in to check their menu. It was a jackpot!...", "Schubert's is a spot we tend to frequent because who doesn't love Mount Horeb. While we have never ate there for anything other than breakfast, it had...", "The food and atmosphere is 5 star. The waitress however had the personality of cardboard. I will definitely overlook the poor personality and be back for..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["dinner", "bar"], ["breakfast"], []]}
{"id": "EvsbXberGLbwGGVWb-n2-w", "text": ["Nitty Gritty is my normal brunch fav on the West side, but with the construction on Park/Gammon, it's a bit annoying to get to at the moment.\n\nStill, the...", "So, I moved here to Madison, WI about three years ago now.  I heard that at the Gritty you get a special birthday treat, not just the burger but bottomless...", "It was a very interesting place, as there was trivia night going on upstairs on my visit on 07/31.  I went to this place based on a recommendation from a..."], "rating": [4, 2, 4], "TBscore": [-0.22, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["brunch"], ["burger"], []]}
{"id": "7dtzpuYYpZeg-kJj3yTcUQ", "text": ["I love this place. I first encountered Sonic in Dallas and, mostly, have not been disappointed since. The menu only changes for the better with food fast...", "First time here so wasn't sure what to expect.  I had my window rolled half way up because I thought maybe they would hang a tray with my food on the window...", "I was stranded while getting my car repaired next to Sonic today, since I had 1.5 hour wait I decided to have a quick meal there. This was my first visit to..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "lzRlrIWuQmHVWU4zV6yZUw", "text": ["I went to Dave's Auto Service on Pflaum Road, Madison , Wi. Service advisor informed me to go online and register on Yelp.Com. To get a 20 percent discount...", "Gus's Diner was a more disappointing than I wished for a awesome looking diner place to be. The food quality of the meals just wasn't very good. \n\nWhen we...", "I LOVED Gus's! It was great that you can get half or small orders of things, I got the half eggs Benedict and it was delish. The egg was cooked perfectly,..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["egg"]]}
{"id": "8RbNzNeaUh5e8PJOnp1e4Q", "text": ["Service is slow but they've always gotten our order correct. Hopefully things will improve when construction is done.", "I honestly don't think I've been to a worse McDonald's. The fly situation here is out of control. There was a wasp when I was there. Super appetizing being...", "Not very good.  But I guess what should you expect. Not much...............................................probably the worst service at McDonalds I've been..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "2U-BRvnR9IGb61-GnIshLw", "text": ["This place is solid. Every time we have gone, we have enjoyed our meals. Service is solid as well. If you're looking for the best breakfast/brunch place...", "Stopped in for lunch the other day with a coworker. We beat the lunch rush for sure, as the place was practically empty. By the time we were leaving,...", "Had a really nice breakfast here!!! The Bloody Mary was very good and the biscuits and gravy were quite tasty. They offer a great breakfast menu along with..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.48], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["lunch"], ["breakfast"]]}
{"id": "nnZU8CDlcDN8DBQ8KSqtmQ", "text": ["Got there on a Friday night & sat at the bar, the staff was really attentive. Ordered our food and waited forever!!!!!!! Finally asked what's going on with...", "The Nitty Gritty has been pretty fortunate that there are limited options in Sun Prairie for food other than pizza. It's the type of place that is pleasant...", "Great for vegetarians! You wouldn't think this would be a good stop on your list considering it's all burgers. But this is a great place for Omnivores and..."], "rating": [4, 3, 3], "TBscore": [0.5, 0.0, 0.83], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["bar"], ["pizza"], ["burger"]]}
{"id": "RAJLLaerVrrz4vqS3qex7g", "text": ["Stopped by here this morning with my sister and we had a very pleasant experience! The donuts were really fresh and the one worker was putting in new ones...", "This is good enough for a specialty donut shop. It's not great - or at least it wasn't great when we came in after 9pm.\n\nI do love the variety that they...", "Man, this place has many customers over the course of a Saturday afternoon. I really wanted to try this place, but shied away when I heard about the crowds..."], "rating": [5, 3, 3], "TBscore": [0.48, 0.22, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["donut"], ["donut"], []]}
{"id": "LAfEK36d29LZn6vSDWYzOQ", "text": ["First time in this location at noon on a Saturday - I thought it'd be much busier! After reading other reviews, I guess that's why it wasn't. \n\nI came in...", "You know what's weird, I often find myself in the DD drive-through rather than in my works parking lot. Not sure if its because I am half groggy and think I...", "Seriously Dunkin' Donuts, using your rewards program is an absolute embarrassment. This isn't the first time I tried to redeem my free drink DD perk reward,..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], ["donut"]]}
{"id": "jovAV03BKKo4rGBNX0hrUw", "text": ["Five stars for service, three for the actual product. \n\nI stopped in on a late weekday afternoon to pick up a box of Munchkins. I'm not a huge Dunkin'...", "I'd give no stars if it were an option . I was charged for a hot tea when I asked for a cup of hot water . $2 for a cup of hot water isn't justifiable \n\nThe...", "PROS: Has parking / no lines (for a reason?)\nCONS: Employees do not know how to count / poor customer service \n\nWe ordered 50 munchkins, but the lady that..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "y40qTCpkR3-nZX-Zmy_m2Q", "text": ["Finally Stoughton has a place that I can get coffee at until 9pm. The grand opening was this week. Stopped in this morning for a breakfast sandwich, and...", "I have been really impressed by this new location's customer service. Everyone is friendly and helpful. Service is also really quick. They even wrote a...", "Place is new ,food is same as other locations , service is poor , kids don't think at all putting donut upside down in bag so frosting stuck to bottom ,..."], "rating": [5, 5, 1], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["breakfast", "sandwich"], [], ["donut"]]}
{"id": "FEH0i7SnTH81k451ZadKIQ", "text": ["Autumn is such a wonderful time to indulge in the full bounty of the growing season. Yet another fantastic growing season has again blessed us with so many...", "Gorgeous setting and happy vibes.\n\nOvercrowded and most booths don't know how to make a coffee or other item they specialize in. \n\nOverall a shoving contest...", "Whole lot of cheese curds and veggies \nGood selection of bake goods\nMaybe not as much variety as you might think for as many vendors as were there. Seemed..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "5Ofzy1JyvQhjlO3xiQVW2g", "text": ["Small, but oh so mighty. We stopped in on a recommendation from a friend, and it was the best decision we made. The worst decision we made was not finding...", "Why oh why did I only get one donut?! It was so hot during Oktoberfest this year, so chocolates and cheesecake were out of the question for transporting...", "A great little bakery. They were very kind and helpful. I wish they sold sandwiches, though. We ended up buying sandwich bread and going across the street..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.46], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["donut"], ["sandwich"]]}
{"id": "1nV672vSi11Qjo-Lpxu8Mw", "text": ["Only place in town for a good variety of donuts, so they will continue to get our business. However, I've never had a friendly face help me, they always act...", "Let me start by saying say this place has the worst customer service ever. Food is obviously the same old dunkin but this particular place deserves 1 star....", "I ordered hash brown today, and it didn't take long to get them but they were cold. I think I would have liked them if the were hot. \nBut it was clean and..."], "rating": [2, 1, 3], "TBscore": [0.36, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [["donut"], [], []]}
{"id": "FDOMBPL6NK3pKpRqU2Z4Lw", "text": ["WOW they have donuts! So I bumped it up from a 1 to a 3 star as they actually had donuts! It would have been a 4 except they now don't carry the Dunkin...", "Good food and service but dining area is not maintained. I was there from 2p-3:30p on a Sunday (not busy, steady drive-thru) and not ONCE did they clean off...", "Super great service! Their iced lattes are to die for! Great prices compared to other chains like Starbucks or locally owned beans n cream. The only..."], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["donut"], [], []]}
{"id": "Wa0X0ro0-psALL_EJjenTA", "text": ["We decided to take the back roads through Wisconsin and found this gem. All the yummy treats were baked in house by this ultracute couple. Lots of choices...", "Went in looking for coffee and a pastry and was greeted by a boy around 9 years old behind the counter. We told him we would look and let him know what we...", "I stopped here for a quick bite and coffee on my way to work.  There were a couple of cars in the parking lot, which I thought was light for a Saturday..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "IPUGrf2xuClfxfBIA020kw", "text": ["First of all, for those not from southern WI who arent familiar with Woodmans, you are missing out.  \n\nA giant no frills warehouse grocery store with...", "Started with 4-Star Review...I am a huge fan of the Woodman's Ap for getting my grocery list together and now have food the convenience of shopping online...", "Did the ShopWoodmans.com today for the first, and last time.\nPlaced my order, choose my \"replacement\" items, and paid no problem. \nNow starts the pain. \nYou..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "lOY5UWReux2rfd2HtASifw", "text": ["It's been awhile since I've been in this location, and it looks like they added quite a few items to their hot foods/bakery/prepared items line-up. I...", "I often frequent the high-priced grocery store. They have many different options to choose from their hot bar as well as the cold bar. I particularly like...", "Hyvee is an awesome grocery store that i go to for any specialty items i need.  They have a lot of delicous samples during the day.  From 2 until 4, you can..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], ["bar"], []]}
{"id": "BXhXmdzrQADNo_yapDgobQ", "text": ["Awesome sales. Friendly associates. Helpful people. I love this store! Great selection of food, hard working people. Super fresh produce. And as mentioned...", "So grateful to have a grocery store with departments that care about their products and service.  Best donuts on the Westside, hands down!!! These donuts...", "I really like this Copps/Pick n Save location. It is very close to my house and therefore super convenient. It is never too busy and the checkouts are..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["donut"], []]}
{"id": "9QzBnFBf1t3RZNM4aiunEA", "text": ["This is a two-part review:\nSo I've been shopping here since this was a Piggly Wiggly then a Copp's and now a Pick n' Save. I've gotta say overall the place...", "Overall, this is a pretty good Pick 'n Save location. It's right on McKee and on the way to get back onto the beltline, or at least, I always seem to pass...", "I enjoy this neighborhood grocery store.\n\nI find their everyday prices very reasonable with excellent weekly sale prices.\n\nWednesdays and Saturday they'll..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "MIyGmoGS8cG1INmVey-BZw", "text": ["Probably one of may favorite places, if not my actual favorite place, to get breakfast in the Cottage Grove/East Madison area. \n\nThe breakfast potatoes are...", "En route out of town we stopped at  Olde Town for breakfast. It is a quick serve casual type place... order at the counter and your food is brought to the...", "Nope.... had the veggie skillet. Greasy and poached eggs were over hard. Never got the toast that came with it either. Wouldn't go back. Try school grounds..."], "rating": [5, 3, 1], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["breakfast"], ["breakfast"], ["egg"]]}
{"id": "UXRaY-AuZC9nguDXlcLvcg", "text": ["So happy they are in sun prairie!!  Came for lunch on Monday. I had the special, chicken with a delicious sauce seasoned perfectly. Moist and tender,...", "I visited this restaurant with a friend early on a Saturday afternoon for lunch before we headed to Milwaukee for an evening event. We both love a good...", "I was not planning on writing a review but I contacted them through the corporate website and have not gotten a response so I decided to write this in hopes..."], "rating": [5, 2, 1], "TBscore": [0.5, 0.43, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["chicken", "lunch"], ["lunch"], []]}
{"id": "84WYW7OfV-IXUJk95EL5_Q", "text": ["I would say that a 3.5 is really what this place deserves - 4 stars for being the only Brazilian steakhouse in Madison, but 3 stars for quality of food and...", "Came here Thanksgiving 2018. Never here before. The meal was wonderful! I am giving 4 stars because overall the food was great the meats were a little tough...", "I am very disappointed with my experience, the gauchos were very slow bringing the meat and when they came Around to your table about every five minutes you..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "mn5Dc67wj1Oczt-5MazAqQ", "text": ["I completely admire vegans. More and more I find myself leaning toward veganism, but it's a complete lifestyle change - like converting to Judaism or Islam...", "Everything I have purchased from The Conscious Carnivore has been exceptional, but my favorite purchase hands down has been the grass-fed ground beef. We...", "Off the charts exceptional. Ive been trying this place out for a month or so now. Two dollar signs is not right. This place is pricey. Bone in ribeyes are..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.28, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["beef"], []]}
{"id": "aVBFKYoF0AHuusNssaQpJA", "text": ["Anything on your pizza you can imagine-almost! Famous for a reason. Where else can you have max and cheese and pizza in one!? Totally awesome. \nFresh made...", "I visited Ian's Pizza over the summer, and since then, I have often found myself wishing there was someplace like Ian's near my apartment. They have so many...", "We just visited Ian's for the first time and found our new favorite pizza place! \n\nThis location is pretty large inside, with lots of seating. It was clean..."], "rating": [4, 5, 5], "TBscore": [0.64, 0.3, 0.31], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "TvhpG74DvdoF4MA0vLlOLw", "text": ["Love their pizzas!!! Been a costumer for years but somehow never managed or forget to check in when there. Lately, it was never me picking up the delicious...", "Best thin crust in madison area bar none. Their crust is thin and crispy. Their cheese is melted with just the right amount of sauce, and toppings. Quick...", "Really great find, loved our pizzas from here. If you aren't a fan of really thin crisp \"cracker\" crusts then stop reading. If you ARE a fan, then you need..."], "rating": [5, 5, 5], "TBscore": [0.56, 0.0, 0.34], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["bar"], ["pizza"]]}
{"id": "8dRTawvY9n8yHPr-Q-XlsQ", "text": ["First of all, I think the pizza is very good. The reason I'm breaking my policy of never giving five stars for an initial review is because of an instance...", "Great customer service. Fast delivery, polite and friendly staff, good pizza! Monday's is BOGO and they offer a rewards program. They always thank us for...", "I think this is the best pizza in the area. Good crust and very generous toppings, which seem very fresh. The MVP is my favorite. This Middleton location is..."], "rating": [5, 5, 4], "TBscore": [0.39, 0.56, 0.56], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "JE3SRhAGqZrAzs0gMm5cIA", "text": ["As someone who is not from the area and who is always on the go, MOD Pizza did not disappointment at all!  They use fresh ingredients  and the fact that you...", "What can I say, I love the pizza and breadsticks, I love being able to tell them every ingredient I want on my pizza, I have done more experiments for my...", "Amazing... Pizza rarely disappoints but Mod Pizza really delivered. (figuratively speaking).  I got the regular personal pizza with a bunch of toppings. A..."], "rating": [5, 5, 5], "TBscore": [0.29, 0.5, 0.22], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "h98IJqWW0wVxwoLV03Azfw", "text": ["Love it. Fast, inexpensive, customized, tasty food. The people working tonight were pretty cool dudes too, cracking jokes and joining in on our good...", "We're in town visiting my Dad for the Thanksgiving holiday, and settled on this place for some late-night pizza.\n\nThe pizza was very good, which is...", "My first time eating lunch here, it won't be my last! Super impressed!\nFresh ingredients and fast service. \nI got the Lucy sunshine added spinach and went..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.91, 0.35], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["pizza"], ["lunch"]]}
{"id": "W1vydY_gBcNQVsOGlkdtDA", "text": ["This is probably my favorite pizza place in Madison. I have been to the Monroe street location a lot, but this is my first time to the Middleton location...", "Brutta is a reliable place for a decent, sometimes well-above-average 'za.\n\nHere comes the picky, picky, picky part of the review.\n\nMy previous visit, the...", "It's always good to have a nice pizza place to go to and this one definitely meets that requirement because: 1) great interior - not too many tables so no..."], "rating": [5, 4, 4], "TBscore": [0.38, 0.0, 0.52], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "y6R_bSCYiotoUjvygVcFaQ", "text": ["I was a fan of their fare, but the people side of the business is a disaster. The newest location is 6 miles from home,  according to tonight's staffer....", "So happy to have a delicious local pizza joint that isn't a chain, I just wish they would expand their delivery area! We are just outside of it but live...", "Let me preface this by saying that I've been to SRP a couple of times before yesterday and I've always enjoyed their pizza. \n\nMy wife and I decided to head..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.39, 0.5], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "d3LrVz27kY__1SGZ3Zpqfw", "text": ["I like Rossi's. Classic coin arcade, great pizza, and I feel like I'm in a truly authentic 80s arcade when I'm here. Complete with shadowy hallway you have...", "Always a good time with family here. Very reasonably priced and yummy. Vintage candy, collectible cards, and arcade games too. So much fun! I've come here...", "We took our three kids out to Rossi's tonight, and they had a blast.  So did this 40 year old kid! The food is simple, but decent. They have deep fried..."], "rating": [5, 5, 5], "TBscore": [0.39, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], [], []]}
{"id": "q_IrYzYP89MUq-18oedTJg", "text": ["The only place in Madison to get good quality Detroit-style pizza. I missed this pizza so much when I moved from Michigan. I was happy find one in Madison....", "First time ordering. Went with the Detroit style large sausage, mushroom, pepperoni, extra cheese. Didn't disappoint, even when reheated! Will stop again!", "Sauce is good. Average besides that. Honestly, easily prefer Red's & Luigi's, for around the same price. This pizza isn't great for its price point...."], "rating": [5, 5, 3], "TBscore": [0.42, 0.0, 0.3], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "Z9wnRnSvmt7PeMo69x3s4A", "text": ["Like any red-blooded American, I've always had a soft spot for good pizza. So I was excited when I heard Roman Candle was opening another location less than...", "Went here for an impromptu date night after deciding we didn't feel like cooking and we were craving pizza. It was a beautiful night for a walk anyway!\nI...", "Poor service & food.\n\nOne friend ordered the Mac & Cheese but it came with cold molded cheese sprinkled on top. That's just unacceptable -- it made me..."], "rating": [4, 3, 1], "TBscore": [0.0, 1.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["american", "pizza"], ["pizza"], []]}
{"id": "LDxapKCuUbH-G24O4vjD7g", "text": ["I had been craving Chicago style pizza here in Madison for such a long time, and thanks to a flyer, I knew I would eventually order from Falbo's. Well, it...", "I love Falbos but the staff at this location is an absolute joke. If it were possible to rate less less than one star I would. I'm glad there is another...", "First time customer here and really enjoyed our pizza. The deep dish crust isn't what you would think if you're used to the Chicago style pie. It's thick,..."], "rating": [3, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "Pt4rt1u_5KuS_NSMqerG_Q", "text": ["We tried Pizza Pit for the first time last night. \n\nThe deep dish pizza was excellent. It was probably the best deep dish I have had since coming to the...", "For a little hole in the wall joint. This place was pretty tasty. \nAtmosphere was so so but, for the price you pay and the food you get it's a solid 3....", "11/15/18\n\nI ate there and it was terrible.  The pizza is better if you order it.  They gave the pizzas on paper plates, the cups looked like they got them..."], "rating": [4, 3, 1], "TBscore": [0.38, 0.0, -0.25], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "crBw_Hq3gCkppirgjnIl4A", "text": ["Mmmm. Love me some Yeti's pizza. What can I say? It's just great, consistently delicious, reliable food. \n\nI've had several pies now, and each has been...", "The best pizza in town by far. Okay ... the competition isn't that great, but Famous Yeti's holds its own when compared to the best pizza that Madison has...", "Tried the pizza and garlic bread because the reviews were great. \nFirst, the cashier in the Beavis and Butthead t shirt didn't smile or was the least bit..."], "rating": [5, 5, 1], "TBscore": [0.57, 0.64, 0.26], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "PE8Bdr3IPAk3N0AX6xEWng", "text": ["I made a boo-boo... I devoured a lot of cheese dishes here! Ok... maybe that isn't the biggest boo-boo but I usually don't eat so much cheese. \n\nThis place...", "This place in New Glarus is really a gem.   First and foremost, the pizza is  some of the best I have ever had.  The service was spot on and the server was...", "Really impressed with the service the food and the beer.\nThe waitress suggested styles and had her own beer guide in the menu!\nThe pizza was amazing. Didn't..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.4, 0.78], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "qd7KHsn4B4q3CqNw-yxOWQ", "text": ["There is good pizza and there is amazing pizza. Then there is Dougboys which takes both categories and combines them into something that is beyond...", "Truly one of the worst pizza deliveries I've had in a while. After spending $45, a frozen Tombstone pizza would have been a the same quality. The food was...", "I am updating my original review as I stopped in for lunch today and ordered two slices of the Deluxe  (pepperoni, sausage, green peppers, mushrooms, and..."], "rating": [5, 1, 5], "TBscore": [0.65, -0.5, 0.26], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["pizza"], ["pizza"], ["lunch"]]}
{"id": "mKT30qU_MlLj4Ps82JAZ8w", "text": ["I hit this spot while getting stuck overnight from a flight cancel.  I was in the mood for something healthy, and one the lighter side.  I know...a pizza...", "Went tonight for the Wednesday $9.99 lobster roll platter. The clam chowder was good, and so were the fries.\nThe lobster roll was pretty good. Not really...", "I'm really conflicted with my experience here... I ordered online to pick up at the restaurant since all I was getting was a small cheese pizza. First off,..."], "rating": [4, 3, 3], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "g9EtSHsKVAwjRpwrg21XXw", "text": ["Have been here twice and both times very good. Pizza is as good as Sugar River and 2/3 the cost .\n definitely recommend !", "Phone etiquette was not there. Pizza was over an hour late. I understand if you're going to be late, a phone call would be great to let us know. \n\nPizza was...", "My favorite pizza, but the deals aren't like they were. My on line order got messed up so when I picked it up, it wasn't there! But the nice man gave me a..."], "rating": [4, 1, 4], "TBscore": [0.54, 0.0, 0.61], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "Cpsx6c52u6AoeP-8ezH9OQ", "text": ["1 of my favorite pizza places in town get it delivered as well as going there. I go there for the lunch buffet regularly includes salad bar a pasta dish...", "If I could give less stars I would.  This place is not good. The salad bar had rotten lettuce on it, our appetizer came with more grease than food and after...", "I'll have to come back and try the pizza.  I came at 6:30 on a weeknight and the place was pretty empty, with the exception of the bar.  The one waitress,..."], "rating": [4, 1, 3], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["pizza", "pasta", "bar", "lunch"], ["bar"], ["pizza", "bar"]]}
{"id": "bObysWCWZqc_rqSC0U83Yg", "text": ["I was really excited to see a stuffed crust deep dish pizza...in Madison. I was so disappointed. The crust through out was definitely not cooked enough. I...", "Ordered the Tree Fungo pizza with broccoli. The pizza showed up 80 minutes after ordering and was missing the sausage and broccoli. Not a great showing....", "2 times I've come here and 2 times they've screwed up the order. I walk and not a single condolence was made for making me wait. 30 minutes each time. Screw..."], "rating": [2, 1, 1], "TBscore": [0.0, -0.3, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], ["pizza"], []]}
{"id": "2jau7OtoplE60-o2TIn6Tg", "text": ["Slices to go and lots of choices!! The BBQ chicken slice is TASTY!!! Highly recommend for comfort food. Staff was also cool about letting me sneak a beer...", "We ordered carry out on the way back from a trip. We ordered via the Yelp app, but it mentioned a 60-70 wait. We called and they had it ready in 20 minutes....", "3 1/2 stars if I could. Pizza is good when it's hot and fresh. We really like it. But their salads... We got 2 takeout salads full of slimy, rotten lettuce..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["chicken"], [], ["pizza"]]}
{"id": "U7Ag9oPTjWinwcnGH20tcg", "text": ["If you're looking for greasy pizza and amazing cheese sticks this is your spot. They do a great job with Badger game days and it doesn't hurt that they're...", "Worst pizza experience ever. The staff was rude and not helpful at all. The delivery guy on the phone was rude and unhelpful. I asked to speak to the...", "Just don't. They mess up every single time we order from them. Only reason I even gave 2 stars was because one time they gave us a free coupon to make up..."], "rating": [4, 1, 2], "TBscore": [0.33, -0.53, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["pizza"], ["pizza"], []]}
{"id": "7AV71O6pCeSuhUgA5zSs-Q", "text": ["Best GF pasta we have found...and we've tried many! The only HUGE problem we had was the fettucini and linguini, which say to cook for 2, 3 min stick...", "You can tell that RP's pasta is high quality...the taste is definitely superior.  We especially love their raviolis, with various fillings like the four...", "Great restaurant style pasta. Delivered to your home or available at some local gluten free retailers. Nice option for a gluten free menu. Almost..."], "rating": [3, 4, 5], "TBscore": [0.51, 0.46, 0.43], "normalisedRating": [0.2, 0.6, 1.0], "keywords": [["pasta"], ["pasta"], ["gluten", "pasta"]]}
{"id": "zv7ApWWtKbu1r_qNK4SFrg", "text": ["This place is a gem!! Everything I've gotten here is amazing from their soups to their meatballs(which truly taste like my Italian grandmother made them)!...", "I've eaten at Gino's for many years and love their food. I want to continue to eat there but probably will stop due to there employees never changing there...", "My family has never eaten at Gino's but after craving lasagna, we gave it a go.  The result: EXCELLENCE!  The lasagna and garlic bread were probably the..."], "rating": [5, 2, 5], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["italian"], [], []]}
{"id": "H6Gb3P21h4e_stdjFQO9oQ", "text": ["One of our favorites for delivery. Been eating rocky's my whole life my favorite sausage of any pizza place in town. Love there salad bar 1 of my favorite...", "I love me some Rocky's once in a while - their pizza is always spot-on and the various restaurants are mostly consistent.   This location does not...", "Loved this pizza place, if you are looking for a greasy, cheesy pizza this is a wonderful place. Their customer service was great and they were very helpful..."], "rating": [4, 4, 5], "TBscore": [0.42, 0.25, 0.44], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["pizza", "bar"], ["pizza"], ["pizza"]]}
{"id": "J0P152h7wimvdJ-aV0QLug", "text": ["Really great coffee!\n\nReally nice ambience and decor.  Great location, however, the parking is not awesome.  But most importantly, coffee is top notch!\n\nMy...", "A lot to love here! It's modern but still cozy, large enough that tables are spread out, and a good mix of wood and metal with some splashes of color thrown...", "I first visited Stone Creek Coffee in Delafield on my way to a meeting in Milwaukee. I came by this Stone Creek Coffee location when I was on my way..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "pB1KbZV7zEFS6pthwdjNkw", "text": ["Non-campus associated goers beware, this location, as to be expected, is frequently visited by undergrads, grad students, and general campus-related...", "\"Hi... I'll have a medium, iced vanilla late, with an extra shot of espresso\" \n\n-Me, every...single...day\n\nI'm a creature of habit, and this particular...", "Every summer I have to have the coconut latte. There are no peets convenient (until the monona location opens up) so I made a special trip today. Ran by..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "iG306oIRSZ69kerCVd3i7g", "text": ["Yes! It has books, but I'm a bunny so I can't read. I can nibble and nibble I do on all these wonderful cookies. I love the natural organic ingredients, if...", "I've been following Bloom via email even before I moved to Madison. It is probably my favorite thing about Madison. Everything they do is just exceptionally...", "So excited to have a Bloom bakery back in business in Middleton!\n\nBloom Bindery is a cookie, coffee, and book shop. You won't find the same items as before..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "_n7WS5jqFs89WHOINineqg", "text": ["Love this neighborhood spot!  Worn wood flooring, high ceilings, plenty of seating and an expanse of windows overlooking Monona Bay make this an inviting...", "I had no idea this place was so huge! I've drive by a dozen or two times but never had any idea it was so expansive. I had some time to kill between a...", "Loved sitting on the porch of this warm little coffee house next to our AirBnb. Service was great. Food was filling. I personally ordered the fruit parfait,..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "fogKzrlNqkKVGz3V8wId-w", "text": ["I received a gift card for EVP for Christmas. Their coffee is okay; it's a little too watered down for me. The atmosphere is very chill and I don't feel bad...", "This EVP location has a great little vibe to it. Be aware that they have somewhat limited hours. I wrote the majority of my PhD Dissertation at this EVP. I...", "After many years of driving by this EVP coffee location I finally stopped in. I was very impressed. My husband and I had breakfast and settled in with our..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "uwxj0XXWOvm8xdhZ-33Vlw", "text": ["I used to stop in Java Den all the time until a short female barista was incredibly rude to me (Katelyn?).  I hadn't done or said anything, so I was pretty...", "Java Den at 1022 Johnson, Madison, WI\n\nThe only reason I even stepped back into this establishment is because I have started yelping. There is one worker in...", "First of all, I want to say this: Jason and Katie ROCK!!!! Their customer service is unparalleled. They are always friendly and fast, plus they make amazing..."], "rating": [1, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "8iZ5bR_Zl-xQZMDCvNKLgg", "text": ["I cannot say enough good things about Crescendo. My husband and I had the mobile cart at our wedding and they were beyond fantastic from the initial booking...", "Not a bad little joint. I like this place - nice little respite place on Monroe Street. There are several coffee shop options on the block - but I like this...", "Great vibes, decent coffee, ok service...\n\nLoved how cozy this place was, great ambiance! The gal at the register was friendly and welcoming but the two..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "wbia2cGn5pUSCZGLYTu0kw", "text": ["Located in the lobby of the Graduate hotel, I just got iced coffee here, which was really reasonable for (eyeballing) 16 oz or $1.58.\n\nThey had a decent...", "Such friendly staff and decent coffee but they have a chance to be so much more and somehow missing that opportunity.  The hand pies are just average for...", "I wish Portage Pi took advantage of the charming space they have, because they could easily be the coolest coffee shop in town with some improvements in..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "oAhk0mgl6HLtLi-m_gwD2g", "text": ["This food truck confused me at first. However don't let that deter you. This food truck is a blend Southern barbecue and Asian fusion. Which in my opinion...", "New favorite food truck right here. In the words of my coworker - that was a deeply satisfying lunch. I don't give out five stars easily but this place is...", "This place and soho are my go to food truck lunches. \n\nI absolutely admire what this guy does. Extrenely creative with the menu and you can genuinely tell..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.37, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["lunch"], []]}
{"id": "tAsTOl-mrPX3kiiyz1a1TQ", "text": ["At a recent Concerts on the Square I was in need of dinner and saw the line for Cali Fresh was out of control. Instead of shying away from the wait, I...", "Tried this food cart for the first time the other day-why haven't I started going here sooner? Food is delicious and lived up to the fresh in its name.  My...", "Talk about having delicious Californian and Mexican food on the go!  I've had a few visits at Cali fresh, and everytime I get wonderful, quick and friendly..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["dinner"], [], ["mexican"]]}
{"id": "a9jEcU9KEaD0osjGyz6rog", "text": ["I was in town for business and heard great things about Antojos Tacos. I'm really glad I stopped in!  The Hawaiian Fusion taco was amazing - you can tell...", "The food here is so good! I've had the seafood tacos and vegetarian quesadia on multple occasians and they were very delicious everytime, I recommend...", "Passing through and glad we stopped in here for a quick lunch. The tacos were great, and everything is reasonably priced. I had the cheese steak taco, and..."], "rating": [5, 5, 5], "TBscore": [0.68, 0.94, 0.46], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["tacos"], ["tacos"], ["steak", "tacos", "lunch"]]}
{"id": "-uMpSkdN39sz9MbjkauVTQ", "text": ["The ability to make nachos taste light and fresh is worth five stars in and of itself, but the fact the owner is just the sweetest really puts it over the...", "Their burritos are simply amazing. For $7, you get a made-to-order, well portioned and perfectly seasoned masterpiece that tastes very fresh. One of my pet...", "Mole chicken enchiladas are my favorite. Tacos are also a good bet. Rice and beans that come with the entree aren't worth getting, but I don't even care if..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["tacos", "chicken"]]}
{"id": "ymGn0eZHFM0bI8Ig0EVXWg", "text": ["Think QDoba, but more authentic, more genuine, and way less mainstream. That's what Habeneros is. It's a build your own burrito/quesadilla/TACOS joint. I...", "Today I went to the NEW Habeneros located in the same parking lot as the old stand-alone restaurant I wrote a terrible review of awhile back. I ordered a...", "This is your basic in and out Mexican style grill with build your own burrito, tacos, salads etc. Inside it is not anything fancy but the food is fresh and..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], ["mexican", "tacos"]]}
{"id": "VSu7GYn-Zln5TLZh_fMtvQ", "text": ["Love this place! \nI am working on my Spanish and I ordered in Spanish. \nThey were very patient with me and kind I got exactly what I ordered and it was...", "Just no. Maybe I ordered the wrong item off the menu but I don't think changing my order would have changed my mind. \n\nStopped in for lunch, to-go order....", "Their steak burrito is KING! Their burritos are as close to a Cali burrito as you'll find around these parts. I was so sad when the La Bamba in Appleton..."], "rating": [5, 2, 5], "TBscore": [0.0, -0.5, -0.5], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["lunch"], ["steak"]]}
{"id": "uQ3Ixx8WJL8UWPwFYDzncg", "text": ["I've been wanting to go here after hearing about it from a coworker and I wasn't disappointed. I got the beef tripe, asada, and al pastor taco and all three...", "Best torta I've had in the Madison area! I'm Mexican and it's my favorite food, the only thing I have at Mexican places, usually. While I've not hit up...", "Absolutely amazing. Better than food I've had in Mexico. I had the taco specials of barracoa, borrega, and pollo. So flavorful and generous portions. Can't..."], "rating": [5, 5, 5], "TBscore": [-0.75, 0.21, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["beef"], ["mexican"], []]}
{"id": "Hf64S1mE01qTOghyCa81cA", "text": ["We had a Guimo's cater in a taco bar for a party at our home. Highly recommended! They will deliver and pick up for a small fee, and you can pick different...", "Really great Mexican food in Sun Prairie!  This is an order at the counter and go sit down kind of joint with no alcohol, but don't be deterred.  The staff...", "Brand new place in Sun Prairie, so I'll give them a little leeway on the service. \n\nFirst, you order at the counter from a chalkboard menu which has a great..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.31, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["bar"], ["mexican"], []]}
{"id": "oah7hUbos7yUH_qP7du2yQ", "text": ["I arrived early morning to Madison, Wisconsin and was hungry. My husband and I decided to visit the area around the University of Wisconsin. Imaging my...", "I want to LOVE this Taco Bell because it's so pretty, but everything else really falls flat. \n\nCan you still get (VERY) affordable cheap Mexican food that...", "This Taco Bell is probably the nicest looking Taco Bell I have ever been to. It was supposed to be one of the cantinas, but they didn't have a liquor..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.22, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["mexican"], []]}
{"id": "AIEyiX9-yfXQgvLOtBgFgA", "text": ["Great place for a quick bite. I wanted taco buffet and I had many choices. Food was great and restaurant was clean. One guy seems to run the place but that...", "Went here for the first time. I was a bit apprehensive considering some of the reviews but I had great luck and my opinion on the lunch prices are quite...", "Paco is a very authentic ,and the real deal ! It is not Mex-Tex or south western food. Prices are great and very clean . I love there food."], "rating": [5, 4, 5], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["lunch"], []]}
{"id": "cRFRuSqrR6GaOgrpiJCscg", "text": ["This place has just opened, and it probably takes the cake for my favorite coffee ​shop in Madison. There are​ some nice ones further west, but I'll...", "I love the vibe of the new crescendo location in Hilldale! The one on Monroe street is your standard coffee shop, but they really upgraded their decor in...", "Really lovely spot. Chill vibe, trendy decor, and amiable staff.\n\nCurrently sipping a mellow \"drip for here\" dark roast coffee. At $2.50, the price first..."], "rating": [5, 4, 5], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["cake"], [], []]}
{"id": "fpwMWuKAR8joNW1B4N3e5w", "text": ["It has everthing I want in my food! \nIts local (when available), Its organic, and\nIts tasty! I get the half lettuce and half rice beacuse the rice is hot.", "I have been here three time and I'm going to keep coming back, for the salad. I have yet to try one of their pre-made bowls because I love customization....", "Forage is closer to UW than it is to Monona Terrace, but we really wanted salads so we made the trek. I had the Cultured Cobb and my coworker had the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "FQFIqLjDMqengktTfhoWlg", "text": ["Next time you are in New Glarus you should give quaint Swiss place a go. \n\nYou must put the Pork Schnitzel sandwich on your list of things to try. It is so...", "Great service and good food, don't expect to eat quickly.  Glarner Strube is my go to, if I'm coming from IL to Madison and if I want to spend a little...", "If you like packing yourself to the gills with cheese and beer, this is the place for you.\nMy spouse and I came here as they accept tokens from New Glarus..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["sandwich"], [], []]}
{"id": "iFWL9vaoRVQ172gzohhugQ", "text": ["So, this place is interesting. I've been here back when it was Julep and the vibe is exactly the same, which I appreciate since it's a nice atmosphere...", "Protip: They have prosecco on tap, and it is worth it.\n\nI have now patronized all the Robinia Courtyard affiliated business and they are all pretty awesome....", "Solid 4 in the garden for this fresh take on tapas. Space is a bit confusing to find given there are 3 establishments in the same location but just keep..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "7iqdNduBzRE0rJQs2WNCKQ", "text": ["Ordered a 7-day turbo cleanse from Fit Fresh- for the price, I was not impressed. The breakfasts were gross-overcooked non-bread, weird egg concoctions....", "Finally tried this place today and happy to say it was very good and healthy. \nI had the Cuban panini on sprout bread. Full of flavor!!  It came with a side...", "I like the idea of this place, but was disappointed in my choices. I ordered the Thai Chicken Flatbread and my husband ordered the Buffalo Chicken..."], "rating": [4, 5, 2], "TBscore": [0.0, 0.0, -0.65], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [["egg"], [], ["chicken"]]}
{"id": "Iq1P8S3--gqd50xoQJxpqA", "text": ["Amazing! This place was a bit more on the pricey side but was the best smoothie bowl I've had in Madison thus far! For the high price I got a very large...", "Great customer service. Plus, first time trying smoothie bowls and it was amazing treat on a hot summer day.\n\nP.S. I got the Paradise Bowl", "Second time at Bowel of Heaven and I've come to the conclusion it's not too bad! I tried the Red Zinger bowl and it was pretty tasty. However, they are..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "8mtP3VJ8Ylvz-rEo_osWgg", "text": ["Loved this place. Located in a strip mall behind mcdonalds, across from easttown on e washington ave. They offer many flavors of ice cream.  I had 2 scoopes...", "Both of the stores are stellar in my book and pump out the best palets and ice cream in the Midwest! Come here for the most decadent ice cream in the land,...", "I came here with my wife on her birthday for a little treat.  It was a great decision, and we had a real nice mid-afternoon snack.  The location is right..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.45], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["snack"]]}
{"id": "c26Nbb6i7OeMCvg7Cs4QSw", "text": ["Best deal ever for spring rolls. They are huge and only $3.50 for a roll! Many options to choose from, but I picked the avocado shrimp roll. There is plenty...", "This food cart is absolutely adorable. I found it at the East side farmers market, but I've seen it around the Capitol square as well. It's painted green...", "This is my favorite place to get a smoothie and the spring rolls are to die for.  The fruit and vegetables are fresh and everything tastes so healthy. Very..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "jaHKCpllY6Vb_kgQ4DYFkw", "text": ["Love love love Sencha! It has such a warm welcome everytime we come. The smell of tea and the decor is always on point with what's trending. Their customer...", "Really cute little tea shop in Madison. Because of its location, you're bound to bump into many studious (or at least attempting to be) college kids. \n\nI...", "Traditional tea drinkers BEWARE: this place does indeed serve loose leaf tea. And you can even drink it HOT like most sensible tea drinkers do. The only..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "BPP4_OSqA-KoTDEBWH2ZaA", "text": ["Words I would use to describe this place:\nAdorable\nQuaint\nDoily \nProper\nManners\n\nI invited some friends to join me for a little morning teatime. The actual...", "It is SO nice to still see that it is a delightful experience. I feel bad that I took so long to stop back in. (you know how life gets). I tried a new tea...", "LOVE LOVE LOVE this tearoom! You need to check it out! It's like being invited into someone's home. They have a variety of seating available for your tea..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "eqk36AK5krqUj3ajh5uBPg", "text": ["Toward the end of every week, I usually go to EVP for a 16 oz mocha with almond milk.  They make the mochas with powdered Ghirardelli chocolate, and they...", "This was the first time at this location. I cannot say anything but good. As all the other EVP in town this one does not disappoint either. Their location...", "Absolutely fantastic customer service from the female barista (unfortunately I didn't catch her name). Very cheerful, talkative, and incredibly helpful in..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "GaOI1biRNa2gJIdM_SED5w", "text": ["Love the coffee here. Friendly staff. Lady who runs the place often seems to pitch and help which I think is super cool. They always have a place to sit...", "I really do love the coffee that EVP brews up. It's always a quality beverage and the service is great. \n\nThis particular EVP location is a bit awkward....", "Nice little coffee shop off Midvale Blvd. I came here in the afternoon and the workers were quick to serve us and the coffee always tastes great. The inside..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "pvQsFWF3XQs28JZIOjrGOQ", "text": ["You ever just get a weird hankering for something that you don't usually eat and it makes you wonder what made you think of it in the first place? \n\nWell,...", "If I could I would leave 0 starts!!! I want to get pretzels like I always do when I am at the mall and I'll probably never do it again!!! One girl making...", "Every time we are at East Towne mall we stop for a snack at Auntie Annes.  Pretzels are always hot, dips are tasty, and drinks are cold.  Staff is always..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], ["snack"]]}
{"id": "7e1rkqyJpXNAQfcFsOQRYw", "text": ["This is my \"go-to\" local spot for coffee, specialty drinks and croissants. I love their Carmellas. I have never had a bad experience! My kiddos love it as well!", "Lovely little place, close to the Highway with street parking. The sweet baked stuff looks amazing, huge cookies , nice looking scones lots of different...", "Cute coffee & bakery place  just 5 min off freeway. \nSmelled wonderful when I walked in A+ for that! \nServes Stone creek coffee which is also bonus. \nOnly..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "4mYNxIZan0vuTqZ9BS7__w", "text": ["The smoothie I ordered was relatively tasty, but it was a hassle to get. There were three people working when I stopped in, and everyone was sort of doing...", "I love Smoothie King!! \n\nI used to both live and work right down the road from this particular Smoothie King, so it was a frequent stop for me. In the...", "Great smoothies, terrible service. Everyone who works there is nice but sooooooo slow. Be prepared to wait 30 minutes for your smoothie."], "rating": [2, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "wDIODhtPE3LoU05kYqFr4Q", "text": ["TJ, PT, and Jamal run this jucie bar, yoga and therapy center, sprout farm, and community gathering spot. Positive energy all around in this neighborhood...", "Mmmm. What a hip place with fresh options and wheat grass shots. I had never had a wheat grass shot before so the cashier made me one to try on her and I...", "The juice here is delicious and straight from the fruit/vegetable! I can only speak to the juice as that's all I get, but I imagine their salads etc are..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], [], []]}
{"id": "-ga9DRU4HE6Li9_tWH3_Fg", "text": ["The staff alone at this location make this McDonald's 5 stars.  I'm pleasantly surprised each time at how polite the McDonald's staff here is and how they...", "One of the best McDonalds in the area. Go to Waunakee of Sauk City if you want McDonalds food done right and on time", "Sure, the decor is updated...but the service is anything but. Please update your Manager age minimum to at least COMPETENT 25+ year olds McDonalds! None of..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "Ylw5xdTfPN5L6Uhd54pzmA", "text": ["I went to the Verona McDonalds today and ordered a quarter pounder with cheese meal.  When I received the meal the fries were cold.  I went to the  counter...", "They suck at Uber eats delivery on weekends. Every other day I don't have issues. There has been two times that \"Rosie\" makes excuses about how they didn't...", "I am disgusted by the behavior shown by these employees. I came in the restaurant and he said he would NOT serve my goofy gay biscut looking ass. I was..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "tVrKuh92l1eGK2fXsGYzaA", "text": ["My sister gave me a Colectivo Gift Card for my birthday in September and I have used it on the Capitol Square but have really enjoyed the Monroe Street...", "Loved this spacious and bright coffee shop! \n\nTried the chorizo burrito for $6.50 & the flavor was on point. Just a hint of spice, plenty of cheesy,\nChorizo...", "This is my favorite coffee place when I visit Madison. The iced coffee is excellent and so are their baked goods. I've frequented both the Monroe location..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "wfsCX4M-uf_l-hQA1sSWyQ", "text": ["This is a great family place with good breakfast great coffee and great people working there who care.", "A very good place to stop for breakfast. I followed my fellow Yelper recommendations and tried their tastes. The drinks... get a smoothie. They are...", "I can't believe I have been in Waunakee for 5 years and have just discovered this place. They have fabulous coffee. (They serve Colectivo Coffee). They also..."], "rating": [5, 4, 5], "TBscore": [0.77, 0.91, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["breakfast"], ["breakfast"], []]}
{"id": "PHrEXX8AYD4NHUl4JsKSqg", "text": ["We've been a fan of their breads which are stocked at some local grocers so I was excited to drop into the storefront. Just follow the smell of fresh baked...", "I like cookies.\n\nThis place makes really good cookies.\n\nScore.\n\nGet the Guerrilla Cookie. It's loaded with oatmeal, chocolate chips, raisins, walnuts,...", "I like little nooks and crannies.  This bakery could fit inside either one.  The boyfriend wanted to check this place out, and I'm always up for adventure...."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "5Y71CQYj1PTw9w0c0YsxTA", "text": ["Great Hidden Gem for gifts... if you like small batch alcohol this is your place. They offer samples before you purchase your bottles. Different sizes make...", "I was in for an sampling event that a friend won at a recent raffle. There were about 20 of us in our group. The event was hosted after normal business...", "I love, love, love this place. My bank account does not though. This place gives me inspiration for cooking, baking, and cocktails. It's a great place to..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "Ixkvt0yxnRWlHWrqimHCjA", "text": ["The scones here are heavenly! Since having  a few (haha, actually more than a few) scones in the U.K. recently, I'm working on my connoisseur license for...", "Have gone here to work several times now. Large tables are nice to spread out at. Wifi alright but sometimes goes down. Lots of space. Decent on the whole...", "Really not surprised have reviews have gone down for this place.  Stopping in Madison and this was one my favorite places.     I also wanted to double check..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "_D7rUvTYVivYBDeGL_gTVQ", "text": ["Service wasn't that great. The workers really didn't seem to know what they were doing. \nThe slushy machine was down. Seriously? My son told me it's not the...", "Worst Dairy Queen I have ever been to. Worst fast food restaurant actually. I work close by so I've actually been here a few times with the hope it would...", "I purchased a cake from the DQ on Cottage Grove Rd. The cakes were thawing in the freezer which meant the c were going to be freezer burnt. The employee who..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], ["cake"]]}
{"id": "P5OEpAGm05NyTJhqUYXOQA", "text": ["A trendy, hipster cocktail bar near the Capitol. They have an awesome craft beer selection, a creative cocktail list and classic cocktails on draft. I had...", "If you like beer and/or whiskey, this place is a must stop location.\n\nThe menu for available drinks is truly overwhelming. I've been to a lot of whiskey...", "Showed up here around 1:30am on a Thursday after seeing that their listing said they were open until 2:30am. We arrived and I asked the bartender (didn't..."], "rating": [5, 4, 1], "TBscore": [0.47, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["bar"], [], []]}
{"id": "i_r5yf-WrVJbMZWyOTv6UQ", "text": ["This place is INSANE\n\n-Funky kind of vintage decor with a cozy couch and random phone booths in the front and the place is ~dimly lit~ for date...", "Decent neighborhood joint- a bit hipster for my liking. They excel at craft cocktails. The drinks are really very good and made with attention to detail....", "If you go at the right time, you can get into the Robin Room.  It is a beautiful neighborhood bar that focuses on balanced drinks.  We braved it on the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.57], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "Y4OyM5VQLcsyc7nuBw2DTw", "text": ["Probably one of my favorite bars in Madison. I have been here a couple times now with friends and have always had a wonderful time. The bar itself is...", "This is a quintessential neighborhood pub. There's a fun bar area to relax after a long day at the office. If the weather is nice, grab a seat out on their...", "This little hole in the wall is relaxed and fun. I will say, though, that the place gets very crowded as it gets later in the evening - but the clientele is..."], "rating": [5, 4, 4], "TBscore": [0.75, 0.28, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "UduPcMWfIVMAYRaIIpzSog", "text": ["This classic divey lounge is one of my favorite places to go.  Good drinks that are reasonably priced.  Fun atmosphere.  Great staff.  I was born the year...", "Old school charm in Madison, who knew?! \n\nSmall, dimly lit, fresh popcorn, classic drinks poured by a 2nd generation owner in a pressed shirt and black tie,...", "I've driven by this place a bunch and finally stopped in on a Saturday night. The drinks were average, but the decor is amazing. I wish there was better..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "GjkgXXicSJokejRge-g3xA", "text": ["I've only been here a few times, but I love this little bar! It's small, unpretentious, and has a really nice mix of patrons. \n\nI've been told that the...", "This is a great little bar a stone's throw from the Capitol. At Genna's they always have a great beer selection, knowledgeable and friendly bar staff, and a...", "Happy hour!! The best time to go here. Kind of a small place if the weather isn't great, but the outdoor patio is perfect for nice afternoons. Happy hour is..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.45, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "rlXgCJVxf5wP4sPhxH_2XQ", "text": ["Highly recommended bar for chatting, feeling like you're in a private space, getting away from the insanity of state street, enjoying a delicious hand...", "Hipster douchebag Millenials seem to believe that there is an art or science to making so-called 'craft' cocktails and have elevated bartenders to near the...", "Gib's is a decent bar tucked away in a two story house. I would never go here at a time when it would be super busy - I imagine it would be infuriating. The..."], "rating": [4, 1, 3], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["bar"], [], ["bar"]]}
{"id": "wlZceADqZ0m9Zw5qM4y3qw", "text": ["Great ambiance, superb beer menu of imported and local craft beers. Bartender was excellent and very helpful! Not too loud, not too soft music that is...", "This is a great neighborhood watering hole.  You will find a few bar snacks but you'll need to eat before or after your visit as this place focuses on the...", "3 stars but that's it. Want to support this establishment, etc etc, but that's reality. \n\nWhy? OK - beer. Yes, large selection, but I think they might do..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["snack", "bar"], []]}
{"id": "c2a7-byrwnuRUW757cyjgA", "text": ["Find my bride and I here as often as possible. My favorite spot in Madison. Staff is amazing and so genuinely appreciative of regular faces and newcomers...", "Maduro is a classy cigar lounge with access to fine spirits and some rare craft beers. They have cigars that range for the novice mild tasters that dabble...", "I ended my night here. I had no idea it existed. It's cigar lounge. I mostly partook in the lounge part, but I hear the cigars are great. I know nothing..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "7oG9TB-SFG9Tpo3QvrYIUQ", "text": ["I found MadisonTap when I was searching for restaurants offering \"deals\" on Yelp. It was a bit difficult to figure out all the details on the web, it...", "As a restaurant at the Robinia Courtyard, MadisonTap has one of the better outdoor patios in Madison: the string lighting/decor is beautiful, the space is...", "I've been to all the affiliated Robinia Courtyard establishments now, and all of them are pretty wonderful.\n\nMadison Tap is a very cozy space. Big bar, lots..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "-pojh365D8riip5Mvwwb_g", "text": ["Delicious drinks! I like getting them in regular glasses and in those huuuuuge vats where you put 1,000,000 straws and 10 people gather around to get a good...", "I would hate to see what this place looks like with lights on. \n\nThe noise level doesn't make for a relaxing time. \n\nOne of the two bartenders went to the...", "I love heading over to blue velvet lounge especially on a Thursday night! Thursday night is Latin night and they play only Spanish music. This draws a big..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "566Si6H4elSwGXsrQDjXdg", "text": ["This is a great place to go after work. It's also a place that has really good bands !! We've had many a work party is here and it's always been fun, very...", "I like this venue a lot.  It's intimate & the sound is pretty good.  They have a great craft beer selection and book some solid acts.  I've seen st motel,...", "One of my favorite places to see a show in Madison. The size is just my speed - small enough to still feel intimate but large enough that you feel the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "hGFtSo3mezqGrjuCYMnt5g", "text": ["Great World Cup atmosphere, lots of people and space to hold all of the people!\nThe audio was ahead of the video, but not a big deal. Also, there is a new...", "I haven't been for the killer happy hour, but we did enjoy a night of watching the Winter Olympics opening ceremony there. The main bar area is on the...", "I've been in to Nomad a few times now, and I think I can safely say I dig it. \n\nI had been to Nomad in Milwaukee a few times before this Nomad opened up. I..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.46, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["bar"], []]}
{"id": "wk4a34PeAcKhlFGwFHi2jw", "text": ["I. love. the. Up. North.\nWhen I lived on Willy street the Up North became my bar. I was never a regular at a bar until I was within walking distance of the...", "I really like the Up North. I've been coming here for years now, so I suppose it's about time I write this review. \n\nI wouldn't call the Up North a dive...", "On the dive bar tour we ended up here for som reason because it's not really a dive bar. They have plenty of good beers on tap so we would sample them and..."], "rating": [5, 4, 4], "TBscore": [0.25, 0.0, 0.3], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "js_THl4BtzSzICKsKwJ-Jw", "text": ["Stopped by the new Sylvee the other night for a jammin show. The place is beautiful in my opinion. Others are commenting on how \"plain\" it is. If they...", "This is a fantastic venue looks and size wise.  Its big enough and they don't oversell so you can actually get to the restroom or get drinks and back...", "It's (almost) everything Madison could want in a venue this size...yet I found I still prefer the Orpheum.\n\nI have looked forward with excitement to the..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "REOLy7B1Y9IEqmNWvTCpFA", "text": ["I'm not a beer connoisseur or anything, so I'm not going to pretend that I know stuff about beer. It's more like I like it or I don't like it when it comes...", "I didn't really spend much time in the space...I grabbed a beer before a performance in the back (Art In).  There is nice seating and a nice bar.  This is a...", "This is a new outpost of Parched Eagle Brewery in a cool space right in the center of things in Madison. First and foremost, the beer. Since it's Parched..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["bar"], []]}
{"id": "5wxhPPPQFPjO3HjNG61-4w", "text": ["Best Taco Tuesday in Madison!!!!!  This is one taco of the two taco lunch special!  ($6.50) The homemade tortilla chips are the best ever!!!  Thanks Joanne...", "This is a bar. If by walking up to it doesn't give you some idea of what it's like inside, you probably don't go out very often. The food is exactly what...", "This is a place I have been going to for years and years, good food and great atmosphere as well, it is a place I can go to at anytime and see a friendly..."], "rating": [5, 5, 5], "TBscore": [0.66, 0.23, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], ["bar"], []]}
{"id": "Pzf3VFw0MqZjlNjmPTEQtQ", "text": ["With the Frequency closing, Crystal Corner might be the next best \"concert in a bar\" venue. They usually have a good line up and it feels a little less...", "(To Be Updated) This bar looks kind of iffy on the outside, but definitely worth the try! They have a variety of deals that makes it more than worth it to...", "Never judge a book by it's cover...or at least in this case do not.\n\nA drive-by down Wiley St might have you thinking not to try, but pull down a side road,..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.36, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [["bar"], ["bar"], []]}
{"id": "VMPSdoBgJuyS9t_x_caTig", "text": ["Came back after about 2 years and I can say wow, I must have ordered the wrong food when I came here the first time. I tried an assortment of their curries...", "It was early spring and we had a nice stroll along Willy Street to Lao Laan-Xang. The cozy warm restaurant with the aroma of peanut sauce and spices was...", "Really friendly staff and absolutely delicious food! I went with a group and there were 5 of us in total-- we ordered crab Rangoon, coconut shrimp, Kan gai..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "zRPAUz1Y2pF9GAKyaGdBlw", "text": ["I LOVE THIS FOOD CART. Since moving to Madison, I have made it a priority to stop at this little truck once every two weeks. My favorite order (and also a...", "Coming from a Lao family, this is where I go to get my fix when I'm feeling homesick or craving Lao food; I've been coming to this food cart for over four...", "This is my Favorite food cart in library mall!!! And this is a lot since library mall is filled with amazing food carts. I however love all of the food this..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "5ZqybrqiTdbANn2yI3B3VA", "text": ["One pint of beer into our Friday evening with two kids under the age of two, my husband and I decided that we would order Chinese food. We knew there was...", "This is our new go-to takeout spot after our favorite place  closed. The food is solid, portions are large and the service is fast! Our favorites are beef...", "Excellent delivery service. Very fast and the order was 100% correct. Food was tasty* and the prices were reasonable. \n\nMy sesame chicken was well flavored,..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.21], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["chineese"], ["beef"], ["chicken"]]}
{"id": "TTVXY5vOJDqC0_Je8UhK8A", "text": ["Wow went there last night and ordered a bunch of food because I was hungry (don't do that lol) and received probably the best bang for the buck Asian food...", "I go here more than I would like to admit. To be fair I haven't had a ton of different foods on the menu aside from my usual order (beef w/ broccoli and...", "We ordered the Szechuan chicken, beef with garlic sauce and the beef lo neon. The expected time was 45 minutes, but they got there in 20! The food was nice..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.24, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["beef"], ["beef", "chicken"]]}
{"id": "LG6vpg5Qx_DstY2aT8-O4Q", "text": ["Let's start out by saying that I'd love to give this place 5-stars but I just can't.  This is my go-to place for Chinese in Madison, but with that being...", "See my photo. That's a lot of celery. To be fair, there was some chicken in here before, but not a lot. This barely passed for Kung Pao chicken. There was...", "This review is only for delivery. I ordered spicy General Tso's Chicken for delivery and it took roughly thirty minutes to get to my apartment. I was..."], "rating": [4, 2, 3], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["chineese"], ["chicken"], ["chicken"]]}
{"id": "8cjXEmuqgCbIRudb2D52qw", "text": ["I loved this restaurant! I have missed getting dim sum since I moved to a small town. I've eaten dim sum all over Asia and thought this was a bit different...", "I didn't want to give this place a one star review but I ordered online for them to deliver to my hotel....they knew it was a hotel and they did not bring...", "My favorite dish here is the steamed spinach with garlic. #161 Garlic Water Spinach. Just try it. It will blow your mind. \n\nMy best friend's fave is the..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "Lku_keJf44D0LxbRAIZOcg", "text": ["I want to love this place so much. The atmosphere, the prices, and the quantity of food are all great, but the quality just isn't there. \n\nThe place is a...", "This place is pretty average as far as Chinese food goes. I did the pick two and got the black pepper chicken (5 stars) and the mapo tofu (1 star) - the...", "This is an absolute FAVORITE of the UW Madsion Engineeing campus and the students at-large love the restaurant. Not the highest of quality foods, but you..."], "rating": [3, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.6], "keywords": [[], ["chicken", "chineese"], []]}
{"id": "aS4t4ee3xqQXgNHNxi9gAA", "text": ["Quick, fast, and VERY hot! All things I look for with good take-out. I only tried the General Tso's Tofu - \"extra spicy hot\" for the heat level. It was a...", "We are now at 90 minutes from when we placed our order. I called 50 min ago and they said it would be here in 20 minutes. When I called to ask where our...", "I've had enough with Flaming Wok. I learned tonight from the delivery driver that Fortune Cookies now cost 50 cents. Up until tonight they were free, and..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "AR1w3ragHgRvnU71A7aaZA", "text": ["3.5 out of 4.\n\nThe atmosphere is less esthetically pleasing than their original space. It can accommodate groups but the space is overwhelming large for the...", "One simple word, horrible. If you call yourself a Chinese restaurant and you can't prepare the simplest American Chinese dishes, what's left? Fried rice -...", "3.5 stars. *shabu shabu review*\n\nThere are not too many delicious, convenient hotpot places in Madison so I've been searching. When I saw a shabu shabu..."], "rating": [3, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [[], ["american", "chineese"], []]}
{"id": "6_7_aSycZlRsfKENFiIi6g", "text": ["Our go to place for \"forced family Friday FUN\"! Great service!  Great food!  We have ordered on numerous occasions and have never been disappointed!", "Okay, first of all - this is take out Chinese ya'll. Let's keep that in mind. We all know what we are getting. Delicious, sodium-packed containers of...", "Happy Wok lied about having food with vegan options. End of review. I would give zero stars if I could. Stop lying, liars."], "rating": [5, 4, 1], "TBscore": [0.0, 0.44, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], ["chineese"], []]}
{"id": "5YUoTimGDPbbmRfw6SJgTQ", "text": ["Underwhelmed.  Egg drop soup smelled so unappetizing that I had to dump it out- smelled like rotten eggs.  Kind of spoiled the meal.  To be fair, this was...", "worst chinese food ive ever had.\ntake out, got the the store about 10 mins after ordering.\nrice is hard, not even hot. general tao chicken not hot, has no...", "I ordered online and it came to my house in about 20minutes! That's so speedy! I ordered the Sesame Chicken special that came with fried rice and an egg..."], "rating": [2, 2, 4], "TBscore": [0.0, -0.25, 0.0], "normalisedRating": [-0.2, -0.2, 0.6], "keywords": [["egg"], ["chicken", "chineese"], ["egg", "chicken"]]}
{"id": "imBVeP4aA-aLTdPD-t8_WQ", "text": ["This place is so yummmyyyyyy. \n\nI ordered chicken wings with house special fried rice. \nIt was a lot of food. \n\nIt was perfect. Nice and greesy just how I...", "Great american chinese food for the price!", "It was eh.. minimal flavor and a slightly questionable texture. could have made some ramen noodles and out some veggies in and would have been happier. The..."], "rating": [5, 4, 2], "TBscore": [0.34, 0.27, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["wings", "chicken"], ["american", "chineese"], []]}
{"id": "asAHqgKQtCWiBbC3XriSIQ", "text": ["I've been here many times, as it is convenient for me. I am a Chinese food fan and I can definitely say, this is one of my favorite's.\nI really like their...", "Let's be honest, this is a Chinese takeout joint in a Wisconsin strip mall. If you're expecting greatness then you've lost the plot, kid. Is that beef or...", "Since when does General Tso's no longer come with rice. Last three times I've been there I haven't gotten the correct order but only offered a refund and..."], "rating": [4, 3, 1], "TBscore": [0.24, 0.3, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["chineese"], ["beef", "chineese"], []]}
{"id": "pTvL6Upfp91J1ryrCZpzgg", "text": ["I've always bought my food as takeaway so take from it what you may.\n\nI don't regret that joke and neither do I regret my choices. I've ordered their...", "I've driven by several times. Decided to check it out when I was super hungry . Place looks old on the outside. Inside a bit dated as well. They had a...", "Jade garden has a great buffet but there food made my stomach uncomfortable for hours. I don't know if it was that I ate there but I wouldn't want to eat..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "7OKQ4ENVfPfxtDqFOG7x0g", "text": ["With few Chinese restaurants in the area, A8 serves reasonably price dishes with adequate taste. The food isnt overly-salty and the service is relatively...", "3.5 stars. Located in a convenient location and a cheap, fast place. Based on the low reviews, I would probably recommend staying away from the...", "No frills, good little place to get your quick Chinese fix. Lunch specials run around $5.50 (awesome for any budget) and come with crab rangoon or egg..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.37], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["chineese"], [], ["egg", "lunch", "chineese"]]}
{"id": "rLJsrXyY61bouCfH58PKIA", "text": ["After our favorite Chinese place closed we went on the hunt for our next go-to-place! This fits the bill.. reasonable, delicious, fresh and fast! \n\nWe enjoy...", "The worst Chinese food I've ever had. The rice smelled so weird I couldn't eat it. Omg, how are they still in business...", "Looking for a good Chinese delivery in Madison as I am here often for long periods of time. I've tasted Chinese food in several different states. I'm from..."], "rating": [4, 1, 1], "TBscore": [0.28, -0.5, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chineese"], ["chineese"], ["chineese"]]}
{"id": "C16dsL_IEOb5UzRWYhxiKw", "text": ["Praise the Lord!  Been looking for good Chinese here since I moved from DC 7 years ago. Everything you would want from a hole in the wall Chinese...", "Today marks the fifth or sixth (or more, but less than tenth.) time I've ordered take out from this convenient location. (This was began this last...", "This place is not fancy like Imperial Garden nor is it very home style Chinese like Fugu.  But it fits the neighborhood well.  The owners are super nice..."], "rating": [5, 2, 4], "TBscore": [0.23, 0.0, 0.28], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "HNW4P0jAhXYRJ_op7OcWCw", "text": ["Very fast delivery!\n\nWe were looking for some delivery options on NYE, and we decided to give Great China a shot. They delivered the food faster than...", "Pretty mediocre. Don't expect anything, then you won't be disappointed. Not recommended for eating in, they'll bring your meal in delivery boxes and plastic...", "Awful service.  Ordered online.  My card was charged.  Waited 2 1/2 hours for delivery.  Called multiple times and told \"we busy\".  Recommend avoiding this..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "-R_dMb9Z1eBv_FlYZrrKbw", "text": ["A good Chinese restaurant typically has good food and bad service. Oriental Wok has bad food and good service. The staff was so friendly when i came to pick...", "Sadly I will not be ordering from here anymore. I've had food orders messed up a few times and my soda is missed more often than not.. but this time not...", "Ordered takeout.  Delivered reasonably fast (25 minutes, 10 minutes ahead of estimate).  Order was accurate.  Food was hot.  \n\nFood was very good.   Hot &..."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [["chineese"], [], []]}
{"id": "GfYzz2Dnnn0CqeDqROAKTQ", "text": ["Classic carry-out Chinese - friendly staff, generous portions, this restaurant was exactly what I hoped it would be. Will be back!\n\nJust read down the list...", "The food is tasty and good quality for Chinese food. This is your typical neighborhood Chinese restaurant and carry out. You definitely get your money's...", "I would of gave a 5 star, but I ordered and waited for an hour and 17 minutes!!!! Honestly, I was expecting bad and bland food, but nope! Everything I got..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chineese"], ["chineese"], []]}
{"id": "dazGlP4Rk4nxlyMtlvkpvA", "text": ["Food is great but service is lacking. I would say the food is 5 stars including perhaps the best, or at least some of the best, General Tso's Chicken in...", "We should have left immediately when our server came over to take our order and was chewing food. She proceeded to eat her lunch at the bar. After being...", "My co-workers and I ordered for delivery which they took forever, but they forgot my coworker's appetizer. My seafood fried rice had chunks of squid and..."], "rating": [3, 1, 1], "TBscore": [0.32, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["chicken"], ["bar", "lunch"], []]}
{"id": "Ucph9MH577u6j0zPK93amw", "text": ["We love this place!! Awesome General Tso's tofu!! The spring rolls are delicious. They also deliver!!", "China Star is a little restaurant with a big history, having cycled through at least two names and two addresses. In terms of cuisine, it's adequate, though...", "My friend and I were travelling late through town last night on our way to Minneapolis. My friend ordered dumplings and paid nearly $10. When the order..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "XE97VxjZoRxV6IM05grY0g", "text": ["My favorite go-to Chinese restaurant. Consistently good food. Teriyaki chicken and pot stickers are the best.", "Had a Chinese craving and Sizzling Hot came to the rescue! Tried veggie egg foo young and is my new favorite. Crab Rangoon always a good choice.   Sherri is...", "This place is a hidden gem! General Tao and Singapore noodles are delicious. Huge portions, we usually take half back home for leftovers. Prices are..."], "rating": [5, 5, 5], "TBscore": [0.32, 0.29, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken", "chineese"], ["egg", "chineese"], []]}
{"id": "5Y-p9QJLrg2P0I8RjJ9TTQ", "text": ["The food is always good when we order. Tonight I ordered moo sho pork. When we got our Oder there was no pancakes, plus I ordered extra which I was charged...", "As for take-out Americanized Chinese food goes, Chang Jiang is pretty good. The food alone gives them 3 stars. What gives them that extra star is the...", "I'm not from this area, but while I was in Madison I decided that I had to have some Chinese food. OMG! The food is awesome from Chang Jiang! The beef fried..."], "rating": [2, 4, 5], "TBscore": [0.0, 0.24, 0.5], "normalisedRating": [-0.2, 0.6, 1.0], "keywords": [[], ["chineese"], ["beef", "chineese"]]}
{"id": "t-LnJne10SHAWATKYdQdJQ", "text": ["We like it! It's a bit pricey so you want to come hungry. Lots of meat and veggie options and the sauces are good. The second spiciest sauce suggestion is...", "Disappointed that the service here has gone downhill over the last couple of years. The food is fine and hasn't changed so \"yay\"?  \n\nOn two occasions in the...", "I've been here about 3 times, all in the span of 2 months, and didn't have any of the bad service experiences others faced. Maybe it was because I went for..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "nM2Jl9GS7IGlluey8ieivg", "text": ["Came to eat here with some friends who work an hour north of Madison. Everything that you normally expect from a Noodles and Company.\n\nWould give 5 stars,...", "Nice staff. However, I agree with prior reviews regarding lack of care. Not cleaned up.  Uncleared tables everywhere. Floor gross.  Bathroom is dirty and...", "Don't go here.  Staff is rude.  Tried picking up my over phone order in the quick pickup line.. but I guess this store doesn't use it and had to wait long..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "HxC7kYHEVO-GKHvDoeI2RQ", "text": ["Great Korean food and friendly ownership / service.\n\nVisits: 7+\nRecommendation: extra crispy bibimbap in the stone bowl", "We were wandering around Middleton, ran across K Peppers and decided to give it a try. It's located in a newish strip mall area with plenty of parking. The...", "The ban chan was sparse and not great. The bulgogi was too sweet and had too much sauce, with an unappealing presentation. The noodle seafood soup tasted..."], "rating": [4, 3, 2], "TBscore": [0.39, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["korean"], [], []]}
{"id": "vzqzoa-plufwTsQUwW_s6Q", "text": ["I am a fan!\n\nThe Pho here are huge and they don't skimp on the rice noodles.\n\nThe broth is clear and doesn't have any of the fat or greasiness at some of...", "Located next to Hu Hot, it's a place I've been to a couple of times. Madison does not have very many good pho/Vietnamese food options (no matter how much...", "Positives:\nThe place looked clean and the servers were helpful and friendly. \n\nNegatives:\nI ordered an array of food: wontons, spring rolls, shrimp & papaya..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "pUSOXrppEF0r2bMbn6PAKQ", "text": ["Wow! Absolutely delicious. Was looking forward to getting food from the SoHo food truck for quite some time now and it definitely did not disappoint. \n\n I...", "Was once more focused on dumplings but has really taken on the rice bowls, salads and specials, Soho has taken Asian dishes to a whole nutha leva of...", "If an item on the menu has a large \"100% vegan\" graphic next to it, it should NOT be covered in real cheddar cheese.  Just sayin...\n\nOtherwise, the \"vegan\"..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "I0L3Qp-uAWzAgdnhzITZ1g", "text": ["This food cart on the square near King Street gives you great bang for your buck. I ordered the dark meat chicken tacos (3 for $6), which came with bulgogi...", "Not worth the money. Burrito is full of rice and other vegetables with very little meat. Flavor is okay, somewhat spicy, just wish it did more for me....", "Had the chicken quesadillas. Very low quality meat, but the sauce that it was cooked in was delicious. Gave me diarrhea tho."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["tacos", "chicken"], [], ["chicken"]]}
{"id": "zEJnehBheo9BeT8_o9hvLQ", "text": ["It's not bad but it not amazing either can be used to describe the pricey yet low quality of food from Noodles & Company. In terms of picking the type of...", "I am a fan of noodles and I frequent two other locations regularly but was in the greenway station area and had a HORRIBLE experience-\n7 pm Friday night...", "Horribly slow to get your food, even when you order ahead. The soda dispenser was broken, which they didn't bother to fix despite still selling soda cups to..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "ws09HDqOIfyKMN0TSp3YKQ", "text": ["The shrimp are huge and so fresh! My dish is made perfect every time! Love this location. The cook is awesome!!!", "I'm an occasional Noodles & Co patron and I like many things on the menu. I usually take it to go, so I can't speak to the service, but everyone seems nice...", "Before undertaking the task of cleaning our duplex out, I needed to carbo-load. What better place to do so than Noodles!\n\nYes it's franchise but I still..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "gapf3si69XZVKiaBilfwWQ", "text": ["After reading through a few of these reviews on here I feel most are way to critical and silly. It's a Noodles & Company. It's good food. You pay a bit more...", "Updated Review: I will NOT be coming to this restaurant in any city ever again. I was eating at this location on the 4th of July, 2018 and bit into a...", "There are not many vegan options in this area, so when I heard that this place was vegan-friendly, I decided to try them for lunch. \n\nThere aren't a lot of..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, -0.25], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], ["lunch"]]}
{"id": "jte_XM9Zo7TX86jlKwq5gg", "text": ["A great variation on typical Indian food. The Dosas are made without wheat, which allows the mildly gluten intolerant folks to enjoy some crepe-like...", "PROS: Solid Indian food, not too greasy\nCONS: Lacking ambience\n\nI really enjoyed the dosas and curries we got here. The food doesn't feel overwhelmingly...", "We decided to try out this place for lunch buffet. For $13 per person it felt like highway robbery. \n\nNegatives:\n1. There wasn't much variety in food...."], "rating": [5, 4, 1], "TBscore": [0.34, 0.33, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["gluten", "indian"], ["indian"], ["lunch"]]}
{"id": "-D9NFU_SZpp5J7VCSsPp1Q", "text": ["You get your money's worth here.  They feature all you can eat buffets for both lunch and dinner.  The food is of uniform excellent quality - their samosas...", "Excellent Indian food on State Street! Visited with my parents for dinner and the food was fantastic. I had the lamb with vegetables in a curry sauce. The...", "I've gone for the lunch buffet, for dinner, and gotten it for delivery and I have always been impressed by the flavor of the food! Usually, it's a wife and..."], "rating": [5, 4, 5], "TBscore": [0.65, 0.7, 0.38], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["dinner", "lunch"], ["dinner", "indian"], ["dinner", "lunch"]]}
{"id": "llKBbswD5XIb-kXFSCP9Tg", "text": ["I had the pleasure of introducing a fried to Indian cuisine and Swad turned out to be the best random roll of the dice decision! \n\nI was craving Aloo Saag,...", "Since my first review of Swad; 1.  My boyfriend and I had our first date and 1 year anniversary dinner there, 2. I have have learned that...", "This is our first trip to Swad. I chose this restaurant based on the favorable reviews. Since Yelpers are such awesome reviewers, I am rarely disappointed...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["indian"], ["dinner"], []]}
{"id": "RGLC87HVaASIYLxh2RL4hg", "text": ["Best Indian food in Madison!! Great food and great service all in one place! My partner and I went on a Saturday at 11:40am only 10 mins after they had...", "Disclaimer : My review is for their Lunch Buffet Only\n\nI've been to this joint earlier back when snow was at its peak. There's a joy in life's simple things...", "Just arrived home and decided to go out to dinner nearby the airport. The restaurant is located next to the coin laundry on E Washington. Parking was full..."], "rating": [5, 2, 2], "TBscore": [0.7, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["indian"], ["lunch"], ["dinner"]]}
{"id": "cJLx99fsYPM0SlNfWLb4Ug", "text": ["Absolutely the best Indian food in Madison- we have been eating regularly at the buffet and during their regular dinner hours. They always have a couple...", "The lunch buffet is a steal for $10 (or $9 if you're paying in cash - they offer a 10% discount). \n\nWe stopped in shortly after the opened on a Saturday...", "Up in the Mad Town to take a Sister in law to move into college.\n \nNeeded to grab lunch and decided to go to a local ramen place but....No parking.\n\nDecided..."], "rating": [5, 4, 4], "TBscore": [0.3, 0.0, -0.31], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["dinner", "indian"], ["lunch"], ["lunch"]]}
{"id": "utC9M5BetVY6GECRyZeLEw", "text": ["Stopped with a coworker to have lunch. It was busy inside so you know the food was on a decent rotation. The atmosphere was a bit dark and the AC was on...", "This place is great for a lunch buffet! My coworker and I stopped in the other day to give it a try, and I can pretty much guarantee we will be back. \n\nThe...", "OMG. I am sitting on the toilet as I write this review. My tummy started hurting right after finishing dinner. Things got progressively worse just a minute..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [["lunch"], ["lunch"], ["dinner"]]}
{"id": "scM6rLQqoz5dEIgwz_JFsg", "text": ["Food is amazing fresh with fantastic flavor, and top itnoff with great customer service! Five stars for Haveli serving great authentic Indian cuisine.\n\nI...", "Haveli Restaurant is one of my favorite Indian restaurants in the Madison area! I always crave their food. The food is always packed with a lot of great...", "This is our favorite spot for Indian food in Madison. We have simple tastes and usually go with the Tikka Masala or Saag Paneer and some garlic naan, but..."], "rating": [5, 5, 5], "TBscore": [0.59, 0.71, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["indian"], ["indian"], ["indian"]]}
{"id": "9gJjV1uydmM6ncehYn159g", "text": ["While I've attended Amber Indian countless times for dinner, and enjoyed my food immensely, I have never ate at the lunch buffet before. I was in for a...", "Okay,\n\nLet me start by saying, I am picky when it comes to my Indian food.  Thai, Indian, Mexican, Japanese, these are my happy places culinarily, largely...", "I come out to Middleton to eat here. I live in Fitchburg, so this is saying something. It's important to note that I still love Haveli, and there's..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["dinner", "indian", "lunch"], ["mexican", "indian", "japanese"], []]}
{"id": "8PCFk6ZKDm73Ag42C8XtGw", "text": ["How have I not written a review yet!?! \nWe have been here plenty of times usually a stop after grocery shopping at Woodmans or the Indian store next...", "Been meaning to try this place for a while, wish I would have done it sooner! I stopped by today after shopping at Woodman's and I'll definitely be back. I...", "Good place, love their parantha's, sweets(desert) are good. Easy access location, sometimes parking might be tough but you can use Woodman's right across..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["indian"], [], []]}
{"id": "Xl6I0-JmFE_6w28bku2idQ", "text": ["Still great food, especially if you're vegetarian and looking for more than the usual veg dishes.\n\nBut the big news is that Himal Chuli now takes credit...", "Very cute restaurant with beautiful ambiance! It's a very small place so it was little difficult to get a seat. I loved their decor . Their food is delish!...", "Himal Chuli is an institution on State Street in Madison, and is a great place for vegetarians. From small families, students, to professors kvetching about..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "CcuKo38SwW54TDlMWAMi7A", "text": ["I've always had a great experience at Taj. My partner and I went in for a quiet dinner on July 4 and received both prompt, courteous service and fresh,...", "I've been here a few times now. Their tikka masala is pretty legit. They have pretty standard everything else. \n\nMost recently and what prompted me to write...", "Very slow service. We went during a weekday lunch when I would expect the service to be quick. We came at 11:30, and there were only two other couples in..."], "rating": [5, 3, 2], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["dinner"], [], ["lunch"]]}
{"id": "kEIe_lyBKdFB6Hv_wsUYaw", "text": ["We tried Curry In the Box for a late lunch on Sunday. We've driven by this place dozens of times and commented that we should try it. I like the name, I...", "i love curry and i've tried a lot of curry spots in town. Curry in the Box is good but isn't up to par to other restaurants offer, in terms of flavor and...", "Curry in the box is a cheap Thai place for college students to take to their dorms and manned by college students.\n\nI drove in around 7 PM and was surprised..."], "rating": [4, 3, 3], "TBscore": [-0.3, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["lunch"], [], []]}
{"id": "YK6XFE1SbLZGGXIKZmrQ-Q", "text": ["Ugh. What a struggle this was. Ordered food from here via GrubHub and was told 40 mins to an hour. Okay cool. No problem. Bring on the deliciousness!\n\n70...", "The worst food ever also the service is terrible \nI will never order there again \nEverything is over-spiced and over cooked not fresh !\nI wish I could give...", "Unbelievably bad. Dirtiest restaurant in Madison. Not sure how they have stayed open for so long. Really not worth it don't get food from here. order was..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "aYE-oZFvSOHsyAtcpf0frQ", "text": ["One word to describe this restaurant : Authentic!! Eating here makes me think I'm sitting in a cantina in Mexico! If you go here you have to get the queso...", "This is one of our favorite Mexican restaurants in the area! Everything is so tasty. Salsa is homemade, always included with unlimited refills, and of...", "Palenque is easy to miss, but you should make a point to seek it out if you enjoy Tex-Mex favorites. Located in a strip mall on 51 in McFarland, it'll be on..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["mexican"], []]}
{"id": "24fW-8hK0hs5KvEYWwWNDw", "text": ["Super underrated!!! Every time I have been in here the staff has been super nice. I have always loved my food (I usually get fajitas). Last time I got the...", "My fiance and I frequent here and normally have great service and great food.  Yesterday, we still had good service, but my fiance found a long hair in his...", "Dislikes: Food (I got enchiladas), it tasted bland and so did the beans and rice with my meal (and I thought Mexicans liked spicy stuff), and the waitress..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "SpCVf25ya5jsHItdkpBpUg", "text": ["This is a great spot! I met up with my family here for my birthday. The service was 5 star - everyone was attentive and friendly. The decor is fun, which...", "This is my favorite Mexican restaurant, I have never been disappointed, one of may favorite dishes is tacos al pastor they are great!!", "I have been eating here for 18 years.  I always used to love the food and service.   Lately though I've had some bad experiences.    Very unfriendly manager..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["mexican", "tacos"], []]}
{"id": "xStWlT67YUdrdhfrNP0eQQ", "text": ["Come for the happy hour. I've enjoyed the 1/2 price margaritas, other specialty drinks discounts (i.e. sangria), $3 taps, and nacho deals. I appreciate that...", "LOVE Pasqual's. My go to place for Mexican-American food in Madison. A little emphasis on the American. \n\nI got their quesadilla and my girlfriend got the...", "I was meeting some friends for an impromptu visit and Pasqual's Cantina was a good mid-way point.  I have not been to this location before and was happy to..."], "rating": [3, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [[], ["american"], []]}
{"id": "svPjZWp4Pa32fwI2gNlxJg", "text": ["This is in our neighborhood and we love it! Authentic food and great portion sizes! A must have  meal if you are visiting or live in Madison. This is a...", "This place is not good. \n\nWe went there last night, they either don't have AC or the AC was broken so it was about 92 degrees and humid inside, there was a...", "Why? Why did we choose Mexican food tonight? We have been to Cuco's twice before. It is OK as far as your typical Americanized Mexican food, but in the past..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], ["mexican"]]}
{"id": "yVYteK2Ootg37Gh2SIPihA", "text": ["Best Mexican food in Wisconsin. The chips are home made. They have the best salsa and entrees are about ten bucks.\nThey have the best margaritas and the...", "I've decided that instead of complaining about the lack of restaurant options in Waunakee, I need to just get out and explore more nearby...so hence this...", "The food is always good, but the service is just ok at times. My entire family enjoyed their lunch, but my wife didn't get her food until we were half done..."], "rating": [5, 4, 4], "TBscore": [0.6, 0.0, 0.31], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["mexican"], [], ["lunch"]]}
{"id": "ZcAoKSDT6BNcWsn3o4-WVA", "text": ["I've been to Me and Julio's twice now. It's a well-put together place with a nice atmosphere and outdoor dining area. The food was a little disappointing,...", "This is a three star solely based on service and atmosphere. We went here on Tursday night for trivia and arrived a little early to get food too.\n\n On...", "First time here for dinner with kids and mother-in-law. The food is a mix between American and Mexican. I ended up having the walleye dinner based upon our..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], [], ["dinner", "mexican", "american"]]}
{"id": "UidScb9HFDSD3NBw8MLuGw", "text": ["Pasqual's - Consistent, Local, Great food & drinks for years!\n\nPasqual's has been a Madison tradition for years; I've been to all of there locations and the...", "I had the jerk chicken burrito, side of cilantro sauce, with New Mexican Rice and pinto beans. The food was great, I loved how spicy the burrito was. I also...", "I have such mixed love for Pasqual's. I still remember going to Pasqual's on Monroe street while being in middle school with my parents and sister. I..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["mexican", "chicken"], []]}
{"id": "QvpH6e7_1Tdlflk_yOj4NQ", "text": ["** Here are reviews from a group order I placed at work today ** \n\nThe Persian style veggie soup : vegan, dill-icious. Nowhere else in downtown Madison [the...", "Who knew a fun little community cafe could have an eclectic menu with delicious food?\n\nIf you are able to visit during one of their few open hours, I'd...", "This place surely has its fans, and it would be a shame to lose, because it is a lovely space with nice comfort food options, including some healthful ones...."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "mSY7I7YYb2v9_2YQ96rwTA", "text": ["Cute restaurant with fresh tasting food and prompt service. \n\nMy husband had the cheesesteak with a side salad, and I had the zoodles with the garlic...", "51 South has great food, friendly service, really nice decor, and a great atmosphere. I highly recommend it. I'll be a regular here.", "Nice fresh  ingredients daily special was delicious as was the blueberry cheesecake. Server was prompt and very friendly. I would highly recommend."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "Ojw5eTqzbv6k27_Df3q0-A", "text": ["Mrs. T and I went here for our anniversary dinner this last weekend because we were craving Italian *and* wanted to try something new.\n\nHaving exhausted...", "Our server's name was Tex. If an attitude can be personified into a human name, this was it. Think gruff and, how shall I say this... straight-forward...", "On 9/22/2018 we went into the location after seeing the parking lot was somewhat empty for a Saturday night. That probably should have been my first red..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["dinner", "italian"], [], []]}
{"id": "TxgLkQGhqVdUGFTCdcEilA", "text": ["Campo di Bella is more than just dinner and wine, it's an experience! We were seated at big long tables with the other guests (not too close, but close...", "I wish I could give this place another half star, but I'm settling on three instead of four.  The positives have all been written about already: It really...", "Had a five-course vegetarian feast featuring Vermont Valley produce. All courses were simple and delicious. Each course was introduced and the event..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["dinner"], [], []]}
{"id": "OacH3fpQxtfk7NU-s-Rmmw", "text": ["Stopped for a late night meal. Lasagna had a frozen taste but I could tell if it was fresh it would have and could have been amazing. The bread was served...", "We stopped by here because it was recommended by our Airbnb host and this place is amazing!  Everything that we tried from the menu was absolutely sublime...", "Best Italian food I've had in a very long time. Great  service! Dined w friends and we're all from out of town."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.48], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], [], ["italian"]]}
{"id": "Bx8cfQJpZvKNA4TWPFWDJQ", "text": ["First time at Tuscany. Like the atmosphere,loved the piano music. Our server was Betsey, she was wonderful and made our dining experience much more...", "We had a Christmas event catered at this restaurant and orders placed weeks ago. We were disappointed in the meals we received.\n\nWe had 3 meat options,...", "We stopped for their HH. Their HH is 1/2 off appetizers. No drink specials during HH. We had the filet mignon kabobs and the tuna piccata. The tuna was..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "SzZXyEAWLkiVfK8I9oltKw", "text": ["the cake we ordered from carl's for my daughters birthday party turned out better than we could have even imagined. it was beautiful, delicious, and the...", "Carl's was awesome from start to finish! We decided on a pirate themed wedding and wanted a fun cake for it.\n\nMy wife and I didn't know what to expect at...", "I wanted a sculptured Blue Owl Cake that two other bakeries had said could not do. I called Carl's about a week in advance and was promptly told it was no..."], "rating": [5, 5, 5], "TBscore": [0.78, 0.65, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "TIf6ZByLdAXratne18kjoA", "text": ["We had a special cake design for a teenager who wanted specific things, so we had to find a cake shop with the skill level to accurately create  what would...", "I don't have much of a sweet tooth, but Craig's Cakes takes the cake in terms of bakeries. Pun intended... I'm sorry. My first trip to Craig's was with my...", "Craigs Cakes have one of the best bakery in Wisconsin. They have the excellent mini cakes which are really filling I love vanilla, chocolate, carrot, red..."], "rating": [5, 5, 5], "TBscore": [0.25, 0.0, 0.54], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "j4jzNojOTEKmt1QMreJu-A", "text": ["Combination Vietnamese and American bakery, also house made coffee.\n\nI tried a caramel iced coffee.  It was easily as good as the big names and less...", "Came here for the first time, unfortunately the chicken puff and cupcake I chose were not impressive at all. \n\nChicken puff was kind of pricey, $3.99 .The...", "I've been meaning to try this bakery for months. It's on Gammon Road, but you access it on the Woodmans side of the building.\n\nOne of the two sisters was..."], "rating": [5, 3, 4], "TBscore": [0.0, -0.23, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["american"], ["chicken"], []]}
{"id": "1AGYo6FGnNgcl_BfuKgxlA", "text": ["I am by no means a cupcake connoisseur, but I am confident in saying these cupcakes are some of the best cupcakes around!  I have not been to the actual...", "If you like your frosting to cupcake ratio 60/40, this is your jam.\n\nI don't normally say this, but I couldn't finish the cupcake in one serving. The amount...", "Looked delicious but was a little too sweet for my taste buds. The cake was delicious- very rich and moist. However, the icing was a tad excessive. I'd also..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.4], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["cake"]]}
{"id": "6JOgO-HYN90eR9g-c6kNfw", "text": ["Was surprised with a Tall, Dark & Delicious cake from here for my birthday, and it was definitely a good one! I'm. Not much of a chocolate ice cream fan,...", "To be clear, I wouldn't come here for ice cream because there is a yummier local shop right across the street. But I wanted to get an ice cream cake for my...", "I don't go here regularly because it's overpriced, extremely sweet, and has a custard consistency which makes it melts very fast. It's fun to go once in a..."], "rating": [4, 3, 3], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["cake"], ["cake"], []]}
{"id": "rAONgHl9EY0gwvmiXqsmMQ", "text": ["What's cool is when you find a nice place to go to get quality food with a relaxing environment. I am a huge fan of coffee so this place just hit the spot....", "We have been wanting to stop in here for a long time. Today we finally did!\n\nThe treats we did get, were yummy. The price wasn't bad either. The...", "Not sure why everyone rates this high. Icky gummy GF bread, an egg that was supposed to be over easy and wasn't and bacon that's the precooked microwave..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], ["egg"]]}
{"id": "1ZkcNwQpIESg8LuAHzye6Q", "text": ["Zuzu is a kinda crunchy neighborhood place next to the zoo. Relatively small, but just fine for lunch!\n\nThe good:\n*Very affordable! Two large portion...", "Went here on Saturday to meet up with a friend for a play date with my son. Street parking only, but with it being cold out, the zoo was empty so there was...", "Small cafe with a neighborhood vibe. The menu is simple with 6-7 sandwiches, a few salads, 2-3 soups, and a menu of daily specials. When I bike around Lake..."], "rating": [3, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.6], "keywords": [[], [], ["sandwich"]]}
{"id": "kQnTHh_KHyV-JbltviG8mA", "text": ["Currently writing this review while I sit and enjoy my amazing breakfast sandwich, coffee, and magical coffee cake.\n\nFirst of all, as soon as you walk in...", "One of my go to stops when I am traveling to Milwaukee because of work. Right of the interstate with good parking this location is great. Not only location...", "EDIT: I REALLY wish they were open later. Unfortunately they close at 1pm/2pm depending on the day. merp. \n\nIf I could control myself around carrot cake,..."], "rating": [5, 5, 4], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["breakfast", "sandwich"], [], ["cake"]]}
{"id": "WJhhjBkgS9FtXET_EJ1HTQ", "text": ["Pleasantly surprised, having had my share of bad barbecue.  They use a sweet, KC-style sauce (which I loved).  Meat was a little fatty for my taste, but...", "Nope.\n\nAt this price either the sandwich should be bigger or the side should be included.  The BBQ tastes fine here - nothing special.  But its' too...", "Let's start this off right. This is not a gourmet BBQ joint. What this is, is a tasty place to eat, if you are on the go, and surprisingly..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.26, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], ["sandwich"], []]}
{"id": "0kzPQQL8wVcHlBQzMdRdWQ", "text": ["I am actually shook by how great this place is and how long it took me to get here! This will be a quick and simple review because you should just visit...", "Thirsty goat? More like piss in a moat... \n\nThe draft lines haven't been cleaned since establishment in 1932. \n\nThe service.... wait.... what...", "Finally ventured to the Thirsty Goat for a late breakfast this weekend. I've only been to the Goat once before for dinner and man the ribs were the greatest..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["dinner", "breakfast"]]}
{"id": "V4Lu6jbMdlimpVFGPAFkdQ", "text": ["UG is both a specialty shop, selling all kinds of meats, cheeses, and other \"farm-to-table\" accoutrements. But it's also a great place to grab really...", "The veggie sandwich was the worst veggie meal I've ever had and it was drastically overpriced (50% more than you'd pay for any sort of sandwich anywhere...", "I'm an out-of-towner walking in expecting something like a NY deli sandwich. Very pleasantly surprised by this place. Roast beef was great, though they..."], "rating": [5, 1, 5], "TBscore": [0.0, -0.25, 0.45], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["sandwich"], ["beef", "deli", "sandwich"]]}
{"id": "NJ4S3JX56JEZGWlAfpF9kw", "text": ["Buck and Badger is my jam. And what i mean by that is it is my now go to place for a drink with some friends and a good time. I love the casual bar...", "To be honest, bordering on a one after my last few visits. Shortly after my previous update the menu was overhauled and the staff appears to have been...", "I've come here many times over the years most regularly for geeks who drink trivia. While I love the trivia and the atmosphere (although don't like that the..."], "rating": [4, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [["bar"], [], []]}
{"id": "zXb5pP4zMHvmusweYfr9TQ", "text": ["So this is a McDonald's of the future.  It is pretty clean and modern.  No more wiggle chairs.  There are many different styles of seating from individual...", "Who reviews McDonald's? Like really.\n\nWe were in town for a few days preparing for our wedding and often needed a quick, hearty breakfast while rushing...", "I rarely eat mcds.. And I was not badababa lovin it by any means known to man. Won't be eating there most likely ever again. \n\nAfter them messing up my..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["breakfast"], []]}
{"id": "GRBJc51ofoVZWpLOs16a1g", "text": ["I was moderately happy with my order here. I ordered baklava and the veggie plate which comes with grilled seasoned tomatoes, green pepper, shredded carrots...", "Very good food and generous portions at a good price. Yes, it is in a mall food court so the atmosphere suffers, but it is worth the trip over to the west side.", "I was looking for a place to eat near the mall and decided to come here because of all the amazing reviews others had left. Maybe my expectations were just..."], "rating": [3, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "tMfGHhwGZDXuWZQHd1a0OQ", "text": ["Took me a year to finally try this place after living practically next to it. I always was a bit sketched out that it is adjacent to a gas station. I...", "I have frequented this place for a while and have NEVER been disappointed... also have visited their food truck when downtown and am always satisfied after...", "I ordered the Italian Beef combo (Mild).\n\nThe fries were your typical small, fast-food joint fries. They weren't anything special. That is not necessarily a..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["beef", "italian"]]}
{"id": "tt96sjIQIKgtGEvRHhLfBg", "text": ["Was there a few weeks back and something was forgotten.  I know how unappreciated fast food work is so I didn't worry about and I called.\n\nThey took all the...", "Here we go!\nSo I've been seeing the advertisement for the \"Philly King\" for Burger King on TV. I thought I'd try it out and see of it's anything special....", "The drive-thru staff is no longer friendly and, even if they take your order correctly, they frequently omit items from your bag. It is such a chronic..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.36, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], ["burger"], []]}
{"id": "i7PG3pFaBLy9MHM_RYzKAw", "text": ["I love the meals I've had here as much as the sweet woman that greets me each time from the kitchen when I pick up my food.\n\nMy faves are; pad thai with...", "My girlfriend and I recently moved to the area and decided to order takeout from here. As a staple, we always order fresh spring rolls when we eat Thai...", "Other folks must have experienced this spot on a better day than us! \n\nIt started with warm beer. The Mr ordered a beer which came out in a champagne-style..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "n8tzdLv8oREwZF6e8u7Hkw", "text": ["I'm a fan of Wendy's food. I like their chili and their baked potatoes. Of course I'll get their spicy chicken sandwich too on occasion.\n\nThis location is...", "It had been years since I'd had a Frosty, and on my way back from a movie at the Palace in Sun Prairie I was hit with a spur of the moment craving and...", "22 minute wait for a kids meal. Multiple customers left the drive thru line out of frustration. Two fellow customers in line behind me inside the dining..."], "rating": [3, 3, 1], "TBscore": [-0.6, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [["chicken", "sandwich"], [], []]}
{"id": "tsDdetbc4qtzgAPtcLH87A", "text": ["The first time we tried this place, we were pretty excited. While the brewpub model is quite a familiar one in Madison, Rockhound seemed to exude a scrappy...", "I would say that this a typical brewery and dining experience for most folks. They do have a large bar, which is nice if you aren't mush of a beer...", "I had a great experience at Rockhound Brewing! \nWe went on a Thursday for dinner and got seated right away. Our server, Sarah, was super sweet and helpful...."], "rating": [4, 3, 5], "TBscore": [0.0, 0.29, 0.49], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["bar"], ["dinner"]]}
{"id": "V1JEkeAem05hps5ZCmMIgw", "text": ["We came here on a Saturday night. We were in the Madison area for a birthday. Tons of beer on tap, up stairs and down stairs seating. Patio was closed when...", "To make a VERY long (painful) story short....  \n1.) I forgot my credit card and I called and was rudely hung up on, I called back and they told me they did...", "Worst pour ever this weekend, 12oz in a 16oz glass, next time I come, I'll bring my own measuring cup.\n\nAlso, the bartender lied and said it was a standard..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "UDyScSvpzBEgOGs6HAXcRg", "text": ["I was a long time patron of Jamerica, but as the years have gone by it has become hit and miss depending on who's cooking, and I was looking for another...", "Food for buffet was cold and all jerk prepared food had a strong allspice flavor \nThr coconut cake and banana cake were super dried out and dry\nVery...", "We missed Jamaica tonight so we thought we'd hit up the buffet and take our little one out (he's 9 months!). Prior to our little Babe, we frequented their..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], ["cake"], []]}
{"id": "7Tp53xZh1ypd2wbudP6Qcw", "text": ["Not the best Thai/Vietnamese but decent for Madison. Also the prices are extremely cheap but they only take cash. Go to Walgreens and get cash back. I got...", "We snuck in here and sat outside on their secret back patio for a lunch meal.  The food was good and came quickly.  Overall we were quite impressed.  I am...", "Visited on a weekend night in the late summer around dinner time. Ordered Pad Thai with shrimp and a curry with chicken.\n\nPros: outside dining is very nice...."], "rating": [4, 4, 2], "TBscore": [0.0, 0.22, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], ["lunch"], ["dinner"]]}
{"id": "4FdXVA-WxWwc5rmjRPJVnQ", "text": ["Went there for a late night snack excellent service and great food fast service as well! Verrry nice employees !", "Gonna be britaply honest. Do not come here within 12 am to 12 pm. \nThere was one decent staff member here and he was working his a** off to resolve the 2...", "If it were an option, this McDonald's location would get negative stars from me.\nFirst, I had to explain to the cashier at the drive through just to give me..."], "rating": [5, 1, 1], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["snack"], [], []]}
{"id": "4ZalERS8GVHK_1ULa86rMQ", "text": ["This was my first time dining at Rex's Innkeeper.  I went one night for a friend's birthday party.  They were going to seat us in a back room but my friend...", "Came here with family of 16 people, the service was great, the food was good, I ordered steak tenderloin and lobster tail entree, the steak was perfectly...", "If you want a great old fashion salad bar with two kinds of soup you will be in hog heaven here. Rex's has been doing this for years and it's very good...."], "rating": [4, 4, 5], "TBscore": [0.0, 0.83, 0.6], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["steak"], ["bar"]]}
{"id": "TNV-nSWQ_pN6wrMwAgxSkA", "text": ["This is an old style tavern slash restaurant. Typical for the region. It is located across the driveway of the McGovern Hotel and Suites. The hotel offers a...", "Just like I remember it 30+ years ago. It was fairly modern then but today is definitely more vintage, almost frozen in time - from the original jukebox on...", "Welcome to McGovern's Club & Restaurant. I don't do a whole lot of eating or drinking here but I am here for Trivia on Tuesday nights. And, because I am not..."], "rating": [3, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "3OUe3uCFuYn6kCPJQNPXUw", "text": ["I have been wanting to go here for years and sorry I waited so long!!\nNot only was the food good but it was a trip back in the time of supper clubs. Namios...", "Hell yes!  Iconic, vintage sign?  Yes!  Vinyl red chairs?  Yes!  Liver and onions?  Yes!  Friday night Fish Fry?  Yes!   Dry Rob Roy cocktail?  Yes!  Relish...", "I hate bashing a local business but we had an awful experience. Only one of four entrees was \"good\", two were passable  (steak undercooked and fish dripping..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, -0.22], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], ["steak"]]}
{"id": "QKIfhITX4YGi-nJdb1SpJw", "text": ["I visited Plow tonight for the first time and fell in love with the place. The bartender and servers were welcoming and friendly when I walked in. My aunt...", "We were recommended Plow by a friend. He is normally a very picky person...and he visited multiple times.\nFirst off I loved the atmosphere. Very neat old...", "Our first dining experience in Cambridge, WI! We had excellent coffee across the street at Kindfolk and read the mostly positive reviews for the Plow. We..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "LqhGOK8p0IZx7TzkFF_N4A", "text": ["The steak was not very good but they had great service. They had a little waiting room where there was a bowl of Gardetto's and they took our drink orders...", "Bad to WORST! Bad service, poor quality food, terrible hostess, dated decor and on and on. The good: good bar staff. Never, ever again! So....here it is if...", "No reservations taken on Fridays, so count on an hour wait. Nice bar area. BBQ ribs and Friday Fish Fry get four stars, while crusted cod gets three. The..."], "rating": [4, 1, 3], "TBscore": [0.0, -0.32, 0.6], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["steak"], ["bar"], ["bar"]]}
{"id": "3RetxRZoakYWEMql5VmmJA", "text": ["My son and I came in for breakfast around 9:00 am, so after the morning rush. The hostess/cashier stand was unattended and no sign stating 'SeatYourself' -...", "I had really high hopes for this place, but I'm sad to say I don't ever plan on going back.\n\nPositive: they have really good pancakes. We got the strawberry...", "45 minute wait for cold and bland food. I knew we should have left after 20 minutes. I don't see how people like this place."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["breakfast"], [], []]}
{"id": "OHlWeG019fqPbvYO5ZDEqg", "text": ["My favorite bar downtown! I absolutely love this place. Even when it's super crowded, the service is still fast and all the bartenders are fantastic. I also...", "Went to Shamrock for food and drinks at around 11am. I got a Shamosa to drink, which is basically a mimosa but with some tequila as well. It is slightly on...", "Walked into this place not knowing it was classified under gay bars until later.  I found out later the next day by reading it on Yelp.  My husband and I..."], "rating": [5, 3, 4], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "wwnuIvnVLgpEZOKzcdfDhw", "text": ["My wife and I first went here with a Bucky Book coupon. Every time we've been here the food has never disappointed. Don't know how they do it, but it's...", "My boyfriend and I stopped here for lunch a very days ago. We both had burgers with fries. Everything was very greasy and bland. And seemed overpriced for...", ":::This review is for the catering:::\n\nWe order Cran Creek often at work. The quality of their food is great. The presentation, set up, customer service -..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["burger", "lunch"], []]}
{"id": "5tsgHQhKey_qP2e866fNhw", "text": ["I've been here 3 times, on the weekend. I love this place! They have specialty pancakes and other delicious breakfast foods. To me, the food tastes really...", "Yummy, popular place.  We were on our way home to Michigan and this came up as being near.  Being right off the highway made it a good choice.  It was...", "One of my favorite spots for breakfast.  Bluegills and eggs!  Amazing!"], "rating": [5, 4, 4], "TBscore": [0.42, 0.0, 0.69], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["breakfast"], [], ["breakfast", "egg"]]}
{"id": "lT4k-e2Axf-f0nA8De9w5A", "text": ["The Green Forest is a family favorite. The food is always fresh and delicious. The soups are amazing. The owners and all the staff are friendly, caring and...", "I used to work at a local coffee shop down the road and was always interested in trying this place out, but their hours never coincided with mine. It's such...", "The staff were great and very friendly. Went for breakfast and got a lot of food for a good price. Nice homey atmosphere, and what appeared to be a lot of..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.65], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "a2WtA_9HkxKe7OJ7NVA0dQ", "text": ["I've been here a number of times for various events. Love how much goes on here. There is always different events and community workshops going on. I have...", "Good and bad.\n\nGreat concept, but a bit too self congratulatory and precious.\n\nThey are absolutely inept at food service; ok food, but horribly mismanaged...", "Friendly service and quiet place to enjoy coffee or lunch and get some work done.\nPlenty of parking and \nExcellent spot to start /finish walk around..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.44], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "VbRT8CJlnCO9_rd0zW-rUw", "text": ["Okay fine, Wisco. You got me. People said you had one of the best burgers in town, and I was like, \"what.\" But when I came here with yet another friend who...", "Good, predictable dive bar on Willy St. It's primary purpose for me is to fill time, and my belly with beer, while I wait for dinner at nearby restaurants....", "The Wisco had a beautiful facelift recently, but don't worry, it's still all dive inside. Until my recent visit it had been a few years. Previous memories..."], "rating": [4, 3, 3], "TBscore": [0.64, 0.3, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["burger"], ["dinner", "bar"], []]}
{"id": "LuqFbuLQXT3CN3hIyKiRkA", "text": ["Was here once on a Sunday morning in Stoughton. Ordered potato pancakes. They had a cakey consistency with lots of shredded potatoes. Large portion. I had...", "Tasty food, high prices, noisy, poor service, gross bathroom. Would enthusiastically rate them at zero stars, if that was possible here.\n\nVisited Pancake...", "Service 1/5 stars.  Waitress forgot to put in one order leaving person at table without food while others ate.  Waitress had to be asked two times for syrup..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [[], [], []]}
