{"id": "pr9QblFCPejuDrGz3oLa1A", "text": ["This was my first time at any of the locations and I have to say these are far from gourmet sandwiches. The sandwich looks like it has been sitting for a...", "Just tried again hoping things had changed. Ordered a hunter's club to avoid guac together. They didn't put tomatoes or cheese on my sandwich! They just put...", "So much for freaky fast delivery. This is the third time I've called and be told that I would take over 45 minutes because their driver wouldn't show up to..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["sandwich"], ["sandwich"], []]}
{"id": "vXT5HJBCcZ1TWl6QYiYREA", "text": ["If you haven't tried Momma G's, consider giving their hot, steamed sandwiches a chance. I can't say that I had a well steamed sandwich before I walked into...", "Let me start by saying I am a HUGE Momma G's fan. Our family is headed to FL and decided to stop here for lunch since we don't have a location where we...", "I'll start my review by saying I love Momma Goldberg's.  However, every time I go to this location I'm disappointed!  The sandwiches are just not as good as..."], "rating": [4, 1, 1], "TBscore": [0.25, 0.4, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["sandwich"], ["lunch"], ["sandwich"]]}
{"id": "AWlGnKlkqfGrO5C5h57bAA", "text": ["sitting outside JJs now.  First time at a Jimmys. Menu was meh. No pepper jack cheese was sad. Sat outside and the Alabama suns beating down. Opend the...", "My wife and I were traveling down to Florida for our honeymoon when we decided to stop by this Jimmy John's. We had never been to this particular one...", "I like this location. It's small, but the staff was very quick to get the customers orders taken and completed. The weather was nice, so I sat outside today..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "mN5eeLfThQEm4q7hMViSfA", "text": ["My friend purchased a vehicle from Orlando FL and as we were making our way to Springfield, MO, realized that the car was driving kind of off (had a...", "Terrible service. Waited 20 minutes for coffee and a scrambler and 2 days in a row they got it wrong.", "I've given this location a few chances because it's convenient to where I work downtown and I like Krystal. So when things go awry, I try to give the crew..."], "rating": [3, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "VwgpX_BD5ujnUs8C6G4OJA", "text": ["Great find on our way to vacation. Fast service.  We had the Grumpy, Cheesy, and Chicago dogs. All were great.", "We ate here for lunch on a Monday. I had two kraut dogs and my husband had a Chicago dog and the grumpy dog. Everything was just okay. My dogs lacked...", "Absolutely scrumptious! We had the grumpy, the grouchy, the kraut and Chicago dogs. All were tasty. Best hotdog chili I've ever had! Staff was super friendly!"], "rating": [5, 3, 5], "TBscore": [0.0, 0.5, 0.51], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["lunch"], ["hotdog"]]}
{"id": "fp_QOEZNa2AbUeZ0DLcrmw", "text": ["Stopped on way home from visiting family in Mobile. Burgers were hot, fresh and tasted delicious - fries were as good as always - hot and cooked perfectly...", "Went yesterday for lunch.  Had a couple of things not go as well as normal at Fiveguys.  Nothing major but just not the high level of service I'm accustomed...", ":(  \n\nI've always heard good things about five guys, but man, what a letdown. Overpriced for a burger. \n\nI paid $16 for a drink, regular size fries, and a..."], "rating": [3, 5, 2], "TBscore": [0.58, 0.0, 0.0], "normalisedRating": [0.2, 1.0, -0.2], "keywords": [["burger"], ["lunch"], ["burger"]]}
{"id": "NdJ4_QWTr_tikrSpJa-7-Q", "text": ["Food was up to par for a fast food restaurant, but the overall condition of the place was horrid, and this is a Hardee's that has been remodeled recently!...", "Every time I think I want your delicious food I trick myself into going, forgetting that this is what I get.. dry, barely iced, and just plain sad. I had...", "My complaint is with the new honey biscuit! Either they didn't put the honey on it or it was so watered down there was no taste!!!! I know I ordered two..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "ZgMdWZdbvJ7jfIxPYtHmVQ", "text": ["After having doctor visit some hot grits was needed. Googled some nearby restaurants that served grits and this one came up.  Service was great the food was...", "Amazing service! Yummy food. We are evacuees from Florida, they were so kind and gave us treats for our dogs. Fantastic service!!!!", "My husband had a double cheeseburger and fries they were delish. Then I ordered Chicken with side it came with Chicken strips yummy green beans mashed..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, -0.35], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["chicken", "burger"]]}
{"id": "Lg3NlMVXsZJ0XcTFJOYKvA", "text": ["This is THE worst establishment I have ever been in. We pulled up to the drive through and they told us we had to walk into the restaurant and order then,...", "I would give zero stars if I could they were rude and was taking there time there was nobody even there it being 5:30 on a Sunday morning!! I won't be back!", "I can not adequately express the level of SUCK that this place displays.\nI knew it would suck from the sucky location but there was much more suck that i..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "_QwlZC2NlmkONd-7WKAzjg", "text": ["Good location and ambiance as Panera's go.the staff are very nice and helpful here. I went on Mother's Day when every other rest. Had an hour and a half...", "I've been having a Panera moment lately, and I'm happy about that. I've never before been much of a Panera fan, but with limited lighter options for fast...", "First time I came to Panera for breakfast...it was disappointing. The cashier was rude and kept cutting us off while we were ordering instead of just..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "G_OvL1mGDACFrN5Os_Fa5A", "text": ["Good food, and clean but its the only one in the area so it is crowded which makes it hard to dine in. Try the Diablo sauce if you like it hot", "This is a pretty good Taco Bell overall.  The workers are very nice and professional, which in my opinion is rare for a Taco Bell.  The food is about the...", "Took 20 min get my food in the drive thru, my food was cold by the time I got home (I live 3 min away). Staff was very unfriendly and unprofessional. Save..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "Al82YMB_DKlG1srTj9dCkg", "text": ["Good food, nice service and great atmosphere! I met my son for lunch during the busiest time we were served quickly the food was delicious we were served...", "Ain't gonna say anything besides that I had a 2 and a half hour wait. Horrible service. Didn't think that was possible but yeah don't go there", "I always hated them. Every time I eat there I get diarrhea because of horse meat. Did I tell u I have a mean sister who can't cook. Anyway I came to park..."], "rating": [5, 1, 1], "TBscore": [0.73, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["lunch"], [], []]}
{"id": "1gS2aQdnP0WUeCMpTUmYtQ", "text": ["No I am not a fan! I love Rasing Canes and thought this would be similar but it is not! \n\nThe service was terrible! The chicken tenders were very small,...", "The kid in me absolutely LOVES the grilled cheese sandwich and fries. My sisters LOVES the chicken tenders, and the pieces from this place were huge. What I...", "I just stopped by here and ordered 15 traditional wings. And a fat lady who took out order somehow brought 15 boneless wings. This place was almost empty..."], "rating": [1, 4, 1], "TBscore": [-0.29, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [["chicken"], ["sandwich", "chicken"], ["wings"]]}
{"id": "iS-MAl4wSwb8NKe37VQ6tQ", "text": ["Good place to watch a game and chill for a while. I don't drink but I like to watch sports and have good food. Toco's and great and all the other food I...", "This is our go to place in Prattville.  We are not sports folks so we could care less about that but the service is spectacular here.  Our food has always...", "Slow service and small portions.  Ordered the seafood dinner.  When it came, I thought I had made a mistake and ordered  a child's plate."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, -0.28], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], ["dinner"]]}
{"id": "DUdsBWsqOrZl4DNiwHmXMw", "text": ["Food is 5 stars. I got hot wins adding lemon pepper and fries. Greaaaat flavor. I loved the very wet sauce and the HEAT. Extremely satisfied with the value...", "The best thing to order is a number one. This is a 12pc wing combo (served with fries and a drink).  The sweet tea has the 5lb bag of sugar in it. If you're...", "Yesssssss this is what i am talking about just what I ordered who needs a doctor lol. Came here order something simple of course so here goes. Some medium..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.68, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["wings"], []]}
{"id": "bBZ_yYAcAeeHoY9Khgm01Q", "text": ["Stopped by this Krystal's today, who doesn't love a Krystal's, even though it had a 1 star and not so good reviews, I for one understand that manager's and...", "My sister and nephew wanted Krystals, so I went along.  Once I got there, I decided to order a Sunrise without the sausage.  I know that they make...", "This place is horrible they served me some uncooked spicy chicken sandwiches. An they have bad attitudes. #Pissed"], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, -0.6], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["sandwich", "chicken"]]}
{"id": "5KpZwnqVO90bvkGKzskaWA", "text": ["The area surrounding this place is sketchy but I gave in and tried the wings.\nTurned out to be great. 12 wings, drink and what seemed to be 2lbs of fries...", "This place used to have the best wings. Now, the wings are gross! The French fries have no seasoning. The customer service is just awful. The order taker...", "I went for another visit recently and the wings are getting tinier and tinier but you'll wants to charged closed to $11-12 for a wing combo, but it's not..."], "rating": [4, 2, 1], "TBscore": [0.8, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["wings"], ["wings"], ["wings"]]}
{"id": "nr3IM0nv7zvK5riS7l3ITw", "text": ["Ginormous selection of both Asian and American Cuisine.  Service was good but the food and the selection made the dinning experience outstanding in both...", "My best friend loves this place, but I think it's only okay. Definitely three category, it is cheap and usually clean. The food though is I guess what you...", "Great cheap place to eat.  Typical of most Asian style buffets with a lot of food choices; sushi, pizza, dessert, salad, and the standard American styled..."], "rating": [5, 3, 3], "TBscore": [0.3, 0.0, 0.22], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["american"], [], ["sushi", "pizza", "american"]]}
{"id": "N1afoEOAbMQ5x65KhJPymA", "text": ["Good store. On par with some of the better publixes I've been to. Antonio will make the hell outta that sub sandwich.", "This is a very nice Publix,inside and out.  It's clean and organized, and in a good location. My reason for only giving three stars is that I bought sushi...", "How is there no express lane open in this store?  I've stood in line with 5 items for nearly 15 minutes. Unacceptable."], "rating": [5, 3, 2], "TBscore": [0.6, 0.46, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["sandwich"], ["sushi"], []]}
{"id": "JxZ8RPYhrCxQ1078WoU4Sg", "text": ["My new favorite place in Wetumpka!\n\nWe visited on a Saturday and were seated immediately. We ordered pork dumplings as an appetizer, which was very...", "We dined here on a Saturday for lunch. The prices were reasonable and the service was standard. We started with the cheese wontons. They were so warm and...", "Very good sushi and extremely polite employees. Sushi is a tad pricey but the quality was worth it."], "rating": [5, 3, 5], "TBscore": [0.0, 0.27, 0.36], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["lunch"], ["sushi"]]}
{"id": "NE5SbqxfD1mArtSDWC0FhQ", "text": ["Zero STARS!!!!  Horrible customer service, obvious language barrier with most employees at this location. The employees seem miserable and frustrated. We...", "If I could, zero stars is higher praise than several employees at this location deserve. The food isn't bad quality. Subway does fresh very well. \nI love...", "Standard Subway set up with the same expected quality. The one bright spot was the tomato slices. Extremely fresh and flavorful. I'm a little bummed out..."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "55lW0zMj-wSzkRyTU9BHyw", "text": ["I love the Club Lulu, that sandwich is always a hit with me. However, the customer service usually is not the best. I sometimes feel like I'm bothering...", "First time I've ever walked out of a Jimmy Johns.... I kinda got used to the \"Freaky Fast \" .... Montgomery Alabama..... this location is freaky slow! It's...", "Went there in the evening after a class, there were 3 staff members who looked bothered when I entered. This was my first time entering Jimmy Johns, so..."], "rating": [2, 1, 1], "TBscore": [0.54, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [["sandwich"], [], []]}
{"id": "U5dvVfjpIM5zhjM6RA2RUg", "text": ["Awesome lunch, Arby's really stepped up their game! Nice clean interior and friendly server brought our food out even  the mozzarella sticks and gyros are...", "My order was so wrong.  And my fry container was half empty with just curly crumbs not fries.  I'm not happy about this. No one answered the phone", "Husband asked for a fish flatbread. Twice. Gave us a sandwich anyway. Ordered applesauce with my kids' meal. No applesauce. This is not a reflection upon..."], "rating": [5, 1, 2], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["lunch"], [], ["sandwich"]]}
{"id": "UFQtXojvTlHyf7Er5-PlTQ", "text": ["This place is a hidden gem in Montgomery. Spring rolls are great and pho is legit. I challenge you to venture off the menu.  The pork and shrimp vermicelli...", "Great thai iced tea, decent pho, and fresh summer rolls with peanut sauce. \nVery clean restaurant, lots of tvs with sports, super friendly staff.\nDespite...", "The seafood pho was too sweet for my taste buds but our visit to this pho joint made our tummies happy. We've been on the road for a few days and wanted..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "Tk0QY_vOKYapW8Sc5V3-aw", "text": ["Great service and great staff. One of the best WH's I've been to. Our group revived our order quickly and correct. Waitress kept our drinks fresh during our...", "I've tried to get my husband to eat at Waffle House around these parts and he won't go with me so I decided to take advantage of traveling solo.  The...", "This was one of the WORST Waffle Houses I've ever been to and I've been to a ton of Waffle Houses. The sad part is that I had been craving Waffle House for..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, -0.75], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["waffle"], ["waffle"]]}
{"id": "tB3Jn23q1Yi-zOHqoWnfYQ", "text": ["Stopped here after a fun night at the casino, because it was the only place that was open. Very cheap prices and food is average.", "$12 for eggs that was half raw, undercooked hash browns and a gray lump of something they called meat. Service was so so but in their defense, the place was...", "Best Waffle House in all of the Montgomery/Prattville area.\n\nWaffle house is pretty much the same every where you go.  What makes a difference, are the..."], "rating": [3, 1, 5], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [[], ["egg"], ["waffle"]]}
{"id": "t6XnL76iDFasigwvS3x9qg", "text": ["I like the food at Huddle House but I think some of the people there are racist. I am Puerto Rican, and there isn't many if not no Puerto Ricans in Alabama....", "I never had a problem with this place I love coming here and sit down and have a smoke and a nice cup of coffee", "If I could give 0 stars I would. I've tried this place a couple of times and I won't be back again. This is the most unprofessional establishment I have..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "UghUd7iac0N6W4ZEG53Q9g", "text": ["My husband and I stopped by here for lunch. This is the kind of place where you can come have lunch by yourself (kind of like a diner bar setup) or with a...", "So after months of hearing about Peyton's Place on the radio I finally got an opportunity to give them their shot... Mediocrity.\n\nSweet Tea:  I asked to...", "The place was very crowded during lunch during the week.  Not sure if they were short  staffed but the service was on the slow side.  The food was cold when..."], "rating": [4, 2, 2], "TBscore": [0.6, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [["lunch", "bar"], [], ["lunch"]]}
{"id": "8QmrWtcfJfnDZtZ9XSsVCg", "text": ["If you are hosting any type of luncheon, dinner, wedding or event in the Montgomery area I cannot recommend Jennie Weller and her catering company enough! I...", "Jennie, Melissa and their wonderful group catered the bridal luncheon, rehearsal dinner, \"day of\" brunch and reception for my daughter's wedding this past...", "Jennie catered our wedding reception at the Young House in Montgomery and the people raved about the food.  Everything was fantastic!  For the reception, we..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["dinner"], ["dinner", "brunch"], []]}
{"id": "A8inwWp_l55P0Gue_AI9eQ", "text": ["Food was good but we ordered carry out and there was no silverware,no salt, no condiments for grilled chicken sandwich, and bella chicken dinner , no...", "Had lunch here a couple days ago. Food and service were great. Restaurant was clean. We were there right after 12:00 and only few people eating at that...", "I'll start this off by saying I never mind dining alone...it is such a nice break from my normal family of 5 dining when I'm home. I was traveling solo and..."], "rating": [3, 4, 2], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [0.2, 0.6, -0.2], "keywords": [["sandwich", "chicken", "dinner"], ["lunch"], []]}
{"id": "eDHCUSUuXboMVNJHvX6XDw", "text": ["Always a great place to bring my children. Food is consistent and staff is always on top of their game.", "We're fans of Steak 'n Shake, and always hit them when we're on road trips going south. They offer drive-thru, pickup, or sit-down burgers, fries, and...", "The food here is decent (as long as you accept you are getting fast food diner fare) and incredibly cheap and the staff have always been friendly and..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], ["burger", "steak"], []]}
{"id": "tJfhy3jewC2bH4fOdqVq9Q", "text": ["Super impressed with this fast food chain. \nThe food was extremely fresh, who doesn't love crinkle fries? Only monsters, thats who.  A dipping sauce...", "Good service and Tasty food. Much better than Steak & Shake.\n\nWe enjoyed a stand up combination to go take out family dinner.", "This restaurant was surprisingly delicious. I almost did not go in after reading some bad Yelp reviews. I'm glad I took a chance on Milo's! Their burgers..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.57, 0.31], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], ["dinner", "steak"], ["burger"]]}
{"id": "-LpzJUzEMfnfZtkVY-Y9xA", "text": ["Disgusting! After fifteen minutes waiting for two biscuits, (no hash browns or drinks ordered), I received two biscuits covered in grease with no napkins....", "If you like mayo burgers and fries cooked in old oil this the place for you! I see why the parking lot was empty..... The Dr Pepper receives 5 stars..", "Every once in a while I go to fast food. The moment we walked in I noticed the staff was not friendly. The tea was out and I told them....they did not..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["burger"], []]}
{"id": "6svJ9ZcxmPNRI3Jev_eWKw", "text": ["Highly recommend - some of the best donuts I've had and the price couldn't be beat. I typically judge a donut shop by its basic glaze and let me tell you,...", "We were driving from Montgomery to Atlanta and needed a little morning roadtrip fuel! Found This place on Yelp - surprised it was the only local donut...", "Delicious Donuts!!!   It's important to note that this is a cash only establishment and the hours are 0500-1200 daily, except Sunday is 0600-1200. They have..."], "rating": [5, 5, 4], "TBscore": [0.25, 0.0, 0.35], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["donut"], ["donut"], ["donut"]]}
{"id": "bVKHq6OVplfspP99MktVbw", "text": ["Had the worst customer service experience here. The cashier(owner's daughter) was on the phone pretty much the whole time i was there. She would not even...", "This donut shop is one of the best. \nBest bet is get their early or they will be out.", "Really good (glazed were awesome) great price too! I like discovering local owned doughnuts shops. Follow me on Instagram www.instagram.com/papabearuf"], "rating": [1, 5, 5], "TBscore": [0.0, 0.7, 0.68], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], ["donut"], ["donut"]]}
{"id": "yzb4Azc2ULgFbsj13ZUvQA", "text": ["Update: Don't depend on speedy service on the weekend.  Only two people in front.  Young lady at front was OK but seemed distracted.  Young(er) male at...", "‍: pretty much how I feel about Dunkin. I dont understand why people like it. The iced coffee might as well be melted Icecream over ice. The lattes also...", "Stopped in on our road trip from alabama to tennessee to Boston. .. awesome service. .super friendly..Jeff manager was so helpful in giving us info on area...."], "rating": [2, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "BpTCqH7G5lMrH3cdVTGHHw", "text": ["Apple fritters are A1.  Some of the best I've had.  Other donuts are sooooo good.  Would recommend to anybody. Take cash, they don't take credit cards,...", "Far better than Krispy Kreme! A great small Business that caters to there customers. The only negative is there hours I wish they stayed open longer but the...", "These doughnuts are AMAZING! They are so soft and delicious! They run out pretty quick. Usually around 11, you don't have much of a variety. In other words,..."], "rating": [5, 4, 5], "TBscore": [0.53, 0.0, 0.28], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["donut"], [], ["donut"]]}
{"id": "uOOCYpaiOv2sO1EbxJqwuA", "text": ["Never had a problem coming here in the morning for breakfast and a coffee. Food comes out hot and tasted pretty good", "I've always had outstanding service at this location. The staff is lightning quick at the counter. The store always appears to be really clean and orderly.", "Still doesn't beat that hot ready now sign, but shows Wetumpka is growing! Lol. Great iced Coffee options."], "rating": [4, 5, 4], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["breakfast"], [], []]}
{"id": "Bzh-GClZo4nNE_cwyualIQ", "text": ["If I was judging this place based purely on the rolls and potato soup it would get 5 stars, it's amazing. However, the rest of the items on the menu are...", "This O'Charley's location is consistently slow with service.  All the servers I've had are friendly, I think they each cover a lot of tables.  Maybe the...", "Another night on the road another stop at O'Charley's. Lawella, Cheryl, and Alison were all incredibly friendly and gave amazing service despite the fact we..."], "rating": [3, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "jj026SvhafxRf8Q8nrn87w", "text": ["Order Steak out to go, it had been a long time since we had this treat because we had moved out of State. We were really looking forward to those steak...", "Disappointment doesn't do this travesty justice. My brother and I are in town for business and staying at a local hotel in Hope Hull just south of...", "I can't even give this place one star! We ordered for lunch , the only thing that was in the plate was vegetables! No chicken or bread! So we called for the..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["steak"], [], ["lunch", "chicken"]]}
{"id": "J2qmo-5eyxIvD6Bu_BseyQ", "text": ["My family and I absolutely love Cow A Bun Go. We order it once a week without fail. The sirloin tips are favorite but also enjoy many other items on the...", "Grilled Chicken Chef Salad $8.50... \nDiced Grilled Chicken, Lettuce, Cheese, 2 slices or  actually 2 quarter sections of a quarter Tomato, & 3 slices of...", "My family and I were craving steaks one Saturday so we decided to call Cow A Bun Go because by the time we would have gone to the store and prepared..."], "rating": [5, 3, 5], "TBscore": [0.0, -0.4, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["chicken"], ["steak"]]}
{"id": "YrqaW60JfH7F85iIcewt3A", "text": ["Papa Johns in Greenville Alabama is absolutely disgusting.  Ordered pizza and found hairs protruding from it. On another ocassion I opened a box and a fly...", "We ordered a pizza around 10pm, they called and advised to say they would be late.... Courteous. But now it's past 11pm, they took the pizza money and we...", "Was traveling through town and ordered for my lunch meeting.  Wow! Great pizza and service. Paul, the manager, made sure that our order was delivered on..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.48], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [["pizza"], ["pizza"], ["lunch", "pizza"]]}
{"id": "3OnpavB8yjsfPZE8HzJc8Q", "text": ["Been there a few times. They haven't messed up my order yet. Saw a delivery driver do a drug deal in the parking lot, that was fun. They tried to play it...", "I placed an online order for 2 pizzas and stuffed cheesy bread to be delivered around 8pm on a Saturday night. My estimated delivery time was between 23-33...", "This Domino's was rude when I called to order a pizza and I was on hold for a total of 30 minutes before they even took my order. The woman told me it would..."], "rating": [4, 1, 1], "TBscore": [0.0, -0.5, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "bkLPCYF0lK6vIoroBdt3lw", "text": ["I was tasked to plan an event for my entire class of more than 200 cadets and was given about 24 hours. I called Domino's and asked if they could help me...", "Four stars for service. This place had my back, they pumped out quality pizzas quickly. Definitely helped me during my time at Maxwell staying in lodging....", "Great convenient location if you're staying at the AF Inn on base. They are fast and polite, you get exactly what you order."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["pizza"], []]}
{"id": "xgk4i5-FmVYM_6qJjs2W6Q", "text": ["DONT GO HERE! Saturday night and didn't feel like cooking. Walked in, everything seemed ok. Until...the same girl handling the cash went to the back to prep...", "Internet and door said they closed at 10. My fiancé showed up at 9:40. They had turned off the open sign, lobby lights and had the rugs rolled up and laying...", "In the last couple of months, I've called ahead twice and ordered several pizzas for Wednesday night suppers at church. Both times, the person taking the..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], [], ["pizza"]]}
{"id": "LEXCDPxP6kN3Z6V3UryjcA", "text": ["This baby casino is very nice. I prefer to bring my kid during the weekday as an after school treat. Then there won't be too many people in there, mainly...", "It's the place where a kid could be a kid, but no one ever mentioned the fact that adults CAN enjoy it here. \n\nMy nephew and I had a date night. His choice...", "The facility is really clean (it should be, it just opened...LOL). The staff is really sweet to help us mommy's keep things together. One even played..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "OyOe8x1O1vPQUPImHy6CkQ", "text": ["Marco's Pizza (to me) is a step above Dominos & Papa Johns, but below SaZas Pizza and Mellow Mushroom. But they deliver, so that's why they got my business...", "So, things have gone down hill at the Marco's location.  This time, they lost my order, then they lost it again. Finally, they gave me an uncooked pizza.  I...", "Been here multiple times. Went to school nearby. Consistently completely unprepared for lunch rush. Never enough food in buffett. People constantly have to..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [["pizza"], ["pizza"], ["lunch"]]}
{"id": "ySspOJZmgTzNngdbmw6GqA", "text": ["I think this Domino's store is at the top of their game. I was a carry out customer. My order was very promptly delivered, exactly the way I ordered it. Its...", "The pizza is good and the delivery time is good. The only problem is the ownership. The complaints department is the people managing the place and that's...", "I use this location at least 4-6 times a month and it's always super fast and correct.The app on my phone makes ordering almost too easy.The pizza isn't the..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.47, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "YZ6AuGyGd2fj4y2gW9421g", "text": ["Had a pizza delivered. Paid $20.00 w/tip. Pizza was cold. This is unacceptable. Won't be ordering from them anymore", "The only reason i have it at 1 star is because the refund was given with a polite response that included an apology.20min wait for a 10 pice Cinnabon.", "Pizza Hut is pretty good. You can get 2 or more pizzas for $5 each if they only have 1 topping. The tables are sticky but if you do the survey on your..."], "rating": [2, 1, 3], "TBscore": [-0.6, 0.0, 0.36], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "hV6StR4GkXq2Nhq7uuNAOg", "text": ["Dough was slightly undercook, big no no.\n\nGood number of mushrooms but maybe not the freshest. \n\nVery few jalapeños added - maybe one per slice. \n\nEven less...", "Just called to order a pizza @ 845 told me everything was closed ... and I asked if they closed at 9? She said yes and when I looked online it said 10...", "Be careful if you attempt on line orders.  Been screwed twice by this location and they are uncaring about any problems.   They can't dial out of their..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], ["pizza"], []]}
{"id": "28LIAd2clob_B3WFImBLrg", "text": ["This is by far the best Starbucks I've been to, the staff is supper friendly, and a young man that goes by the name Tanner is a very busy (always running...", "Always fast and courteous, the Starbucks at Eastchase is my favorite Starbucks to frequent. They always have a large variety of baked good, Sweets, and...", "At Starbucks at 3:59 and get told they are out of white chocolate mochas the most basic drink... and have to sit and wait for a huge van since I can't go..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "OFX0IhDGPCvNVKimxtB47Q", "text": ["Omg..good to the last bite. Amazing food. Never had turnip green casserole but oh so yummy! Definitely coming back.", "Met a long time friend for dinner here upon his request. No regrets! The restaurant is clean, well decorated, service is friendly and the food is Superb!!...", "On our last full day of a week at a cabin at Lake Martin, we rolled south to Tallassee to have lunch at the 1220 Café.  The place is larger than it looks..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["dinner"], ["lunch"]]}
{"id": "cWAUPcHJ4W548NYMlWBlbA", "text": ["So, full disclosure, I don't drink coffee, ever! That being said this is probably the third Starbucks I've ever been in. This is a small location that is...", "Terrible attitudes of the employees and y'all need to have a sign of items that are unavailable instead of having someone standing in line for 30+minutes...", "They were very polite and were  helpful and shit.I want to buy all kinds of cool shit in there"], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "BO_wzIO_9tMCo4sfyfqCpg", "text": ["Went through the drive through.  So turning off the HWY into their parking lot is a little bit of a pain.  Ordering was not an issue. My food was given to...", "I had a taste for Taco Bell and I hadn't been in awhile so I decided to swing pass the drive thru. I get home and realize that there was barely anything...", "Pretty good food. Conveniently placed next to firestone so if your getting your car serviced you can eat without using your car. This location was good to..."], "rating": [2, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, 0.6], "keywords": [[], [], []]}
{"id": "Iqs4QFzGLWcRrf8O3HK-OQ", "text": ["I've been to a lot of taco bells.  This one was just the same.  \n\nFood tasted as expected.  5 star for consistency.  This isn't a 5 star restaurant for...", "I don't eat often at Taco Bell but decided to try their breakfast meals. Driving up, the first thing I noticed was the door of been broken out replaced with...", "I ordered over 150 items(various tacos and burritos). They packaged everything up nicely in boxes and made it easy for me to pick up. They even helped me..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.52], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["breakfast"], ["tacos"]]}
{"id": "jwVe-0b0LO0tVto-YVd5jQ", "text": ["Ate here today inside at 11:00 am, waited about 10 minutes for food. Ordered Nacho fries supreme, got regular nacho fries . Had to have order remade for...", "My fiancé and I went through the drive thru. We ordered two number 12's. The lady rung it up as two 7's. We did not catch the mistake. After he paid I...", "Updated: June 2015-\n\nMy how time can change a review!\nSince the original post, this location has made a complete 180!\nThey've consistently had our order..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "v1p_9IHtnogFDjKPcTn9xQ", "text": ["The staff decided that \"we don't serve coffee except in the morning.\" Which I know was nonsense. They just didn't want to make fresh coffee. \nThis Taco Bell...", "Food was what I expected for eating at Taco Bell. Staff was friendly, service was fast, went through the drive thru so I cant comment on the status of the...", "Great food made to look just like the advertisements.  Most places make food any kind of way with no pride at all.  Good job goes out to the cooks and manager"], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "t_N6AZKO5UCMWKrzvpoJqg", "text": ["It's a hole in the wall, the food is served in Styrofoam containers with plastic forks and knives, but the people are friendly and the food is hot. I...", "3 letters... OMG! His food is to die for & the hospitality is A+. Salmon is my favorite, but all his food is on point!  Had been seeing the commercials and...", "Long wait, poor service, bland food. But it's cheap and you get large meal. Cash Only"], "rating": [3, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, -0.2], "keywords": [[], [], []]}
{"id": "4QoA7Qgfnhdx6qmuaOUgsg", "text": ["Lunch was delicious and the service was excellent. The Mac and cheese, mmmm! The scalloped potatoes were awesome, also. The chicken and dumplings were good....", "Poor service. It should not take over 30 minutes to take someone's order especially when they are on a tight lunch schedule. We were never acknowledged. The...", "Looking for a great hot breakfast? The country breakfast with bacon hit the spot. The bacon is cooked to crisp perfection. Coffee is served in oversized..."], "rating": [5, 1, 5], "TBscore": [0.62, 0.0, 0.43], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["lunch", "chicken"], ["lunch"], ["breakfast"]]}
{"id": "UOcjux4CEth5OO414sVHUQ", "text": ["Staff is extremely friendly! Great southern home style cooking. Excellent fried chicken. Cafeteria style dining, worth the stop. Food is cooked fresh. You...", "Great southern cooking. Southern meat and 4. Richard the owner is friendly and full of southern hospitality. Prices are very reasonable. My only complaint...", "Best country cooking you could ask for! Great fried chicken green been and cabbage. Their corn salad recipe is in Southern Living Magazine! Met Mr. Robert..."], "rating": [5, 5, 5], "TBscore": [0.32, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken"], [], ["chicken", "corn"]]}
{"id": "s2uIZz572lvzeeaT40xm5g", "text": ["Yum!!! Friday night and good German food, just doesn't get any better. Friday nights are when they serve a German all you can eat buffet. The other nights...", "Love this place! Brunch buffet has unique combinations and the atmosphere is nice and down home. I have heard great things about the German Food also.", "Best food in the area.  If you like southern food it doesn't get any better than the Plantation House. Large selection of salad and side dishes. Great..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.37, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["brunch"], []]}
{"id": "_IFMm0lOen4b--mgbav5WA", "text": ["This was tough review to do. I actually love Panera. And I've been to this one a few times. But I don't love this particular Panera Bread location that...", "Once again after trips to doctor office, nice to be able to sit down and enjoy brunch... the customer service was great,  my hot chocolate was a must need...", "Who runs out of cream cheese at 9am? \nWhy is service so painfully slow ? \nAnd what kind of nasty drinks are being made ? Retrain the employees please."], "rating": [2, 5, 1], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [-0.2, 1.0, -0.6], "keywords": [[], ["brunch"], []]}
{"id": "q3bz09PPPcH8g5AYsK5Npw", "text": ["This place gets the job done if you don't feel like leaving the hotel. Service was friendly and only slightly slow. But the food was good. I tried the...", "Waited over an hour for food. Slow service. Good music though.", "Stayed at the hotel for one night. Dinner in the restaurant with a group of friends. Service was good, food was average. Generous portion of salmon, OK..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [[], [], ["dinner"]]}
{"id": "6qElAC-Jfk8yBmBSAi3KIw", "text": ["This place is like a beach in the middle of an urban area---The fish  had an Island taste, and the place is even decorated like the beach.\n\nNow for the food...", "First time eating here. \n\nNot impressed at all. Some good/some bad. \n\nFood was over fried. Catfish tasted dirty and no seasoning on fried coating. Oysters...", "I didn't have high expectations coming here, but leaving I was impressed.  The food was delicious!  I had the Mahi Mahi tacos with okra.  Both were amazing...."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.69], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], ["tacos"]]}
{"id": "uK1gK-h_69lD5P_Xt9TDag", "text": ["I would give no stars if allowed. My hubby grabbed the crab claw meal and the shrimp dinner it cost us almost 37.00 and I feel robbed. I have never seen...", "First time eating here today. Good food and plenty of it. I like that you order at the cashier and when you finish eating you leave. No waiting on the...", "First time at the new location, looks nice, colors and decorations are appropriate. The music is very festive with the Mardi Gras theme, but can be..."], "rating": [1, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 0.6], "keywords": [["dinner"], [], []]}
{"id": "oUdM5IgNPYfawU_usW1pJg", "text": ["This was a fun stop for my kid to grab a light treat! Lots of flavors, very tasty, and in a cool part of town. \n\nI think the only thing that could improve...", "Very delicious popsicles! About $3.50 a piece. We had the avocado lime, zesty orange, and the key lime pie. Oh my goodness! All three were remarkably...", "Yum. I had avocado lime and it was excellent. My family had other flavors and enjoyed theirs as well. There were three in my group and about 6 in the group..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "wLG52rpcwz77zL1N1wlt3Q", "text": ["Been here several times, I stopped coming for a bit because I was getting tired of the old flavors. So, I'm really happy they have some new flavors. I...", "I stopped here for a quick smoothie and when I say quick I mean quick.  The girl behind the calendar was hustling to get things done.  Her hustle to get her...", "Love smoothie king everytime I have the pineapple surf it gets better and better! The small is $5 but it's worth it . I once had a smoothie with Greek..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "icUe3khQKaVoEP44ltu47A", "text": ["The store interior looks a bit like a second-hand flea market but I didn't come here for tchotchkes or souvenirs.  I was on a 1,300-mile road trip and...", "Very nice shop. Located across the street from the Old Alabama Town playground. This is my first time inside the physical store, I've had gift baskets from...", "Cute little southern gift shop located near Old Alabama Town.   Lots of creativity surrounding pecans--a lot of it involving chocolate.  I am not a fan of..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "_ScIYUttwdDSENEU7iKYig", "text": ["I ordered  a bacon egg and cheese McGriddle but discovered when i got to work I was given sausage instead.  I don't eat sausage and this after I get...", "Worst store ever. Not from around here & will NEVER go back. So much for \"southern hospitality\". Rude people. Horrible customer service. Dirty floors &...", "Waiting for the rest of our caravan to catch up on the way to the beach. Service was fast and even given that it's a McD's they made no qualms about our 7..."], "rating": [1, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [["egg"], [], []]}
{"id": "vbj-RVuv2pn-AVxCSHnaxQ", "text": ["Popular spot at 8pm...kinda late for dinner guys! Small dining area, don't expect to seat a big group or even a medium sized group here. Drive thru was...", "Sat in drive thru with no assistance for a few minutes even asked if someone was there. Extremely rude you could at least say one moment please or put a...", "#1 does not mean McChicken Value meal!!!  #1 is Big Mac Meal!!!"], "rating": [3, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [["dinner"], [], []]}
{"id": "QuFECskI-BWU2mxJxSmeIg", "text": ["I don't know why I went here last night.  Every time I go through the drive thru my order is wrong.  Usually I get no napkins.  Last night when I got home...", "If you like fast food that has a slow drive through and gives inaccurate orders then this is your spot.  Only come here if you are desperate for a snack.", "Terrible service and terrible people,threw coke at us and coke everywhere,won't ever come here again,lady just looked at up as were trying to clean it like..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["snack"], []]}
{"id": "qmy4FQUnmZXb9ywTFYam0A", "text": ["I understand that this is a McDonald's and the food is pretty much uniformed from one location to another, so my review is mostly to give credit for...", "Keep driving!  There are other options. This McDonalds had no ice cream, no soap and cold fries.  I know it's Interstate fast food, but come on.", "The store driveway allows for people to cut around the others and the people driving will pull around you and cut in line. They are slow in the drive through."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "0ZOdx3Mi1SBNctSdRhjlLg", "text": ["Beggars can't be choosers and this airport is tiny so be thankful that MM is there so that you can get a little something before you board. This is no...", "Oh by the way...this is inside the airline terminal.\nHay...you must have a boarding pass and therefore an airline ticket here...to even get to this place....", "I ordered a 12 oz double latte, and it didn't taste like there was any coffee in my coffee. It tasted like milk with syrup in it. :-/ I wanted to like it,..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "N4fx_jjNnuS1SHoZ0y9lVw", "text": ["Fix your fucking ice cream machine, it's always broke! \nLame. \nThis goes to every McDonald's from sea to shining sea.", "Awful service, terrible customer service, restaurant cooking area was dirty. I was hungry and had no choice  The owner should consider a secret shopper. I...", "This is a standard McD's, just a little slower and a little less clean. It's does have a play area, which my kids enjoy. There's typically at least one..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "taICHf-0vkj-VBF2t897oQ", "text": ["Unequivocally, the dirtiest (chain) restaurant I've ever been in. While the employees are friendly and courteous. somebody needs to assign clean up duty to...", "To All this May concern: This Mcdonald's is so unprofessional and disrespectful! Not only to customers but first and foremost to themselves! I am so...", "This McD's is DIRTY and service is pathetic. Keep driving! If you have to eat here, use the drive thru because if you go inside you are likely to lose your..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "tqmJ4kc1IGjd6goULmrilQ", "text": ["McDonald's at this location has changed completely, the staff there are more nicer and the service was better than before the renovations. I recommend...", "Have been waiting for probably 10 Minutes and a lot of people were standing around. On top of that, they messed up our order! \n\nUpdate: There was plastic on...", "If McDonald's wants to know why their stock sucks and they aren't on top anymore,I've figured it out. It's the staff they keep and the way hey allow them to..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "aZcBER22Lbr8NpDPvyWpMg", "text": ["Service isn't great and the 2 drive thru line idea was a failure. The French fries are the only thing worth eating from this trash hole", "I pulled up in drive thru at 12:35 pm. It is now 1:10 pm and I'm still in line. I came thru lane 1 and sat at speaker for 10 minutes waiting to order and...", "Evening visit (no rush).  Disgusting on the cleanliness scale. Floors were slippery with greasy residue, even in the bathroom.  Even as we walked in, we..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "DHTRjWad03_6FRjBbKPy0A", "text": ["Worst service in the area. Waited on the drive thru for 25 minutes.... paid and then get to the pick up window and get told the shake machine is broken....", "The last 4 times I have brought my children in to eat. The kitchen staff and upfront staff yelling and talking so loud it was not a great experience. Some...", "I pulled up to order it took them forever to come to the speaker box so I finally ordered pulled up paid they gave me my orange juice & told me to pull up I..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "8C5iRRUkvbGzYW04PYQHOw", "text": ["No one taking breakfast orders for first five minutes, wait another five to take order. Lady who took my order managed to do do with out saying one word. No...", "This has got to be the worst mc Donald's ever crappy service I have never seen someone so rude n smart mouthed working at a drive thru coming here takes...", "For a fast food restaurant its good. When you are traveling its the best place to stop at."], "rating": [1, 1, 4], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [["breakfast"], [], []]}
{"id": "QeiUkOrg5Qk9fwHQxAw0Vg", "text": ["@$#%¥£McDonalds!! Absolutely indescribably horrible!!!!! Talk about a staff with bad $%#! ATTITUDE! First the cashier is looking at me like I'm an alien...", "Stopped at this McDonald's while travelling. Ordered a cheeseburger with no bun. Ot took for ever! When I opened my food the meat wasn't even warm and the...", "Typical McDonalds, what else is there to know.  I found the service to be adequate in terms of employee kindness and order preparation time."], "rating": [1, 1, 4], "TBscore": [0.0, 0.6, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], ["burger"], []]}
{"id": "JJw0cjW-cCVDORhFT3l5Yg", "text": ["This is a quiet-chill bar within walking distance of a few of the best restaurants in the Gump.  I like to hit the Pine Bar before dinner at A&P or Vintage...", "I was visiting Montgomery and met some friends at Pine Bar. It was a Wednesday night and maybe 10 people there. \n\nThey have a nice outside patio with market...", "A beer and a martini for $19? Not a sports bar. Definitely not a bar I would go to just because it's close. The place is a super sausage fest. I guess if..."], "rating": [4, 5, 2], "TBscore": [0.4, 0.3, 0.0], "normalisedRating": [0.6, 1.0, -0.2], "keywords": [["dinner", "bar"], ["bar"], ["bar"]]}
{"id": "jqVAHTdo7T9BuFsCTvy7Xg", "text": ["A safe space to chill out, have a nice drink and fellowship. Always my first choice when I want a bold drink. MGMT is friendly, bartenders are the best in...", "Great service, art display, music, beer selection, indoor/outdoor seating areas... all around good vibe. Staff is friendly and attentive also.", "Mgmt discriminates against disabled citizens with service animals by not allowing them to be served inside, mgmt verbally assaults when being informed about..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "CQgRkIAhYIepY3tbycBXyA", "text": ["So- PSA\nI do NOT recommend Alley Bar in Montgomery.  Used to be a good spot-\nNow it has horrible (and rude) ownership with service that reflects this,...", "Not a bad bar area in downtown. Drinks are bit pricey but it is what it is. Music is not too bad but can be better.", "This bar is NOT OPEN. Says open til 2am. LIES!!!! We are here from out of town and rely on accuracy. Someone should correct this issue"], "rating": [1, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "oNoJntAkJBLlc_l08ECvTw", "text": ["Awesome little spot for Happy Hour after a hard days work.  I meet up with friends for drinks after work and Im glad I took the time to stop by this spot...", "I am happy to post another 5-star review for this place! Great job guys!\n\nGood: Very friendly staff. Family owned for 20+ years. Lots of TVs. Very long bar...", "If you are not a local....do not waste your time stopping....we have been traveling cross country and stopped at many establishments..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.62, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["bar"], []]}
{"id": "DBHL-3k3RoH864oEVB7iFg", "text": ["This is a great concept it just needs to be where the fly boys are!  I like the vibe .... there is no reason for girls to come here bless you want to meet...", "Decor excellent. Selection excellent plastic cups not excellent \nI am an adult I would like a big boy glass please \n\nI really like the bar I recommend a visit", "Straight dishonest bartender tried to overcharge me for a drink  I was about to pay cash for. Instead paid with credit card to get a real receipt and it was..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], ["bar"], []]}
{"id": "4qT3ejax27dYUIIIautEcQ", "text": ["Not gonna lie, I thought Wet Willies was a South Beach thing until I saw it spring up on my yelp & I was like whaaaaa... It's the typical frozen drink...", "Great place to grab some frozen booze and wander around downtown.  This is a fun way to prime the pump for a great evening.", "Not all that... just saying.. anyone that says \"the liquor is already in it\" is ripping you off. This place is not worth it.  I had to order a shot of..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "evY_E7WBKtpkw-ERONwlkA", "text": ["I absolutely love this place. The people are so friendly  and the drinks are amazing... and cheap. The atmosphere is great. I'm def coming here again :)", "I was here on opening night and I have to tell you, the five at this place was so positive and so full of love that it's hard to explain. People are so...", "Came in during happy hour and Willie was so helpful and friendly. The music was relaxing and there were tv's to catch a game. The atmosphere was so chill..I..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "-8k8bPlVACBfPRiM4mBFsw", "text": ["Came out with a group on the Sunday before Labor Day.  We got there around 830 and there was a pool tournament going on.  Friendly staff and patrons that...", "If I could give it zero stars I would. Worst place I have ever been. If the managers/owners are out there, check your staff (mostly the bouncers). Don't let...", "I've been in here a few times before but tonight was the worst. Outside of the rules listed outside of the club, they often make up rules on the fly. The..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "N3m9jFCu_hOFzv0XMiFCCw", "text": ["Came in to grab a beer while waiting for the Christmas parade to start. Front entrance comes straight into the bar, back entrance comes in though the...", "Best craft beer around. Friendly, knowledgeable staff, no stress environment to unwind.", "I can't seem to stay away. I'm guessing that means it's a great place.  \n\nNo food!  Just beer. You can bring food in with you, or order it from next door if..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["bar"], [], []]}
{"id": "kkxPoXVGGxew8M7RCI0q2w", "text": ["I've eaten here multiple times and also done call ins during lunch hours. The owners and staff are always very courteous and friendly and the atmosphere is...", "I was mislead by the website , I asked if I can change my order ,  the manager ( I'm assuming that's who he was )  told me no they already then made the...", "Only giving 4 stars because I didn't try the food.  I was too stuffed on arrival. However, food looks soooo good and my family living in Montgomery  has..."], "rating": [5, 3, 4], "TBscore": [0.39, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["lunch"], [], []]}
{"id": "U5YxuHeG_7EyHfJHEHPiEw", "text": ["A Manhattan cocktail:\n\n2 ounces bourbon\n1/2 ounce sweet vermouth\n1/2 ounce dry vermouth\n2 dashes bitters\nMaraschino cherry\n\n\nIt was a simple request. I...", "The better half and I stopped in to have a quick cocktail before heading in from shopping. Obviously a place for locals. Bar tender seemed preoccupied with...", "Great place for craft cocktails! Nice atmosphere and will definitely be back next time we're in town!"], "rating": [1, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 1.0], "keywords": [[], ["bar"], []]}
{"id": "lTq4O8qI3beF6cFVIb-0Jg", "text": ["A little divey, but it's a pretty laid back place. Good place to kick back and have a group of friends or even a date. Sometimes Friday nights they'll have...", "Okay, so my friends and I walked in and the bartender was extremely unaccommodating and rude. He could have cared less about taking care of his customers....", "Visiting from out of town and this place sucks!! The music sounded like I was in an elevator and they didn't have ICE!!  The 6 of us were ready to spend..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "SoOUteJLfXA-OMq4KrV40g", "text": ["Fun little dive bar in the Old Cloverdale area of Montgomery. \n\nI like this little bar, its a go-to spot for me and my friends. Pool tables, modern touch...", "If I could give this place negative stars I would. Wednesday night I came in with a group of 6. I'm from out of town, hanging out with some family and...", "I've been there three times now and everytime I leave thinking why did I spend my money there. The bartender is rude.  I can't stand to give money to a..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["bar"], [], []]}
{"id": "ubVXsYm2X_A-mISDWaSCCA", "text": ["Sat down with my child, waited for 10 minutes for a server. The manager looked at me three times. Wife came in waited. Finally left. What a waste of time.", "I had an issue and went to talk to the manager about it. Honestly I was frustrated but Mr. Jones and MrEverett went above expected to help me. They are the...", "Horrible service at this restaurant!   Came in with only a party of six.  The service was very slow.  The manager said that they only had two servers but..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "KtwH_PAPGvvFBKY4LOVQmA", "text": ["We had the Pub Oysters. They're similar to Rockefeller. They were very good. Next we had the Cajun shrimp bowl. The shrimp were on the small side. It wasn't...", "Great food and friendly folks, if you bitch about smoking just realize it's the only place smokers can grab food and enjoy a cigarette in Prattville.. so...", "This place is awesome. Just plain entertaing.There's always a loud ass drunk at the bar, a complainer or someone who has no idea what they are in for...."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], ["bar"]]}
{"id": "TkfBvLc_PKjO6nwUo3QEVg", "text": ["With Maxwell's limited dining options on base, this is the only one that's conveniently within walking distance of SOS and OTS and ACSC....beside the club....", "They forgot the bacon on my bacon cheeseburger, so that says something. They also seem to not know the difference between sauté and grill. Anyways, the...", "Service is terribly slow. I am still waiting at the bar as I type this. I've been standing in front of the bar for 20 minutes waiting to order food and..."], "rating": [2, 2, 2], "TBscore": [0.0, 0.0, -0.3], "normalisedRating": [-0.2, -0.2, -0.2], "keywords": [[], ["burger"], ["bar"]]}
{"id": "-GNpHO3LcL28Tjth6CyWAw", "text": ["Great location. Good happy hour prices. Good music. Slow service. I ordered a Reuben which turned out to be the worst Reuben I have ever had; on the plus...", "Music marginal, service slow and forgetful. .. brought meal short my truffle fries. Explained that kitchen forgot and was now closed. Offered to make them...", "Pleasant atmosphere... But really slow service. Waitress kept apologizing for neglecting us (three times), but an apology only goes so far. BBQ was just..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "BrrhQ8ld8qrPG0El1j0ZIw", "text": ["I was very skeptical of this place. The pictures don't do it justice. Great seafood for a fair price, but not the best service.\n\nI was in town for the ASU...", "I am really struggling to give them 3 stars. The restaurant was clean, the staff was welcoming and friendly and we were seated immediately. The food took...", "After a couple of months, I finally made it to the Juicy Seafood restaurant. The restaurant is very spacious for a large group of people with a nice bar..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], [], ["bar"]]}
{"id": "BE-bRjMbwHgXCpZriQflSw", "text": ["Stuck in Montgomery due to Hurricane Michael. Saw this place on Yelp and decided to try it. Mapquest wasn't very helpful (it's in strip mall behind...", "Bomb orange chicken, a great portion for what I paid for. Nice and clean on the inside. A lot to offer on the menu. Food was fresh and hot. Definitely will...", "This is first time coming and the food is really good! I ordered orange chicken and a side of crab Rangoon. I wasn't sure how big the portions would be so I..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["chicken"], ["chicken"]]}
{"id": "0U9CNlVmsEPa-6O0RS6WCA", "text": ["I first came here five years ago and it gets better and better. Lots of variety...various Asian cuisine styles. Great value and excellent customer service....", "The best Chinese Food Restaurant in town + Best Customer services. Highly Recommend to anyone", "Frankly the worst Asian food I've ever had, and I've had some pretty bad stuff before. The people were nice, but the food was a mere cousin to what it was..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.54, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["chineese"], []]}
{"id": "DGX2O_UovoWgzWeCEt85nQ", "text": ["Great little neighborhood spot for quick Chinese takeout.  Everyone is friendly, the food is always amazing and the prices are just right especially the...", "Probably the best Chinese place I've been to in Montgomery. The lunch specials are great, and the service is always friendly. They can get busy, but the...", "The food was great and the lunch price is a steal. They also have coupons for free items with a certain dollar amount. You get lots of food for what you..."], "rating": [4, 4, 4], "TBscore": [0.28, 0.45, 0.47], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["chineese"], ["lunch", "chineese"], ["lunch"]]}
{"id": "NQeo4qi84JRO8ZnKeWi0Vg", "text": ["5 stars for the price. If you're looking for authentic or a nice Chinese place this isn't the place for you but it checks all the boxes for quick and easy...", "I walked in there and ordered just egg drop soup.It was busy but give me a break. Just put a big spoon in the pot and fill it up. I almost went back there...", "The price is great and the food is good.  I  have been ordering food from No. 1 China  several times a month  for over 6 years.  The shopping center is not..."], "rating": [5, 1, 4], "TBscore": [0.37, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["chineese"], ["egg"], []]}
{"id": "fNreELDdNkI-IPipIpTzeA", "text": ["Decent price for food quality. Not the best but definitely not the worst. I wouldn't make this my first choice but it's alright. The workers were really...", "Like other reviwers have noted, this place will do in a pinch instead of driving across town for better food. Delicious standards like rangoon and sesame...", "The food is delicious and the service is great! I love the shrimp and broccoli, and the sweet and sour chicken. Also the prices are very reasonable. It..."], "rating": [3, 2, 4], "TBscore": [0.0, 0.0, 0.34], "normalisedRating": [0.2, -0.2, 0.6], "keywords": [[], [], ["chicken"]]}
{"id": "J4Jdz9i9dMoRAcs4C-ZmnA", "text": ["The portion is super huge and it comes with a super cheap price as well! The taste? Well at least you can get full and with the price like that can't...", "I just don't know what I'm being served sometimes.  Chinese spaghetti?  Def not lo mein noodles.  Get fried rice people....no Chinese pasta.  Tried the...", "We eat here often but mostly because it's close to our home. One advantage is they have a drive through. Some things are lacking in the flavor category. I..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], ["pasta", "chineese"], []]}
{"id": "jhqimu5O81QQpv2PDoZ0oA", "text": ["I ordered wonton egg drop soup and both the egg and the meat (beef? Pork?) in the wonton were RAW! I spit it out and tried to finish a VEGETABLE spring...", "The egg roll was good. Everything else was absolute trash. It seems like they haven't even had Chinese food before. I ordered Shrimp fried rice and they...", "Same as so many small Chinese restaurants in Montgomery, passable.  They don't care about what they serve.  They are quick and convenient but don't expect much."], "rating": [1, 1, 2], "TBscore": [-0.29, 0.3, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [["beef", "egg"], ["chineese", "egg"], ["chineese"]]}
{"id": "xC83EIrTR4hCCTh3iW104g", "text": ["Great \"to Go\" Chinese food.  Limited seating in restaurant.  Great House Special Soup, Lo Mein is excellent and great egg rolls, etc.  \nGood deal for family...", "Quick even when you order inside. Food is excellent. Fresh. Reasonably priced. I just wish they offered a military discount. I'll definitely go back again....", "I was thrilled that this place was open on Christmas. The food was just ok in my opinion. I ordered my food extra spicy but to no avail. The garlic spicy..."], "rating": [4, 4, 3], "TBscore": [0.55, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["egg", "chineese"], [], []]}
{"id": "EoIoHXQvKxpTLRiRZZ2o-g", "text": ["I've been eating fried chicken wings for 10 years in this restaurant.it is always delicious.chicken wings are big", "38 years ago, my wife and I went to China Pavillion for our first date.  Back then, it was a real restaurant located on the Southern Bypass.  It had table...", "If you like everything covered in oil this is your place. Only redeeming quality is the veggies were crisp."], "rating": [5, 2, 2], "TBscore": [-0.3, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["wings", "chicken"], [], []]}
{"id": "rvZzRTCEnU2D3GD8GKakBw", "text": ["Just got food there and came straight home. Unfortunately, I called to let them know their fried rice was spoiled. I could smell it as soon as I opened my...", "This is good Chinese food. I order out from here all the time. One thing I always remember is the fact they've never gotten my order wrong. Not once! Years...", "I don't eat Chinese food, but this is the best place to go for your first time.  The mixed vegetables and gg rolls and dumplings was fantastic. Store was..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], ["chineese"], ["chineese"]]}
{"id": "kBLoyEid-CiGgBW3W-bbDg", "text": ["Soooo decided to checkout this Chinese restaurant because we haven't been to Millbrook yet and the ratings were high. The food was okay....it was neither...", "Wanted Chinese food - opted for here.  You get a whole lot of food for your money but it is not the best quality of Chinese food.  I have had a lot better....", "Owners were genuinely friendly. Great food and service.....will be my go to for Chinese cuisine. General Tso's chicken is tasty!"], "rating": [3, 3, 5], "TBscore": [0.0, 0.34, 0.0], "normalisedRating": [0.2, 0.2, 1.0], "keywords": [["chineese"], ["chineese"], ["chicken", "chineese"]]}
{"id": "0RGS0OKb92X7j9nJ_fZa_A", "text": ["We ordered delivery for a 3 nurses at a large hospital. It took almost 2 hours to get our food because the driver got lost. Then he started cursing about...", "Never been sick & always timely delivery. Delivery driver always brings me free tea, or tosses in free food.  The Mongolian Beef is not bad. The Walnut...", "My take out was horrible. The food was somewhat cooked(the meat felt smooth and creamy on the inside!) and all the sauce was at the bottom. The chicken was..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, -0.37], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [[], ["beef"], ["chicken"]]}
{"id": "fxutFkG4wFswQ9O9F-_4jA", "text": ["Great everything. Service is great. Great choices. Recommeded for the whole family. I am there at least a couple times a week.", "Great customer service and quick delivery on made-to-order items. Fresh ingredients with a 98 health score!!! Bonus: the egg rolls are frikkin amazing!!...", "The food on the buffet was good with a large variety. Also when you get take out there is a lot of food for the money."], "rating": [5, 5, 4], "TBscore": [0.0, 0.66, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["egg"], []]}
{"id": "ENRLHA3xXiUmSxP5zyEhWQ", "text": ["First of all service was worst...we ordered chicken fried rice and believe me, i can count the chicken pieces. It is plate full of rice...just rice. I blame...", "The food here is great. I feel bittersweet giving low review but they need to do something about the service. The only server that works is the old lady...", "My wife and I visited this place because it was the close to our home and we wanted Chinese Food. The place we normally went to was closed, so we checked..."], "rating": [1, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 1.0], "keywords": [["chicken"], [], ["chineese"]]}
{"id": "Qd7UlJcxpAOKcTlQNy45Kg", "text": ["This place was awful. I wasn't expecting much from food court Chinese food, but this went beyond simply mediocre. There were a handful of issues that turn a...", "Horrible service and very rude employees! Visited this past Sunday and was told they do not give samples after 1:00 p.m. Typically when you're ordering...", "I love this place and have loved it for years. The staff is always very friendly and efficient. I will drive all the way across town just to get their honey..."], "rating": [1, 1, 5], "TBscore": [-0.33, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [["chineese"], [], []]}
{"id": "x8LiAl0x9NGb19mNsCZU_w", "text": ["Clean restrooms, lack of toilet paper in female bath.\n   Good food on takeout. Had scallops and broccoli with fried rice-a quart, fried rice and a quart of...", "Overall China Garden hit the spot for my buffet craving. Staff was friendly, the place seemed well kept, and the food exhibited the expected flavors. I...", "We were in a hurry and needed a bite to eat real quick. I have been in this establishment before and was not real pleased with the cuisine but decided to..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "j2genX-KLK8YFCd_VJse6Q", "text": ["Wow - seriously a contender for THE WORST CHINESE RESTAURANT in the united states.  I had thought that it was an easy first place for that title, but that...", "The guy above me is right. I came in at 4:45, the only one there. The food was all very cold and very little at the bar. I tried a little bit of everything,...", "I could never in good conscious recommend this restaurant to anyone. I stopped by to pick up some General Tsao's Chicken but wish that I had kept driving...."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["chineese"], ["bar"], ["chicken"]]}
{"id": "-9acOa6L9X0_8QJXX2g4DA", "text": ["I've only had the chicken with mixed vegetables. That's my go to Chinese dish. It was great. Most places put too much ginger in the sauce and Panda hardly...", "A small restaurant but nice. I had their Chicken Broccoli lunch meal which was very tasty. The lunch came with Fried Rice, but it didn't taste like any...", "Been here several times for lunch.  Staff is attentive, works fast on you order to satisfy you.  I always get wings and fried rice and it's very good."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.38], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["chicken", "chineese"], ["lunch", "chicken"], ["lunch", "wings"]]}
{"id": "FZxmqvm8XbvJF2RgezDQQg", "text": ["Below average Chinese buffet. Food was okay but not great, like typical mall Chinese food.", "Awsome food, goog flavor top five buffet in my list. Will come back again and tell all my friends about it.", "Great buffet if really hungry or craving Chinese food. Meat lovers paradise. I really like choices..Never crowded. Cheap! Closed on Mondays."], "rating": [2, 5, 4], "TBscore": [0.0, 0.0, 0.27], "normalisedRating": [-0.2, 1.0, 0.6], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "zhAtSi-qKDuUpa_4jkATbQ", "text": ["I'm always skeptical when it comes to vegetarian pho - but this place was fantastic. A light and flavourful, slightly peppery broth with plenty of bean...", "OMFG can't wait to come back here.this pho is amazing-their veggie broth is fab so i know their meat stuff is great too. I got a vegan pho ga and husband...", "Pretty nice place. Went here just to get bubble tea/boba/tapioca.\nThe place was clean and so were the restrooms too."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "SQqQvb0BJlfYr03Wpvf5bA", "text": ["Walking in the door the first thing that hits me is that this place needs to be cleaned.  Rubbish on the floors and mystery stains on the walls.  The front...", "When I lived in Tallassee, I would eat take-out from here once or twice a month. I now live in Montgomery and I sincerely miss this place. Although it's...", "Good food, but limited selection. Ive only eaten the buffett, so to be fair i cannot speak of their carry out. The dining area is far from current, but it..."], "rating": [1, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "MVW14N5zW0lLF594tRT3Ug", "text": ["Only go here if you want to wait 30 minutes for your teriyaki chicken to cook, she only told me a few minutes... also got my wife's order wrong.... also...", "Typical Panda Express. We don't have these where I live and am excited to see one. Walked in and greeted by almost every employee which is nice to see at a...", "Just left the drive thru and as soon as I tried the food I was immensely disappointed. The chow mein was certainly not fresh, it was more than likely reused..."], "rating": [5, 3, 1], "TBscore": [-0.26, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["chicken"], [], []]}
{"id": "C7kOuZZS-HPsPiVb1fq35w", "text": ["This restaurant is very nice!!\nEspecially,  food is great!!\nLess MSG. Better than local restaurant\n\nI love this place so so so much.", "My favorite restaurant in Montgomery. \nBest bulgogi. If you want some spicy food, try pork bulgogi.", "I've eaten in most of these in MGM; this is the best.  A single native Korean lady prepares it all to order.  The only reason for 4 stars is the..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["korean"]]}
{"id": "7GcYkxOzTbI_erqD3XfKtw", "text": ["Great tasting and fresh options! Very friendly, open and prompt service! Loved the samosas to start. The Lucky Buddha beer was flavorful and light. The meal...", "Great food and great service. The lunch buffet was well stocked, hot and had a great variety of meat and vegetarian dishes. The servers and the manager went...", "The food was GREAT! It is a little pricey...rice and a lamb dish with water and no bread or sides $16"], "rating": [4, 5, 3], "TBscore": [0.0, 0.66, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "lETKSfxhYr69T885kfINxA", "text": ["When I am in the area, I always make sure to stop in at the Bombay grill!  Indian cuisine at its finest... ask for the Naan bread and butter. Mmmm mm good....", "I had such a nice meal the last time I ate here but I hate to report that was not the case with the to-go order we just got.  \n\nTo start, on the phone we...", "Good service, clean restaurant. Would come again. I enjoyed buffet and selection including chicken tikka masala. Husband had lamb tikka masala. The masala..."], "rating": [5, 2, 3], "TBscore": [0.66, 0.0, 0.24], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["indian"], [], ["chicken"]]}
{"id": "SBKoMmhKf2_aT5FYmJCrYw", "text": ["NEEDS TO ELEVATE THOSE INGREDIENTS AND  FLAVOR PROFILES!\n\nThis little place was very difficult to find and with our initial search it was under a different...", "Staff unconcerned about customer. Sat at the bar on cell phone nearly the whole time. The chips are paper thin, the salsa is tasteless. I was given two...", "85 food score. And each of the three times i came for lunch i was basically invisible. Had to get up to ask for a napkin this time, more drink before...."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], ["bar"], ["lunch"]]}
{"id": "x9wzLpcq5BikBA8Qf3dxBQ", "text": ["The food is delicious, service is great, margaritas are just as good. There was no wait and the servers were all very attentive. We will definitely be back...", "No! Don't spend a penny on this crap. It has the worst menu to see, there was fungi and roaches all over there. I had to leave , someone call the food...", "Delicious! I had the Burrito Supreme and my husband had the Jose's Burrito. Both were fantastic! I will admit though that within a couple hours we both..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "ywiZCz741HrYf1BVs0eqVQ", "text": ["Visited from San Antonio, Texas my family brought me here to eat. I loved it!! The salsa was awesome I loved it! We had great service! I had guacamole tacos...", "2.5 stars. \n\nWas looking for a place to eat with the family on Memorial Day and we decided to come here. We've been craving Mexican food lately, so why not?...", "Wow. Best Tex Mex in Montgomery! Fresh, hot chips (the kind with oil on them). Great queso. Combination fajitas were fantastic. GOING BACK SOON!\n\n\nCons: The..."], "rating": [5, 2, 4], "TBscore": [0.97, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["tacos"], ["mexican"], []]}
{"id": "ONqCLkFPt_FWro01DJZa5Q", "text": ["Great food, friendly service and the atmosphere is colorfully unique! We frequent this restaurant and recommend it to friends and family. Excellent for date...", "Great food with generous portions, excellent service and clean restaurant.   A place I will definitely go to frequently.", "Same owners as Las Casitas in Prattville. Same menu. Convenient if not looking to drive to Pville.  A couple of large parties slowed down service but good."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "Ns-YXY551m-8zH924i0prw", "text": ["Huh? Trying to think of a positive thing to say...  \n1.  Glass was so foggy that I could not see what I was buying (totally on me...!)\n2.  Not real sure why...", "This place was once really good. I purchased fish on ice  to fry at home that smelled foul when I opened the bag at home. It smelled rotten so I tossed in...", "Haven't had a bad experience every time I've been here. Food is fresh, decent prices and excellent customer service. I was skeptical initially but once I..."], "rating": [1, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "UW9nnY6VkXslNBQtrH6hBA", "text": ["Petty moment @ the manager or whom ever makes response to comments....\nI just viewed after visiting this establishment accolades and much thank you's were...", "I love their street style tacos with grilled jalapeños and cilantro. When I visit the area this is my favorite place for Mexican.", "Food is pretty decent here. \n\nI usually get the carnitas when I come. They are a little greasier than I like but they are very flavorful. The portion size..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.33, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["mexican", "tacos"], []]}
{"id": "D3CKwBt16ZVJdlV2rvBwsw", "text": ["Outstanding service! Food was great!! Friendly environment!\n\nI highly recommend if you're in the area!", "Excellent service, food fresh and hot. Fair prices. Always a good experience! Would recommend!", "I've always enjoyed the S. Burbank location, so I was happy to see a location open up in Pike Rd. The Pike Rd. location is nice and large. The food quality..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "1Ta4pHZOctHJ6HS5zts5hQ", "text": ["One of my favorite Mexican restaurants.\n\nI normally get the chicken quesadilla with rice and beans and of course queso dip with jalapeños. They never seem...", "Sooo...We've been here a few times and the food is always good and the drink specials are good, but we won't be back after last night. My wife found a hair...", "Great drink specials and good food. Chips and salsa are average. Thursday's during happy hour they have $0.99 lime margaritas which are very delicious and..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["mexican", "chicken"], [], []]}
{"id": "YnS2mT3Q-nHvC7ntEG4m3w", "text": ["2nd visit to this location since restaurant name change. Ordered a chicken quesadilla and Chile relleno to go. (Great lunch prices 2 items $5.50 + chips/...", "The shrimp and Shalott us here are outrageously good I must have we coming in here there's a lot of selections but that certainly when you need to try.", "Excellent Mexican food, great fast service, and also outdoor seating on a sheltered patio that accommodated our dogs on our road trip.  \n\nWait staff pointed..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["lunch", "chicken"], [], ["mexican"]]}
{"id": "2Zy8PyaIydWWDuHiCaIq0A", "text": ["Friendly staff, great service, good food. The drinks were larger than expected. Excellent portions, very generous. Queso and chips with the meal were very...", "I've eaten here ever since they opened and have they have never failed to be impressed with the service,food and price! 5 stars from me anytime of the week!...", "Great friendly staff. Great service. Good authentic Mexican dishes. Def a local haunt, which we love! Beers are cold and margaritas are huge! Get a visual..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.34], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["mexican"]]}
{"id": "9Wpq3POxR8nAsLOmQ5DSYQ", "text": ["Very fortunate to have authentic Mexican food here. \nI tried various burritos and especially enjoyed the sredded beef burrito.\nGood eating.", "Five stars by few .they must of never eatten any real good mexican food.this place El Patron in Slapout is about at the bottom of the list along with the...", "El Patron Mexican Grill is new to Deatsville and is located in the Old Dusty's Diner building. The decor is very festive but the food is where the..."], "rating": [5, 1, 4], "TBscore": [0.45, 0.27, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["mexican", "beef"], ["mexican"], ["mexican"]]}
{"id": "lOoyezA2hPQle5WNcN7zGw", "text": ["I live in Ramer so Reds is fairly close to me. They've always had good food whether it's the buffet or ordering steaks. The owner is real friendly she is...", "We found this restaurant while driving down the highway looking at Yelp reviews. We were driving from Chicago to Florida and wanted to find something local....", "This place is a hidden gem we have found on our way to Florida. It is very neat and local. Definitely has its own character!\nMainly it is southern cuisine..."], "rating": [5, 5, 5], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["steak"], [], []]}
{"id": "FaWwD61NtXH7RblvDdNBkQ", "text": ["Love it! Great burgers and breakfasts late night/early mornings and coffee is hot and fresh.", "This Waffle House was super clean, extra friendly staff and very fast service! I'd highly recommend this WH! Our waitress was very patient with us, as I did...", "We tried to eat breakfast yesterday. We were completed ignored. We will not go back. We went to the WH on Chantilly Blvd, it was a Great experience."], "rating": [5, 5, 1], "TBscore": [0.34, 0.26, 0.4], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["burger"], ["waffle"], ["breakfast"]]}
{"id": "GtGSKGaP0jLw7JgnpRWXYg", "text": ["Love the drive thru! This is a great feature for stopping by \"quickly\" when I am in the car with kids and don't want to go through the circus of getting...", "A dessert place in Montgomery that closes at 10pm on a weekday?!  Who knew such a rarity existed!  Since Yelp said it did a friend and I hopped into our car...", "This place is awful. Every time I come in its dirty. Half the employees aren't working, have them clean up. There is one employee who barely works, she..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "pthtt2zdexU4yCrIBEnZBg", "text": ["I love this shop.  1.  Great cupcakes and cake.  2.  Even better story...entrepreneurial single woman... without the resources of Donald Trump...starts...", "Wow! Amazing! Delicious! All of the above to describe her cupcakes! The carrot cake one is super moist and delicious. I loved the red velvet cheesecake one...", "I ordered a dozen variety cupcakes and I had three over the course of three days. Honestly, the best cupcakes I have ever had. My friends shared the same..."], "rating": [5, 5, 5], "TBscore": [0.43, 0.49, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], []]}
{"id": "i0j1XqgR_bfppAfEjBHTKg", "text": ["Wonderful wonderful cupcakes!! The owners were warm and friendly! I will\nmost definitely visit again!", "They were great! I ordered the cake for my husband. He loves red velvet cake. I told them what I wanted picture on the cake etc. I forgot to send the...", "I'm telling you this is the best tasting cupcake/cake place in the world. I have traveled all over the world and came to Montgomery, Alabama to visit my son..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["cake"], []]}
{"id": "ZmDo5IFktNjJ1hw8KbVJtA", "text": ["They don't take credit cards. Would be helpful if they said that before I called and drove all the way there.", "Their cupcakes are simply amazing! I was craving some freshly baked goods and after my disastrous attempt at ligors bakery I found this one. The cupcakes...", "Cake Designs did both cakes (bride and groom) for my wedding. The people there are very friendly. They work with you to ensure you get exactly what you..."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.37], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [[], [], ["cake"]]}
{"id": "aTNjNZIQZ0T0bXXwM-PIvw", "text": ["Superb treats! The cupcakes are very well made, with many creative variations. We were a group of four and bought about a dozen, everyone was very happy!...", "I ordered the peanut butter cupcake. Was looking forward to it all day. Unfortunately the cake was dry and the icing was not bad but a little too sweet.  My...", "After my most recent trip to Montgomery, I was introduced Jozetti's cupcakes and they were so good that I had to come back and downgrade my rating for..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], ["cake"], []]}
{"id": "c2Fh9lQhXCM3kH7q0XJqVQ", "text": ["I LOVE CUPCAKES!!! So much so that I'd consider myself a cupcake connoisseur. Living in DC, there are plethora of cupcake options. I can think of at least 8...", "Stopped in and bought 4 cupcakes today.  Peach cobbler cupcake had no flavor.  My husband had the chocolate and said it had little flavor.  Tasted the pecan...", "The love of my life in the form of a sweet potato cupcake. I'd put a ring on it if I could. I find it hard to articulate my feelings! Be far one of the best..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "XtQAah18L-DgaY7SPY4UPg", "text": ["I picked the Watermelon Sorbet! I filled it to the brim with fruits! Absolutely delicious....worth every penny! You can fill the cup up to the very brim for...", "Ever since they opened in Montgomery years ago, my kids and I have been eating here. They have the best deal and the best flavors, as to why I believe...", "2 words Dole Whip!!!! Happy Birthday endingShould consider selling all 6 flavors Strawberry is amazing like pineapple but thank you for selling the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "v5aPljKFSwSwrZrCrG_vDg", "text": ["I think this place is hit-or-miss. There's a lot of local foods and baked goods, but the farm offerings are of varying quality, particularly at the end of a...", "NOT AS EXPECTED!\n\nIf you are looking for a market that is similar to the Auburn Market in Atlanta or the Farmer's Market in Nashville, you are in the wrong...", "This year-round, Tuesday-Thursday-Saturday farmers' type market is best visited on Saturdays, when the most vendors show up. I checked out a couple during a..."], "rating": [3, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "Qv7Qt0abvt0d3fLTpDa9cw", "text": ["Girl at front counter very nice, person in back very difficult, was not happy when we requested the free kids meal with adult meal. We ended up having to...", "I am a captain d's fan, but as of last night I'm going to have to start going across town to get the food, service and atmosphere that I should have gotten...", "This Captain D's is OK.  The quality of CD's fish has gone down over the years.  It used to be much better.  The fish is OK.  The fries are hit or miss...."], "rating": [3, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "AP_OqT2YeboH-wapCDcjug", "text": ["I absolutely love this Asian market.  I'm glad to have found it from the Yelp app.  I wasn't expecting to find a good selection of Asian products in...", "I was pleasantly surprised with the amount of stock in such a small store. This is the first place around that I found that had ingredients for what I want...", "Yes, this is a small market, but well stocked. Comon people, we're in the middle of Alabama. The next closest option for Asian groceries is at Walmart LOL...."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "KnmtitUIyUrCuylbA4QB3Q", "text": ["Wonderful people! Wonderful food!!", "Me and My son came here yesterday, I had been meaning to come here months ago but since I've  moved I'd haven't had the opportunity to go. When we walked in...", "Ordered the Sampler Platter that comes with ribs, tenders, and your choice of pulled pork or chicken. It also comes with French toast and two sides. The..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, -0.3], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], ["chicken"]]}
{"id": "FI0NLC2uhl4I_Xj2zenfDA", "text": ["Large serving of beef brisket with baked beans and coleslaw filled me up completely. They provided a single slice of white bread on the plate that, being...", "This was the best lunch with my friend \nThe ribs were delicious moist and tender along with the brisket juicy and tender melt in your mouth no sauce needed...", "Great meats, brisket, pork, and chicken. Perfect Sides, only no mac and cheese. Great southern hospitality."], "rating": [5, 5, 5], "TBscore": [0.0, 1.0, 0.33], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["beef"], ["lunch"], ["chicken"]]}
{"id": "5mFARgWCmM1G0pI0uZQdug", "text": ["Great locally owned, no frills bbq joint. Fast, friendly and delicious. Generous portions and great value. The pulled pork sandwich with your choice of 1...", "*** This place does not exist at this location ***\n\nIt is on Federal Drive about a mile or two down the road\n\nIt's fantastic and worth finding!!", "Excellent BBQ and Wings. Love the down to earth environment and the friendly staff. I love the local owned places where the owner is behind counter."], "rating": [5, 5, 5], "TBscore": [0.53, 0.0, 0.26], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sandwich"], [], ["wings"]]}
{"id": "NVAnccTBPpdGwE99lfukmQ", "text": ["We got a meal to-go for our family get together. Everything that I tried was really good. I had bbq pork, slaw and sauce, Mac and cheese, potato salad,...", "Stopped here on the way back to Prattville from mountain biking at the Swayback Bridge Trails.  Needed a quick bite before the shenanigans of the Iron Bowl...", "Super nice owners. Always great food and smiling faces. Champs is also very supportive of the community."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "ERQcEb3pqPb6bO5U_9SMoQ", "text": ["Great bbq in a tiny spot on us hwy 231 in the ole we2! Faith is a great thing and they have it! Greatesru jêj", "Good enough.  Not the best, but holds it own. Very small dinning area. May be best to get it to go, especially at lunch time. My order was a jumbo sandwich...", "Smokin S is definitely worth a visit if you happen to be in the Wetumpka area. Super home-style place - friendly service, food served on paper plates,..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["lunch", "sandwich"], []]}
{"id": "KrtFZv0gT602Oaun7d-aag", "text": ["Ok... so this is a country cooking buffet... That being said, it is a good one. \nThe vegetables were fresh and cooked well. The meats I tried were very good...", "Very good food.  Usually a good selection, although not a lot of beef or seafood choices.  Great veggies that're well seasoned.  Great for the price, if you...", "I recently came here with my grandma and I was some pleasantly surprised! The food was delicious! The standouts for me were the mashed potatoes, the lima..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.69, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["beef"], []]}
{"id": "P6UQl92WEGHkHNCILyo_8A", "text": ["Stopped in here for lunch and was not disappointed. The portions were generous. I got the pork plate, the meat was melt in your mouth good, a good Smokey...", "The big blonde lady at the counter was rude clicking her pen at my husband wanting us to hurry up and order but why would you have people order up at the...", "Over priced small portions! The BBQ isn't even that great. And you have to pay extra for slaw, really?!!! What's BBQ w/out the slaw!  The TEA was horrible..."], "rating": [5, 1, 1], "TBscore": [0.59, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["lunch"], [], []]}
{"id": "H_z--N6OlRIs1HcJHvqFlw", "text": ["I'm guessing management or staff has changed since all of the negative reviews were posted. Staff was friendly and the food was good - no problems here :)", "My boyfriend and I are Popeyes fanatics and enjoy it on long road trips since we don't have one where we live. Out of all the Popeyes we have eaten at this...", "Never again! I would never eat here again no matter how hungry I am was. The young lady in the picture should not be working in the front of house because..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "f_2eRLkMW10T-Dyidg3_Pg", "text": ["It's faster to go anywhere else in town. They either are slow and running behind, or they feel like they are randomly done for the day. You could be stuck...", "I stopped by this location and came through the drive through to place an order. This was a quick process and my order was done correctly. My food was...", "Asked our order 3 times in the drive thru before being told 3 times before we could finish to hold on. Rude and untrained staff. And they want 15 an hour. Haha."], "rating": [1, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "UVPBabHJiSc7SWQH4fg7Cg", "text": ["I had a much better experience than the rest of the yelpers that reviewed this franchise location.\nI had been wanting some Popeyes for miles coming home...", "I would first like to say, I come to this particular restaurant at least once a month and I always go thru the drive thru when I visit. Each time the worker...", "As much as I love this restaurant the drive thru service was beyond horrible.  I was first placed on hold to put my order in and currently I am sitting..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "fmg3NKz0577FV_mcbxbTqQ", "text": ["Literally the rudest women working at their drive thru windows. Honey, you slide a card all day...no reason to let out a big sigh like your job is so hard.", "The owner of this establishment should be ashamed of themselves!! It's obvious you have failed to address basic health conscious maintenances on this...", "Walked in to find a super long line so I went to the bathroom to find no soap, a broken paper towel dispenser, & broken trash can. Finally ordered & they..."], "rating": [1, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "j0CMyZcQoIz29RTg_Wh9-Q", "text": ["Wendy's is Wendy's - in most places... there are variables. \nThis location is hidden behind the Waffle House. This is a smaller store with more congestion...", "goood food! friendly service.. a little hottt in the restaurant tho could use the a/c lol but in general good place they have my business for sure", "wendy's in crisis\n1 million degrees inside\nAll workers seem like they're working their very first shift \nGodspeed to anyone who visits"], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["waffle"], [], []]}
{"id": "GZMxzuVxLVp36hMUB6aN_w", "text": ["We had another great experience with Outback today!  Zach P was our server and everything was fantastic he is so attentive when he takes care of his...", "Omg. Where do I start?? Ok. So my fiancé and I went in at 8:00. They closed at 9. We sat down, ordered our food and around 8:30 our meal was brought out. I...", "I came here to eat on a weeknight by myself. I walked in and was immediately seated. Within 1 minute the waitress was asking for my drink order in a very..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "jk2uiKW_76YCXaeJvfYndQ", "text": ["I used to love this place. It seems as though over the past year or so the food quality has been lowered. I suppose it is most likely to lower cost. Even...", "Came in at 4pm with party of 10.  Hostess asked if we called ahead.  I said no. She acted as if that was a sin.  It's 4pm.  Half the restaurant is empty....", "I just had a great lunch experience. It was lunchtime on a Tuesday. I got the Logan with broccoli,  and baked sweet potato. The broccoli was amazing. Most..."], "rating": [3, 1, 4], "TBscore": [0.0, 0.0, 0.56], "normalisedRating": [0.2, -0.6, 0.6], "keywords": [[], [], ["lunch"]]}
