{"id": "9RXHnUyVGGdA5lnt3_gobg", "text": ["All you need in your life is the #6 vegetarian on the 9-grain bread! That's the end of my review. \n\nIn all seriousness, this is the best vegetarian sub on...", "The food itself was good, but I have 2 main areas in which my experience could have been better:\n1. Price. Lettuce wrap sandwich, chips, and drink were...", "Oh man I literally couldn't believe how much I enjoyed their \"Veggie\" sandwich.  It was truly delicious!  The bread was fresh and the guacamole was on..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.46, 0.6], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], ["sandwich"], ["sandwich"]]}
{"id": "AXch6-PRn0eqle8mdH3o-A", "text": ["Short walk from the food distro if you park on Joseph street. Great little deli. You'll want to grab some extra sandwiches for the road. Fair prices and...", "Love love love this place and these people!!! In a totally industrial area of Newark so not necessarily a destination but  if you happen to be working...", "I walked into this place for lunch, was greeted by a friendly lady at the counter asking \"how can I help you?\" and watched an 80 year old woman make one of..."], "rating": [5, 5, 5], "TBscore": [0.26, 0.0, 0.24], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["deli", "sandwich"], [], ["lunch"]]}
{"id": "jh6FMF2j8n9sdqo4Y9JOZQ", "text": ["I normally reserve five-star reviews for the BEST of the best... and Hero King of Nutley truly deserves that rating!  From the moment you walk in the door...", "My wife and I decided to host a party of about 10 of our relatives who all live about two hours north in upstate NY.\nWe knew we didn't want to cook and...", "Love sandwich spot. They make a mean hero. The bread they use is always fresh and they do not skimp out on the meats. My two favorites are the Hoboken,..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["sandwich"]]}
{"id": "Mdtqib8egjoTD-67S3y_SA", "text": ["I was excited to see a cheeseburger, fries and a can of soda for $6.25 on the board as a special as I passed by at the end of my lunch break. \n\nI went in,...", "UPDATE: This case is now called Ark Gourmet Deli. I was told that not only were NYC bagels good, but so were New Jersey bagels. I don't typically eat many,...", "Used to be my favorite place but not anymore. Food comes incredibly fast but it comes undercook. I spoke with the manager regarding the undercooked food and..."], "rating": [1, 4, 1], "TBscore": [0.37, 0.23, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [["burger", "lunch"], ["deli"], []]}
{"id": "EsgNQBqDF2Mu1A-wnzs7cg", "text": ["Went there for take out this is well needed place.  Had pastrami sandwich with side if potato pancakes.  The pastrami was amazing it melted in your mouth....", "So first off, the staff is SUPER friendly, and they go out of their way to have you try everything.  Samples of the soups, corned beef, pastrami, and...", "This new restaurant's owner is a culinary school graduate, and previously managed three kosher deli's on Long Island, so I figured he must know what he is..."], "rating": [5, 5, 4], "TBscore": [0.6, 0.32, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["sandwich"], ["beef"], ["deli"]]}
{"id": "SNoqF-WxjHsjBshlbB-N3w", "text": ["Nothing special, but perfectly decent and average food, with lots of variety - sandwiches, salads, snacks. Marginally better than going the chain fast food...", "$3.99 for an egg & cheese breakfast sammich is pretty darn cheap for airport food. Quality was better then expected as well. Not gourmet for sure, I'm...", "Surprisingly good food for an airport.  This deli is definitely worth a detour if you find yourself in one of the other concourses in terminal C.  I was..."], "rating": [3, 4, 4], "TBscore": [0.21, 0.31, 0.29], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["snack", "sandwich"], ["breakfast", "egg"], ["deli"]]}
{"id": "T4G8DbZnX8aZ4lwY62gE7g", "text": ["Giovanni's has the best mozzarella hands down. They have delicious hot food too! I go there for lunch often.  They have a generous amount in them. Giovanni...", "Great vibes as soon as you walk in ! The guys inside are so sweet and greet you with smiles and help you right away ! Sandwiches are AMAZING ! Gelato is...", "Not from around here but since we were in the area we decided to stop in for some lunch. From the moment we walked in to the moment we walked out the..."], "rating": [5, 5, 5], "TBscore": [0.54, 0.61, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], ["sandwich"], ["lunch"]]}
{"id": "qrfSvfsAtbfEiXeJoK3EFQ", "text": ["The best Cuban sandwich ,exceptional service and very clean !! Will definitely come again , not easy to find a good place anymore .", "Definitely the best Cuban sandwich in the area! If you ever find yourself in the area, you should definitely give this place a try.", "Small hole in the wall joint.  My husband and I both tried the Cuban sandwich which was delicious. We both had a beef empanada each, they were fried..."], "rating": [5, 4, 4], "TBscore": [0.48, 0.33, 0.38], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["sandwich"], ["sandwich"], ["beef", "sandwich"]]}
{"id": "tFGkvy_rrpwZ0GV-l6wncQ", "text": ["Disappointed when I went to the So. Orange Ave location and realized they are not there anymore. Yes the area is hood, the store is hood, and the employees...", "I used to come here many many years ago... back when they also had a Coopers on South orange Ave as well. I used to get brisket, corned beef or pastrami...", "This is not the most ideal location BUT the sandwiches are 5*! This is one of thee best corn beef sandwiches (probably thee best corn beef sandwich) u will..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.33, 0.88], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["beef"], ["beef", "corn", "sandwich"]]}
{"id": "8vBpOumTQcW1Zu2bHhvj8w", "text": ["I always passed this on my way to Penn Station and finally decided to give it a try. It's a small store with a counter that actually had a fairly extensive...", "One of the BEST falafel sandwiches I have ever had, and for only $4!!\n\nIt was warm and moist, and the pita bread was so soft and perfect. They served it...", "$4.81 for a sandwich and a soda... Sign me up. Bread was fresh, cheese was very good compared to an equivalent place and so was the meat pretty good. Pretty..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.54, 0.48], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["sandwich"], ["sandwich"]]}
{"id": "DO4QxluGx2aMVNgUf5-c5w", "text": ["I've been going to Benanti's since I was a kid. By far the best Italian deli in NJ. The only place I like better is Leo's / Momma's deli in Corona. These...", "When I moved to NJ, I was told this was the best sandwich spot in town and boy were they right! Best and biggest sandwiches I've had in my entire life. The...", "Great sandwiches you get what you pay for (and some, I feel) Charlie is great and the ingredients are always good. (Well I'll be honest, there was one day..."], "rating": [5, 5, 4], "TBscore": [0.32, 0.59, 0.72], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["deli", "italian"], ["sandwich"], ["sandwich"]]}
{"id": "A4NeiyuX9zndRiUdItKnEw", "text": ["The subs are big and the toppings plenty, I've got no complaints!\n\nThe place is clean, sparse, and the staff is efficient.  Stopped in as I was craving subs...", "If you grew up in Kearny you can still remember the day American Hero opened up and families became divided and friendships were lost depending on if you...", "Good eatin', yet expensive. The $15.00 that I paid for a large sub & bottle of water certainly was pricey, yet satisfying in the end. So satisfying that I..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], ["american"], []]}
{"id": "j4z5bahYOOhWEN1dEAM4oA", "text": ["I haven't been here since childhood and when my fiancé asked me to pick him up a sub I knew this is where I had to go.  Place hasn't changed a lick in 20...", "Someone call the health dept for inspections cuz I got the runs!\n\nYou might say it was something else I ate, but I'm on that intermittent fasting diet, so...", "Well, damn--that was a good lunch. What can I say that hasn't already been said?\n\nHole-in-the-wall? Check.\nHuge menu (120 different items)? Check. \nFresh..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [[], [], ["lunch"]]}
{"id": "2byAm2L8PzD_SJXKzWWRcQ", "text": ["By far the best Wendy's in the area. The drive through lines are pretty long but they move fats, and for the most part the food is always good.", "Just another Wendy's the was good the place looks decent.  The only bad thing is the bums that harass you for money. I didn't see one today but they are...", "The only reason I give Wendy's three stars is because the food is always good.  The lost of two stars is because  of the ways of there employees. When they..."], "rating": [3, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "YZuzkLV-5A90uj-HgOSlMA", "text": ["This is a solid Burger King location.  The dining room and restroom were very clean.  The service was quick and courteous.  I ordered a couple of classic...", "This location is rancid. They cook food with old oil and have no intentions to change it via management. On top of that, the drive through is a complete...", "This is the worst Burger King ever!!! They lady who took my order was dry, no spirit,no happiness, she just seemed so upset. Then when I came to the window..."], "rating": [4, 1, 1], "TBscore": [0.32, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["burger"], [], ["burger"]]}
{"id": "GQsvBRgGloNNncIXgPJqoA", "text": ["There are times that you really just want a burger and fries, even from a fast food joint.  Such times include a near two hour delay for your flight's...", "Very good lunch\n\nWhile waiting to fly out of Newark yesterday I stopped by Wendy's for lunch.  I received a cheerful greeting as soon as I walked up.  I...", "Fast service,  respectful employees the employees are always smiling and on point with the customers..I ordered a cod fish meal cause simone never bought..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.7, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["burger"], ["lunch"], []]}
{"id": "ojDmEmZ_db5VraeAUYyr9g", "text": ["I was hoping to try this place out and called a couple times to confirm their hours. No answer. I drove by hoping to find them open. No luck.\nI talked to a...", "Price was decent and food is delicious!! The lomo sandwiched and pesto sphagetti is amazing!!", "I used to come here daily for breakfast as a kid and I became a familiar face. In such a short amount of time this simple hole in the wall Peruvian spot..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "LnWltNfXLY61bGqDwHtPNg", "text": ["I have eaten here many times. Understanding it is a small place and when busy service may suffer, if you wait for it, the chef will provide you with a...", "So we went to get breakfast at this place. We sat down one of the waiters gave ups the breakfast menus and he disappeared for 20 mins. (Keep in mind...", "Saturday, Dec 16, 10:30am. 30 minutes before closing. Every table was dirty. One server working in the whole place. She was working her tail off. Restaurant..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["breakfast"], []]}
{"id": "Rf_2A9BD1IwskUCmfBFf-w", "text": ["JJ s hotdogs is not closed\nWe are open till 11pm weeknights and till 4a.m. on Friday and Saturday", "JJ's is LITERALLY the best place to get a hot dog! anyone who doesn't like JJ's is a weirdo and you need help because clearly you don't know what a good...", "Its a hot dog, you'd have to work very hard to screw it up lol!\n\nThis place uses sabretts I believe.  They are boiled.  They have a nice snap!\n\nOne thing..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["hotdog"], [], []]}
{"id": "Yzcn5hcXmcUVSUK_xLDVow", "text": ["I love hot dogs and Newark is home to plenty of options.  Decided to try Jacks after I saw it on Yelp.  The truck is located on Adams St. next to...", "Jack's is open ........period.....I don't know \nwhere or why people would report it as closed...\n.\nBut I'll tell you this when your in the ironbound on...", "As you may know, I'm always on the lookout for Jersey's best hot dog...I don't know that I'll ever find it, but because YOU want to know, I'll keep..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "f_CMlNaEeygehNezk23F-Q", "text": ["This place is HEAVEN! Wow. What a legendary spot. Cheap hot dogs at fast service. They do, however, close early. They close at 5pm and Saturdays at 4pm(...", "if you like chili dogs, this is the place for you! The hot chili does have some heat. They use Sabrett  dogs boiled in water. Also try the Hot onions.", "Been a customer for years. Family run business a plus. Great hot dogs and fries.  Fast service. A+"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "CDlHBT6ToRNmyNFvL1_SjQ", "text": ["Can't believe it's taken me this long to leave this review. This guys hot dogs are the real deal. You can taste the quality, freshness, and attention that...", "Vito's is the BEST Dirty Dog vendor I have ever experienced  and I have experienced all the Great and not so Great in Jersey and beyond \nHis passion for...", "\"SOONER OR LATER...YOU'LL HAVE ONE\" Best hot dog truck I've ever been to. His toppings are home made and it shows! The chili is perfect! \"The Junkyard\" dog..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "kcPryuachzN1hAEHIxgxcA", "text": ["I have been coming to Tony's before my teens I think I was 11 years old when I first stubble upon the truck. In my many years I have seen East Orange and...", "Co-worker and I needed hot dogs for lunch today because it was beautiful...not many more of these days this year. This was my first time here (still working...", "I was a little disappointed with my last visit. It just seemed like he didn't want to be there. We were doing a hot dog run (7 different vendors in one..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], ["lunch"], []]}
{"id": "flqB7Lwhx7ilmWb12Ulilg", "text": ["Omg. The chili is dope. I put it on my wieners. I put it on my fries. I put that sh*t on everything. They offer the Cherry Pepper Hoagie spread for their...", "Good hot dog stop close, not too far from EWR Airport and 1&9. New place with a good menu. Hot dogs are good with good chili. Had the spicy and liked the...", "Hot Dogs are Hot Dogs...but the different chilis is what gives this 4 stars!!  Will definitely come back...."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "p4MFj1vG8SwNbophVtfKoQ", "text": ["One of the best things I look forward to in New York is a great hot dog. This is one of my favorites! Walked a while in the rain for this one   Fabulous!", "Get the \"sausage\" - really a larger, spicy hot dog. Definitely worth the dollar upgrade to $3.5 and delicious.", "i haven't had a hot dog from a street cart in years and with good reason    it's dirty dogs in dirty water and the carts are stored on the west side in a..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "pcmj5-iUCW51AEEvwtwhlg", "text": ["Absolutely love these Hotdogs!!!! Have been coming here for years!! Cant get any better than mashed potatoes on your dogs!!!", "I'm a Chicago native and always believed nothing can a beat a Chicago dog ... until now! There's something about these dogs that are phenomenally delicious...", "These are the best hotdogs around. The soft buns, juicy hotdogs with a great snap. The potato and cheese is my favorite"], "rating": [5, 5, 5], "TBscore": [0.99, 0.0, 0.6], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["hotdog"], [], ["hotdog"]]}
{"id": "67RVLyckzlhkKHlYBSOgig", "text": ["This truck should be impounded with the owner maybe years ago he used to be good but now I feel sick to my stomach you are the true meaning of dirty dog you...", "These dogs are by far the best in the tri state area. Trust me I travel all of NJ, PA, NY, and randomly bordering states daily for work. The toppings are...", "I spent this evening with my daughter watching the semi-final of the Essex County High School Softball Championships in Newark's Ivy Hill Park.  The game..."], "rating": [1, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "IuO9s-V5Ne6eLk98qnSOAQ", "text": ["Wow-a dog truck with natural casing Sabretts, a fresh roll and a long list of \"house\" (actually truck)-made toppings. \n\nThe hot dog was a little small but...", "Located on the corner of Jersey Street and Frank E. Rodgers Blvd. For locals it's such an easy place to walk to as it's almost right in the middle of town....", "high quality, low cost hot dogs served with pride by friendly people from a food truck at a corner on a lot that the business controls or owns all of. There..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "oVrK19rolvrkWt3ej1oWow", "text": ["No complaints yet\nHopefully they will renovate one day\nBooming business need more space", "It's just not the same. Last time I went it wasn't worth the wait in line. It was so beyond greasy.\n\nUPDATE In response to owners reply: I am sorry my...", "My first time trying an Italian Hot Dog was at Jimmy Buff's and it was great.  Cheap prices, filling and great tasting!  Little messy but worth it."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], ["italian"]]}
{"id": "lk5r_tZ4WB7BbjmrCwhKzg", "text": ["The BEST of the best!  An absolute staple in NJ.  Tommy's has been around forever.  The tastiest deep fried dogs and sausage with potatoes, onions and lots...", "This is a classic Italian hotdog spot in a good way! I've been here twice, each time getting a double Italian hotdog. Although I've never tried anything...", "Me and my family are always in search of great eats. Cheap eats and hole in the wall places serve of some pretty tasty dishes for a reasonable price...."], "rating": [5, 4, 3], "TBscore": [0.0, 0.21, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["hotdog", "italian"], []]}
{"id": "U2XXOxfvXe_o10QywbjxYQ", "text": ["Great food and even better customer service,  my daughter and I love this place!!! The waffles are the best I've ever had in life!!!", "I been here a few times and customer service is always a hit or miss..... Note to owner.....hire quality servers. Highly disrespectful giving this is a...", "Ok so I've been hearing about this place FOREVER and finally on Sunday I decided to stop by.  Now walking in to the left is the restaurant area and you can..."], "rating": [5, 1, 2], "TBscore": [0.82, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["waffle"], [], []]}
{"id": "WqrMVOEulCcKZl7uAkYl_A", "text": ["My husband and I stopped by so we could compare Jerry's and Tommy's and ultimately found that we preferred Tommy's hotdogs. However, Jerry's is an amazing...", "Hot dog or hot dog?\n\nJerry's makes a good hot dog, but, I personally prefer Tommy's. Judge for yourself, though! \n\nBeing next door to one another breeds a...", "This place has been around forever and it's because the chili cheese dog is amazing. Literally the best I've ever had."], "rating": [4, 3, 5], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["hotdog"], [], []]}
{"id": "gFSkLQ-G6G2mB6ywkOuMvg", "text": ["Ok, so you might be thinking \"How can a hot dog have 5 stars?\"  Well this was my first visit after passing by so many times. Finally go in was given a...", "Excellent Italian dog. I loved the chop burger. I would trust anything that comes out of these guys kitchen. Everything on the menu I wanted. \n\nNice,...", "I love Italian hot dogs and this place was really good. I gave them 3 stars because of the service the guy that looks like Qbert making the hot dogs just..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.57, 0.34], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["burger", "italian"], ["italian"]]}
{"id": "ejQEFROyy34QgTqG5WGAtw", "text": ["Great spot for a quick bite & you never wait long for your food. They have outdoor and indoor seating it's pet friendly they have liquor and a huge...", "If you're looking for a good hot dog, this place definitely ranks among the best ones in the area. This place has been a staple in town for as long as I can...", "Lots of menu selections. Seating inside or out. Went there to sample the hot dogs. Had their Texas wiener (chili dog for non-Jerseyites). Good dog! Both the..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "CKrjSw1NTsI8asdIpa2Tiw", "text": ["My son and I stopped in here yesterday before walking through the car show on Broad. Very quick, friendly service and great hot dogs. They have a good...", "The owner threatened me after I reported some of the posts as being extremely suspicious. This place is not great at all then I notice the other reviewers...", "So good  all fashion hot dog . I also got fries great  and the best the soda Stewart's so good ice cold have go ready for my next delicious hot dog and more..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "P5_9ExgaFVlMDnfQOfx3wg", "text": ["I had the taste for hot onions I wasn't near my go to spot so I stopped at my back up spot. Branch Brook Park has 4 Hotdog trucks holding her down. Louie's...", "Love this place! Out of all the hot dogs trucks in Newark this is hands down the best. Owner-operated everyday and always served with a smile. Definitely...", "This place is a hidden gem on Mt. Prospect on the border of Newark and Belleville. I love coming here around lunch time and there is usually a small crowd,..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["hotdog"], [], ["lunch"]]}
{"id": "0nhNZ-_OwTgzTMAmWUgsFw", "text": ["Randy and his big personality alone are enough to visit this place.   Great hot dogs in an odd spot.  I had the Best's skinless hot dog on a regular hot dog...", "Randy takes the act of serving hot dogs from his cart to culinary art.  He has three hot dogs to choose from, thumans, spicy sabrett, and best.  All served...", "Ah, Randy and his hot dogs.  A hot dog slinger of the highest regard, who will regale you with hot dog stories and the meaning of life.  A philosopher..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "NYkKw-kWfeZTe8ehgu0Ffw", "text": ["Lady behind counter with blonde hair just miserable like she doesnt want to be there rude and seems a bit racist", "I have been going to Petridis all my life. Even when new owners bought it and it changed to George's I'd still go, and often defend it to others. No...", "How can you screw up a boiled hot dog? Bad attitude, stingy dressings and nothing ever new or inventive."], "rating": [1, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "_-VKxmidl_5FloiNVIDSLg", "text": ["Hot Dog!\n\nOld school New York City hot dogs... multiple locations, turnpike, airport and boardwalk. Man they make a great snappy hot dog. \n\nRecommend the...", "I didn't really expect a gastronomic delight inside a freaking AIRPORT in NEWARK, no, but I really did expect a halfway decent dog between flights.\n\nThe bun...", "Terminal C at Newark Airport sure has a lot to offer. Compared to the terminals A & B.\n\nMaybe it's due to the fact that this is the newest of the 3..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "a1o9OHheNsQ7o6gM8VSQEQ", "text": ["Waffles were on the denser dry side so it got cold and hard quickly. Wings quality has gone down. Home fries were abysmal in taste and appearance. I...", "Had to go try a local gem ........ Best hotdog in East orange,Nj ...   A must try oh did I mention that have all the fixing to dress up the all American...", "Local spot is disappointing considering it's the only restaurant within walking distance of my house that is not Chinese food. They always and I mean always..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.33, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [["wings", "waffle"], ["hotdog", "american"], ["chineese"]]}
{"id": "HOIxbQV3hfou0kWC4s1rPw", "text": ["Been coming here for years, they make my Italian turkey cheeseburger w fried onions and light mayo and ketchup just the way i like it, friendly staff cool...", "This place is a hood staple!! I've been coming here for years, before this particular location even opened. Nonetheless they still serve the CLASSICS that I...", "Yummyyyy! This was my first time and I must say I will deff be back! We called ahead because my friend knew it was a busy location. The lady who answered..."], "rating": [5, 5, 4], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["turkey", "burger", "italian"], [], []]}
{"id": "PKeVGPNiZlkaGeY-ixsL1w", "text": ["Why do they sell sushi and not provide chopsticks?! Also why is a maki roll over $10 and a beef jerky stick $3? My choice in airport food is also questionable.", "Very bad way to get trick the customer with gambling games that pop-up right when you make a payment after your order. Then the games goes fast and charges...", "Incredibly over priced and miss leading, grabbed a chicken Caesar salad wrap that was literally nothing but Chicken and mayo, why would you call it a..."], "rating": [2, 1, 1], "TBscore": [-0.5, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [["beef", "sushi"], [], ["chicken"]]}
{"id": "dILDvNj1AXZzB3JlXGTdDg", "text": ["Hot dog was good.  That being said nowhere on earth is a hotdog worth 5 dollars I don't care about the labor involved or high quality meats. I'm on an inner...", "This review is for every time I've rafted down the Delaware river:\n\nI fuckin could not pull our 8-seater deluxe raft over to the right of the fork.\n\nThe...", "It was about 47$ per person on a weekend (raft). Highly disorganized lines. People on one bus rafts and tubes on another.  Long wait had people asking for..."], "rating": [3, 5, 1], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [0.2, 1.0, -0.6], "keywords": [["hotdog"], [], []]}
{"id": "mBHs4o_8xdQhj5yTwlwqCg", "text": ["Under new ownership, this dive bar is a great place to come and spend time with great people. The bar is basically a family, all the regulars and all the...", "Too much to say. Killer total local cop/fire bar, super friendly clientele & staff. Good tap. Great specials & deelish food. BEST burgers ever, cooked...", "This place is racist..I went to get a drink and the owner said I couldn't get served I was one of two people of color in this place....wouldn't recommended..."], "rating": [5, 5, 1], "TBscore": [0.58, 0.43, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["bar"], ["burger", "bar"], []]}
{"id": "jIkB_Ze-vLJ70P6aziMsyA", "text": ["One of my fave spots, Marc... I mean Russ, is the best! Great drinks and bar food.  Get the French onion soup!", "Great in town Pub with delicious burgers and lots of crowd pleaser weekly specials. Friendly & attentive staff. Had fun time at Burgers & Bingo night.", "Awesome, awesome vibe. \n\nCouldn't have chosen a better place for St. Patrick's Day. This place has such an amazing atmosphere. We came here late, around..."], "rating": [5, 3, 5], "TBscore": [0.37, 0.57, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["bar"], ["burger"], []]}
{"id": "-2nFnzWZ_EfC43Q_ftWM4Q", "text": ["Been meaning to order from them for weeks, after my first UberEats order went bad. I went with DoorDash this time and got my dinnah!\n\nI ordered a double...", "This is a great local spot! Good wings, made fresh, flavorful sauces, and great service. I'm glad there's this new local spot.", "**update** the owner has added a \"no flour\" option on the menu (aka \"naked wings\") y'all are so bomb for that! \ntry them guys!!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["wings"], ["wings"]]}
{"id": "p6PtzRIr2Yovn4CXei56Hg", "text": ["Very please with this local spot. I am new to Newark and I am used to BROOKLYN style carribean food. Ths place is just as good as Flatbush.\nThe Curry...", "I took a cab from Newark to Irvington in the rain storm praying the food was good...Not only was this food banging Iam mad I only got 1 velvet cake so moist...", "I have patronized this restaurant 3 times already and will continue to come back. I have had the oxtail, curry chicken & curry goat dinners, and they all..."], "rating": [5, 5, 4], "TBscore": [0.0, -0.21, -0.3], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["cake"], ["chicken"]]}
{"id": "JHLc_E7r4PyTz97CGpNNWA", "text": ["Some of the best pizza around! Get the Nana's pie.  Also good:\n-Garlic salad\n-Fried pickles\n-Tortellini but with Vodka sauce", "What the f**k does a girl have to do to get a decent meal around South Orange?\n\n$43 for INEDIBLE food: chicken parm, garlic salad with grilled chicken, and...", "An italian restaurant featuring mediocre thin crust pizza in a dark \"sports bar\" setting.\n\nCan't really call this a sports bar except it has a few more tvs..."], "rating": [5, 1, 2], "TBscore": [0.85, -0.34, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["pizza"], ["chicken"], ["pizza", "bar", "italian"]]}
{"id": "T22xAzPVQwVpcMMDpaH8wg", "text": ["I could probably eat the frango a Lena here at least once a week if not more. \n\nAtmosphere: small, but never busy since I've been a frequent customer. Order...", "Food always good. Except one time I feel like they slacked. Also I wish they excepted debit/credit. So make sure you have CASH! I really wanted to order...", "I have been to this establishment a few times already. I have made the acquaintance of the owner Danny and he is a fabulous person. You can tell he takes..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "NaLMvxnhX3MlWUOT27jc6Q", "text": ["Looking for a diner near the airport ; Starlight appeared on googlemaps.\nLooking for yelp reviews, nothing since 2015!  I'm assuming either they're closed...", "Staying at the Wydham Gardens Hotel for business I went here for a late dinner. I did review the hotel if you are at all interested.\n\nThere are two glass...", "Passable hotel fare, but nothing to write home about, believe me. If you're staying at the Wyndham hotel in Newark, you're better off staying in than trying..."], "rating": [1, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.2], "keywords": [[], ["dinner"], []]}
{"id": "QMpv00Ua1eSD96UmtYFDZA", "text": ["This is my first time staying at this hotel near Newark airport. I decided against going out to a local restaurant because of the crazy New Jersey and New...", "For room service it wasn't bad. Caesar salad was crisp and not overly dressed. Pizza was warmer than when delivery comes! Plus I got 2 free bottles of water.", "Rude service!!! Disgusting food!!Every time I called to ask about picking up an order they told me 45 min. When I did go down to order, the service was..."], "rating": [3, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [[], ["pizza"], []]}
{"id": "KqVsJIUcNV-IeeKDeZ0zKw", "text": ["At 6AM on a Saturday morning, my boyfriend and I needed some breakfast food - quickly - we were getting hungry. We noticed this place looked clean and...", "Ok, a 6 am flight. So Phillips is open, and my server was friendly enough at 4:30. Kudos for both of those achievements at such an ungodly hour. And it was...", "Wow! Am I having a bad night after trying to eat at this Phillip's.  \n\nHorrible experience and will never eat here again. I can say \"I would rather starve\"..."], "rating": [4, 2, 1], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["breakfast"], [], []]}
{"id": "UHlpmHTR6G10rm5m2zaMcA", "text": ["Worth the extra little hike I had to take to get here from my gate area. Not too crowded, plenty of seating, and super friendly service. I like ordering...", "Ordered the 20oz Ribeye Steak and I must say it was cooked perfect, the meat was of high quality. I've had plenty of steaks in different parts of the...", "We flew through Newark on our way home from Italy and had a long layover.  We tried to go find a place to eat, and were disappointed that all of the..."], "rating": [4, 5, 1], "TBscore": [0.0, 0.39, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], ["steak"], []]}
{"id": "3MWuG_WPKMhrzXH1CU1rkA", "text": ["Went in, said hello, nobody acknowledged me. I approached counter, looked at the menu for a good minute...nobody said nothing. Finally asked a question and...", "Decided to try a new place and checked out this little restaurant. Ordering was kind of difficult because of a language barrier and the guy basically told...", "I only had the cheeseburger (X-Burger) here the other night but dang it was awesome. They put corn, potato stix along with the lettuce, tomato, onions and..."], "rating": [1, 2, 5], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [-0.6, -0.2, 1.0], "keywords": [[], [], ["corn", "burger"]]}
{"id": "NqrQ60pggWeGBIgL_hV8pQ", "text": ["Our go-to local spot on those nights when I don't feel like smacking pots & pans together.  Lots of choices to choose from on the cheap. Quick service. Nice...", "I love this spot!!! It's my go to comfort food in Roselle! Always clean, chicken is fresh and nice people. Love it!", "I'm a wing connoisseur and have had wings from places high and low, all kinds of sauces and rubs and jazz. But if you want a straight up old school naked..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.38, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["chicken"], ["wings"]]}
{"id": "JKCRrwTxYc3dIXYFkr4Dgw", "text": ["Never again!!  This isn't too far from where I lived, so I decided to walk there at 10pm since parking is horrible in my neighborhood. I get there shortly...", "Worst Service, Filthy Walked Out Nasty As Hell.... Never Again...Rude Staff Took 30 Minutes For 3 Small Chicken Sandwiches...The Health Department Should...", "This place looks like crap the service is crap they over charge and don't give you full order if I owned this Kfc I would shut it down"], "rating": [1, 1, 1], "TBscore": [0.0, -0.73, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["chicken"], []]}
{"id": "XoHV8xRBOOPzl_UCo1anGw", "text": ["I wanted to sit down\nGuy behind counter\nMade me feel as if he was\nRushing me\nand never asked\n\" for here or to go\"???\n\nI thought he put my\nRoot beer in the...", "These hot wings are dry and extremely salty! Ordered a tray of 40 wings for a little gathering at the house and everyone has been drinking water and juice...", "I wanted fried tonight.  Fried is good.  I read the reviews and noticed that the best one was from this year.  Bad ones were from years past.  Now let that..."], "rating": [1, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], ["wings"], []]}
{"id": "9MSiIrns4-nXLgXlrTwm4Q", "text": ["Not a fan of the steak sub.  The sandwich was too soggy, the bread became mushy and fell apart when I tried to eat it.  The sauce is overly sweet and the...", "Had an awesome Cheese Steak here at the Famous Food Festival in Jersey City, NJ.  I recommend giving them a try when you see them out and about.", "Tried to order lunch, still  waiting on food, he lied to us, never tried to make it up to us, food was ordered at 1130 a.m., delivery was to be no later..."], "rating": [2, 5, 1], "TBscore": [0.35, 0.75, 0.0], "normalisedRating": [-0.2, 1.0, -0.6], "keywords": [["steak", "sandwich"], ["steak"], ["lunch"]]}
{"id": "XgVOX8QBLtDK98me0DA0fA", "text": ["This chicken is the best in town! And the empanadas are so freakin good! I would recommend to anyone! My family has been getting food from here since I was...", "Great little spot on Bloomfield Ave for Hispanic food. I stopped here after hearing the guys at the barbershop talk about how good it was and I was curious...", "This is my go to spot for food in this area. Their 1/4 chicken with yellow rice, maduro, and tostones is the absolute best. Everything is fresh, seasoned..."], "rating": [5, 4, 5], "TBscore": [0.47, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chicken"], [], ["chicken"]]}
{"id": "UKcG9sshXKeMGxqVgqMqsw", "text": ["Came down here seeking portuguese eats and this popped up as a new well rated place but I found it to be kind of average for portuguese. Sure the huge...", "Small cozy spot with friendly servers. Food is delicious. Ordered the picadinho, shrimp and garlic, picanha, bbq chicken and ribs and everything was on...", "I was so hesitant to visit here because it had zero reviews. Well I'm sure glad I was feeling lucky yesterday because I struck gold. I was expecting a hole..."], "rating": [3, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "yQ3ltuBLDQLE60FMM0jR8Q", "text": ["Cash only!\n\nGreat chicken for a great price. My girlfriend and I got a half chicken for ourselves and we remarked that it would be a great place to pick up...", "This place is just okay, nothing special, nothing outstanding. Their specialty is supposed to be the Rotisserie chicken and although it's inexpensive, it is...", "Very rude people, I was looking for their menu on line and couldn't find it, so I politely asked if they could please take a picture of it and send it to..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["chicken"], ["chicken"], []]}
{"id": "W9NbR2S8MgZPkE00MGctgA", "text": ["My favorite place to grab some BBQ Chicken and and Ribs in North Newark.\n\nI usually get a 1/2 combo with fries and rice, you get a half chicken and like 4...", "I was in the area for a doctors appointment, so I figured I'd stop by. I've had this place bookmarked for a while.\n\nThis place is located at the corner of...", "I've had this place bookmarked for ages. But we don't get down this way often. The other day, while driving down Bloomfield looking for someplace tasty to..."], "rating": [5, 4, 4], "TBscore": [-0.22, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chicken"], [], []]}
{"id": "h2v_q0C8eeoGQujXVCRsTw", "text": ["Drop everything you're doing and go grab a California bowl! So fresh and delicious. I know this spot just opened up but they are doing everything right....", "YAS YAS YASSSSSSSSS!!!!\nThis spot is AHHHHHHHmazinggggg!! \nI'm soo beyond excited that this place is so close to me!! I had to travel for good poke but not...", "So I'd like to start off with the fact that I was never a sushi person at all and I decided not to try Poke till last year. People would continuously try..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["sushi"]]}
{"id": "Q4pAMMXrX9OPESOodrjXBQ", "text": ["I'm giving this 5 stars just because I'm not sure why it's rated so poorly, undeserved!\n\nService is prompt and polite and the sushi is fantastic - airport...", "Origami has such an opportunity to be a great restaurant because their menu ideas are so creative. But when the food arrived, it was BLAND!!...", "The rolls were warm & delicious!  We didn't have to wait very long but we arrived after the lunch rush hour.  You order & pay from from an ipad right in..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.46], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [["sushi"], [], ["lunch"]]}
{"id": "39wVugNsS8n56Q7H19vB7g", "text": ["Yes a 5 star rating! As always I only write my reviews when I have enough experience with the establishment to give a reliable opinion. I wish more...", "Great Chinese food with fast delivery and reasonable prices. My only complaint\nIs that you can't use coupons if you are paying with credit/debit card. CASH...", "This place has terrible food. I ordered wings and they looked abnormal. Tried sending them back and was given a hard time\n. I would not recommend  this place."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, -0.43], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], ["chineese"], ["wings"]]}
{"id": "cqqKYxw9dXxOCseRdbXqbQ", "text": ["Beware!  Stopped in on Sunday, August 5 on the way back from NYC with friends who keep kosher.  While the ability to enjoy matzo ball soup with sushi is a...", "Great Schwarma! That laffa tastes amazing. They stuff it with some great salads too. Nice clean place.", "Poorly cooked food. The chicken was over cooked in both dishes. The caesar dressing was like water. Shame because I wanted to like this place."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, -0.5], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [["sushi"], [], ["chicken"]]}
{"id": "NgzDzpXKlp-dzh2aKe42vw", "text": ["Hi folks !! I went here for lunch this weekend and the spinach wrap was out of this world filled with crazy goodness. I should have taken a photo. The next...", "This Blimpie location is the worst of the entire chain.  I love Blimplies, but the location at 150 Halsey Street is overpriced for its quality and portion...", "My Blimpie's sandwich was delivered to me. I ordered a double meat honey turkey and cheddar sandwich. I called and within 15 minutes my food arrived. I..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [["lunch"], [], ["turkey", "sandwich"]]}
{"id": "q7QXxwuNu2oYjCUmHzwUTQ", "text": ["I'm upset they got rid of the eggs-in-a-basket dish. That was delicious and it's so hard to find", "Not friendly, no service, people don't care.  Horrible. No expectation on when food will be ready.", "Eggy Weggy? Waitey Latey! I'm with Stefany in another review. I had 15 minutes before my flight was to board and needed food before my 6am flight. How long..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "KIOHhedfqf9zYoQ3tKacmA", "text": ["Friendly service but barely any effort is put into the limited menu options. Food is McDonald's quality and very overpriced. I had the \"southwest scrambler\"...", "I ordered the Thai chicken rolls. The sauce was really sweet. Everything was super mushy inside, doesn't seem fresh and no distinctive chicken flavor. Was...", "Awful place. Awful policies. Awful service. Awful seating. Go to Phillips seafood or grab a turkey panini from java moon. This place doesn't deserve your..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, -1.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], ["chicken"], ["turkey"]]}
{"id": "hg9YtPsvEBMGrxeR1LD6ww", "text": ["They knew what they were doing when they called this place Pronto Cafe.  I was able to order, get my food, and pay within 7 minutes.  I ordered a chicken...", "DO NOT ORDER FROM HERE!\n\n50 minute late delivery (should probably tip cash to offer a promptness incentive, I suppose - lesson learned). \n\nCold food...", "I love their oatmeal, home fries, and salads! It's a shame that their customer service isn't the greatest."], "rating": [3, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [["chicken"], [], []]}
{"id": "FyM4865f71NRi3QXwscREQ", "text": ["Best Italian deli in all of jersey!!! From breakfast to lunch, you can't go wrong at angelos! Definitely try the pancakes...they're amazing. Service is fast...", "Have been eating here for the past few weeks now and it hits the spot every time. I always get a chicken cutlet sandwich and am never disappointed. Friendly...", "I have to say this place can go unnoticed because of its location but what a fabulous spot. I learned about thru a friend who brought me over some of their..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["deli", "breakfast", "italian", "lunch"], ["chicken", "sandwich"], []]}
{"id": "kkHC13n4LQbMSIm65uQP0w", "text": ["We stopped here for a quick breakfast and enjoyed everything we had. CrepeOlogy crepe, Veggie Sandwich, Avocado BLT and beef barley soup were ALL DELICIOUS!...", "Holy crepe this place is truly amazing! From the clean interior to the welcoming staff this place hit all the right spots for me. After a rather long,...", "Went for breakfast, food were great clean and a lot of healthy choices. \nWe ordered big breakfast so we were not able to order sweet crapes... Next time!!"], "rating": [5, 4, 5], "TBscore": [0.61, 0.0, 0.25], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["beef", "breakfast", "sandwich"], [], ["breakfast"]]}
{"id": "3oXpMgrhMh4wunEQp3yy_A", "text": ["Such a yummy food pop up! I ate from this spot at the Jersey City Eats fest this past weekend and was in pure food happiness coma. The two things we tried...", "Found them at the Jersey city street fair this past weekend and SO glad we did! The unicorn was delicious- covered in crispy fruity pebbles it was warm and...", "My boyfriend and I have a serious Mochi obsession, so this was high up on our list of things to try at Queens Night Market. We tried the Unicorn one, which..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "3SAQQIBjOhTN22UZV3PJgg", "text": ["THEY HAVE GLUTEN FREE WAFFLES YOU GUYS. GLUTEN FREE!!!!!\nTruly, these are so delicious. I am so excited they exist, but also it could get dangerous if this...", "Overpriced as far as waffles go, but the people running the truck are super friendly and make a delicious filled waffle!", "Bex waffles are one of those foodie truck experiences you hear about - delicious, addictive, and transformative.  I must admit, I didn't get what the deal..."], "rating": [5, 4, 5], "TBscore": [0.43, 0.46, 0.5], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["gluten", "waffle"], ["waffle"], ["waffle"]]}
{"id": "xG7W7SpI5_sJQXl-aIciIA", "text": ["This is a great, quick place for a variety of Thai dishes. Great prices and friendly staff!", "There was hair in my pad Thai chicken. A long strand of straight black hair. This was the first and will definitely be the last time I'm ordering from this...", "9 Thai Cuisine seems to be the only Thai restaurant in the city of Newark. It is very authentic which makes this place even better. Their authentic dishes..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "DlbTfJP7qJglF7lOGim2Yw", "text": ["Great food, great atmosphere, great drinks. great service. The even have exclusive parking iHighly recommended.", "Quality breakfast if you find yourself around the way. Don't expect many frills, or formality. Nearly seat yourself and expect to play catch with the...", "There was a time that this place was my absolute go to for a great waffle and decent chicken. Well folks, that time seems to have come to end. I've been a..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], ["breakfast"], ["chicken", "waffle"]]}
{"id": "HM_nsq0WunSfDg5_Wglpww", "text": ["Cheap lunch specials, fast delivery, delicious food. \nI order from this diner almost weekly and will continue to for lunch at work. The price on their lunch...", "We were at our loadin spot and they shooooed us away till later this afternoon !! Sooo we found this place on gps and lucky to get a paid parking at trk...", "Food is ok. But service sucks. 1st Ike I went got a sandwich told them no ketchup and they put ketchup. 2nd 1 week later got same sandwich and they never..."], "rating": [5, 5, 2], "TBscore": [0.53, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["lunch"], [], ["sandwich"]]}
{"id": "wfLjct9L0FmhDFlOjRsAsA", "text": ["I was out in Lyndhurst for business and I needed a quick breakfast before meeting up with my clients. I popped into this cozy diner. Best decision of the...", "Cool old school 1970's style diner. Bar stools at the counter and a few benches.  Visited based on the yelp recommendations,  was satisfied overall.  Food...", "I love this place the food make me so happy . Very clean and cold sandwich is  delicious and so adorable"], "rating": [4, 4, 4], "TBscore": [0.38, 0.0, 0.45], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["breakfast"], ["bar"], ["sandwich"]]}
{"id": "Mp20hVZTxAPznF6XsAetaw", "text": ["Cozy is the first word that popped into my head as soon as I walked into this coffee shop. They have a well thought out selection of baked goods and many...", "This was my first time at this coffee shop and I deff enjoyed it.\n\nThe staff was very friendly. Very nice ppl. \n\nThere are sofa for you to lounge in and...", "Lovely surprise walking into this warm & cozy coffee shop on a cold Sunday morning! Their menu has all sorts of breakfast and lunch items (eg omelettes,..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["breakfast", "lunch"]]}
{"id": "xkQVeHokuuzbOG-2k1qDQg", "text": ["Terrible attitude from the owner and his son. Was on the phone the entire time I was ordering and refused to let me order certain items on the menu, stating...", "This is a great place to eat whether you want breakfast, lunch or dinner. There is never a long wait and you xan eat in or take it to go. I just found out...", "The prices on the wall are not accurate you must ask before you order. The breakfast is good and the  fried fish is good. The owner is not that pleasant I..."], "rating": [1, 5, 3], "TBscore": [0.0, 0.41, 0.48], "normalisedRating": [-0.6, 1.0, 0.2], "keywords": [[], ["dinner", "breakfast", "lunch"], ["breakfast"]]}
{"id": "VYPJ4TatKjAYd8M4UivU6g", "text": ["I always drive past this place and never thought to go in as I assumed it would be dingy inside. When a friend of mine told me it was a great place to get...", "You won't be blown away and you won't hate it. The Stack is a staple and has been around for many years. It gets the job done for sure. The food comes out...", "Food was ok, nothing special. Gyro with a cup of soup (French Onion or Chicken). French onion was good with plenty of gooey cheese on top.\n\nGreek spinach..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["chicken"]]}
{"id": "T02wdF8UV7jmaN092hy1rQ", "text": ["This restaurant is fairly new, as it opened up in September of this year. The place is pretty small which isn't a bad thing. It has a really intimate feel...", "I was initially excited when I got a flyer from this place earlier this week. I recently moved to Newark and was happy to see a new place that served Sunday...", "I had the BBQ ribs there today.  Serving is large.  Staff was very friendly while a bit slow.  Hope that once the place gets going, things will be a little..."], "rating": [2, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "9UksP_mjSsQ-BktxmOdxXw", "text": ["You would think that a restaurant in an airport would at the very least, even if the food is terrible, be fast. In this case you would think wrong. \n\nNewark...", "Clearly the management of this restaurant doesn't care about the consistently bad feedback they receive.\nFirst, there are so many table crammed into a small...", "The service was very poor. We waited for over 30 minutes for our food. We didn't even get to eat it in the restaurant. I had to ask for to go trays because..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "OWQIP93_EKMYgAClLUsLsg", "text": ["Upon our arrival at Newark once checked in we wanted some food & drinks this area doesn't have a lot of options so we gave this place a try. \nWe sat by the...", "I haven't flown to Via Newark because I used to stay in the city.\n\nThis is by far the worst dining experience I had in years. Yelp definitely has something...", "Place is a joke. 10 min wait in line to be seated and then no service/ order taken for another 15 min. Food is average, not staffed enough and zero sense of..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "StsbKxkg7cEUW7CzIP9zeQ", "text": ["Ate there several times. The Pork chops were the best I have ever had anywhere. Fried food, such as fish and such were fantastic even though it's so bad for...", "* Que Beef Burger\n* Thai Twist Tofu Wrap\n* Fried Sweet Plantains\n\nWent to Two Que's Cafe for lunch.  Its a small but comfortable spot.  The server was...", "Great local Union restaurant. Small, intimate space with incredible food. Had some delicious pork chops smothered in gravy with a side of Mac n cheese. By..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["beef", "lunch"], []]}
{"id": "p50aJcI6iHmOSyqhyg0ITg", "text": ["Came here for the first time a few days ago with my sister and it was empty (then again we came maybe a half hour after it opened), and I have to say that I...", "Came here one night after dinner for a little dessert and it was super clean and easy to find... we chose our ice ream and watched the creativity begin lol...", "This place is great! \nWhenever I go there's a huge line but they always work through it very quickly. They're always friendly and willing to help with any..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], ["dinner"], []]}
{"id": "vWsGf4KhhAFngeXOXx718Q", "text": ["As a southern, creole woman of color, I don't eat southern cuisine outside of my home, as I can make most dishes myself but this spot....ABSOLUTELY...", "Love this place! \nFirst, the staff was so friendly and helpful. Really great. Second, the place was really clean and had a really nice atmosphere! The vibe...", "Hmmmmmm I am between 3 and 4 stars here . I also came here once \n\nI remember when this place used to be a bar. \n\nAnyway there is metered street parking in..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], ["bar"]]}
{"id": "4fLcYhWvg8yz_8MqvlAo7g", "text": ["This is probably my favorite Soul Food spot. Everything was fresh and tasted so good. Mmm! The Mac n cheese was the bomb, I was very surprised. Tasted like...", "Been here twice. Had the fish 1st time and oxtails my last visit, both had that home made love and taste.The establishment has a homefelt atmosphere and...", "I've been searching for a great soul food restaurant and definitely found it! Raz and her staff were so kind and offered me quality service. They took their..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "e-W2DbfN5N0ev9XGlDg91A", "text": ["The food is not edible.  The whiting thick and over breaded with this strange red stuff...the Mac & cheese was bad, bad, bad\nThe chicken wrap was disgusting...", "Never eat here the food was late, wrong and disgusting . Even tho they brought the wrong items they wouldn't give a refund or exchange. The food used to be...", "I had a craving for shrimp & grits so I got grits, no egg, rye toast and an order of fried shrimp.  They gave me fried whiting, but changed it and..."], "rating": [1, 1, 3], "TBscore": [-0.51, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [["chicken"], [], ["egg"]]}
{"id": "2IGIL3mfZzjBZhYjtFgBNw", "text": ["Love my experience here I was referred to come in from my Uber driver. Me being from New York and living in jersey has been hell trying to find good soul...", "This place had been on my list for a long time and I finally made it in last night and I can tell you I was pleased. I ordered the Ribs Mac and Red potatoes...", "Nah. Save your money. This was a real disappointment and I don't understand the good reviews. Might be family members or friends leaving reviews or paid..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "9nQr7-9WvkfkfAkZiEcAng", "text": ["Lord, glad I ate here before checking reviews (which almost never happens)! We came to Karpollo because our first choice was closed already and had a really...", "Hate to leave a bad review, but this restaurant would not acknowledge my yelp deal that I purchased at $10 for $15. The workers didn't know what to do with...", "Karpollo didn't disappoint chicken was flavorful sweet plaintains great, the rice, house salad and fries were my favorites.\n\nOk 9/18/17 and I am revising my..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.26], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["chicken"]]}
{"id": "sulipN61P85ISTkV-bMeFA", "text": ["Awesome experience \nKids loveddd it\nMy husband as well (until he had to dig in with his hands lol )\nOur team won! \nYes, you can buy alcohol beverages.\nAND...", "First time here! Our friends bought their tickets online and we bought ours when we got there, but because we came together we were still able to be seated...", "I'm gonna feel a bit like the grinch writing this review but my experience at Medieval Times was less than thrilling. I took advantage of a coupon code so..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [[], [], []]}
{"id": "ZYfsV9GGKtfIF-nYODZ9ew", "text": ["I have never in my life eaten such delicious southern food, OH MY GOD. Every single piece of everything we ordered was amazing. It came delivered and it was...", "I've ordered from here a few times and only cause it's the only soul food place that delivers in the area (that I know of at least) it's always...", "I usually get my soul food in Newark but I was craving it and in jersey city so I ordered from the only soul food spot that showed up on my uber eats which..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "r04Qdxj5J7hlHLm3zSDvQg", "text": ["I've only stopped in early mornings and tried a few things on the breakfast menu. Everything is cooked to your liking, flavors and portions are excellent. I...", "The best empanadas in town ! The owner is so nice and welcoming great guy and the food is so inexpensive ! I love this place great food", "Was getting some work done on my car. I got hungry and found this place in walking distance.  Must have passed it countless times will driving up and down..."], "rating": [5, 5, 5], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["breakfast"], [], []]}
{"id": "4uw74HOwcGeAnbbzBWhmQw", "text": ["Awesome little takeout joint in the heart of hillside ! I traveled 20 mins to try their chicken and it was so worth it . The staff was very nice and let me...", "The day the card system is nit working, of course is the day i come for the 1st time. The staff were nice. I tried the meat options. The hillside punch is...", "I love their food and the customer service is always nice. I am sure through all these negative reviews they have grown and remove the bad to give you the..."], "rating": [5, 4, 5], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chicken"], [], []]}
{"id": "x3TMR2rsjQ3fOshgMCjh9A", "text": ["This is a great local ice cream spot! A hidden gem! Its not on a busy street but parking is a bit difficult . It's behind Bloomfield Ave. I come here with...", "Delicious and not rock hard.  Great service\n Eager to let us try different flavors. Clean and\nfriendly too.", "Having this place in walking distance from my job is dangerous, haha. At least if I walk I don't feel too guilty about stopping in. It's a nice little..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "rZO6Kv1_hvAsDnYUA05gPA", "text": ["What can I say about Checkers?!  I love their seasoned fries and their spicy chicken sandwich but not the rude customer service.  Occasionally, if you're in...", "I can't say my experience was good at all, went through the drive thru and had to scream my order out because the worker couldn't hear me. After placing my...", "Terrible experience, and what's worse is it was my boss' first and last time at checkers. They took forever for our food to be ready, and were missing 3 of..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [["chicken", "sandwich"], [], []]}
{"id": "Ost3V94nJNfH7L3o_ymmuw", "text": ["I was walking from JFK Blvd to Ave E on a particularly muggy day and ice cream was required. Yelp to the rescue and lucky for me, this place was a block or...", "Visited the store by chance while walking on the buzzing Broadway roads\nTried a simple Vanilla cone\nIt was probably the best vanilla ice cream I have ever...", "Dissatisfied. The hurricane in particular, which is the only thing I tried, was visually unappealing and the cherry and chocolate flavors were not very..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "zWH_lAPX0_RsQ2PK0PTCQg", "text": ["Should have checked Yelp first, but I was in a rush for a quick bite at Newark airport. \n\nThe burger patty looked like a hockey puck. Didn't taste much...", "Ehhhh. There are definitely better options in this food court. Currently sitting here eating my cheeseburger, fries and an Oreo milkshake and nothing really...", "I arrived early enough for a quick meal before I needed to board. I was 5 minutes before open time (11AM). My bad. \nWhen I returned I was told that only..."], "rating": [1, 2, 1], "TBscore": [0.26, 0.23, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [["burger"], ["milk shake", "burger"], []]}
{"id": "fFHhSFwsftKjVmbM9IZDDg", "text": ["The professionalism this guy Joshua has right now was outstanding. All I got was a drink since I was on my way to work. And he was polite and really looked...", "I was very disappointed. first the lady taking my order was rushing me and rude. Then the guy making milkshakes I saw use a dirty rag to wipe the outside of...", "This sonic was a good spot to go to. The staff were all friendly. The food however was great and flavorful. I love coming to jersey for sonic cause in parts..."], "rating": [5, 1, 5], "TBscore": [0.0, -0.33, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], ["milk shake"], []]}
{"id": "vEn8MGxD1cKXJ3-L4EGUZQ", "text": ["My favorite...\nGelati: A layering of Italian Ice and creamy Frozen Custard. \nI look forward to this treat during the summer months.", "Forgive me for waxing poetic about desserts, but I made my husband drive nearly 5 miles out of the way after a day of errands, so I could enjoy an Italian...", "Absolute Yum! I had a vanilla custard in a waffle cone. The custard was rich, creamy, thick and delicious. I will be returning as long as it is open, since..."], "rating": [5, 4, 5], "TBscore": [0.25, 0.22, 0.21], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["italian"], ["italian"], ["waffle"]]}
{"id": "a_IvxpNASsf_rD0QF1J0Ww", "text": ["Conveniently near the South Orange train station and theater area, I was pretty satisfied with my experience here. The ice cream is a *little* pricey...", "I love Coldstone ice cream.  I'm giving them 2 stars solely based on the poor service at this location. Yesterday was the last straw. My last several visits...", "I have such a great time every time I come in. I love the energy and the happy faces. The loud music and the ice cream!!! Its an absolute match made in..."], "rating": [4, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "am-L0MozOutKySPKILOmsw", "text": ["Horrible customer service. Everyone has an unprofessional attitude. One guy even slammed the the window in my face. \n\nI can't believe a franchise would not...", "Checkers at one time was a great fast food chain having got their roots started in the South and making their way to the Urban Inner city of The NY/NJ area...", "Where do I begin... first of the manager Wendy is the worst! Her attitude is definitely not friendly and she yelled at me numerous times after I asked for..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "ydh7zv5gezSecJZsXgufHw", "text": ["What can I say for a place that has the best arepa de chocolos in town? They are by far the best in Elizabeth. Their bakery is what makes me come back every...", "Antojitos Y Mas is a small Colombian bakery and grill located on Elizabeth Ave. in between Downtown and Midtown. \n\nI usually stop in for their fresh juice...", "This is definitely one of the best Bakeries in Jersey. Upon walking in, I could not take my eyes of the enormous selection of pastries, bread, and sweets...."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "o5_1D3I3C3erCpMSxhl9hw", "text": ["Came here for dessert and was very glad that we chose this place! The people working here are amazing and super friendly!! My friend got the vanilla soft...", "Loved it. The was my first time at a Carvel boutique. I WAS a Baskin Robins customer but I think Carvel just gained a new customer. \n\nThis boutique is...", "health department should give this place another visit.\n\nalthough the ice cream was delicious, there were a lot of things that were clearly out of code..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "K6GsrqxDfukrlJtWEHsvnw", "text": ["My favorite local Colombian restaurant! Came on a Thursday morning and ordered breakfast. I ordered the Calentado con Carne y Arepa con Queso plus 2 fruit...", "The best Colombian restaurant in town and all of North Jersey. I have not come accross a Colombian restaurant better than this anywhere. Everything is...", "I've been coming here for several years, the food is consistently excellent, as is the customer service. I love Noches, but the bandeja paisa here blows..."], "rating": [5, 5, 5], "TBscore": [0.25, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["breakfast"], [], []]}
{"id": "kAXSyXJDZqyPdTTh1VYkKA", "text": ["YUM! Last time we got to order here was New Year's Day. Today we are celebrating our 16th Wedding Anniversary with our kids. This is great comfort food and...", "After my gym workout I felt the need for a few cheeseburgers and fries.  White Rose System never disappoints!  Besides the great taste of the burgers, it's...", "This is your late night after hour place to go if you're in the mood for something to eat. The disco fries were our favorite!! We also had a club sandwich,..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.34, 0.24], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["burger"], ["sandwich"]]}
{"id": "ZR_yXYVp46vmVcYmoKbI6Q", "text": ["C'mon! How can Wawa get a bad review?? It's convenient clean and has hot and freshly made foods. They also make you a fresh cup of Cappuccion with...", "Gas attendants are always friendly, polite and quick!\n\nIn the convenience store, the cashiers are also friendly and quick. The people making your food are...", "A traditional WAWA in all its glory, edging its way up ever closer to the coast. Next stop, Weehawken? I hope you are reading this, Mr. & Mrs. Wawa. \n\nI..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "KCB-KLqrZpRLUbD7Nm9hPQ", "text": ["Food was very good, a little more salt needed but overall good. Fast delivery. Arrived nice and hot. Good amount of side and sauce.", "Came across this place while searching for \"Healthy\" food options, being that Irvington does not seem to have many options for good food, besides the usual...", "Was in the mood for some Salvadoran food and I so happen to fall onto this restaurants page. It was kind of hard to decide what to eat since I've never..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "A0y1PAsSkZX9JqNCQ1OGcw", "text": ["Not bad at all for fast food.\nIt's exactly that ...fast food .\nIf ur in a rush and want a cheap eat?...\nThis is the place to go...\nNo dine in available...", "We were craving a nice treat on a warm night so decided to give Sonic another try even though the last time we came wasn't the best experience. We pulled up...", "First I get 2 disgusting hot dogs that were sour and on stale buns. I go to the counter and the girl takes them back and gives me a hamburger and fries,..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], ["hamburger"]]}
{"id": "b8r5wMVmwNCN9_CzQpKlQg", "text": ["I love it, my husband does not. I prefer their thin burger and I love all their options. Sweet potato fries and a milk shake yesssss", "Another awful experience with SB Glen Ridge. Haven't been in awhile bc service is always a challenge in this location. \n\nToday took the cake and I will not...", "Great place for a burger! I love the bbq bacon cheedar burger and the smash fries. They also have great shakes. It's never super crowded and has plenty of..."], "rating": [5, 1, 5], "TBscore": [0.24, -1.0, 0.53], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["burger"], ["cake"], ["burger"]]}
{"id": "1itdBhW73t1lbsk8auNbiw", "text": ["I recently used Vital for a small office gathering. \n\nThe food was very good. The carrot, ginger and apple juice is so refreshing. The jerk chicken was...", "Sorry to say I was not impressed. And I really wanted to love this place.\n\n1. The prices are ridiculous!! 6 wing dings (3 chicken wings) are 12 dollars!! So...", "Very disappointed... I will preface this by saying this review is in regards to a pick up order.  I wanted to love this place bc I am a Caribbean..."], "rating": [4, 2, 2], "TBscore": [0.0, -0.29, 0.0], "normalisedRating": [0.6, -0.2, -0.2], "keywords": [["chicken"], ["wings", "chicken"], []]}
{"id": "FcoM3IQmOLSC3nZvX5u_EQ", "text": ["Your typical homey New Jersey Diner with comfort food.  Small but cozy and unfortunately very rude waitresses.  I would have given you five stars put we got...", "Can't believe I've gone this long without even knowing this amazing diner existed! As soon as I saw it I knew I had to check it out. Classic diner vibes...", "We came in late one night. It was pretty much a dive to say the least. My boyfriend's fork and his cup was not very clean. We sucked it up cause we were..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "fF60rvc9WvoRIkcOr-qd9w", "text": ["Just went here  the other night for a late bite to eat with my sister & mother. Food was good, and love that your can have \"breakfast \" anytime!\nFood was...", "Ok. So. Updated menu and look. Unfortunalty it seems like the facelift as been just on the surface. I stopped in to grab a smoothie, which I was SO looking...", "So my boyfriend and I decided to stray from our regular diner (plaza diner) and it was a big mistake. I wanted to try something new, and instead I got..."], "rating": [5, 2, 2], "TBscore": [0.22, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [["breakfast"], [], []]}
{"id": "4biVwXdy1oS9q0Cjap-Bjg", "text": ["The food is great!! Really really good, the cocktails are good too (not as good as the food but worth the price).\nThe service is very friendly, been there a...", "I'm venturing out of Harrison because of the new developed buildings I just moved into - anyway I want to see what the neighborhood is like to go out to...", "If you are looking for some good, authentic Peruvian Food then your search has ended!  Oh Calamares is a must visit without a doubt!\n\nWe came on a random..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "wnCChEp4YI6HEPEW_o62cQ", "text": ["Solid IHOP location. Food is always hot, comes out quickly and if you get lucky and get the server we were waited by (can't think of her name) you'll get...", "This has got to be the laziest iHop I've ever ordered from. It seems that they do not care the least bit for orders that are placed through apps like Uber...", "I love coming here because the minute I walk in the door I get a contact high from all the people smoking and dealing weed in the bathroom so by the time my..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "9Tv-HjfR-iGmx5wJ7BPPcw", "text": ["Hit or miss :/  I come to this DD pretty frequently. I blame it on the free coffee from the DD app. Haha\n\nI'm pretty easy going when it comes to my coffee...", "I am definitely a Dunkin enthusiast so it's a must stop at one through out the day and this specific location caters ideally to my needs. \n\nThe location is...", "This place is the nearest dd to my job so i come here all the time.  The guys that work here are pretty cool and give good service, but they dont have any..."], "rating": [3, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "Kqes50benZPTxokJq-sI5w", "text": ["I used to go to this Dunkin' everyday and now it is back on my route to work so I am back again. The staff here are always upbeat and kind and my lattes are...", "They never do what I ask. They dont even know how to make  a cappuccino. They have given me the wrong order several times.", "The best Dunkin around which is why the drive thru is always long. However its  worth the wait. Staff is super friendly and professional. The bagels are..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "hHK6SNWzJIvM-VxfYYfRQQ", "text": ["Although I will always prefer eating at McDonald's, I found that DD was a decent spot to grab a quick hot breakfast. I ordered their Big n' Toasted. It came...", "I usually only go to Dunkin' Donuts when I'm in the mood for donuts, but I was looking for a savory breakfast this time. Having now had the hash browns...", "This Dunkin' Donuts is found in the food court of Terminal A at Newark International Airport.  Had to buy me one last Boston Creme donut before heading back..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["breakfast"], ["donut", "breakfast"], ["donut"]]}
{"id": "GHqCPN9ubtgP5b_nbrJ0NQ", "text": ["Phenomenal service and delicious options. We buy bread pretty much every day from this place. Highly recommended.", "I have been sold too many stale goods up to the recent past. Also, they charge an additional 4% if you use your credit card to purchase any of their goods....", "A coworker brought some donuts and cookies for an office party.  The donuts had the consistency of cake which is a step above Dunkin Donuts for sure. It..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], ["donut", "cake"]]}
{"id": "W92Sp6Mca5qRmG1g-f9OIg", "text": ["Kudos to this location for A) Having a drive thru, and B) Keeping it moving. There's never a wait here. In and out.", "I use to work here for years and I got fired for standing up for a young lady that was being miss treated and got called \"SLOW\" when she is mentally...", "How do you run out of donuts coffee and all Culotta type drinks on a Mother's Day it's only 7 o'clock"], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["donut"]]}
{"id": "rdb0hiygR3S4pTDWy3VtGQ", "text": ["Tiny location.  I have been in walk in closets that are bigger than this...\n\nThe whole place smelled like a dirty wet rag that has been sitting around in...", "Good: the location of this DD is within Newark Penn Station. Staff is efficient and even though there are somewhat long queue early in morning, it moves...", "Located in Newark Penn Station. Convenient to get to. Usually a long line in the morning and right after lunch but it moves. They participate in the DD..."], "rating": [2, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, -0.2], "keywords": [[], [], ["lunch"]]}
{"id": "tyP12eI4YVjo3L7rcEpKpw", "text": ["This is conveniently located right at the end of the terminal so you can grab some food right after you have made sure you not going to miss the flight. I...", "I will preface this review by saying that they are doing their best. However, their best is simply not good enough. Many customers here are trying to grab...", "This dd is by gate 108 or so.  Long line but they cleared it in 4 mins.  Fast service with smiles.  Had my coffee before I slid over to pick up."], "rating": [2, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "0hNeRxotY5D8NN8uzZFyEA", "text": ["I love visiting this store. Everyone is always nice and always have exceptional attitudes. Keep up the good job queens!", "DO NOT BUY ANYTHING FROM THIS LOCATION! All of their milk products are expired. I had just purchased an iced coffee and it tasted like chemicals. Then I...", "This is the 3rd time I've been to this location and have been told they have no donuts . How can Dunkin DONUTS have no DONUTS ???"], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], ["donut"]]}
{"id": "mgd_bLswg74PcD0wpUXhJw", "text": ["I love this location.  The best out of all the dd's in the area. I come here daily. The staff is nice and so are the locals. Donuts and bagels are always...", "This Dunkin and the adjacent Popeye's share the same building on the corner of Passaic and Harrison Ave. This is a busy intersection and the DD is on a...", "Horrible, and rude,,, the place wasnt that busy and employees were unenthusiastic to work,, i just wanted a bottle of coke, \nTge fridge that usually has all..."], "rating": [5, 2, 1], "TBscore": [0.53, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["donut"], [], []]}
{"id": "DhFYvxu1oT7XkDUkmJBEFQ", "text": ["This dunkin donuts name should include crack cocaine or K2. It's always an army of crackheads at the drive-thru begging for money or coffee and donuts....", "I came in here last night at around 1 o'clock in the morning for a large black coffee so that I could put some Baileys in it at my house\nAnd I didn't...", "Croissant Donuts paired with a French Vanilla coffee. YES! Though you can get that at any D Donuts this one is fast... I mean super fast. \n\nFast and nice...."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [["donut"], [], ["donut"]]}
{"id": "GMopalC2Zg2a-JfkVPshOQ", "text": ["I'm pretty surprised at the low ratings for this location; I'm only reviewing drive-thru though. \n\nI've only waiting in line for a long time a few...", "The woman serving us gave an attitude when I asked her if she can add some milk to our two lattes because it was scorching hot to sip. The staff is not...", "I come here because it is really close to my house but the service is horrible. The drive thru never gets my order right. I've gone back to let them know..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "EG1B1-th2riHziXkjn6I7w", "text": ["Extremely convenient location for a Dunkin Donuts. Decently clean bathroom (customers only) and the overall look of the Dunkin Donut is clean and welcoming....", "Strawberry Donuts everything bagel with cream cheese and medium latte swirl caramel. Clean very nice store. Roomy", "ok so i rarely write reviews but im hoping the owner/management checks this! i live right near this dunkin and almost every morning before work, i stop here..."], "rating": [2, 5, 5], "TBscore": [0.0, 0.57, 0.0], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [["donut"], ["donut"], []]}
{"id": "Cjrs8B7AvHAfq9x4ec5Alg", "text": ["This Dunkin Donuts is my go to everyday. Staff recognizes me and starts making my complicated order while I wait in line. They're always pretty friendly.", "This location is convenient in the Gateway building that is connected to walkway to Newark Penn Station. But a lot smaller than other DDs. The participate...", "Tiny little Dunkin Donuts in the Gateway close to Mulberry Street.  Service is OK especially if you get there early.  Like most places in the Gateway it..."], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [["donut"], [], ["donut"]]}
{"id": "3-Ft3pr3G334ENBTRYGXHg", "text": ["So this location may not be the nicest looking DD, but I disagree that it rates the 1 or 2 stars that other Yelpers have given. For me, I compare it to the...", "Stole $15 from us. We placed an order via the app. They refused to fulfill it. Showed them the receipt. They said \"too bad, no order for you.\"\n\nNever coming...", "Lady taking my order didn't put on gloves and whipped her stanky nose. I was so  mad I threw my food away."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "gNrjBgrqANoWBXOUUgaKWw", "text": ["Horrible horrible staff and food. No matter what time you come here be ready for a  long wait. 9 out of 10 times they dont have no donuts but its a dunkin...", "I came here about 5 times already within the past two weeks as it's so conveniently located off the highway and on my way to work.  It has a drive thru...", "Had to pick-up some treats for class. Figured this location would be great as it's on my way to school. I'll admit, I was a fool for actually going into the..."], "rating": [1, 3, 1], "TBscore": [-0.46, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [["donut"], [], []]}
{"id": "fCw3Kp7SqQfkoa2FSaRPXw", "text": ["The worse customer service I have ever seen. The staff is rude and they cant even open on time. I stood outside in the rain for over 30 minutes  waiting for...", "America runs on Dunkin! I run on Dunkin.. once in awhile. Haha. I usually stop by here when I'm in town and I am in the mood for some coffee, and hashbrowns...", "It's smaller than the average dunkin donuts and the room for the line is a small hallway they try to make into a two lane waiting area with a little nylon..."], "rating": [1, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.2], "keywords": [[], [], ["donut"]]}
{"id": "_Nhz41XhRhWXD3h-d66WLQ", "text": ["Really, i got to work in this establishment, the people that work there, are like a family, they will and undoubtedly listen to what you want and deliver on...", "3 strikes and you're out!!! Horrible, nasty, water downed coffee!!! They can't even get the order right!!! How hard is it to make an extra light 3 sugar...", "I wished they had popular American flavors at this Baskin Robbins . They rarely have chocolate chip  & when I went during the holidays, they didn't have..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.3], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["american"]]}
{"id": "KvXJDjBaHhFztpWNSnPaOQ", "text": ["New businesses in Elizabeth are always opening as the city continually expands.\n\nRoc's Cafe may appear to only be a brand new, clean and neat cafe on North...", "Excellent service!!! Really enjoy the service and the pastries!! Ruben is really nice and will definitely return!! My number one bakery in NJ!! Highly...", "I highly recommend everything is fresh made to order i came here often for good portugese breakfast."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.39], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["breakfast"]]}
{"id": "JhslPlsi_WvlXJSixjsRKA", "text": ["I live in the area and have passed this place several times. Bookmarked it a while back and finally made time to go. Family vibe when I entered. Customer...", "Very good variety for a Naija restaurant the food is awesome. Food is good. The decor is not top class but the food makes up for it. \nThe food is fresh and...", "It was an unfriendly environment.The Cashier was rude.I been there a couple of times but I am done and won't be going back then again"], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "-o_RDtmstLzcB62aSiLIQw", "text": ["After 10 min waiting they made me a \"cosmic cool\" pineapple with some attitude. As you can see there's no cosmic here and I didn't complained about the...", "This DD is located right inside Newark Penn Station and offers a full-menu.  Coffee has always been good here-consistent as ever- and the employees are...", "This Dunkin Donuts is located in Newark Penn Station. I commute to New York everyday through this station and come here quite frequently. I order the same..."], "rating": [1, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.2], "keywords": [[], [], ["donut"]]}
{"id": "v4N08YmjW24gj7qaastqaw", "text": ["We found Neptune Bakery & Deli when we were on vacation. They have an amazing assortment of delicious baked goods that made a perfect breakfast before we...", "The Neptune Bakery is a hidden Jersey City treasure! When you walk in, it's fairly unassuming seems like any other bakery or deli but they have a great...", "The custard cups here are amazing! The flaky crust &  the sweetness from the custard is the perfect combination. They are $1.25 a piece and they're honestly..."], "rating": [5, 4, 3], "TBscore": [0.87, 0.29, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["breakfast", "deli"], ["deli"], []]}
{"id": "PgBQ3vaChUVNOH8ggxxuZw", "text": ["Dear Dunkin, stop trying to cheat the tact time by asking customers to pull up then back up to reset the counter.  Just adjust your process to make the...", "Not your typical Dunkin because they had a Baskin Robbins! It was so clean and the whole staff was friendly and ready to help everyone; they all had a great...", "The people who work here lack common customer service skills! The store had promotional material up and out for customers to see but not honoring the..."], "rating": [3, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "Yv4aye4KDaXnYjQ_HSLJjw", "text": ["They unpredictable ...on some days they ok most days slow ..you never know ..they'll have 5 workers and be slow as hell during the crowded times and then...", "They didn't listen to my order, gave me the wrong item, and then told me that I was wrong and had ordered the item they gave me.  I ordered an ice coffee on...", "This is the only place open in the airport during the night shift. Service id fast and with a smile. Coffee was aceptable... but thats it. Doughnuts are..."], "rating": [3, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.2], "keywords": [[], [], ["donut"]]}
{"id": "FPNw_i8FOhLz7_FQf4chbg", "text": ["What a bagel with cream cheese from Dunkin at 4am looks like smh  At least they even took my order, most Dunkin's at this time just don't answer at all. If...", "a WARNING to our police that work in the Ironbound \nplease be careful if you  go to get coffee in the Duncan donuts in  south street.\nas we took our order a...", "The place is clean, efficient, and has parking. The staff is friendly and helpful, and they don't tolerate beggars hanging out in their seating..."], "rating": [1, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.2], "keywords": [[], ["donut"], []]}
{"id": "SNVjVR0jADcxZOZrNZtABQ", "text": ["Enjoyed dinner here last night for a friends surprise birthday. They have valet parking so you don't have to circle the block looking for a spot which is...", "Not a bad spot for lunch.  It's fairly elegant inside compared to the neighborhood where it's located.  Parking can be a chore, but comes with the...", "Entering this establishment, a fish tank can be seen.  There was a bar with about 10 seats and a good number of tables on both sides of the fish tank too...."], "rating": [5, 3, 3], "TBscore": [0.25, 0.42, 0.7], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["dinner"], ["lunch"], ["bar"]]}
{"id": "NHF7T9n4Kun8q7dznjnEPQ", "text": ["Is this the best pizza I've ever had? Not the best \"traditional\" pizza, but Brazilian Pizza is pretty darn delicious! \n\nIf you want a plain slice, you...", "I'm really so appalled by all the one star reviews! I've never had typical brasilian pizza (like in actual Brasil I mean) however - this place is amazing!...", "I have been here a bunch of times with my wife and once with my kids. My kids are extremely picky and rarely eat anything that's \"Ethnic\". So far I have not..."], "rating": [4, 5, 4], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["pizza"], ["pizza"], []]}
{"id": "cSdcG_-5hQb9ID4rr5SWzQ", "text": ["This is a solid old-school eatery.  IMO, Dickie Dee's has the best Italian hot dog in town.  The bread is just right and their onion and peppers taste...", "I remember going to Dickie Dees way back when I was in HS. Haven't been there in a very long time until today (11-30). So I got a DBl Dog minimal ketchup n...", "Love this place! My dad's been taking me here since I was 5. And now I get to share this experience with my 5 year old son. I've been getting the same thing..."], "rating": [5, 3, 4], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["italian"], [], []]}
{"id": "0ptEblu2pBxavB2zajhjmw", "text": ["Bomb.com pizza was fresh great and I got the chicken wings so good not greasy seasoned perfectly my new spot for sure", "Yummy pizza and good prices. I was a little nervous because Themis place doesn't have an online presence, but I should. I posted some pictures, we got pizza...", "Okay pizza for a good price good for lazy days. Good size pizzas as well for the low always order from here if yoyr a teen"], "rating": [5, 5, 4], "TBscore": [0.3, 0.26, 0.34], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["wings", "pizza", "chicken"], ["pizza"], ["pizza"]]}
{"id": "2bBl14HhMwTs7ShetuCPVQ", "text": ["Why why burn the piazza ?? A simple cheese pizza was lacking cheese & the crust was burnt. The pizza was dry and so not worth the $15.15 it cost. Maybe it...", "Let's cut to the chase:Im a foodie.A real one.Hands down the best cheesesteak with onions, green peppers, cheese mayo and fries I've ever had!!!Ordering...", "I order from here weekly for dinner at work. My go to meal is the grilled chicken Caesar salad. Another favorite of mine is the shrimp parm. Delivery is..."], "rating": [2, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [["pizza"], [], ["dinner", "chicken"]]}
{"id": "I0X_zENB0uZGkAh_XJx-SA", "text": ["Very quick and easy. I ordered from an iPad and had my pizza in 10 minutes (probably less, although I didn't count).\n\nIt is slightly confusing that you...", "The place is gross.\n\nI paid 13.86$ with tax for a 12 inch pepperoni pizza. \n\nThe pizza was not burnt but it had a burnt dirty oven taste.\n\nThe food came out...", "Really delicious wood-fired pizza in the revamped food court in terminal C. I customized a red pie and added mushrooms. Delicious !"], "rating": [4, 1, 5], "TBscore": [0.0, -0.3, 0.67], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "bMG94O-x3M9Y66bCQzdecw", "text": ["Nico's food is soooo good at a great cost.  I love the italian chicken cheese steaks.  you get a lot of sandwich for your money and it taste great.  I also...", "Good pizza for a great price !!! Owner was friendly I ordered and picked up all within 15 minutes and cheese didn't hurt my tummy so it was all worth it !", "Haven't tried everything but for pizza you can't go wrong with this place. Huge foldable crispy thin crust, budget friendly. Been here a few times and food..."], "rating": [5, 4, 4], "TBscore": [0.37, 0.61, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["steak", "chicken", "italian", "sandwich"], ["pizza"], ["pizza"]]}
{"id": "Kb8i3ZKJbKk_dQoVB7s9oA", "text": ["Frank's Frank's Frank's I LOVE LOVE LIVE your pizza. It is amazing. Their cheese blend is awesome not gummy and cheap like other pizzeria's their crust is...", "Great food & customer service .Franks son and the head pizza maker together can do 30 people in 10 minutes ! Gotta respect that !", "I have been going to this place since i was a little girl. It used to be the IT pizzeria in Newark, but they have gotten very stingy. Everything is way over..."], "rating": [5, 4, 1], "TBscore": [0.43, 1.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["pizza"], ["pizza"], []]}
{"id": "IXBLE0MvRYJIczkdLvt2lA", "text": ["La Pizza has OK food, good prices and abhorrent service. Besides ordering food from this location uneventfully on several occasions, here's why this...", "I recently moved to Harrison, and am absolutely loving it! Awesome community, easy commute to NYC and pretty close access to all major NJ routes/roads....", "Nothing special about the dining room\nParking is awful \nBut By far the best pizza in Harrison \nNino's pizzeria doesn't compare at all \nThis is the Best..."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "TQy5fLbcf0tKgUdTY5o--A", "text": ["I had to give one star bc although the gyro was super light on the chicken, it was rather tasty. Literally NO chicken fell out of this \" gyro\". For $5.50 it...", "One of the worst service and food I ever had.\nI ordered 4 gyros, the gyro is totally filled with ranch instead chicken.", "Food was cold and frozen which tracks with an order being accepted, \"cooked,\" delivered to the wrong address, and finally delivered to the correct address..."], "rating": [1, 1, 1], "TBscore": [0.0, -0.4, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [["chicken"], ["chicken"], []]}
{"id": "UrlJnjVMYF1GpKhKslobrw", "text": ["This new pizza and Italian restaurant is quickly becoming a Maplewood favorite. The staff is as friendly as can be and the food is delicious. \n\nWe ordered...", "Although Maplewood already has a ton of options when it comes to Italian and pizza this place is really awesome! We've tried a few different pies,...", "Stopped in for a pie last week based on a recommendation. I'm very happy, that I did because what I experienced was a very good start to what could be my..."], "rating": [5, 5, 5], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza", "italian"], ["pizza", "italian"], []]}
{"id": "1FUR_eH97s2pl7Q8_vw4bg", "text": ["I had the Bianca... IT WAS AMAZING.\n\nFirst time here and I'll definitely get back. \n\nYes, $18 is a bit steep for a personal sized pie but it's really the...", "It's not often I have premier level pizza -- that is wood fired. Regular pizza - that it is pretty much every pizza joint in your neighborhood usually does...", "I won't get as breathless about the pizza as some others because it is on the expensive side and to me Razza is the best pizza in the NYC metro area. That..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "9e5-C6_fSckZ_1chSzDO5g", "text": ["Just ate here for the first time during my bike ride home from the gym. I decided to try the buffalo chicken and chicken parm slices as both looked...", "Best pizza in Bayonne by far, every time I try something new I like this place even more, regular pizza, grandma's pie and the white pies are my favorite,...", "Hands down best pizza in Bayonne/ Jersey City area!!!! Cheese is of such good quality! Sauce is very tasty and the crust is perfection! Not to mention the..."], "rating": [5, 5, 5], "TBscore": [-0.32, 0.32, 0.39], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken"], ["pizza"], ["pizza"]]}
{"id": "KVP_6DSGpqCc9zHatnLsCg", "text": ["I've enjoyed everything I've ever ordered from Zi Zia. Some of my favs:\nPizza with sausage and sweet peppers\nFettuccine Alfredo (their Alfredo sauce is to...", "I really do enjoy ordering from here when the opportunity rises. Even their food other than the pizza is really good. It easily hits the pizzeria-craving...", "I went to zi zia today on a whim. I wanted thin crust pizza and have not been happy with anything near my home so I decided to stop off on my way from work..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.35, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["pizza"], ["pizza"]]}
{"id": "4GWxnmBiysTYCqMWlJSwrg", "text": ["Pizza is great. Slices are huge! They dont even fit on your plate. Plain slice $2.\nNot sure how much toppings are. Maybe  $1-3 dollars more.\n\nWhat I didn't...", "Health warning! SERVED FOOD ON A MOLDY BAGEL!!!\n\nI was given a refund but no apologies and the owner didn't even look surprised. There was alot more wrong...", "These guys are a rip off, they charged about $5+ on each slice. Sure the slices are huge, but I didn't even finish it. The pizza quality was terrible, the..."], "rating": [4, 1, 1], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "XyVI14tZJsTQHMJ5Wva1JQ", "text": ["Your lucky you can have Johnny napkins pizza as it's so good it should be reserved only for the gods. \n\nThat's all I gotta say except. Go!!! Just go!!! Put...", "I was at \"Dory's salon\" next door getting my hair done when the stylist handed me the menu to Johnny Napkins. The menu has your basic Italian eatery options...", "It upsets me to have to do this but here it goes.\n\nI always order from Johnny Napkins, we love their food but lately they've been slacking off.\n\nI placed an..."], "rating": [5, 3, 1], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [["pizza"], ["italian"], []]}
{"id": "7Bsc-mnzsYOGFb9VZWHhmA", "text": ["The  pizza to get if you don't  want lame franchise pizza with a real Italian working there.  Something that seems to be rare these days. The sandwiches are...", "Yo their pizza & cheesesteak is amazing!! Trust me ya should come here. The prices are very affordable, you can't even compare the prices and pizza to...", "Disgusting food. Messy and sloppy service. Whoever takes orders DOESNT LISTEN."], "rating": [4, 5, 1], "TBscore": [0.0, 0.57, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["pizza", "italian", "sandwich"], ["pizza"], []]}
{"id": "otC1CbPz3K4V43lKb7xqiQ", "text": ["Might be the best Italian place in Bayonne.  Newly renovated with a nice honey feel.   Pizzamasters in Bayonne is a must go if you are in the mood for some...", "Good food pretty bad service!\n\nI frequent pizza masters pretty often to expect crappy service ! Everyone is always acting like they are so busy ( last time...", "Bayonne Pizza Masters is my favorite pizza place in town.  Cant go wrong with anything on their menu.  Some of my personal favorites are the buffalo chicken..."], "rating": [5, 4, 5], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["italian"], ["pizza"], ["pizza", "chicken"]]}
{"id": "Ow9oEiOXPgcxN5spKOz5tQ", "text": ["Decent enough. Tagliare is available if you didn't get enough pizza on your vacation to NYC. But at the end of the day it's still food court pizza. They...", "The pizza pie is OK, nothing to write home about but still enjoyable. Be aware of the dripping grease when eating these so they don't stain your clothes...", "It's pretty awful pizza by New York pizza standards.\n\nWhich means by almost-anywhere-else, it's edible. Which it is. Barely.\n\nThat said of all the trendy..."], "rating": [3, 3, 2], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [0.2, 0.2, -0.2], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "bRPq-Nmct5bOuOtsu8fC7Q", "text": ["Fast food Mac n' Cheese. What a time to be alive.\n\nHad a few friends over my house on a rainy afternoon, throwing back some beers, and watching the latest...", "Great mac and cheese! I ordered their La Mancha mac and cheese, and it was really good. The nosh size is definitely plenty for one person. \n\nDefinitely make...", "I was recommended to this place by a friend. \n\nI mean nothing crazy to rave about. Average food priced above average. \n\nEmployee wasnt friendly or..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "CWl-eedNeE6tEPNTz52nZA", "text": ["Macaroni Macaroni Macaroni! And Cheeeeese!! \n\nThis review was written mostly while waiting for the food (decor, service, menu, wait-time), and a few...", "I got reeled into trying this place by one of those facebook videos that does a little infomercial on restaurants. Upon seeing gooey cheesiness, I had to...", "Came here about 2 weeks ago, ordered the lobster mac and cheese, my boyfriend had the margarita one. I thought the food tasted really good, his had a great..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "oOsJn3leUnWDfErRWMf81g", "text": ["I had my birthday dinner here last year and they were quite helpful with organizing the details -- which I appreciated. We ordered from the Pre Fixe menu...", "Nice place for brunch, to preface, I would give this place a 3.5 stars, not a 3. Ambiance here is great and it fits all party sizes. I had no idea how...", "Good atmosphere, however  Customer Service is terrible!!!!!\n\nPros: \nThe bar area is nice and bartenders provided great service which is the only reason they..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.7, 0.22], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["dinner"], ["brunch"], ["bar"]]}
{"id": "kVzl49sY2SGuPOPsR4XxiA", "text": ["I was surprised to find a cheese factory on the inside, as well as a small cheese store, a restaurant (located downstairs), and a deli/cafe with seating...", "OK my opinion is probably v controversial but why do people like this place so much?! \n\nI came here for dinner with some friends on a weeknight in the...", "Moved from Seattle to the other Washington (DC) 2 years ago and thought we'd never have the amazing Beecher's cheese again, but after Costco started selling..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.43, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["dinner"], []]}
{"id": "1LIptXhtDh58vAA-QPFL4w", "text": ["Arrived around 9:30pm for a dinner with three friends. We settled on tuna tartare, veggie burger, margarita flatbread, bolognese pasta, squash salad and pan...", "A favorite Happy Hour haunt for great bites and delicious cocktails! \n\nDrinks: Love the blood orange jalapeño margarita- get it every time! True to its name...", "Came here with coworkers on a Friday around 5:20pm.\n\nThe good:\nWe were seated promptly.\nI tried their onion rings which were yummy.\nLove the rose wine\nThe..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["dinner", "burger", "pasta"], [], []]}
{"id": "vbvtWBbO3Q-Q15w7aHxgVg", "text": ["Why does my sweet tooth never listen to my wisdom tooth? Because of Max Brenner's! \n\nTo everyone writing that this is a touristy restaurant with overpriced...", "Eh. There is no good without the bad. \n\nA nice candlelight environment, a getaway from the harsh cold outside. But then if you look around, couples are...", "Reservation for 7:45pm but got seated at 9:06pm. \n\nThey made us close to an hour an a half for our own reservation while we watch other walk in's get seated."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "4GYc1Ld8r4rGQJKz_Qp07A", "text": ["OMG where to start, Spoonbread is by far the soul food place.  I frequented the one on 138 st until it closed and I was heart broken until i found the one...", "Run Punch is good as usual but today was my very 1st BAD experience with my food. I'm disgusted and disappointed!!  My Turkey wings came out cold, I mean...", "I come from brooklyn Olive Hernandez and Mary Mclain am well pleased with spoonbread too. Could cater from brooklyn but fell in love with spoonbread,,will..."], "rating": [5, 2, 5], "TBscore": [0.0, -0.37, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["wings", "turkey"], []]}
{"id": "wqOBqXkMar3xPOHfkWGwDA", "text": ["They have a $10 card minimum which is really inconveniencing given their cheap pricing! I don't want them to raise prices but yikes, lower the minimum...", "If I could give this spot zero stars, I would. The presentation of the food is sloppy and messy. I was extremely hungry, and nothing else was open in the...", "I got the vegetarian dish, which is just 4 sides and a slice of corn bread. The food is nothing special - not bad, but not amazing. However, you do get a..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], ["corn"]]}
{"id": "i_kP_KwZ8xe8_2aGPkjTzQ", "text": ["My girlfriend and I came here for the first time on November 9, 2018 after having had been following their Instagram page for a few weeks. \n\nI was astounded...", "How amazing is StuffedBurger?! It's impeccable! This was the first time I ever came here (11/9/2018), however, I've been following their Instagram page for...", "It honestly takes alot for me to write reviews online but after going to stuffed burger, I now feel it's the only way I can repay the owners for opening..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.3], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["burger"]]}
{"id": "h9rymMeMUMOxQ9d93U0YDg", "text": ["Known for its Michelin star award for Italian food, Baker & co offers great Italian food and brunch dishes. My friends and I made a reservation for a Sunday...", "Situated in the heart of the West Village, Baker & Co is a local favorite for brunch. However, my dining experience there was below expectations. I made a...", "Tuesday evening we hosted a team happy hour at Baker & Co. I had never been there before but it came highly recommend. \n\nThe spot is fairly small and..."], "rating": [5, 3, 4], "TBscore": [0.23, 0.25, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["brunch", "italian"], ["brunch"], []]}
{"id": "JL_p-OHtSEYVfoeLQQgqDA", "text": ["By far one of my favorite places to pop in on an elegant evening dressed in burgundy. Such amazing hospitality through out the years and everyone never...", "Oh Casellula how I love thee. Let me count the ways...\n\nI have been to Casellula 5 times in the past month. Yes I'm a neighborhood gal, but that's only a...", "DO NOT DO BUSINESS WITH THIS COMPANY! THEY ARE RUDE AND DISCRIMINATORY. \n\nThe owner of this establishment will be hear from my attorney this week as I am..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "JXsHJfBAKZT0fG8XkA9Kzw", "text": ["Came to Sweet science on whim for brunch before a party, and im so glad I did! The restaurant stands out in the neighborhood, but also looks like it...", "I don't do a lot of yelp reviews, but if you're going on a date or on a Sunday please read.\nVery mediocre food. They didn't have several options on the...", "The mac & cheese is done to MF perfection!\n\nThe food and service is great here. The wait time can vary on weekends, so try and get there on the early side...."], "rating": [5, 3, 5], "TBscore": [0.49, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["brunch"], [], []]}
{"id": "luA6pI0K6AWU_ivxqykdiA", "text": ["So. Our favorite brunch place closed - 44 1/2 which was just half a block away. But, this was its sister restaurant and despite some lackluster reviews, we...", "Okay. Get ready. This is the best restaurant I've been to in the city so far. The menu was overwhelmingly appetizing. The mule was the best I've ever had....", "Glorious brunch vibes at 44 & X (pronounced \"ten\"). The restaurant excels in all pillars of my evaluation criteria--atmosphere, service, food, playlist and..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["brunch"], [], ["brunch"]]}
{"id": "G7S5zTB7qXw_GvGwq4w0pw", "text": ["Grilled Cheese Heaven. If you are looking for a delicious sandwich then this is the place. There are so many different options. The owner Rick always...", "Don't let this place fool you! It may look like a little shack in the middle of nowhere, but the grilled cheese sandwiches are amazinggggg! They have a...", "This place is great.  Our sandwiches were awesome. The kid behind the counter was a gentlemen who even brings your sandwiches right to your car.  I only..."], "rating": [5, 5, 5], "TBscore": [0.5, 0.0, 0.34], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["sandwich"], ["sandwich"], ["sandwich"]]}
{"id": "JUQ1QYsbsWobgYiPn4zp7Q", "text": ["We've been to Panchita's both for dinner and brunch. This place is great and doesn't deserve the grumpy one star reviews complaining about portion size -...", "New place in town, went in for a quick lunch and was recommended a choriqueso as an app, recommended by the waitress. \n\n\n\nGood customer service. Contacted...", "My wife and I ordered two wet burritos for delivery. The quality of  the food was good and the delivery was timely. The portion sizes were appropriate for a..."], "rating": [5, 4, 4], "TBscore": [0.8, 0.39, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["brunch", "dinner"], ["lunch"], []]}
{"id": "gFtP2675y-ZK_j76DVvqIw", "text": ["Have been coming to this seafood spot for years 2009 to be exact. The food (oil) then I must admit used to sit on my stomach. But for the past 4 years the...", "I smelled the same odor that Freeyah experienced but persisted with our order.  Spouse's catfish was filleted well, my Porgie was partially deboned, mom's...", "I've had the cod and chips 2x so far and absolutely amazing. The staff is super friendly. I'll be back to explore the menu more as time passes since I work..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "9ME7wS8WYdwXRWPuBnyFfw", "text": ["Came in for brunch on a Saturday with 6 others. Service was bugshit fast - drinks, appetizers, mains - and our server was a world beater. So good I couldn't...", "The food was meh and the atmosphere was even worse. We came here for breakfast and i got the challah french toast (first time i haven't finished my french...", "Stopped in after a hard day's work and I wasn't disappointed. Our waitress was incredibly friendly and provided great service and attention to detail. We..."], "rating": [5, 3, 5], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["brunch"], ["breakfast"], []]}
{"id": "f4A-1KEvqbLkcySAFvhnNQ", "text": ["The bbq ribs are fall off the bone amazing. So tasteful. They are expensive but the ribs are better then most spots.", "I had takeout from here and the order was right on time. I have to say that the food is pretty damn good.  They do give quite a large quantity. My only...", "O.K.   I've lived in Bayonne for almost 10 years now and I have never set foot in this place.  Well, last night I decided to give them a try considering it..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "yy8jf3cnbXG4KOLGNJVfig", "text": ["The 3.5 star rating is a little surprising since I thought Burger & Barrel was firing on all fronts. Including the playlist - B&B had the 90s hits locked...", "Burger & Barrel is one of those rare places in New York that makes a well balanced and flavored burger. Both the Double Barrel and Bash were phenomenal....", "A pretty average dining experience. Not disappointing, not super special, just a solid meal. \n\nWe came to Burger & Barrel for dinner on a Friday night with..."], "rating": [4, 5, 3], "TBscore": [0.26, 0.23, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["burger"], ["burger"], ["dinner", "burger"]]}
{"id": "TsiaDFMCRBvZiKk-P3d9vg", "text": ["So had some empanadas at this little spot that's very franchised. I had a Cuban empanada it was cute. I felt it was only pork no real Cuban sandwich feel to...", "It's been a while since I've been to this location I stopped by with a few friends & to my most amazing surprised they now have alcohol?? Omggg simple...", "I needed something to eat really fast and was in Astoria after work, didn't want the normal thing so I stopped here. First off the staff was very nice. They..."], "rating": [4, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["sandwich"], [], []]}
{"id": "EAonyboedxDjYIi5_VL53A", "text": ["Black owned business!! \nCame through for brunch and got the chicken and waffles - amazing. The chicken could not have been better and the waffles was so so...", "They're closed !!! \nWaste of time . No notice came from afar even tho the reviews were weak to be super disappointed. \nYelp should have an option to say an...", "My husband visited on October 11th, around 4:30pm. \nThe food- Unfortunately, they didn't have any greens or cornbread. The food is pretty pricey, in..."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["brunch", "chicken", "waffle"], [], []]}
{"id": "7cISftD8dqwvCk0ZbuSXSA", "text": ["What people have been saying about here seemed mixed but honest. Yes, the service is slow. It can take quite a while for food to arrive (especially...", "Super disappointed in the food here.  Small portions and lacking quality.  The sweet potatoes fries are dry and the rice bowl is small with literally just...", "Worst. Service. Ever. I made a lunch order on Grubhub for a burger and fries for pick up. Grubhub has the option to choose you're temp, so I chose..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, -1.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], [], ["burger", "lunch"]]}
{"id": "axg4l2ssoRrGF_RqDmzr6Q", "text": ["White Maple Cafe is such a nice establishment in Downtown Ridgewood to go for brunch.  We enjoyed our experience greatly.\n\nFirst of all, Downtown Ridgewood...", "Came here on a weekday afternoon with a friend for lunch. \nPlace is modern and very cute looking inside. \nI had the burger, which was good but I've had...", "If you're looking for a cute BYOB establishment in Bergen County then definitely give White Maple Cafe a try.  The space is small, but the interior is cute,..."], "rating": [5, 4, 3], "TBscore": [0.27, 0.52, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["brunch"], ["burger", "lunch"], []]}
{"id": "YOrY7m9-BDM8MfrdeSnmog", "text": ["Fun first visit here, where we enjoyed apps, beer, and burgers on the patio. There was live music, and service was prompt and easy. Parking was very...", "I will stick with 2 stars for this review. Although I have never had any previous issues here in the past. \nWe took my niece and nephew Sunday for dinner....", "The Stage House is a structurally impressive, lively tavern in the heart of Scotch Plains. It's three levels in a rustic Colonial building with an outdoor..."], "rating": [4, 2, 4], "TBscore": [0.3, -0.21, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["burger"], ["dinner"], []]}
{"id": "ecGwxxLjGDDtpRRbK5RAHg", "text": ["Good local spot for breakfast and lunch. The food is consistently good. Never had a complaint for take-out or delivery. Very big menu with lots of tasty...", "I ordered breakfast for delivery at 10:34am this morning, and I'm still waiting for it to arrive. The email confirmation confirmed 45-55 minutes for...", "I placed an order on delivery.com last Wednesday for catering for a potluck at my job I just started. I wanted to make a good impression on my new..."], "rating": [4, 1, 1], "TBscore": [0.22, 0.4, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["breakfast", "lunch"], ["breakfast"], []]}
{"id": "PZKv6Nj9XcA2xB8qNx1p2A", "text": ["Workingman's brunch! We spied the 25c wings listed on the sidewalk sandwich board so we wandered in here, hungry on a hot afternoon. Nice big bar, chairs...", "Came here on a Sunday afternoon , ordered some wings. The wings were really good and not bad for 25 cent wings. The server was really sweet, kind and very...", "This place is terrific in the food department.\n\nThe seating that's visible from the outside is either bar-stools or high stool/table seating.  I'm happy to..."], "rating": [4, 5, 4], "TBscore": [0.28, 0.44, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [["brunch", "wings", "bar", "sandwich"], ["wings"], []]}
{"id": "rKbnm4TOYB1rqY4DCO_1kg", "text": ["Friendly service and good food! I ordered their decaf soy latte and it proved to be great!\nMy friends got breakfast plate and bagels, they love their food...", "Boo.  I'm so disappointed.  I'm all about supporting local business, which is why I chose to meet a coworker here for coffee for our business meeting...", "I thought I walked into the wrong place based on what I read and reviews, but it was the right place.\n\nThe environment is not inviting. It's a tight space,..."], "rating": [5, 1, 2], "TBscore": [0.69, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [["breakfast"], [], []]}
{"id": "N3nJR0zJ6D_Bz9UIQhz8OA", "text": ["This diner is a staple in town. My friend grew up coming here and we decided to grab some dinner here today. Around 6ish, the parking lot was full but...", "I go to the nutley diner for one reason and one reason only....DISCO FRIES\n\nTheres no magic to it, its french fries, brown gravy, and cheese...but they do...", "My boo and I just moved down the street from this diner a couple weeks ago. Last night we got drunk and woke up with a hankering for diner breakfast. We've..."], "rating": [4, 5, 5], "TBscore": [0.35, 0.0, -0.22], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["dinner"], [], ["breakfast"]]}
{"id": "Wn4OJxDd4wZFAZet-eSrhw", "text": ["Came here for brunch with a friend on a Sunday, decided to sit at the bar and we were warmly greeted by the bartender. \n\nHe told us the drink specials and...", "visited here on sunday for lunch/brunch...seated at a high top near the bar as were were told it's less noisy than downstairs...if that is the case i can...", "I was on a business trip when my colleague and I decided to eat at GSAH. When I walked in I immediately liked the decor. It wasn't busy at all - there were..."], "rating": [5, 2, 4], "TBscore": [0.6, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["brunch", "bar"], ["bar"], []]}
{"id": "FEVQpbOPOwAPNIgO7D3xxw", "text": ["I've eaten at this Shack before and ordered a Veggie burger and fries. This review is for my breakfast:\nI really needed some coffee to wake up before work (...", "The original Shake Shack! \n\nGood basic burger, super friendly and helpful staff, fast orders and plenty of seating available!\n\nThe joint is situated in...", "Garbage. Waited over 30 minutes for a shake. Probably the worst service I've ever encountered. And they didn't even have my shake in the queue after 30..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.37, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["burger"], ["burger"], []]}
{"id": "AHVlPpOkiEl9maijGhar-Q", "text": ["I came here for dinner tonight with my mom and sister and we had an amazing experience. \n\nAmbiance: the restaurant was a bit squishy (lots of long tables...", "This was my 3rd time eating here. I didn't love my previous experiences but thought I'd keep trying anyway. \nWe ordered a Caesar salad, meatballs with...", "Meatballs + sauce might sound very simple for an entire meal, but sometimes simple is better! There's a good variety of meatballs (e.g. beef, veggie, pork,..."], "rating": [5, 2, 4], "TBscore": [0.28, 0.0, 0.29], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["dinner"], [], ["beef"]]}
{"id": "LRgB2kEKtBxqIxNksTO_PQ", "text": ["This is hands down the best food and experience I've ever had coming to NYC. As soon as you walk in the door you are hit with wonderful smells, sounds,...", "The restaurant gets 5 stars, my date gets -1star.\n\nAfter walking with a date, a total stranger, the Domino Park, I decided to bring him to this restaurant...", "Overall this is one of my favorite restaurants. The food is fantastic every time I come and I have been coming here for dinner years.This place is perfect..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["dinner"]]}
{"id": "QvQilClGyuKFz08TBsoJNA", "text": ["This spot has recently become my after work go-to spot for Happy Hour. It has a lovely dark, sexy atmosphere but still quite casual. Lots of food options....", "My breakfast: Poached Eggs with Béarnaise sauce, jam on a soft bread. All this combination are really great. This a place that I recommend to eat good, for...", "2018 Review 98/100\n\nReally great restaurant in the back of an adorable market. Delicious foods and drinks. The outdoor patio area is a beautiful place to..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.53, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["breakfast", "egg"], []]}
{"id": "mk3UxnO9MQlJMsr_mMG9yQ", "text": ["Hidden gem in West Village! \n\nWe stumbled upon this place as it's next door to a coffee shop we like.  It was a cold winter day, and were wanting something...", "The original, and still making delicious pizza. We supplemented with a pasta (Spaghetti No. 28) and salad (carciofi), both also strong.\n\nThe service was...", "We booked a reservation for 7 people and they had two tables reserved for us with no wait time at all. We ended up ordering two large 29\" pizzas: the..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.6, 0.21], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], ["pizza", "pasta"], ["pizza"]]}
{"id": "XK8DnTYgZGoZKuihH4_cpg", "text": ["It is both a pity and a blessing that I am 3.5 hrs from Taboon. A pity because a would go back often, a blessing because I would spend an inordinate amount...", "Dinner is great food is excellent Unfortunately when we came back for brunch very poor experience from manager and server.  We received a salad that half of...", "I did some research on great and popular restaurants in NYC and Taboon was one of top results  and since I really enjoy Mediterranean Middle Eastern food I..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], ["brunch", "dinner"], []]}
{"id": "S8OKQ5S40oZ1Rr5RbC0jdg", "text": ["Came during a Friday evening around 8pm and waited ~20 min for a table for two which I think is pretty good for a weekend night!\n\nI somehow always get so...", "I was visiting New York and a friend took me to Motorino for dinner. I really dug the aesthetic and ambience of the place. My friend and I ordered the...", "In all fairness I've never actually eaten there, just ordered delivery a few times, but I've been remarkably and reliably unimpressed. First of all, NY is..."], "rating": [4, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.2], "keywords": [[], ["dinner"], []]}
{"id": "fPJoi_TVRhjBdPYBZS6kXg", "text": ["If you go to Brooklyn- you stop at roll - n - roaster. \nA tradition for many years of ours! \nHands down the best comfort food! \nWe go every year on our...", "This is my go to place for comfort food. I like their roast beef (double dipped in gravy- no cheese). Their Arnold Palmer (half iced tea, half lemonade) is...", "Since I was a kid, I'd love going to Brooklyn with my dad just to be able to get Roll N Roaster. It was a treat considering we hated the drive from Queens..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["beef"], []]}
{"id": "_tHF8-3rbyMesgdkQzB2yQ", "text": ["The atmosphere and the service is amazing. It's such a memorable spot just by looking at it. We made a reservation last minute and during a snowstorm, mind...", "This used to be an amazing place, well worth the 4+ hr wait we've done many a times. However when i went tonight and was sat a dirty dripping table, i knew...", "Pretty cool establishment. The desert options are really what you are coming here for. The hot chocolate with whipped cream is really an art piece. The..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "KaBw8UEm8uZTV6YLsshYrQ", "text": ["This is the kind of low key spot that you want to go to when you want to chill with your friends or a date and you happen to be in KTown. It does get pretty...", "This place is small but it packs a punch. Find the hole in the wall; Climb up a flight of steps; Ignore the handwritten paper messaging doubling as part of...", "The wait is lengthy, but this is a staple visit for me whenever I'm NYC. Have had a couple different dishes here that I've enjoyed. Recall having the squid..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "iBm8YTqNwrddsxWdqLPK-A", "text": ["This little hole in the wall has always had me interested when I visit home as theres usually a line, that also being that it might seat 10-13 people at the...", "If you are looking for a solid Arepas spot, head over to Caracas Arepa Bar.\nI have been here several times and have never been disappointed.\n\nI usually get...", "Caracas can easily be missed, but I highly recommend seeking it out. Your East Village hole in the wall locale (and any other word that describes this vibe,..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "a0IET3_yCFcO36OqGSsisg", "text": ["Eataly is essentially an Italian culinary theme park of joy and sunshine. This is large Italian speciality store with cafes, a patisserie, butcher, and...", "I have often been to Eataly in midtown and downtown for wine and cheese and really like it so\nthis review is specially for their Sierra, the rooftop bar...", "Our Party of six seated upstairs at the balcony. Service and foods were excellent! Pastas, Pizza, appetizers and the $25 bottle of Prosecco was a great..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.28, 0.9], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["italian"], ["bar"], ["pizza"]]}
{"id": "zOmgO8Di9Ui2bQHqSarUKg", "text": ["Great Pizza! \nAnd even Gluten \n\nExcellent pizza. The Traditional is the best!\nThe Margarita was good but different cheese so the taste was just ok. \nIf your...", "I enjoy going to John's but am very clear with visitors that want a NY slice that this pizza does not have the traditional NY crust, but it is very good...", "Sent here by the hotel concierge: I'm sure there's some kickback involved because this place was not nearly up to what she raved about.\n\n1. The beginning..."], "rating": [4, 3, 2], "TBscore": [0.6, 0.36, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["gluten", "pizza"], ["pizza"], []]}
{"id": "4yPqqJDJOQX69gC66YUDkA", "text": ["You must be wondering...best steak in NYC? Is it all just hype and hearsay? Well...I'm here to assure you, that the hype is--in fact, quite real.   So real,...", "Excellent service and excellent food! \n\nOur table ended up ordering bacon, steak for 2, and a caesar salad.\n\nThe bacon is super thick cut and had amazing...", "I began my trip to NYC with dinner at Peter Luger's.  It's décor was as described, however I will add the musty odor emanating from the bar reminded me of..."], "rating": [5, 5, 4], "TBscore": [0.3, 0.53, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["steak"], ["steak"], ["dinner", "bar"]]}
{"id": "KRe0dP1yf46Ig3ZJM9engg", "text": ["If you are concerned about the levels of either calories or cholesterol intake, and are health conscious, this is definitely the place for you. I drove by a...", "Have had a terrific meal.   Hip place - very friendly owner & sandwiches great, and the pastas look great.  \n\nCons:  Limited drink choices & said they don't...", "This place is delicious, delicious, delicious! I had the Calabrese (piadina) and it came piping hot! I actually had to wait a few minutes to eat it, it was..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["sandwich"], []]}
{"id": "sMyhMFkFJXRGQevTtmtGYw", "text": ["Very friendly we're going to let me pay after i ate but i paid prior! Had two slices with sausage and they were good, I'm not a big pizza critic so you'd...", "Got a pepperoni pie and it was yummy. The crust was delicious, which is not easy to find. Great job!", "if you have not heard. JP has the best pizza in this area. I've tried several when in this area. But they won hands down. \nI have tried many kinds and never..."], "rating": [5, 5, 5], "TBscore": [0.3, 0.0, 0.34], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], [], ["pizza"]]}
{"id": "vFpufuM05aMSIQ9eGon6xw", "text": ["I found this place on Yelp when I was looking for a local Italian restaurant, and I'm so glad I did! It's a small place, but definitely a neighborhood...", "Great prices and portions but the food just lacks. \nChicken parmigiana platter was huge and cheap but lacked in flavor, cutlets were dry and unseasoned just...", "I tried Jerry's because of the 5 star listing even though 3 out of the 8 reviews were written by a 1 time check in / 1 time reviewer.\n\nThe customer service..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["italian"], [], []]}
{"id": "g9-wrQqcT_sTMpL2fnT7pA", "text": ["Upstarring this 3 star food because of cleanliness. A gentleman was cleaning all the table regularly and attentive and friendly service from the folks...", "Small portion,  but yet expensive as hell, I understand its the airport but come on man, i ordered a chicken parm and spaghetti,  the chick gave me one...", "Pretty mediocre panini. Very, very salty. Should have gotten a sub at Jersey Mike's or burrito at Qdoba instead."], "rating": [4, 1, 2], "TBscore": [0.0, -0.45, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], ["chicken"], []]}
{"id": "hGHRZEs1GegOB14zoyjRgw", "text": ["Placed an Ubereats order this afternoon and was truly impressed!! I was looking for a healthier option from typical fast food. Finding a good salad can be a...", "Constantinos is definitely being added to my lunch time rotation. It's located in the Five Points Shopping Center, just before the intersection. My first...", "I usually get their Italian Cobb salad here and it's always so good and filling. The turkey meatballs are my favorite thing, it's in a vodka sauce that's..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["lunch"], ["turkey", "italian"]]}
{"id": "F_ENppayXzPhx5ak4BkDgg", "text": ["My favorite local place....\n\nLike the plain pie without cheese.  It's delicious.\n\nThe owner could not be nicer.", "Great customer service. I had a taste for spaghetti  so I Yelp for places in the area. This one had four and a half stars so I had to try it. The navigation...", "OMG Italia Pizza was awesome.  Their pizza dough was cooked perfectly and the red pizza sauce is to die for.  Fettuccine Alfredo was creamy and delicious...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.75], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["pizza"]]}
{"id": "h-K3uSXqRsl8uS--7_FYJQ", "text": ["We passed by Brix many times so we decided to try it for a lazy Saturday lunch. The restaurant is simply decorated but nicely done. There wasn't a full...", "SKIP BRIX AT ALL COST. WOW what a scam. Came here for dinner Tuesday night and the place was mostly empty, apart from rowdy town folk at the bar, salsa...", "Tried this place for the first time early on a Friday night with my husband and 1 year old. Walked in and no one was around, then we were told to grab a..."], "rating": [4, 1, 3], "TBscore": [0.24, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["lunch"], ["dinner", "bar"], []]}
{"id": "vBXSrrjYVhWVyTUD-RH4Xg", "text": ["It was barely 9am and this place was buzzing! Great on a Sunday morning craving for coffee, sandwiches, and sweets.\n\nThis bakery set up feels more like a...", "When I first arrived there, I wasn't greeted nor noticed for about 3 minutes when the place had only two customers and three staff. I decided since it is my...", "I've been eating here for over 15 years and it's always so good. Very good authentic Cuban flavors in their pastries, cakes, and bread! Don't forget to..."], "rating": [5, 1, 4], "TBscore": [0.45, 0.0, 0.74], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["sandwich"], [], ["cake"]]}
{"id": "DM-amphVyVhZAEGRFoAorQ", "text": ["3 stars because their customer service could improve \nHowever their soups, pastries and sandwiches are decent. \nThey have a few chairs & tables if you would...", "We were a little put off by the staff at first, however, the natas quickly made up for any surliness. They are just little pieces of Portuguese heaven....", "Okay.  So what's up with Alvaro's?  Well, they are not a late day drop-by, since they close usually fairly early (I never seen them open past 7p)  They do..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [["sandwich"], [], []]}
{"id": "3r79tzm7dxsMRGhFY9g7Og", "text": ["Their Natas are amazing.  Coffee is great and they even put hot milk in it if you want.  I always stop here to and from Newark Airport to bring a box of...", "Absolutely amazing. Came here twice in April. I love their little pastries. So affordable, cute, homemade from the heart, and delicious. I also had some...", "Nata for nothing am I currently obsessed with Portuguese Egg Tarts.\n\nYeah, it's true.  I am hooked on Pasteis de Natas.  Furthermore, I only recently..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["egg"]]}
{"id": "jPpDG0lh4vKEJ1UBgzb5WA", "text": ["Today I had the opportunity to experience true customer service. To be greeted by such a lovely lady with a beautiful smile made my experience pleasurable....", "Decent selection of items. A bit small to eat-in, the lines are annoying and uncomfortable to stand in if one forms. Overall pretty good ! Try out their...", "Typical cafe, just recently added new pastries and updated their menu! Nice place to go to study time to time since they really arent that crowded."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "jRmvhXnot1zQqg8imGZlog", "text": ["First of all, SUPPORT LOCAL BUSINESSES. \nSecond of all, definitely support minority owned businesses. \n I recently learned about the Tripleta sandwich on...", "Terrible customer service. And you can't even order what you want on your sandwich. The attitude to them is take it or leave it. I've been going there since...", "It's super hard to find this quality of bread and pastries outside of Puerto Rico but the borinquen bakery absolutely nailed it! We drive over 30 minutes..."], "rating": [4, 1, 5], "TBscore": [0.0, -1.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["sandwich"], ["sandwich"], []]}
{"id": "U94kczRJkdN7IxhOOYpSUQ", "text": ["These are the best pastéis de nata in Newark, all of New Jersey and perhaps even the USA. \n\nSimilar to bakeries you'd find in Europe, where after a night of...", "Each time I come I find the quality comes down- either in food or in service, or both\n\nThis time, the lady at the counter decides she is in a bad mood and...", "Pastel de Belem in the US in the City of Newark.... A small but salavating piece of Lisbon Portugal right in the outskirts of the Iron Bound. Love It hands..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "yE2nrGZ9Xyb_oIJeij7A6g", "text": ["Amazing place! Great food! Great people! The best Portuguese bakery in NJ! They are open from  530am to 11pm. It is one of the few businesses that I can...", "I was on the hunt for some goodies yesterday to bring for a friend and my last resort was Arcos. They're open late which is the convenient part. \nParking is...", "Worst baked goods and food I've ever had. The baked goods tasted like they were a few days old and we ordered a cheese steak and fries and the cheese steak..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, -0.37], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], ["steak"]]}
{"id": "-uJ2WMxKqEzn2LMAT6gL3g", "text": ["I know I've reviewed their cakes before, but I have to really commend them for some truly excellent customer service. I wrote to them and asked if they...", "What a great little Bakery this is. They have real Sicilian pastries, but I always come for the sfogliatelle, which are only a dollar. They are crispy...", "Delicious pastries all different prices ranges. My favorite are the chocolate cannolis. Rosalina can make any cake you can imagine. My husband walked in..."], "rating": [5, 5, 5], "TBscore": [0.6, 0.0, 0.5], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], [], ["cake"]]}
{"id": "Df3vQ_4jLyD889giILMK2w", "text": ["They never missed a mark to me! I always order their steak burrito but I've also had their ham quesadilla, shrimp quesadilla and recently their fish tacos....", "I loved ordering here since I've moved into town because the service was quick and food was fairly good... HOWEVER ... I won't be going back due to the...", "I order from here a lot not one I had a complain until today. Food took over an hour and the flautas were not only cold but soggy. Called the restaurant the..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["steak", "tacos"], [], []]}
{"id": "ek0iE-86Qr4H5Kl4cwPIyA", "text": ["Working in Newark used to pose some lunch problems.  Options were limited and not that great.  Then came the Taqueria Autentica taco truck - typically...", "=== Your wait time is: 30 minutes. ===\n\nThis is something I wish we had been told, prior to nonchalantly placing our order for a basic pork torta.\n\nHalf an...", "Loved the food, but the owner of the truck is one of the most rude and unprofessional people we've ever come across. I'm willing to overlook the fact that..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["lunch"], [], []]}
{"id": "dERAmB5qWvxszCCcPaluqw", "text": ["I ordered a Loaded chicken Tostada. They have spicy option as well. So they start with the basics and allow you to top it off with whatever you want. Paid...", "I love this place, the young ladies are sweet and the food is amazing...absolutely wonderful!  I get the shrimp burrito with the works expect no spicy (I...", "10/10 recommend the food was great and the workers were extremely nice. Kind of had a chipotle vibe but was 100x better"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken"], [], []]}
{"id": "kGbTt5uIdQxQTrJVh9IEag", "text": ["After a long hiatus in Elizabeth, Taqueria Brenda Lee has returned to Elizabeth Ave. \n\nTaqueria Brenda Lee is a famous street-style taco shack, with several...", "Was going to my usual favorite Mexican spot in Elizabeth \"La Cabana\" and fortunately for me they were closed, craving some tacos I strolled into \"Brenda...", "Husband and I were on our way to la cabaña when he noticed this place right before we reached la cabaña so glad we chose to try this place. Once i noticed..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["mexican", "tacos"], []]}
{"id": "ICwNVmtICXCtvBTK027Ftg", "text": ["Two words: chicken. Flautas. \n\nI decided to order from here based on some suggestions from a community Facebook group that I'm a part of, and boy they were...", "I've been here twice and have not been disappointed!! \n\nFood: I had their tacos, Mexican breakfast (omelette, buttered toast , and potatoes) their toast was...", "Randomly found this restaurant as I walked along the neighborhood. I've lived in this neighborhood for a long time but couldn't believe I never saw this..."], "rating": [5, 4, 5], "TBscore": [-0.6, -0.5, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chicken"], ["tacos", "breakfast", "mexican"], []]}
{"id": "s6R7t5hCG8QaJFHEXGko-Q", "text": ["Taco Tuesday?  Oh he'll yea! Dollar tacos make something good even better. \nI love the friendly folks working there. Tacos come with fresh limes, radish...", "!! Taco Tuesday $1 Tacos !!\n\nWandering on Elizabeth Ave. I came upon this restaurant with its inviting trompo in the window, right around the courthouse and...", "Taco Tuesday.  Very friendly people here.  Great first impression."], "rating": [5, 5, 5], "TBscore": [0.47, 0.29, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["tacos"], ["tacos"], []]}
{"id": "RKuWCwXQD-gVckd7Rw5JuQ", "text": ["Busy Bee Roasters is everything that's right about the Ironbound. \n\nHomey and welcoming, the interior alone speaks for itself. Woodcarved tables and chairs,...", "Excellent place for breakfast and meals. Specialized in american and brazilian breakfast , sandwiches and meals", "Great staff very friendly , food was very good and a good price ! Everyone had a smile on their face ! Definitely will be a regular place . Breakfast was great!"], "rating": [5, 5, 4], "TBscore": [0.0, 0.5, 0.56], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], ["breakfast", "american", "sandwich"], ["breakfast"]]}
{"id": "PaKqTeV73sf_mkx536TSPg", "text": ["The atmosphere/decor/ambiance of this place alone is deserving of 5 stars. Great place to relax. Catch up. Do some work. It's really stunning in there. The...", "Decided to give you another chance!\nSaid hello to the barista... Hi , how are you? \nDidn't even receive a response, such a lack of common courtesy! Needs to...", "This is a cute cafe/coffee shop located in the residential area with plenty of seats. It's got great lighting and many outlets if you are looking for a..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "IQYQz1svn6HxgnUP6wCTBw", "text": ["Great place! We happened to find it while being on our way to the airport. Coming from a mix of Turkish and Israeli families, we are hard to impress when it...", "This spot is across the street from my office. My coworker swears by it so I decided to give it a try. Once, I ordered from the grill. I got a chicken steak...", "Came here for lunch with some colleagues. Got the chicken gyro pita sandwich which came with choice of rice or french fries . Of course I went with the..."], "rating": [5, 3, 3], "TBscore": [0.0, -0.6, -0.3], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], ["steak", "chicken"], ["chicken", "lunch", "sandwich"]]}
{"id": "SQRHAkcW7gY5BCHIoGl95Q", "text": ["Great African buffet restaurant.\nHot and spicy food.. some food just taste right!!!\nSo if you love trying spicy African dish , this is somewhere to...", "A taste of back home, authentically and perfectly done.\n\nTheir okro soup is comfort epitomized. And the pounded yam is formed to a perfect consistency....", "Really good African food. Goat stew, chicken and spinach, lamb and rice, sweet plantains and yams. \n\nBig restaurant in a convenient area.  \n\nCash only though."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "S-wgHMUZ_eODGFabjSSpMQ", "text": ["Delicious! I have never had a bad meal there yet.\nThe chicken shawarma, lemon chicken pita and lemon chicken gyro have such great flavors and is delicious....", "AMAZING AMAZING AMAZING!\n\nBy far the best breakfast place in NJ ! i'm a big breakfast lover and this is now my favorite place. \n\nIt was a group of 5 of us...", "This is my every Friday morning girls breakfast spot! We get there at 7am and catch up on our week while having the best breakfast. \nThe look. The place is..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.51, 1.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken"], ["breakfast"], ["breakfast"]]}
{"id": "wY5JlHdplU319FezxDA5Sg", "text": ["Everyone who knows us, knows we love going to new places and if there's a Groupon/deal, we'll try it out (and will continue patronage if the food/service is...", "I'm gonna warn whoever is reading this review that I'm bias. I know the owner Mr Ramiro and every time I come here he makes me feel like a Queen. I have...", "It had  been awhile seen i visited this Portuguese restaurant  in Newark. It is really fantastic and a gem in the heart of DownNeck section of Newark.\nThere..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "-cug98tGiWHM518drPVKMg", "text": ["We were up north for a 5k/turtle back zoo and found Inkosi's Cafe on Yelp. \nSO GOOD\nThe crab cake is one of the best I've had and the buffalo chicken wrap...", "I was starving. Ordered the salmon burger and a side-salad to go at 7:30 pm. \n\nSalmon burger was just o.k. No real flavor or seasoning. The bun was sweet...", "I like this cafe. I came when it first opened and recently returned. Anything fried is absolutely bang bang... \n\nChicken wings!!! I came back for two orders..."], "rating": [5, 2, 4], "TBscore": [0.28, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["chicken", "cake"], ["burger"], ["wings"]]}
{"id": "vlQQKPbVKDUruVoVWYuwJw", "text": ["This is one of the best restaurant. Me and my family have a show to go to and decided to have dinner,before the show. The review for this restaurant was...", "Nowhere on their website nor when we called was this mentioned. So we asked to sit at the bar. Mind you our reservation was for 5:30 so the place was not...", "Very disappointed in the quality of food.. Overpriced. Only one bathroom In the restaurant. Will not recommend.."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], ["bar"], []]}
{"id": "AfbJhLfyNz3irHlcXbMayQ", "text": ["Wow, Finch's to the rescue... came to the renaissance hotel and found this gem inside... great find for sure. Was prepping for a very long wedding day for...", "Food was okay but service was slow and spotty. It is in a hotel so it's why I gave it 3 stars and not less", "I never have high exceptions when trying restaurants which are in hotels. They are usually below average and the service isn't great. This is the FIRST..."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "0v-vS3OkvFZTRFxj6CJdsw", "text": ["My husband and I just got off a cruise and wanted to find food near Newark Liberty airport and found this on Yelp. Great food! The owner was super kind!...", "Place used to be great, havent been there for a while. Went there for a late lunch today. Waitress kept on getting the order wrong although only four of us....", "Every time I visit the Union Office for work, Patio Cafe & Grill has become my regular spot for lunch! I love the friendly staff & owner. The business has..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], ["lunch"], ["lunch"]]}
{"id": "turbVMxppIxu3q4ut29dhw", "text": ["It is obvious that this chef enjoys cooking:  the sauce escorting the food is flavorful,  the food is entertaingly delicious, and the presentation is...", "O my. Please put this restaurant on your bucket list. The escargot and crab cakes are to die for.", "It's ok. It's dated. The decor and the plating are like traveling back in time. The food is good but the service I found lacking. The servers did not seem..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["cake"], []]}
{"id": "_WTnqfA-hdedP8MDkUg9Rw", "text": ["Gotta start by saying I love the decor of this place. Found them on Yelp and made a reservation (turns out I didnt need to today). Was served by Grace who...", "Went there for brunch today and was less than impressed. First, the poor waitress was there alone tending both the bar and the tables seated. What is that?!...", "I really wanted to like Essex Junction, but last nights experience was less than stellar.\nWe'd made a reservation for our party of nine a few days prior,..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], ["brunch", "bar"], []]}
{"id": "ERkKeGst10gRvwG0q6DX3w", "text": ["Delicious! Service was terrific and food was prepared authentic Portuguese and delicious. Ordered 8 different tapas and all were great, favorite was the...", "Horrible costumer service!!!! Stay away from this place   if you dont want unpleasent suprises...\nSchedule a 35 plp party for sunday 18th a week ago, and...", "Excellent food and service. Attractive dining room. Sparse attendance on a Friday night leading me to think this restaurant has not yet been fully..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "qgCU4qcv7d3-NMeWlIF1oQ", "text": ["Best McDonalds in town. \n\nAlways fresh and hot food. Always great service. Always quick. Always clean.", "One of the worst McDonald's there is.\n\nFirst, the phone number is wrong. If you call it it says the number is out of service.\n\nSecond, going there for the...", "The worst , has two drive thru lines completely ignores one . Order is always wrong and fries are never hot . Just plain terrible"], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "J2sfRdn93mK-ckWSpdnPiQ", "text": ["As at 9/29/16 the scanner for mobile offer was not working, but they honored it by not charging the free items.", "Listen to me. This is the WORST McDonald's on the face of the earth. I wish I could give them 0 stars. If you look up the definition of \"incompetence\"...", "Horrible ass McDonald's literally waited 25 min on the drive thru Line while employees giving bad customer service and have side conversations with others..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "yhAYRpB_ic6qOmhZjhR9Mg", "text": ["Playa bowls is life! Its become a weekly stop for me. The service is quick, the ambiance feels like a tiki bar stop at a summer beach, and they tailor your...", "Playa hits the spot every time. I work in Newark and this was my go to spot during the summer. The bowls are unmatched... I'm sorry no one has yet to...", "I love the açaí bowls and smoothies from here! There are so many options available, sure to satisfy every customer. They're always so fresh, presented..."], "rating": [5, 4, 5], "TBscore": [0.33, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["bar"], [], []]}
{"id": "Ivc9Jo6uANCmj43iYbSGKQ", "text": ["This mcdonalds has been improving their service along with their food! Good place to stop by to grab a quick coffee before a 12 hour shift!", "This is a straight forward McDs.  It's on a corner so it's hard to miss.  Drive thru is open 24 hours but unless you live in the area I don't suggest you...", "Stopped here the other day on way to work for a quick bite.  Went to the drive thru.  Thought everything was fine until I opened my bag to see that my order..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "eGvrqzaRBbkBLfVwrJQ8bQ", "text": ["This place is shady!  Buyer beware!!!\n\nI have read many reviews from others that their products are not what they say they are.\n\nBe careful ordering any...", "I bought from this company for the first time following the reviews. \nI received my order of roasted peanuts in a few days, but it's flavor was rancid and...", "Update... my last review was in regards to the slow service, long lines and discontinued small size popcorn.    Lines are a little better, still forced into..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "evBlSaI6xGyuTUFZ44nd3w", "text": ["We LOVE this place for our fruits, produce and snacks. Wish they sold meat :/ \nAlways great prices, it's like shopping at a farmers market! (not the Hoboken...", "Renamed Garden Farm Market.\n\nThey carry items in your usual grocery haul at good prices; vegetables and fruits are in abundance. \n\nFish is available and the...", "I would do all of my food shopping here if they sold meat. \n\nThe produce, especially the herbs, are very fresh. I see them re-stocking it every day. \nThere..."], "rating": [5, 4, 5], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["snack"], [], []]}
{"id": "KwHdSnM5ZMktdlcuB83csQ", "text": ["Great menu and friendly staff. We were here and had to wait a little longer than usual and the owner without any prompting, offered a full refund. Excellent...", "My first time eating here and everything was spot on! Walking into the restaurant I was greeted with the sweet aroma of fresh fruit and friendly smiles. \nI...", "Great experience ! I had the baguette with cappresse , and it was delicious.  I feel the smoothies were I bit much only because it wasn't made infront of..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "mQxPSOaQ2Rl9dUEMD6-oWQ", "text": ["Nice local Italian café. We came here for coffee and desert after lunch on a lazy Saturday afternoon. Friendly service and welcoming casual and clean...", "My favorite place ! Always great coffee and desserts . Love everything here plus the owner treats you like family", "As close to Italian Café you will get. \nFrom the Italian speaking clientele, to the aroma of fresh brewed espresso, to the Italian products on display to..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["italian", "lunch"], [], ["italian"]]}
{"id": "39Q4QccVvVC8BVf2H0aYSA", "text": ["Great place to eat at and the empanadas are to die for thank you Stella for all your hard work keep up with those great tasting empanadas.\n\nEat a pizza...", "Empanadas are so delicious. The ham and cheese one is so yummy!!! The meat has a great flavor as well. Always made fresh", "This is probably one of my towns best hidden gems and can't believe I didn't know about this place before! They sell strictly empanadas and I believe they..."], "rating": [5, 5, 5], "TBscore": [0.44, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["pizza"], [], []]}
{"id": "ie48QfzHWNPMzaIxARFITA", "text": ["You get a two star review because I love the pretzels and the pretzel was freshly made or else it would be a one star for the poor service!  The guy who...", "The pretzels at Auntie Anne's are a guilty pleasure for me, and being stuck with airport food options is a good excuse to indulge. There are a couple of...", "I got a freshly made almond pretzel that had the right texture and crunch I expect from auntie Anne's but the flavor was off. It wasn't as sweet and..."], "rating": [2, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "BDuRXATWGcMv4OE8jKkJ-Q", "text": ["A huge step down from the typical McDonald's experience. The presence of a security guard in the building tells you all you need to know. Crowded lines,...", "Horrible customer service. Really rude workers and we even found eggshells in our egg McMuffin. Avoid this McDonald's place if you can", "I would give them zero stars if that was an option. I used a coupon at the automated Kiosk and it didn't process my coupon for the $1 burger so it..."], "rating": [1, 1, 1], "TBscore": [0.0, -0.65, 0.0], "normalisedRating": [-0.6, -0.6, -0.6], "keywords": [[], ["egg"], ["burger"]]}
{"id": "g4WHUm0lTRmxDimVAyM9RQ", "text": ["I tried the vanilla yogurt. It's a decent price, especially for an airport. But the yogurt is not good. It's kinda chalky and has a bit of an aftertaste. I...", "I wasn't terribly hungry, but my upcoming flight was a few hours long with no snack service onboard, so I wanted to get something to keep me going.  Also,...", "The service is jaded. The fruit looks lackluster and the smoothies aren't as fresh and full of fruit as you'd hoped. But they carry coconut water, have some..."], "rating": [2, 4, 3], "TBscore": [0.0, -0.42, 0.0], "normalisedRating": [-0.2, 0.6, 0.2], "keywords": [[], ["snack"], []]}
{"id": "okwe_8q4jBmqECTnpq19VA", "text": ["Crema is such a gem and it's a really great addition to the neighborhood. Their prices are reasonable and their staff is always friendly. Believe it or not...", "I love Crema so much!! \n\nI am so lucky to live right down the street from such a great business! \n\nCrema is a quality, family-owned local coffee shop that...", "This place was like an oasis in the desert... but with dessert. Womp, womp.\nMy 3 year old broke me down after negotiating for ice cream for what seemed like..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "6HwkVfCBQ7ME57IA3lDX7Q", "text": ["this place blows!!!!!!!! slow gas service, non existent cashiers, filty bathroom, no ice, and the worst car wash in the state of new jersey. avoid this poor...", "I'm all for a business attempting to capitalize on a market but I think this place is too much.  Here is my list of my frustrations: \n1. It's a 7-eleven ;...", "Gone steadily downhill since opened earlier this year. Typical 7-11, slow gas pumps, filthy restroom often out of service. Used mostly by limos and shuttle..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "gXwmEwpLQJNR_rMCT4z6xA", "text": ["This place is ridiculous. Ordered a mean from here through UberEats the receipt on the bag has my correct order but the contents in the bag are all wrong! I...", "This place has terrible customer service in the drive thru. I actually stopped coming here for a while because the teenagers working drive thru played so...", "I always get my order wrong at this McDonald's. I was asked for my receipt and I still got the order wrong. I don't understand how you can mess up an order..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "7D8Gu3eKCwCTxNI9G-qEqQ", "text": ["I got an \"original pretzel\" and thought it was great.  If you're looking for a snack before a flight, I recommend one of these pretzels.", "Most people are not looking for hot dogs at 9:00 in the morning but depends what time you got up. Not quite sure why this chain is a frequent stop of mine...", "How I heard of this place: I am nearly positive that the first time I had ever seen (or remember having seen) an Auntie Anne's was in my teen-age years at a..."], "rating": [4, 3, 3], "TBscore": [0.59, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["snack"], [], []]}
{"id": "xYvVN0u2cfEXs1huw-nyzQ", "text": ["Wifey wanted something healthy before boarding the plane.  Jamba Juice to the rescue!  This Jamba is at the food court of Terminal A in Newark International...", "Loved my apple kale smoothie! Ordered a medium and downed it in about 25 minutes waiting in the TSA line. There was no line and the smoothie delicious but I...", "Whenever I'm here I get the acai bowl it's good as hell and I like the way my dude Rupan makes it he know how it's done lol"], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "WVubi7LzSXi6qWUdRm0Dcw", "text": ["I'm really sorry I had to order from you and make you do your job. I'm also sorry that I had to ask you to repeat yourself, because both the girl that took...", "Worst coffee ever. Rude staff too. It was supposed to be a small vanilla latte, tasted acidic and overly sweet.", "This coffee tastes like chain store coffee. I would expect a more premium product. My latte was cold and the barista was rude. OTG needs to be more..."], "rating": [2, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "Cf_t7vFv2t9tmBZZCMEd-A", "text": ["‍‍‍‍\n\n\n\n\n\n\n\n\n\nGreat food, a great business, and great service! \nIf my emoji demonstration doesn't explain that, then I don't know what will! \nKeep up the...", "3.5 Stars would be more accurate. \n\nThe empanadas are pretty good, I love the sauces especially the chipotle aioli. I usually order the pork/plantain one,...", "I just loved the three empanadas I chose. I have to try everything on the menu.\n\nIm back trying one of their entree's."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "ZaorQF4MIQ4SLLZthEqiqw", "text": ["I came here late one night and the kitchen was closed but the owner Tony, who is Spanish whipped up some of the most amazing food I have ever had in the...", "Checked this place out because, as you can tell, my name is Maite so I was interested. Food was amazing. Tony is one funny guy and the amount of food you...", "Ever since the closing of El Pastor (RIP), my friends and I have been looking for a place for pre-Red Bull match fun. We (literally) stumbled upon Maite and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "eFhC5G8KyXh2tXmNmHoOlA", "text": ["The place is gothic ,but friendly.Nice bartender and a comfortable piece to hangout. If you are a young person,  you may fit in this establishment.", "In a region where clubs come and go with trends, and even worldwide big names like Pacha can't hold on for the long term, QXTs has been open for almost as...", "It just keeps getting better and better.  Upgrades and improvements can easily be noticed as the additional events occurring Thursday to Sunday. PS Sundays..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "Y7azHN-mWLO6GTT4KIMWGg", "text": ["Listening to Jazz. Nice smooth drink and some handmade Cuban cigars with good company!!\nGreat place to go with friends for a good conversation and...", "I needed to meet a client down the block but had to kill 1 hour.   Walked into Jimenez Tobacco and explained I needed to kill some time.  Even though they...", "To begin with this establishment is trash and has horrible service, and is very dirty i have seen roaches and rats running about. the owners are very..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "hhXQLEmD8t-UQyoQxYtSEA", "text": ["First time in NJ and it was a very nice bar. Close to the airport. Very chill and laid back place. Nice staff and great happy hour. Definitely will go back :)", "Blitz sportbar is a great place for after work drink and it's very close to Newark International airport. A nice place for a traveler to stop.  Happy hour...", "This bar sucks.. the girls can't speak English , and you don't get the same waitress so none knows what you i ordered and it becomes redundant. I Had..."], "rating": [4, 4, 1], "TBscore": [0.39, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "zjoHov9SWVHHUk_2zSNzPA", "text": ["My favorite bar of all time. James is a great bartender and very welcoming and friendly. Have a nice menu and knowledge of all beers. If you choice is basic...", "Hidden gem in Harrison! Great beer selection, and yummy cocktails. Don't go here if ur looking for coors light, or a bud. It's not that kind of place. They...", "Very low-key and quiet when I came here (on a Friday evening). I'm sure that changes. Comfortable atmosphere. \n\nThe bartender (believe it was the owner) was..."], "rating": [5, 5, 4], "TBscore": [0.41, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["bar"], [], []]}
{"id": "lJOvVQInzr3O7k5V0fYG8A", "text": ["Very adequate veggie egg white omelette saved my day!  Doubletree next door had nothing open at 10AM. Service was exceptional so I'm kicking an extra star....", "This review earns its 1 star due to the service of the bartender. The wine is terrible and was served very warm like it had been sitting on top of a hot...", "First time here and will definitely go back! Even though it's part of the hotel, they do not charge food to your room so be prepared to pay. I had \" the..."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [["egg"], [], []]}
{"id": "r7ZEMWBOs5idLJ2cmcUivQ", "text": ["Cool spot to get your drink on in the area.  Im a fan of the crabs too!", "Usually come here if I just need a quick night cap and not to mention the food is hands down GREAT!!  Not the place to go if your looking for huge dance...", "Based Only if you get there early. 2 bars which is cool for the size of the place. Ms Emma the barmaid was awesome. Mr Ron aka the lawyer was a good..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.43], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], ["bar"]]}
{"id": "zrG47hxmHhXzWoCxnyV_Yw", "text": ["I tip my hat off to Chef Shon and Chad. This place is definitely going on my list for go to spots for good food. It's a small place so I suggest going on an...", "Soooooo I have to be very honest in saying that at first this was going to be my 1st and last time coming to this place. My co-workers and I decided to come...", "I don't go out much now a days because I work 6 days a week with crazy hours, but I went out with a friend and landed here driving from jersey city....it's..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "_3e0fki1XdLizsRqyKvK3w", "text": ["The ambiance of the lounge is very nice! Good music and AMAZING happy hour drink specials. There weren't that many people there when I went (September 2nd)....", "Dive bar....\nCheap ass drinks served ghetto style in plastic cups but believe me I'm not complaining or judging lol! That's just what it is! 3 dollaz for...", "If you're looking to have a great time at an upscale lounge, with great service, good food, and amazing drinks---this is NOT the place for you. I imagine..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "ezvz1NDFFyPmVnSdCyBtrw", "text": ["Hinchys Hinchys Hinchys....\n\nThe times I've come here they've been full of experiences lol good ones of course! This place is the quintessential hometown...", "Came here for Thanksgiving Eve with my husband for what you can consider happy hour. Did not try the food so this review is based on drinks and ambience....", "Hinchy's is a nice neighborhood bar. A low key spot, it's a good place to just sit down at the bar and have a pint or two. They do a solid pour and there..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "IBJ8hQQRZcf1NbvpCScZYg", "text": ["I found myself at CAPS while waiting for a delayed flight in Terminal C in desperate need of a snack and a beverage. It's the typical OTG iPad setup, this...", "Every single restaurant and bar in the C gate area of a Newark airport is controlled by the same company. Everything is ordered on iPads, staff are...", "Since Newark started to revamp their restaurants, this is one of the restaurants that popped up as a result. It has many seats and a varied Asian/Sushi..."], "rating": [3, 1, 3], "TBscore": [-0.38, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [["snack"], ["bar"], []]}
{"id": "_bdgCNuvyI1JSDZA9zP3jA", "text": ["Ok place to get some good affordable drinks before heading to concert or out. Music and atmosphere pretty live. Would definitely go again.", "Ive visited on more than one occasion...i love it....the food is outstanding......the music is enjoyable....the crowd is nice....the management is  on...", "This place is the small..  the drinks are mediocre but I ordered wings they were great the music kinda old school it has older pple vibe honestly Soo be..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], ["wings"]]}
{"id": "whSS9vQ0z5XziSa4-iESug", "text": ["I visited on a Wednesday, they had karaoke and small good crowd. I asked for a Gin and tonic and it was satisfying. Ordered a savory patato salad dish by...", "Very tasty food . As a Peruvian myself I can recommend this place , food tastes just like in Peru specially the sea food . Big portions good prices and the...", "I was informed about the food of this location by a few friends, I had always passed by the place but never stopped in. I met a customer of mine at the..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "LsMJeXMKRfrLj7Azeq2wDw", "text": ["I've only been there during the day. It's true they give you free pizza. You do have to wait for it. There is a little mini patio out back to smoke or hang...", "I was coming home from visiting my sister in PA and asked my friend in Montclair if he wanted to grab a drink--so he suggested the Pour House. \n\nI...", "This is a really cool local hang out spot. There are two pool tables so you can play some rounds with your friends. The bartenders were very friendly and I..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["pizza"], [], []]}
{"id": "UTmjCWZbZEybUDwn6jLc_Q", "text": ["Awesome little place. Dark and cozy with times playing on the jukebox and great burgers. Just the way I like a nice neighborhood Irish bar. I only went in...", "This place is a Jersey City classic.\n\nThere might be a slice of bias being that I have been frequenting this hidden gem for the past twenty years.  One of...", "My home away from home during my misspent youth. They still make the best burgers in town!"], "rating": [5, 5, 5], "TBscore": [0.23, 0.0, 1.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar", "burger"], [], ["burger"]]}
{"id": "OISIMxbKi48udQPF5LuCew", "text": ["This was the spot to go right after school and still is the best Chinese place in Newark years later! The buffet is very diverse. There is a great selection...", "Nasty ppl and they dont wash their hands after using restrooms...2 employees did it and coughing over food!", "Their food is SO delicious! I would honestly take this Chinese spot over Wok II any day! Their food tastes way better in my opinion."], "rating": [5, 1, 5], "TBscore": [0.38, 0.0, 0.53], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "RBpwDqMpajBLLjMKOPrUxg", "text": ["Authentic Chinese noodle soup and it is an establishment in town \n\nI go there maybe once a month in the cooler months . The noodle soup is really great and...", "Hand made, hand pulled noodles slathered in crunchy, salty, spicy chili sauce. Writing that sentence made my mouth water. \n\nNoodles has a good chew that...", "Tasted the knife cut and hand pulled noodle and I prefer the former as the latter is thicker and chewier. I got the noodle with meat sauce and I felt that..."], "rating": [5, 4, 3], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["chineese"], [], []]}
{"id": "L-eIYrn4DuS0THyWPUMvJw", "text": ["I love their chicken wings and their Baby shrimp with broccoli and white rice great customer service and my food is always hot and done in a good amount of...", "I ordered the beef and broccoli. Im so disappointed, I swear the meat that was sold as Beef was not Beef. It was pinkish. Im calling the Health Department...", "I ordered a pint of rice on the menu for $3.25. Waited nearly 10 minutes and they were not busy. The clerk was arguing and yelling  at a \n customer on the..."], "rating": [5, 1, 1], "TBscore": [0.27, -0.75, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["wings", "chicken"], ["beef"], []]}
{"id": "EvvhcBWjiGC52qTdQfZ_EA", "text": ["For some reason, this FANTASTIC restaurant doesn't have any reviews, so I'm here to give it its first so that the people of Newark will realize the Chinese...", "ew if i could give this place zero stars i would!! i never leave bad reviews but this place is horrible. cool i got my order exactly 20 mins after i called....", "I got fried rice with shrimp and broccoli. The rice was basically yellow rice that tasted unfresh. The broccoli was good. The shrimp smelt rotten. The lady..."], "rating": [5, 1, 1], "TBscore": [0.22, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["chineese"], [], []]}
{"id": "3X0JSpgxQrfwqONnxs17og", "text": ["I Googled Chinese restaurants close to me & China Sea popped up. I ordered by phone & the lady was very hard to understand. She has a very thick accent. I...", "BICYCLE LADY! The Sesame Chicken tastes pretty much the same as any other Chinese joint but I order strictly from here just because the delivery lady...", "I ordered a couple egg rolls and they didn't deliver them to me. After I call and told them they said they would bring them in a hour. Got charged for them..."], "rating": [4, 4, 1], "TBscore": [-0.26, 0.0, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["chineese"], ["chicken", "chineese"], ["egg"]]}
{"id": "1uJrdM4dwK9GTFph3NYl4A", "text": ["One of my favorite Chinese Restaurant in Newark. \nFood is pretty good. One thing I hate is that they always forget 1 thing that I ordered.\nOne time they...", "Panda Chinese is a decent Chinese restaurant with good food. I've only had one thing from here and it was from the diet menu, but overall I was satisfied...", "Curry sauce shrimp egg furong is delicious!"], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 1.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [["chineese"], ["chineese"], ["egg"]]}
{"id": "e65lj5nLniU1CrPWCewsXA", "text": ["This is our near by go-to Chinese restaurant. Sadly, we discovered this evening that it was devastated by a fire early Saturday morning (10-20-18.) The...", "Two of our regular orders are General Tso Bean Curd and Broccoli with Garlic Sauce. Brown rice is $0.75 but worth the extra cost. Delivery is super quick...", "Ordered  sesame chicken w lo mein and came with an egg roll.  Overall - ok. Service was fine. Chow Mein heavy in Soy Sauce but edible . Sesame Chicken was..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [["chineese"], [], ["egg", "chicken"]]}
{"id": "xVPTI1ytXt2PLU-strKcnw", "text": ["I am from sichuan, so I can tell you this place is authentic. Best szechuan food I had in New Jersey/New York region. This is a very small stall. You can...", "Careful - if you blink you might miss this place.  \nIt was cold afternoon, and my PIC and I wanted something spicy.  After checking out Yelp, we found out...", "Good Sichuan place in the area. Very authentic.\n\npretty small but perfect for take out and delivery. try anything you want in this place, won't be bummed...."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "1BJwE4PuPT8s4xoUQy60Rg", "text": ["There are several Chinese food spots in the Ironbound. All you need to know is Ming Choo is the BEST.\nNew location, same phone number!\nFood is great and...", "One day I Order here and the first thing he ask me do I live in the projects & Then he hung up on me then called me off a block number then called me a...", "They hung on me when I asked about delivery then called me from a blocked number calling me a \"nigger.\""], "rating": [5, 1, 1], "TBscore": [0.32, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["chineese"], [], []]}
{"id": "a_bkwamYLgrfBrBC8Zfmzw", "text": ["My family has been getting take out from Amin's since before I can even remember. We may not live in Newark any more, but still come here to pick up massive...", "Love the chicken wings, the shrimp lo mein and the shrimp wonton soup, and can't forget about the homemade tea", "I ate there plenty of times, but I have a problem when the shrimp is not deveined!! Complete turn off and I will never go back!!!"], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], ["wings", "chicken"], []]}
{"id": "nP88tTJ6foWmIfJyK-EujQ", "text": ["I called to place an order for delivery, I was told it would cost me $13 with a debit card. They asked me for information in regards to my debit card so I...", "Not bad !! I was surprised at the free 2litter soda. Had shrimp fried rice and broccoli and shrimp. The broccoli wasn't cooked all the way but it was ok.", "This is the ONLY place I order Chinese Food from. They are Halal and very clean! This is one of the 1st Chinese stores that I have went to and I was..."], "rating": [1, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 1.0], "keywords": [[], [], ["chineese"]]}
{"id": "naeBY_C_skAQmVj1Lc-Edw", "text": ["Food was bland and way over cooked. The steamed dumplings had zero flavor and the General tso chicken had a funky taste.  The pork fried rice was over...", "The location for us is ideal; however the food is \"ok\". Nothing special but if you're looking for just some quick take-out, this is a good option.", "Best Chinese food in town. Favorites are shrimp & broccoli with rice combo; shrimp lo mein; and roast pork egg foo young. Enough food tonight for a family..."], "rating": [2, 3, 4], "TBscore": [-0.24, 0.0, 0.28], "normalisedRating": [-0.2, 0.2, 0.6], "keywords": [["chicken"], [], ["egg", "chineese"]]}
{"id": "QOiBzAc8S62JlaD51eBK7A", "text": ["Great lunch spot.   The pre-prepared food is decent for the most part.  However, the made to order food on the wall menu is excellent.   I love  the sliced...", "My favorite Chinese restaurant in Newark. If you eat here at lunch rush, you'll notice the majority Asian crowd. I take that as a testament to the quality...", "Chef is a good man and alway with big smile. I love fish and tofu most. Beef stew noodle soup is very famous and delicious! Lunch time is extremely busy,..."], "rating": [5, 4, 5], "TBscore": [0.59, 0.0, 0.47], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["lunch"], ["lunch", "chineese"], ["beef", "lunch"]]}
{"id": "v1QBRLaIQc2qa6GJWkyKtQ", "text": ["Their chicken fried rice is so flavorful and good. Their ribs are meaty and flavorful cooked just right. I enjoy their fried plantains never greasy and...", "I ordered out from this Chinese Restaurant. I had vegetable low mein and boneless spare ribs and it was EXCELLENT. The delivery was very quick, the service...", "Ordered take out here a couple times. It was good and exactly what i expected and hoped for."], "rating": [4, 4, 4], "TBscore": [0.0, 0.36, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [["chicken"], ["chineese"], []]}
{"id": "P-GqywRkdDihLtIFllSO2w", "text": ["I'm a huge chinese food fanatic. Not just your average joe chinese. Authentic, unique chinese. The types of chinese that fill your belly with warmth and...", "Pretty good Chinese food. Menu is an odd but delicious mix of Chinese and Hispanic food.", "So cheap and the chicken is tasty. They have parking, yet the neighborhood is kind of dangerous."], "rating": [4, 4, 3], "TBscore": [0.0, 0.3, 0.0], "normalisedRating": [0.6, 0.6, 0.2], "keywords": [["chineese"], ["chineese"], ["chicken"]]}
{"id": "gSDHRQbAxTN7Il2L3M8O9A", "text": ["OUR SEARCH IS OVER...Since moving to Kearny in 2010 I tried several \"so-called\" good Chinese Food places and none even come close to Lily House. Finally!!!...", "After moving to this town and leaving my favorite Chinese restaurant,  I was determined to find another favorite Chinese restaurant close to home. After...", "I don't know what the hype of this place is, the food is so greasy and it taste so weird.  I've tried this place a few times and got different things, I was..."], "rating": [4, 4, 1], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [0.6, 0.6, -0.6], "keywords": [["chineese"], ["chineese"], []]}
{"id": "HUjDE-bkNCDmY-AG4JKkCg", "text": ["I ordered last night for the first time and I will say that the fried rice was delicious.   I am perfectly familiar with Uncle Ben products and it is by far...", "Food was relatively good and the service staff was kind. They seated us in the dining area but I recommend just getting takeout. General Tso's chicken was...", "Was  visiting the hospital nearby and found this spot on the way after work. Chinese food as expected. Tasted good. It's Newark so people were hanging out..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["chicken"], ["chineese"]]}
{"id": "iOpyiK0AdF0egQsWYQukig", "text": ["GREED\n\nOk, so the food is not bad, but I gave the 2 star review due to greed. I was eating alone yesterday and decided to order. Since their website, menu...", "So we are here again trying something new and the smell of it being prepared is just wonderful and the food is freshly done. We enjoy eating here and the...", "the hot sour soup cures your misery and brings summer to your winter. a hefty portion for $5.\n\ngarlic bokchoy, a simple but delicious dish. this one beats..."], "rating": [2, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "J3HZ9lRWK3CA0UoBKtkLqQ", "text": ["Very friendly and reliable people. They give great service.\nThe people are kind and the food is tasty. I highly recommend thiS Chinese restaurant to...", "I love this place! There not in the best location, but it is a gem for Chinese food. The owners/people are very friendly and accommodating with any specia...", "Gross.... ordered shrimp and lobster sauce. Super watery and the chief put sliced fake crab stick slices which completely tasted fishy in a bad way. Threw..."], "rating": [5, 5, 1], "TBscore": [0.41, 0.53, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["chineese"], ["chineese"], []]}
{"id": "fWvcw7zwVtt7izFPcyq4Qw", "text": ["Of the Chinese restaurants in the Ironbound, this one may be the best. \n\nSome reasons why I think so: The broccoli isn't soggy and most importantly, you...", "Food is horrible no meat in wonton .zero star save your money go someplace else a waste of time.", "Not the cheapest or fastest in the category of low-income neighborhood Chinese take out. It is what it is.  Skip it."], "rating": [4, 1, 2], "TBscore": [0.47, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "lCEG8AMaBaRBapHB9ySmcA", "text": ["Been coming here all of my life, really nice people and good clean Chinese food. Can't go wrong with their wings, best wings ever!", "Love their hot garlic chicken because the sauce and ingredients are wonderful.  \n\nAlso, love going there to pickup the fried chicken wings. Ask them to fry...", "Will probably never order from here again, and I'm about to tell you why;\n\nI order from here when I need something quick. It's not the best Chinese food,..."], "rating": [5, 5, 1], "TBscore": [0.36, 0.0, 0.44], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["wings", "chineese"], ["wings", "chicken"], ["chineese"]]}
{"id": "QrFNmQ4X1DuURED-gylZtQ", "text": ["Horrible. Orderrd delivery of sweet and sour chicken and fried dumplings for the office\nThe food was cold even though it's 78 degrees outside.The dumplings...", "Lately the salmon and potatoes have been cold. They need to work on the AC when it's hot outside", "Food is never consistent. Some days the food is way too salty and others it just tastes terrible. Ordered delivery recently with coworkers and food tasted..."], "rating": [1, 3, 1], "TBscore": [-0.4, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [["chicken"], [], []]}
{"id": "mwcwOABV4VO8goqoEfPfjQ", "text": ["By far the best Chinese food I've ever had. The food is always fresh and flavors are amazing. I really enjoy the classic wings above all else, no extra...", "I do not love Chinese food but find that I eat it more often than I should because it's pretty accessible. I was in good old EO and my friend said I HAD to...", "This place has good food, but I ordered food from there the other day and I found a bug in my food crawling around while I was eating my food. I was so..."], "rating": [5, 4, 1], "TBscore": [0.29, 0.24, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["wings", "chineese"], ["chineese"], []]}
{"id": "uDIXQD3CwlibwQeRFMtYCw", "text": ["11/23/15\nThis is one of my top 3 places for Chinese food in the Essex County area. You get service with a smile & the food is always fresh. I love the Mei...", "The food at Golden Garden is delicious! This is one of my favorite Chinese spots when I'm visiting family or in the area. I have been eating out of this...", "The food is not that good and they can definitely improve on their customer service. I will not be ordering from here anymore. I mean why act like I'm..."], "rating": [4, 5, 1], "TBscore": [0.32, 0.45, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [["chineese"], ["chineese"], []]}
{"id": "dZFO4qpiF8RiXE7AMuqWRA", "text": ["I have been ordering here for over 20 years. Food is consistently good. Service is excellent. This is my go to place for Chinese food.", "Horrible customer service. Food was never delivered, and the restaurant refused to refund my money. Thieves, I hope you go out of business.", "Blechfried wontons as hard as rocks.\nHot and sour soup was very sour, no spice.\nChicken and broccoli loaded with msg and so salty my body was..."], "rating": [5, 1, 1], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["chineese"], [], []]}
{"id": "VNlR8hSOYmf1_ZdbAbeNNQ", "text": ["Quick and friendly service with all of the traditional chinese food dishes plus a side menu of spanish & chinese fusion platters", "Place smells Clorox. Ordered bean curd made out of tofu. The tofu is way too dry and very hard to chew. It could very much be a left over food. So I ended...", "This is basically a Chinese takeout restaurant, but they have some other options as well. They also offer Hawaiian barbecue plates and Peruvian dishes.\nFor..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [["chineese"], [], ["chineese"]]}
{"id": "oXU869JMLxCgUfegpEwMZg", "text": ["Eh its alright I've been to better chinese spots and this one is below expectations which doesn't happen too often since most Chinese spots are pretty...", "Fool me once....At best this is a very average Chinese takeout. There is almost no parking nearby. There are two metered spaces and that is it. No place to...", "Not sure why this place gets 4*. It's good but not THAT good. Decent place to pick up Chinese."], "rating": [2, 2, 3], "TBscore": [0.25, 0.27, 0.26], "normalisedRating": [-0.2, -0.2, 0.2], "keywords": [["chineese"], ["chineese"], ["chineese"]]}
{"id": "xbuP6nxSAqRLb7Gp88z29A", "text": ["Trying to find fault here; the sesame chicken had zero sesame seeds on it. That's about it. Egg drop could use salt. Scallion pancake was legit. Egg roll...", "Recently tried the egg roll and wonton soup.  Both were tasty and I will return to try it again. A simple order was incorrect.  I only wanted a pint.  Oh...", "Definitely a step above most Chinese take-out places. The Honey Garlic Spare Ribs are a \"must have\" item. They're unlike anything I've had elsewhere...."], "rating": [5, 4, 4], "TBscore": [-0.6, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["egg", "chicken"], ["egg"], ["chineese"]]}
{"id": "knMH3uSyuiJfn2S2i41QSA", "text": ["I ordered food last night and the delivery service was really fast. Food was warm and good. A lot of food on each order. I Definitely gonna order here again!", "Walked in for the 1st time since I moved to Kearny and did not receive good customer service. The child behind the counter was not attentive and rude. At...", "I ordered duck soup noodle. The duck offered is all neck parts which is full of hormones and not edible.\n\nDo not order here. Low food quality and bad..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "2z5FNjCndda0cuAHuaZxIQ", "text": ["This is a good local place for Chinese American food.\n\nThe buffet is best if you order during lunch time or dinner time when you know that the food is...", "I dont know why this place got such a good review...\n\nThe chicken and broccoli i got, the chicken lacks the usual tenderness from a Chinese stir fried dish,...", "the best chinesse spot ive had in years. this tops all of them, i love tye customer service, its fast and efficient, very clean and organized\nand friendly..."], "rating": [4, 2, 5], "TBscore": [0.34, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 1.0], "keywords": [["dinner", "american", "lunch", "chineese"], ["chicken", "chineese"], []]}
{"id": "Lif5g7EmNR41OT9j7wFA5w", "text": ["There chinese is ON POINT! Im from atlantic city and would only order from one place cus once u find a good china resturant u go NOWHERE ELSE .....\n\nWELL I...", "My husband orders from here almost daily. He loves their food. Sometimes I ordered with him and I've always enjoyed the food so far. Flavors are amazing. We...", "First time ordering from them and the food was AMAZING. I ordered chicken teriyaki w. White rice and veg. I also had extra chicken well done added. And I..."], "rating": [5, 3, 5], "TBscore": [0.23, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["chineese"], [], ["chicken"]]}
{"id": "CvPP4Kzct9fLJfDpYmFQ0Q", "text": ["Only place I will buy my Chinese food. Fresh and very quick delivery. Order is always accurate as well.", "Decent Chinese food... eggroll is ok- since I finally tried it \n\nIf I'm in the mood for Chinese- I'll get an eggroll and tofu and broccoli in garlic sauce", "Service: Great  \nPrice: a LITTLE bit more than other places\nFood: decent\n\nReally nice people working here.  We ordered shrimp egg foo young, general tso's..."], "rating": [5, 4, 4], "TBscore": [0.23, 0.0, 0.24], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chineese"], ["chineese"], ["egg"]]}
{"id": "u-trtwKpPaYBL4asHH25LQ", "text": ["Classic Chinese fast food restaurant that you can not complain about. Normal set up with dingy booths in front of the restaurant and an ordering station in...", "Good chinese food. Consistently good & arrives quick. Disappointed in the chicken rice soup but thats prob not their special. Their general tsaos shrimp is...", "Panda is your standard Chinese food spot but my boyfriend and I have gotten food from here a few times. We choose Panda because it's close to our home,..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["chineese"], ["chicken", "chineese"], ["chineese"]]}
{"id": "9M1HDQkviKYM63Q6L2zE8w", "text": ["This is one of the best Chinese restaurants in the area. I recommend their fried chicken with fries or fried plantains, or the General Tso's chicken and the...", "The food is great but the lady that runs the place always acts like her dog just died.  Also, her toddlers are always there doing homework.", "I went up to the lady working there, and asked for a veggie dish, so like fried rice with mixed vegetables. I also asked if she could give me string beans..."], "rating": [5, 5, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.2], "keywords": [["chicken", "chineese"], [], []]}
{"id": "wInlWQvYswMw2pZG-WQalw", "text": ["Always my go-to spot for the best local Chinese food. Super friendly staff that remember you and your order. You can guarantee consistent delicious meals here.", "The hillside kitchen noodle is superb with many varieties of thin cut vegetables and meats. It's tasty and not greasy.\nMy Indian friend ordered a veg dish ,...", "Great clean Chinese food! NOT STINGY! the lady at the front is the friendliest and sweetest business owner! Would recommend this place!"], "rating": [5, 5, 5], "TBscore": [0.42, 0.37, 0.39], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chineese"], ["indian"], ["chineese"]]}
{"id": "P7i79ltjikKSeCvnXRqUSw", "text": ["Fresh Wings... Love The Food, No Pre-Cooked On A Tray Full Of Grease.... Looking Forward To Eating Their Food Again!!!!", "Ordered the small shrimp and broccoli & everything tasted so fresh. The broccoli was crunchy, shrimp nice, and most of all, the sauce ratio was perfect and...", "My neighbor and I had a late night craving and called at 10pm for a last minute pick-up order. I was really pleasantly surprised to hear a chipper voice on..."], "rating": [5, 5, 5], "TBscore": [0.55, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["wings"], [], []]}
{"id": "LXRdRSqK7A0L_XlqNYarKQ", "text": ["Food is fantastic. Much higher quality then other Chinese/Asian food places in the area. Great for pick up or delivery, not so much for eat in. \n1/2 a star...", "My boyfriend and I were looking to try a new Chinese spot and deviate from you usual. I decided to go out on a whim and try this place despite the horrible...", "One of the best take out places in all of Greenville.  Prices are a little higher than some but remember, you get what you pay for.  Love the boneless ribs...."], "rating": [4, 3, 4], "TBscore": [0.0, -0.28, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["chineese"], []]}
{"id": "Gkz2GawpJCK4j3dENtul_Q", "text": ["I found this on yelp looking to change from the Chinese restaurant I normally go to.  This is a great place for take out and delivery.  I even got my...", "I've gotten take-out from them twice so far, and the food is (mostly) delicious! (and inexpensive!!!) The staff are friendly and eager to help. It is very...", "Delivery time was quick but the quality of the food was meh at best."], "rating": [5, 4, 2], "TBscore": [0.32, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [["chineese"], [], []]}
{"id": "r0RcMNzHpkMOpfJvyFdJQQ", "text": ["My go to  Chinese restaurant. They're nearby, quick and they're reasonable. The food tastes delicious I've never had any complaints when dealing with them.", "I really enjoy the food here. every time i come here, i'm always satisfied! only thing i don't like is that they don't do delivery . overall, number one...", "Not a bad place when you work late at night and have to hurry home with something it's a great place to grab some food they do have an offer where if you..."], "rating": [5, 4, 3], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["chineese"], [], []]}
{"id": "laGdC32pXQLaxTwF8czB9g", "text": ["For airport food, you can't beat this place. (low cost, somewhat healthy)\nEither the sushi or the chicken teriyaki w/steamed rice and veggies will do.", "On a company business trip and wanted to eat Sarku. I could of chosen to eat at a steak house but I hadn't have rice for a while. \n\nThis place seems like...", "Sarku displays nice photos of what they allege each dish looks like. We ordered Teriyaki Chicken with Vegetables. What we got was chicken with about a half..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["sushi", "chicken"], ["steak"], ["chicken"]]}
{"id": "S1TTrMHpOzAYuNwlGLenvg", "text": ["Always greeting me and my family with a smile. Very patient and friendly! Quick at prepping the meals too. Family favorite to come here on the weekends....", "I love this place and their prices are so affordable for it to be located in South Orange!", "I just wanted some quick sushi but I expected the basics ... I order a shrimp tempura most places give you Avacado and celery in the role but they don't . I..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.24], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], ["sushi"]]}
{"id": "kgT5NERrhAImDeo84WoxsA", "text": ["OMG what a treasure in Harrison! An amazing variety of Asian products ranging from Indonesia, Japan, Korea, Thailand to China and more! The produce section...", "Chen's is your typical small Asian style grocery. They have a lot of the typical Asian staples like frozen bao in many styles and flavors, a big fish...", "Has the staples! Vegetables are packed too tightly in the bags though, they get squished and the ones on the inside turn yellow quickly if you don't take..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "6JTE5q_1Zf4EvDQSUiNqIA", "text": ["Vegan hotspot ! \nThe basil fried rice is the best in Montclair ! I opted for extra vegetables not vegan \"Meat\" alternative. (No soy for me .) I frequent the...", "Literally the worst Thai food I've ever had. I'm a business traveler and eat a lot of Thai food. This tasted like nothing, was crunchy in all the wrong...", "I really wanted to like this place. Since there are so few truly vegan options in the area. Tried it twice. Tried a variety of entrees ,apps, sides and they..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "PqCh5tLVds4tMOyREdXdcA", "text": ["5-stars are especially for their SWEET POTATO FRIES!!!\n\nI have grilled chicken platter with sweet potato fries, which also came with coleslaw. :)\n\nYes, I...", "Awesome food truck with a great variety of sandwiches and platters. Must try their brisket as well as their pulled pork sandwiches. Really good...", "Saw this food truck near my job, and I was in the mood to indulge today so I gave it a shot! I ordered the namesake sandwich - the Meatoss, along with an..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.83, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["chicken"], ["sandwich"], ["sandwich"]]}
{"id": "MK7I8PSBczESYGQ3PJIcag", "text": ["I reached out to the NYFTA for a corporate event for a media company and they truly went above and beyond! When it came time to select the vendors we wanted...", "I needed food trucks to cater a specific client project and I have to admit, I was a little nervous about working with food trucks (as an events...", "We wanted to set up seven food truck events to land in a 3-week period this May and June and New York Food Truck Association was the perfect partner to make..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "-HYrr7-Bx-RuQO0Bo0F4iw", "text": ["This place may not look like much, but looks are deceiving.\n\nCame once for lunch on a whim (I'm a sucker for goat vindaloo), then brought my girlfriend for...", "I'm a fan of this local Indian spot. My husband and I tried the vegetable samosas, garlic naan, chicken curry and tikka masala and we enjoyed it! The...", "Went in to try the goat masala and it was amazing. The meat was tender, the sauce was hot and spicy, the rice was fluffy and flavorful. Service was great! I..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["lunch"], ["indian", "chicken"], []]}
{"id": "sOu_0B7CgxYEzwagOh27Tw", "text": ["Had the chili paneer; chicken tikka Masala; samosas; and garlic naan bread .. everything was great but the chicken tikka Masala. Not enough chicken..\nThe...", "Good experience with folks at Biryani Xpress. Place do look a little \nunwelcoming BUT staff were very friendly. Not poshy looking like other Indian...", "We order from here often at work. The food is always on point and so is the delivery. We order from yelp. The Hakka noodles is a must try, naan, butter..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.22, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["chicken"], ["indian"], []]}
{"id": "1jHX_Q79OjC9PtTsnseANQ", "text": ["Excellent food truck choice on NJIT campus. Very fast and nice employees. Bonus is you can call your order ahead. Would like if there were more healthier...", "The food was just okay. For $1 more, just go to sahara grill  there way better. These people didnt even put no salad or pita bread on the side. The quantity...", "Even though this is a truck, the chicken and lamb with the white sauce was amazing. To be honest, it's one of the best halal platters I had. My hat off to..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.32], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "ODpSYoZ8fkaX3UaDzBLhsg", "text": ["Good hole in the wall type place. Seems family run. Service was good, was was really flavorful.", "Staff was rude. When pointed out that chicken was bad, blamed us for wasting food. One particular staff member was preachy on how to eat food. Realized...", "I have yet to dine in and try their buffet, but have relied on them for years for takeout! \n\nOur food has always been very good as we usually order the Non..."], "rating": [5, 1, 4], "TBscore": [0.0, -0.33, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], ["chicken"], []]}
{"id": "omW37-yT6-yjuTCD1IMJ7A", "text": ["Delicious and beautiful lattes! Can't wait to come again.\nThe place gets crowded most of the time especially at night. There are lots of people staying for...", "*Lunch time Review*\n\nListen folks, right around lunch time at the entrance of this little coffee shop is a small indian food stand. GO HERE. I promise you...", "Was going into the buy a bottle of water don't know how it was great saw a cart rite in the entrance serving Indian food it was awesome tried the veggi..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.9], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], ["indian", "lunch"], ["indian"]]}
{"id": "FNhR8BBvxTLYUfAO7V8e1g", "text": ["Ummm hello?? How amazing is this place!! We went right when it opened and we were greeted so warmly. The place is beautiful and smelled amazing right when...", "We used to go here all the time and then the owners changed and the food got way worse. We avoid this place now.", "I got a Mausam flyer in the mail with a revamped menu (and a sign on the door saying new management). Similar to the way Chipotle lets you customize your..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [[], [], []]}
{"id": "_04FYEa8HLjhO-cS8G19Sg", "text": ["I love Indian food... and this place did not disappoint. Searched for local place as I'm new to neighborhood.. ordered take out. Chicken Tikki Masala......", "Intro: A group of 4 of us came here after church. Apparently, the restaurant had scheduled some sort of event that day, so there was a bit of a mix up when...", "Very friendly staff but the issue here is the pricing.\nWe ordered a set of chicken tandoori ( it has 4 small pieces of chicken cuts(boned) and was charged..."], "rating": [5, 2, 3], "TBscore": [0.0, 0.0, -0.24], "normalisedRating": [1.0, -0.2, 0.2], "keywords": [["indian", "chicken"], [], ["chicken"]]}
{"id": "lz4lljmw2kdx3B3nQ2dKHw", "text": ["Hands down a 5 star experience! Great for both Americans and Indians alike. This place was highly recommended via word of mouth, and it did not disappoint....", "I would say this is one of the better Indian places in Montclair.  I ordered the Lamb Korma and the Paneer Makhani.  The sauces for both were really...", "Goat curry and chicken tikka masala is amazing!!!!! So happy I ordered from here. Will def be coming back!"], "rating": [5, 4, 5], "TBscore": [0.0, 0.35, 0.3], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["indian"], ["chicken"]]}
{"id": "S6r0P0PItA9EYHV1nCiQgg", "text": ["Omg the food here is just amazing!! so flavorful that I did not want to even sip on water after I ate since I did not want the lingering taste to disappear....", "This is an authentic Indian food kart.\nThe flavors feel so real and fills your mouth with the real taste. The food is hot and filling.\n\nAlso not to forget...", "Great quality, authentic, and the service is phenomenal. Highly recommend their vegetarian and meat options, the food is restaurant quality, if not better..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.29, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["indian"], []]}
{"id": "nQfPwIasXCi8NwNKq65vfw", "text": ["How come you guys do to be always smiling and friendly? :) Thank you Minakshi, Yuvaraaj and all your family for your work.\n\nHave been coming for years at...", "Mysttik Masaala serves up fresh, hot Indian lunch platters and snacks for a really affordable price. This particular review is for the new cart they set up...", "Delicious food, quick service. I tried the veggie meal and the chicken meal. They were both piping hot with the right amount of spice and flavor."], "rating": [5, 5, 5], "TBscore": [0.0, 0.21, 0.25], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["snack", "indian", "lunch"], ["chicken"]]}
{"id": "CqE_BNtAr0Y45yiDIN_Oow", "text": ["The food is really good! Tastes like grandma's. And I really like the selection of drinks they have. Wait time is a bit long, but it's definitely worth it.", "The food here is good but the front store service sucks. I ordered from here twice and the first time the server gave me a very thin plastic bag. The bag...", "It is 11:26 and I am currently sitting in my car outside the restaurant. They were supposed to open at 11:00.  I have been to this establishment many times..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "CjDtZLx2USjMY9l_YVOksQ", "text": ["This place is great and authentic. Just finding out that it is run by the same owners as Natraj, so it's not really much of a surprise. \n\nI have a special...", "Really great place!  \n\nIt's a bit disconcerting how incredibly large it is.\n\nSame owners as Natraj Palace - moved here.", "My family went there for the 1st time for the dinner buffet only to find out they only have lunch buffet 11-3 as the dinner didn't go so well and they..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], ["dinner", "lunch"]]}
{"id": "z5z6_y69b_ufy73GZUt7Tg", "text": ["Okay, this is by far my FAVORITE place to get some South Indian grub. Excellent Mysore masala Dosa (well spiced palya, spicy coconut chutney, good sambar)...", "Dosa was great bt too much wait.. they should plan on increasing workforce as there is huge demand for Raghu's dosas and coffee.", "Horrible quality. Better off going to journal square. This  place survives because of the location. Not because they have good food."], "rating": [5, 4, 1], "TBscore": [0.56, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["indian"], [], []]}
{"id": "jp7Fn_eU2T90sVqMU_zKlQ", "text": ["Im so disapponted asked for oxtails & Chicken look at this sloppy mess we got how you gonna give out kneck bone passing it off as oxtails i will never come...", "Ive been wanting some Jamaican food everyday. I live right down the street from Golden Crust but by the time you finish cussing them out for trying to give...", "I haven't tried anything too crazy yet just because I'm slowly getting into Caribbean Food. So far I've tried the beef patty with coco bread. Looking at it,..."], "rating": [1, 5, 3], "TBscore": [-0.4, 0.0, -0.27], "normalisedRating": [-0.6, 1.0, 0.2], "keywords": [["chicken"], [], ["beef"]]}
{"id": "kk-Tm4qhAmlUtZwO7JFYRw", "text": ["Best alternative for halal guys in NYC! Love that it's cheap, fast service & they give you lots of it. For $7 you can get chicken or chicken/lamb over rice...", "After driving 13 hours home for the holiday, I was told that I was responsible for dinner and gyro king was a suggestion.\n\nI have to say that the pictures...", "I love this place... i think in my opinion, it's better than the Halal Guy in the city... you see how they cook their meat, how they patiently chop up their..."], "rating": [5, 4, 5], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chicken"], ["dinner"], []]}
{"id": "R1hRLBVYITw5aIkLa58xFQ", "text": ["I agree with some other reviewers, this place is more about quality over quantity.  It has a home-cooked essence to it and I feel like it's the \"healthiest\"...", "Horrible!! Do not go there! Save yourself the trip! Expired soda - Flat, requested a new one still flat! Ordered Tropix Special Fried Rice - $14...except no...", "I am so excited that this place opened! I've been waiting for them to open for a while. I was worried the food wasn't going to be good, but I was wrong...."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "iSiOfm9CdUhbS0eDHPHUNA", "text": ["If your into hot buttery crusty dough and authentic flavors of curry and Indian spices and then some sort of amazing bomb sauce on top of that then this is...", "Super tasty. Only had the chicken Puri Bhaji, but it was like a flavor explosion with every bite. I'm already craving more. \n\nGuy inside the truck was super...", "This is a food truck, not a cart, and there is a difference. I definitely love the typical street cart chicken over rice, but this place was higher quality..."], "rating": [5, 5, 5], "TBscore": [0.46, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["indian"], ["chicken"], ["chicken"]]}
{"id": "lNdt767ZOi8Uy4-7rpFwZg", "text": ["The food is amazing in this quaint restaurant. I have been here several times over the years and the food is consistently delicious.  Maklit the owner of...", "People are pretty obsessed with this place but it was def not my cup of tea. The owner gave off a pretty rude vibe, not sure if she was tired or if it was...", "I saw about ethiopian food on food network on triple D and thought oh I'm going to try that one day when I go back home. I came home for the holidays and..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "UtknyDJ_DPut-FKRqs0wpQ", "text": ["So we couldn't decide what to eat on this 13 degree evening so we yelped it. My husband kept saying, seriously we are in NYC and we are gonna eat from a...", "Was pretty apprehensive to try a halal food cart I found on Yelp...my somewhat fickle stomach can betray me in a heartbeat.  I mean, come on though, how can...", "Used to come here for years, and even after stopping, the moment I pop by they remember me and my old orders. Customer service is really top notch and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "HwvG1FXbVunyHOZCYZSblA", "text": ["I love this little Pakistani market on my corner!  They are open until 10pm every day, and they make really good pizza.  Asma, who is always at the...", "Great for quick Pakistani groceries plus fruits and veggies.  They even carry Pakola (green cream soda and the syrup) and spices and pizza (I don't like the...", "Let me start with saying it's a one stop shop to buy Pakistani/Indian groceries, Halal meat, frozen food, and they make an excellent pizza! Prices are..."], "rating": [5, 4, 5], "TBscore": [0.24, 0.31, 1.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "CcncHLot-nt8qECbw3SNsg", "text": ["My fiancé frequents this place for there amazing vegan food!! We shared the vegan pizza and wow was it amazing. I also had a shrimp wrap and it was very...", "Too expensive. Hands down. And the added fee for using a debit card is so crazy to me. Food was good, not phenomenal. The children of the owner are the...", "Hands down, Andrew's Cafe has the best Vegan Burger and largest variety of awesome Vegetarian/Vegan desserts I've found in NYC or DC areas! \n\nHaving moved..."], "rating": [5, 3, 5], "TBscore": [0.46, 0.0, 0.61], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [["pizza"], [], ["burger"]]}
{"id": "tG3ojlIvdbf79RXrO2oGKQ", "text": ["The quest to find the best halal cart never ceases!\n\nI was sitting at my desk 12am at night looking for a cart still open. Bam, Gyrohouse was open! and its...", "Very delicious. $7 for chicken and rice which is a little pricier than some others but the quality is higher. There's a sister cart on Ann and Broadway that...", "Outstanding quality and generous quantity...and fresh chickpeas, fried onions, cucumber etc makes this unique! I visit here because it's close to my..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "I4_ANKut1sBHCSVFl2_Lhw", "text": ["Daily Buffet 8.99 of Indian/Middle Eastern food between 12 pm - 5:30 pm is what I tried when entered this place. Actually I did notice that the open sign is...", "Terrible food. Got a chicken roll that didn't even look like chicken and taste like it was microwaved and serve to me. Yuck", "Really authentic Pakistani food. I live and die by this place. Not for haters! The food is genuinely fresh and it tastes amazing. If you're picking up call..."], "rating": [3, 1, 5], "TBscore": [0.0, -0.73, 0.0], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "o_KYjDny8D1_PXPNS9r5_A", "text": ["Food has lots of flavor. Burritos are HUGE. Guac is fantastic. Empandas are nice and crisp. The inside gives off a very authentic feel. Service is friendly,...", "Came here on a Friday night. We were a little skeptical bc it was dead when we arrived. Parking was a bit tricky in the area. As I read the reviews now, I...", "A little hole in the wall. Food was made fresh, not oily. The guacamole needs a bit more salt but that's for my taste. The lady in the front was nice, we..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "BAIS49qt0cuOYs8FueCoxQ", "text": ["I need to come here more often. I eat here about two times a year, usually on a stopover from my job in East Orange on my way home to Summit. The chips are...", "This establishment is staple in South Orange. Everyone from the area knows about this Mexican spot Nd you should definitely visit it. I gave it 3 stars...", "The chicken fajitas were very tender and the onions and  peppers were perfectly cooked.   I would have loved a side of quac/pico/sour cream for my fajitas..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.33], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], ["mexican"], ["chicken"]]}
{"id": "gPW5eNH8I-zHQYFyBlz8xA", "text": ["The food is good. Tacos were authentic. My issue is the lack of service. I waited about twenty minutes for the bill which I found annoying. Would've given...", "I've been here twice now--once for takeout (10/30/16) and earlier today for lunch with a couple of others--and I can finally comment on a handful of items....", "Con: service, don't come here on a rush \n\nPro: delicious, authentic, love the guacamole, did i mention the guacamole?"], "rating": [3, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.6], "keywords": [["tacos"], ["lunch"], []]}
{"id": "DGDgn4lEjpKkMW8U1lzHxA", "text": ["My husband and I  love this restaurant it's our go to for a chicken bowl and friendly service it's replaced our stops to chipotle and moes. It's is much...", "Got delivery here and it was fast and efficient. I got two bowls - one salad and one rice. Both delicious! I loved the portions. They did not skimp on...", "I've ordered from here both delivery and pick up and I have to say - they're doing it right! \n\nI love the fact that they're hitting two of my favorite..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chicken"], [], []]}
{"id": "z8xv57tuTqase-tZdO4ggQ", "text": ["This place wasn't great, but it wasn't terrible either. It basically exactly what I expected from an airport cafe. The menu is limited, and not exactly...", "Ugh, run, don't walk away from this place. I wish I had looked at the reviews before going in, but there's really no choices once you get beyond security...", "Would love to take pic of food. If employees cared more for customers than chatting to one another- it might have a chance. First lets start with the sign..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "ylyhBmDtnd3__v2rszjeRQ", "text": ["How is this place even open?! It smells like rotten crotch and the bartender is a rude biatch! Nevertheless all the food sucks", "Horrible. All of the food we got was gross and my nachos came out cold. They told me the nachos were \"different\". I wasn't aware that meant inedible. I may...", "i don't care how friendly you are, how strong your sangria pitchers are, how good the chorizo is... please for the love of god ...invest in a toilet seat..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "oTeYKFjfZd0PzpK5LmMXFQ", "text": ["I stopped by for an early lunch on a cold day. The sopa de mariscos hit the spot. I also tried the ensalada de pulpo. It was okay, but it was really just...", "I got put on to this spot by a high school boyfriend. His dad at the time was half partner, not sure if he still is. But man oh man, this review is solely...", "I've been going here since I was a kid. About 20 or more years. This is my dad's spot and now as an adult I go here with my kids. This place is awesome. I..."], "rating": [4, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["lunch"], [], []]}
{"id": "yFLjlR0OU7fxjz2ra8ExDw", "text": ["Last night in town and I'm starving! I go in for a late lunch and see guys filling up the bar some sort of soccer/football match has everyone captivated. I...", "The first time my girlfriend Nancy took me here for the sangria and the latin dancing.  Her friends claimed it had the best sangria in town and the band was...", "Excellent restaurant - food was delicious, Sangria was great, live music was excellent and the host Tony was wonderful! My brother is in a wheelchair and..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["bar", "lunch"], [], []]}
{"id": "6WOzgetw2JVW2lsZzr_MzQ", "text": ["Second time ordering from here. The people are nice as well. Super fast delivery. Fair prices and food is good quality. Definitely recommend.", "One of my favorite Chinese food spots. I go on lunch break sometimes to order sautéed veggies and I appreciate how kind the people who run the restaurant...", "The food has been good, but the delivery has been better. I have waited over an hour for a delivery that is a few blocks away. I went there to place an..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.37, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], ["lunch", "chineese"], []]}
{"id": "7qsttCwhxJut81XU0wHhtg", "text": ["Maybe I'm spoiled coming from Manhattan but I don't know...$12 for a mediocre salad that wasn't even tossed or chopped? I should've waited until I got back...", "Very disappointing.  Way overpriced for the portion of food.  Now I see why there is no line in there.  Never going back again.", "This is cute. I came to this place because its indoors and although I love to walk around downtown Newark and look for new places to eat. \n\nheck .. I just..."], "rating": [2, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "s-cIDbh7gBqXgpWeRWao9Q", "text": ["SAY IT ISNT SOOOOOOOOOOO!!!!\nWAAAAAH!\nI came all the way down here to discover that the restaurant is CLOSED! Due to an electrical fire\nHart SANK down to my...", "I love supporting black owned establishments especially restaurants. First and foremost, it's in downtown Newark so you will have difficulties finding...", "This spot is impressive for a few reasons. They sell soul food & Ghanian food. 2 of my friends are related to the owner so they recommend I go there for the..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "GR6J3uECA6J7fmDQDRArhQ", "text": ["We went on a Sunday afternoon and parking was hard to find. The waitress needed a translator. The amount of food was not as expected compared to other...", "We stopped by on our way up to Harriman State Park. The food was SO GOOD and there was SO MUCH OF IT. It was also incredibly reasonably priced. Will...", "This is a place to get diner food. I don't think it's anything that special. The food isn't super expensive or anything which is good. It's open pretty..."], "rating": [2, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "yQ8CA83K5MCK-Zbq5zo_Ng", "text": ["The absolute best! Reminds me of Nonna's cooking!! The cavateli with pot cheese is to die for it actually tastes like I'm in my Nonna's kitchen. The shrimp...", "Good food. Long waits. Worth the waits. \nAlcohol is served.\nFilled with locals. Filled with out of towners.\nOverall great place!\n\n*They get busy so no funny...", "Talk about stepping back in time, a trip to the Belmont takes you immediately back to the 1950's. Additionally, we use to frequent a little dive up in..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "RscvJlUeQkVDPQ02guSXXg", "text": ["I had an amazing lunch here, the staff is very attentive, the wine list was top notch and the food was OUTSTANDING!!! Donny made our experience complete....", "This place is always on point. The food is always great & the staff is exceptional. I highly recommend Da Benito.", "Lunch Apr 26\n   Table bread was 3 different types that we all delicious, more than enough to share for all !\n  We ordered 2 meatballs at appetizers as we..."], "rating": [5, 5, 5], "TBscore": [0.54, 0.0, 0.38], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], [], ["lunch"]]}
{"id": "m7DX8OlCStrI2nHiEFvnvw", "text": ["Let's be fair here, I'm giving this place a review solely based on takeout orders. I've been here yes, but I know most of the workers and owner so I can't...", "The Titanic is sinking and for the wrong reason..This place is a find. The atmosphere is local and warm. you can sit at the bar and make new friends very...", "I love coming here with my wife or friends.  Great Seafood and Steaks.  With friends we eat at the Bar and watch the Portuguese Soccer/Football games, it's..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.65], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], ["bar"], ["steak", "bar"]]}
{"id": "NsCmrhNRzn7iA6amdSdymQ", "text": ["So this is a complete hidden jewel. We can here at the suggestion of a friend, who we will now consider a better friend.  The place is small and quaint;...", "You wont find a better Italian restaurant in this little town where Italians have the majority.  Nice little place off the beaten path.  Staff is friendly...", "Great atmosphere, cozy and clean. Fried calamari, Sea bass special and spaghetti puttanesca were AMAZING. Spaghetti and meatballs special was ok. Meatballs..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["italian"], []]}
{"id": "pxq-yJhZCIm9jEkRJQMnZg", "text": ["Excellent service. Excellent steak and absolutely mind-blowing gnocchi! Will definitely come back for the full tasting menu and some more.\nKeep in mind that...", "I have always regarded this Montclair establishment as a high end dining experience. It saddens me to downgrade it by a full star. But after two meals there...", "Just tried Fascino this last weekend for the first time and was not disappointed. \n\nAmbiance/Service:  we had a reservation for 9pm and were a little early..."], "rating": [5, 3, 4], "TBscore": [0.44, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["steak"], [], []]}
{"id": "tBRu4b9oGJ4SiLysD4hT_g", "text": ["Wow. That's all that needs to be said about this place. \n\nCame in here with my family for dinner on a Sunday and it was unbelievable. It's a very small...", "We walked in and No one greeted us for at least 5 minutes.  The place only had seating for about 30 guests.  Then a lady (probably the cook) came out and...", "I heard about this hidden gem from a friend and me and my friend decided to give this a try; I'm so glad we did! The atmosphere was funny, it was like you..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["dinner"], [], []]}
{"id": "AhqWTf8ObRg1ZcNRV_vzIQ", "text": ["What else can you say about a place that has so many reviews with such a high rating? Not much so I will keep it short with some recommended rules:\n\nRule #1...", "This amazingly unique experience blends a charming, cozy atmosphere and amazing, made-with-love food that can only be described as \"an experience\". Come...", "Celebrated a surprise birthday party at 15 Fox Place. At first, we had hesitations given the immediate surroundings but we were thoroughly impressed with..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "OB7HUmMTC8hwmF5XRePBig", "text": ["I kept hearing about Guy's from several neighbors and so I had to try it!  I called and ordered a pizza and chicken parm hero. I didn't realize they didn't...", "Im very picky when it come to food . especially good Italian food \nsome of the best places are these old time establishments in Newark , and West Orange...", "I absolutely LOVE this small, cozy restaurant. As soon as you walk in you feel like you're in Italy, so don't get scared if you hear the employees yelling..."], "rating": [5, 4, 5], "TBscore": [-0.3, 0.46, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["pizza", "chicken"], ["italian"], []]}
{"id": "7YrecPhUklWJmpnrDUw3CQ", "text": ["This place is a hidden gem. Doesn't look like much from the outside but inside it's old school fancy. The food is fantastic. I hade chicken Marsala. The...", "It's a solid 4 stars but I support small business owners. The Caesar salad was terrible. Very dry. Not enough dressing. The crab cake was amazing and...", "Can't believe there are so few reviews for this restaurant because it's not new, and there was a steady flow of diners! Came here for Pasta Night (glass of..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [["chicken"], ["cake"], ["pasta"]]}
{"id": "949Uk75h7hiaMNN7_N_4rg", "text": ["This restaurant is EXTREMELY underrated! I think people underestimate it because of its plain exterior and its strange location (in a small, tacky plaza). I...", "Normally we spend Easter with family and a home cooked meal, but this year we decided to eat out, as some of the family were on vacation. Normally, they are...", "We had our rehearsal dinner here as we were staying in the attached hotel, it was just convenient. All in all, though, we were quite pleased with the..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], ["dinner"]]}
{"id": "NICTgnuTPwziO56o6fyuRA", "text": ["I've been here twice and both times I stumbled upon the early bird dinner menu and I feel like I just can't go back now. It's such a great deal. You get an...", "The service, bar and food at Lassoni - all very good.   It was a busy Saturday night and our party of eight enjoyed well made cocktails, well timed...", "We came here after my grandmother's funeral for a luncheon and I wish we chose anywhere else.\n\nThere was a group of 50 of us in a private room that my..."], "rating": [5, 4, 1], "TBscore": [0.23, 0.5, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["dinner"], ["bar"], []]}
{"id": "L6o6epAGG8oFLXy_ZP2bcA", "text": ["I recently for the first time made a purchase from this amazing bakery for my birthday party! I wanted southern desserts and not a blah sheetcake!! Can I...", "This bakery is the go to place for there sweet potato  pies. ! Don't forget to pick up some cookies too you won't be disappointed! Mrs Kathy is the best she...", "Giving 5 stars to the Coconut Custard pie- best I've ever had!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "f1GouyANn6gO5W9T8ylttg", "text": ["Was looking for a cake w/out fondant for our daughter's baptism. 6 days before the event grandma found this place. \n\nBest cake ever!! Seeing the amount of...", "You have to put a star to leave review. It's unfortunate. They misspelled the word anniversary. We spelled it right on the contract. They refused to come...", "This is my favorite Dominican cake bakery ever! I get them For every special or family celebration and the crowd goes crazy over them. Mrs. mommy is the..."], "rating": [5, 1, 5], "TBscore": [1.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["cake"], [], ["cake"]]}
{"id": "ocJGSTeiuVwRkMPmMt3uQQ", "text": ["All I have to say is, wow! This is Gigi's cupcakes is in kind of an odd location, but I am glad that I found them through Yelp. Not only did they have an...", "This place is a problem. I mean, why does it have to be in my neighborhood?? Their cupcakes are always calling me. ALWAYS! Well, cupcakes can't talk but you...", "I just sent my daughter the chocolate lovers selection for her first birthday away at college.  She LOVED them.  Said she was so excited she almost cried...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "ycdAUtafe3vKGCtXpOsrLA", "text": ["Edo, whoa-oh-oh-oh! Edo's custom cakes look and taste divine! My sis-in-law told me about this baker a couple years ago and since then, I've gotten really...", "After doing countless research for German Chocolate cupcakes for a special someone's birthday, this place literally took the cake! \n\nI searched all of...", "Best bakery around! Such great customer service Edo is very reliable and always gets the job done. Had a few special cakes made by him over the years and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "stkQJ-HmvK7QTzRphACoVw", "text": ["I love Fido Dido cakes. Nikita has true talent for design...the cakes just comes out amazing. They not only look pretty but tastes amazing. The cakes are...", "The best eggless cake I've eaten in New Jersey. \nI went to her at the last moment and she came up with an amazing cake. I lover her work.", "We got a red velvet butter cream cake and it looked as professional as buying it from any cake shop. It was delicious, perfect amount of sweetness and..."], "rating": [5, 5, 4], "TBscore": [0.38, 0.43, 0.53], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [["cake"], ["cake"], ["cake"]]}
{"id": "N0MZae2Py6x-Ndpp2mmhEQ", "text": ["Rate and review\nFrenchy's Cake Designs, 910 Riverside Dr, New York, NY 10032\n \nbee nice\nPosting publicly. Learn more\n\nMy wedding cake recieved so much...", "Beautiful 65th Birthday Cake!\n\nI am so excited to be writing this review. I found Frenchy's via Yelp and was astonished by all the amazing reviews. I...", "This is a double barrel drip cake. The flavor was vanilla and I believe there was chocolate cake swirls inside. This cake was really really good. This is my..."], "rating": [5, 5, 5], "TBscore": [0.29, 0.0, 0.35], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], [], ["cake"]]}
{"id": "kYyb2ugcFbFMoRtCX0DcLA", "text": ["So where should I begin... courtesy, customer satisfaction, deliciousness, cupcakes, everything was top notch. \nCupcakes were highly discussed in our...", "I had ordered red velvet cake for my friend on her birthday. Wow, the cake was so amazing, no excess sugar or cream. Most of the cakes from commercial...", "I contacted the Goods Desserts a day and a half before needing 3 dozen cupcakes and they were amazing! They worked with me last minute and delivered the..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.24, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["cake"], []]}
{"id": "vfyuPSSDnGOunE004rGtxQ", "text": ["Stop reading this review and go get some sfogliatelle cookies from this joint right now. \n\nThis place is phenomenal. Cannolis are absolutely amazing and...", "Ordered a cake for my son's 1st Birthday. The cake was delicious and I couldn't be more pleased with the service. And their cannolis are the best!", "I used Conca D'oro for my wedding cake at the Park Chateau and it came out PERFECT! From the design to the taste, they over-exceeded my expectations by far...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.75, 0.55], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["cake"], ["cake"]]}
{"id": "_SzdFJ0j-ZnaEP3XRSz21A", "text": ["This place is absolutely amazing! I needed a cake that had some detail, I went to two other bakeries that both said they wouldn't be able to do it exactly...", "Love the tres leche cake and dulce de leche cake pops! A Must try!! Can't wait to visit again!", "I literary went to the shop last minute, like 2 days before my niece's birth and I walked in there for the first time. Everyone were so nice and great..."], "rating": [5, 5, 5], "TBscore": [0.34, 1.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], ["cake"], []]}
{"id": "EK6YJiey5K6hkKcbonY9lg", "text": ["The best round rolls around. My Grandfather made sure they were always on our table for every holiday meal... Perfect buttered or with some fresh ham. They...", "I like the bakery - it's a go to for cakes and pies. I recently ordered a dulce de leche cake and everyone at the party raved about the cake! I would give 5...", "The best Italian bread around !! I had a grilled chicken sandwich this afternoon and have to say it was excellent, definitely suggesting Brothers Bakery to..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.28], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["cake"], ["chicken", "italian", "sandwich"]]}
{"id": "sYlRBLNW7y2F074A7ktvrw", "text": ["Absolutely delicious!  Ribs not greasy and very MEATY!  Very tasty BBQ sauce.  Side dishes were perfectly seasoned.  Addictive!  I only splurge once in a...", "Got takeout from here tonight. Not a great showing. Ordered chopped pork, ended up with chopped pork with some chicken tossed in. Odd.  Meat was bland...", "Two unreadable menus followed by incredibly slow service. 2 people working, one guy doing huge takeout order and other person took an extended break before..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.39, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["chicken"], []]}
{"id": "q9YfTpJWNvRpl40rJSW5cg", "text": ["I love this place. Authentic, fresh and delicious Puerto Rican food. The empanadas are super filled with meat. Definitely worth the money. \n\nI've had...", "Wow, what a GEM! I've been trying to get to this place for months. I would have never known of this place if it weren't for the collections portion of...", "I recently went to a Food Truck Festival in Livingston, NJ and I was lucky enough to try a few dishes from there. I ordered the El Lechon burger, my mom had..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["burger"]]}
{"id": "QPflYYZx3nt_AmZMDgssyg", "text": ["I thought I already reviewed this place, but it was really just me telling everyone who would listen about how good it was & hoping they decide to go and...", "Hello Yelpers! Unfortunately, my recent experience at this place was less than desirable and I felt my business unappreciated. CUSTOMER SERVICE is a huge...", "UPDATE \n\nDespite several bad experiences I decided to give it one more try cause I wanted ribs and I'm glad I did. Most things I've ordered from here..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "FUDIv4UrmIoIEXFhPLsBJQ", "text": ["Holy BBQ, John knows what he's doing!!! I needed my party (of 50 picky people) catered for a holiday weekend housewarming party. John is not only an...", "Such a great idea - host had the food truck at a party! Amazing pork sliders, cornbread and Mac and cheese. Don't have to worry about serving guests and...", "Great experience for a family gathering in September. Great service- fun concept - food was delicious."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "hNNs6prWkYCMlbXeYDHWiA", "text": ["Portion size amazing, chicken was really good, steak skewers also tasty but the ribs I can pass on. Ribs really not tasty, dry and overly cooked. Vegetable...", "Quick good food !!!! This isn't typical American BBQ , this is Portuguese style BBQ .", "This isn't a traditional American bbq, it's more of a Portuguese style bbq which when done right is great. The menu is a hodgepodge of basic fast food i.e..."], "rating": [3, 4, 3], "TBscore": [0.0, 0.29, 0.26], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [["steak", "chicken"], ["american"], ["american"]]}
{"id": "6CIgMFvAfe-lX_6G_QkBRQ", "text": ["I don't know how long Bennett's has been open but I wish I knew about this spot sooner. Tonight my husband had the bbq chicken with rice & baked beans and I...", "The location: The restaurant is located next to the corner grocery store and can almost be missed if your driving too quickly. The ambiance inside is nice,...", "Amazing. Got the wings/candied yams/green beans. Spent 10 years living in FL, mom now lives in GA, always have a hard time finding good BBQ. Love this, will..."], "rating": [5, 5, 5], "TBscore": [-0.22, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken"], [], []]}
{"id": "sK7TWo_fJbT87wzNll9FZQ", "text": ["A true gem for Portuguese food. \nSmall place catering to locals. \n\nEverything I've tried is cooked perfectly. \nCash only. AAAA++++", "I can't say enough about this place. Little cozzy restaurant served by the owners super friendly.\nThe food was incredible, they offer me a sample of the...", "On my way back home from Newark Airport, we decided to stop by this little local spot for Portuguese BBQ. Mostly a takeout restaurant, the restaurant offers..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "KOvfcN3tpUmKezmWTG17rw", "text": ["This resturant has now become one of great favorites in NJ. For tourists like me, it's located in a part of town that doesn't appear to be the safest i.e....", "Food was good. I had the goat & black rice. Came in great portions & had alot of sauce. I wanted to sit down & eat since I was coming from NY but it was hot...", "Slamming Haitian grub. \nNot better than my lover's mom and sister but certainly GREAT if you're craving Haitian fare. \nFried pork (griot) was tasty and..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "Wm-_1oKOrxWH_U0YPafKJA", "text": ["My cousin Stephanie planned an amazing surprise birthday dinner party at this restaurant for her Mom.  They have a large private room, which accommodated...", "The BEST place ever to host an event. It was by far the easiest process I have ever encounter. The food as always was amazing and the selection of what we...", "Will NEVER go here again!\nRibs are rubbery  \nChicken & ribs have ABSOLUTELY  NO TASTE, NO \nMatter how much  you squeeze the plastic bottle  of bbq sauce on..."], "rating": [5, 5, 1], "TBscore": [0.27, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["dinner"], [], []]}
{"id": "U2Db8P42ulM5BqxKcU0NPw", "text": ["its really a mom and pop kind of restaurant nothing special.\npretty old decor with plastic table covers.\nThe arroz con Gandules is dominican style which has...", "4 stars - food and flavor!\n3.5 stars - location \nAh yes Dominican food! I guess I have a thing for Spanish food!\n\nWhen we're in the mood for some steak...", "Pros: Best mom&pop spanish restaurant, wide variety of authentic cuisine (I go here every time I crave spanish food, has a homey feel to it, no parking lot..."], "rating": [3, 4, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.6, 0.2], "keywords": [[], ["steak"], []]}
{"id": "W0VurcaR5tyqloBh6q-_rA", "text": ["Jamaican food is not easy to find in Hoboken, so really happy to see a quality one in the neighborhood. \n\nHighly recommend:\nJerk everything - they have...", "Tbh I didn't expect much walking in to this restaurant. I was greeted with a smile and a good conversation regarding her passion for the food she cooks and...", "De. Li. Cious. This place really surprised me. I had tried Jamaican food before from another place and wasn't super impressed. I ordered lunch with some..."], "rating": [4, 5, 5], "TBscore": [0.0, 0.0, 0.48], "normalisedRating": [0.6, 1.0, 1.0], "keywords": [[], [], ["lunch"]]}
{"id": "P7uqi3WdmSwEraGNmRZd9w", "text": ["Best Beef Satay everrrrrr!\n\n\nYou'll never regret ordering from Excuizine.\nIts been a year and Excuizine never fails.", "I cannot say enough about how fabulous every aspect of Excuisine CAterer. I was in a short notice jam and Chef Renee responded on a Sunday morning to my...", "Tried their Sandwich and kale salad. I like their sandwich wrap even thought I am not a sandwich person. The wrap was soft and fresh. I tried the tuna fish..."], "rating": [5, 5, 5], "TBscore": [0.62, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["beef"], [], ["sandwich"]]}
{"id": "8ndVdwDsdyq0DUrLmiqPEg", "text": ["The menu is the usual McDonald's fare. All day breakfast, burgers, chicken sandwiches. Salads for vegetarians and with chicken, ice cream desserts and a...", "So this is what they consider a large order of fries....basically a small order put into a large container and they have the audacity to call it a large...", "This place is dirty,employees are very disrespectful and need better training. There lucky I gave them 1 star I would have given them no stars."], "rating": [4, 1, 1], "TBscore": [-0.48, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["breakfast", "burger", "chicken", "sandwich"], [], []]}
{"id": "rVTb2fiEODeeP9n6e60mGA", "text": ["OMG the most horrid experience.  First of all, the service, disrespectful staff and ignorance encountered in just a short time. Let me preface this...", "The tall guy he's a nice guy, also he called me trouble maker because i told him they were so cheap with the french fries  i payed almost 10$ dollars for...", "Okay this is more of a question than a review..... When you eat at a Fast Food restaurant that is part of a franchise, shouldn't there be consistency in the..."], "rating": [1, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "MiR8rwAp6d9QNAScuI3IeQ", "text": ["Worst service of any wendys I have been to. All their attention goes to the drive thru, Customers coming inside to eat and order can expect to wait extemely...", "Everytime I come to Wendy's there's always a situation orders aren't filled correctly two occasions I had to walk out waiting too long to resolve issues :-(", "Check your bag at the drive through these clowns aren't too bright. And the bathrooms could use a mopping... But hey it's Wendy's!"], "rating": [1, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "4-RP5gH0Dh_IDx6AvxLGfQ", "text": ["I love buffalo wings and chicken sandwich. The food is very delicious at reasonable price. Best place to find chicken of all kind. Staff is very co...", "After watching a boxing match at Caravao, stopped by for some wings to take home.  Ordered a dozen.  It was closing time and I was the last order.  They...", "Delicious delicious chicken spot in the hood that I grew up on while in high school. Extremely cheap."], "rating": [5, 1, 5], "TBscore": [0.29, 0.0, 0.39], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["wings", "chicken", "sandwich"], ["wings"], ["chicken"]]}
{"id": "M3GvRKzkM_Iiroz09PMZRA", "text": ["Love their fried chicken and the wings with mac & cheese are my favorites! If you want good chicken these people know how to do it! Serving fresh chicken...", "I love the Italian cheeseburger. This place can get busy during lunch. I've noticed they have more selections but I'm a fan of the Italian cheeseburger,", "This is the best place to get fried chicken in this hood ! Sometimes I run down here durIng my shopping trips to get a nice snack. I always buy a ten piece..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.22, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["wings", "chicken"], ["burger", "italian", "lunch"], ["snack", "chicken"]]}
{"id": "lL_rMNSCC8yXWf9Xi2gVUg", "text": ["I'm looking at the reviews for this place and I don't get it...I LOVED IT HERE!!! \n#1 - the smell that hits you from outside makes your mouth instantly...", "DO NOT ORDER FROM HERE. The service was terrible and i was over charged. All the person on the phone had to say was \"oh.\" The delivery man was extremely...", "I used to come here all the time. After a recent Visit I realized one of the reasons I stopped going so frequently. After spending $40 on two whole trays of..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "Cn4H2QTcX3HH1RrNiI_a0Q", "text": ["I feel like I need to update my review since I've been here two times after my initial review. The food is still very consistent and delicious. The rodizio...", "Parking around the area is a bit sparse to say the least but they did have free valet when I went. \n\nThe dish I ordered, the short beef rib was gigantic and...", "Drove by and decided to stop in for lunch to try the new place out. The decor inside is definitely welcoming. The price is a draw for sure. $15 for all you..."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.21], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], ["beef"], ["lunch"]]}
{"id": "45hQYGbLr-wzhOi4iTpWWw", "text": ["Okay, point reduction for poor planning on MY part. Who goes into Tony Roma's on Good Friday? (Says a non-practicing Catholic boy who still follows the...", "Food - good.  Server..well specifically the bartender..OMG...my advice to you... Get out of the service industry. You clearly dont like customers (you...", "Worst dining experience ever. Only went here because this place is the only option outside security. The food was disgusting, but the worst part was the..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "yl_IA_EAnWjObw72xrTWpg", "text": ["This place is amazing compared to the buffet back in California. There's so many selections and food is always fresh! The fried shrimp is a must try it's so...", "Went tonight, was cut off by a B****. This Bxxxx also pushed an older Asian woman. So g. and rude.\n\nFood is ok. No one to report the incident to. Jersey...", "Very large selection of food and at least half of it tastes pretty good. The most value is in the hibachi grill in the back. Before 3:30pm on weekdays lunch..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], ["lunch"]]}
{"id": "NyaVfDVGXmso9RIIbiWOPg", "text": ["Average Chinese food but fast delivery! \n\nI arrived at my hotel past 9PM, took an Uber so I had no car and was hungry! I decided to go with Chinese food and...", "After a day of meetings, I got too lazy to go out for dinner so I ordered some Chinese from here. This is a lesson for everyone, don't be lazy!\nIn all...", "Never again will I order from this place. I spent 20 dollars on take out that had to go right in the trash you can see in the picture I posted there is..."], "rating": [3, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [["chineese"], ["dinner", "chineese"], []]}
{"id": "2WdoQYH5u3OCJjWte4wxeA", "text": ["Noches de Colombia who? What? Psh.\n\nThis place is amazing. Blows every Colombian restaurant I've visited out of the water. I recommend that you try their...", "Love the setup of this place and loved how there was live music! The guy performing walked around and had such a wonderful voice! The food was really good....", "Is a fun Colombian place to come for date night on a Friday night. They had Mariachis live and their coffee is the best! The food is ok but speedy...."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "1QTmJlksdnQlOYQHM5MsQw", "text": ["Great Bayonne, NJ Bar & Restaurant. Good selection of beers on tap. Good solid food menu. Friendly locals.", "The place has an interesting vibe which is why we walked in. \n\nOur food was cold, and cheese tasted moldy. Definitely not going back here. Wish we had...", "If you think this place has anything to offer...you need to get out of Bayonne more often ! \nFood- crap pure and simple. Poor quality steak, overcooked..."], "rating": [4, 1, 1], "TBscore": [0.52, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["bar"], [], ["steak"]]}
{"id": "kGJrhiePz8Ea6h6A0EHBog", "text": ["I ordered a rainbow roll today with spicy mayo on the side.. not only did it not come with spicy mayo, but the roll looked \"old\" .. I said OK fine I'll get...", "I used the StubGrub app to order from this restaurant. I've done it many times with ease. Last nights ordering experience and delivery was smooth. I find...", "The worst place ever... my chicken had feathers on it!! If i could give this place negative stars i would.. not people friendly at all .... first and last..."], "rating": [1, 2, 1], "TBscore": [0.0, 0.0, -0.27], "normalisedRating": [-0.6, -0.2, -0.6], "keywords": [[], [], ["chicken"]]}
{"id": "s21eqJFaH5QkcXIwe18hqg", "text": ["I ordered through their website @6:20pm on a Friday evening. It is now after 7pm and have yet to receive my food. I called their restaurant telephone, and...", "We decided to try a new Chinese food place and I have SOOO many regrets. This place is in Orange, but took over 90 minutes to deliver the food to West...", "I have tasted fried calamari from all types of Asian restaurants and the Five Spice Crispy Calamari was fried dough, soft and chewy, plus heavily..."], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], ["chineese"], []]}
