{"id": "T-KmLcpdrpdnhkzW7jqlfw", "text": ["What was that on my Philly cheese steak? Was it Mayo or some sort of cheese? Whatever it was it was covered in it and it was ALL I could taste.  Also, the...", "I hated this place. The bread is too soft and squishy like wonder bread. Everything inside the sandwich is fine. The staff work hard too. \n\nJersey? At these...", "Sign up for the jersey mikes sub reward club and receive a free meal offer or perhaps a free birthday sub! Hell yeah! \n\n\nI was unable to pull up my coupon..."], "rating": [1, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [["steak"], ["sandwich"], []]}
{"id": "eQVTHLiq1pVVHPajX4CSRg", "text": ["Who doesn't love Meconi's????\nPlenty of seating! I like how they have plenty of condiments at a counter when you walk in and in the middle of the...", "This place is a joke. Zero service, bad food, and over priced. I ordered 4 subs, they didn't get the order correct, and the taste was bland not to mention...", "Drove around at lunch looking for some soup. Decided to try their soup. It was Italian Wedding. It was $4.30 for almost a cup of soup that was mostly broth...."], "rating": [4, 1, 2], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.6, -0.6, -0.2], "keywords": [[], [], ["italian", "lunch"]]}
{"id": "gOVbzQIrCGTiXFGi9pjzUg", "text": ["Very good German food.  Excellent customer service.  They also sell fresh deli meet, which is delicious.", "I lived in Lacey for years and this was my first visit to Oskar's. I was on a trip back home to visit and wanted something different. I wasn't sure what to...", "Todays' visit was second time and never again. Will go back to Hess's in Lakewood.\n\nFirst visit was lunch with husband. We both had a half sandwich with cup..."], "rating": [5, 4, 1], "TBscore": [0.64, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [["deli"], [], ["lunch", "sandwich"]]}
{"id": "8RIDqNxNXBmwekE9zXCScQ", "text": ["Don't waste your money. A quick look behind the counter will show you how dirty the floor is. They just step on food they drop. The women behind the counter...", "These guys are much better in the last year or so.  Sandwiches are consistent and daily specials are tasty and generously portioned.  It's not gourmet but...", "This place has gone down the drain. It used to be a quick convenient place to get something to eat. Nothing spectacular but edible. About a year ago the..."], "rating": [1, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], ["sandwich"], []]}
{"id": "1rc_7Oj8waMB6SFF7imxGA", "text": ["They are not closed! They shut down to remodel and reopened a couple months ago with an expanded and revamped menu.  The expanded menu includes soft...", "I stopped here on a lark. We had been at a nearby park and wanted a quick lunch. This is a walk up window service spot and the sidewalk outside  was so...", "A+ for having veggie dogs and loads of condiments. I always forget that it is cash only, my bad. Some sketchy people hang around it late at night"], "rating": [4, 2, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.2], "keywords": [[], ["lunch"], []]}
{"id": "eKw5ewgCf5VdUo8d4a1bMw", "text": ["Since moving to the area I've been on the hunt for a good coffee stand where I could be greeted with a smile by someone wearing a shirt. Cutters point...", "Worst coffee I've EVER had. I burned my tongue on the first sip and it wasn't even drinkable for about another 10 minutes after I transferred it to my cold...", "Consistently great coffee for a fair price. \nMake sure to get a punch card, because you'll be back!"], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "BXYLRuwjh9_3eT5g0xZjQQ", "text": ["We've lived here 6 months so far and have had an amazing experience. The staff is always friendly and helpful, I love how dog friendly the complex is, and...", "These apartments are absolutely covered in mold, and when you're paying premium dollar for an okay apartment, this is unacceptable. One bedroom for over...", "Fleas. Office staff either under qualified or underperforms. Dishwasher leaks. Toilet doesn't flush properly. Hot water not working upon move it. They won't..."], "rating": [5, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "dv-T3dactPNmZO4zXcFFYA", "text": ["I'm not exactly sure how I feel about this store, so I'm only giving it 3 stars. Some days it deserves a 1 or a 2.\n\nThe store itself is very clean, somewhat...", "So as I have learned in my travels to other counties, Thurston County charges for bags. I keep my resuseable bags in the car. For this trip, I was like well...", "Pharmacy personnel (Barbara?) are very rude. Either doesn't have customer service skills, doesn't like her job, or both. Rude; rude, rude"], "rating": [3, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "qVq-ybP0PfGPssqfjhiaIQ", "text": ["I have been to this location several times and have left several times disappointed not this time I want to give the guy working this morning dark hair he...", "It's KFC.  Had the $5 buck lunch -- Two pieces of Chicken, Mashed Potatoes, Biscuit, Soda, and a Cookie. \n\nThigh and Leg tasted just like I thought KFC...", "I'd give it no stars if possible. \nGot order wrong. Received cold Apple pies. Had to ask for receipts \nColeslaw had no dressing and chicken dry v\nTerrible..."], "rating": [4, 3, 1], "TBscore": [0.0, -0.6, -0.46], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [[], ["chicken", "lunch"], ["chicken"]]}
{"id": "HaT-uTEZ0-axvQGALg0BGg", "text": ["A taste of Aloha here in Tumwater, Washington! These places are EVERYWHERE in Hawaii (at least on Oahu) and they seem to be spreading across the mainland...", "I've now given this place three visits before my review.  The chicken katsu is onolicious!!  The rice and Mac salad needs improvement; they are both a bit...", "Come get this in your belly now! It was all that I've dreamed of... those food network shows really painted a picture in my mind and I was so happy with..."], "rating": [4, 3, 5], "TBscore": [0.0, -0.94, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "nFcqooB0eRWcK7S3EL8M9A", "text": ["When using a Credit/Debit card to pay for your order check your bank account for possible overcharge. Last week I ordered from drive thru was not given a...", "I asked for a Croissant with egg & double bacon only. They rang it up as a Supreme Croissant with No Ham, No Cheese & Extra Bacon cost $5.49. I told them...", "My boyfriend and I are visiting from out of state and we had always wanted to try Jack in the Box. We tried a location yesterday and it was so good that I..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], ["egg"], []]}
{"id": "jlcAJqxiaMFOcjsphjvlkg", "text": ["Shirro's showed my fiancé and me a dining experience unlike anything we've had in Downtown Olympia's increasingly stale and bland restaurant scene: superbly...", "Their website says they're open on Thursday from 5pm-1am but they're not. Guess we'll never know what the food is like-bummer.", "There is no other place like it in the area.   The owner and the menu are delightful.  We had the Afrika Platter  and the Githeri was the best plate out of..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "XTkCdbbnIEMKjC5bgRgPNg", "text": ["New fave spot!!!!!!! Lunch special is a gem.......de li cious and everyone was so kind. Generous portions and tasty sauces..........I'll be back next week ;)", "My large poke bowl was amazing.  It left such a lingering memory on my tongue.  Service is quick, friendly, and very helpful.  \n\nI took one star off because...", "It's definitely \"fast food\", but tasty and fresher than most options.  I didn't think I would want any of the rice, but the sauces and toppings all combined..."], "rating": [5, 4, 4], "TBscore": [0.31, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["lunch"], [], []]}
{"id": "8gFrYAtPjIDpOz-TFBHKeQ", "text": ["I left my wallet at this store and didn't realize it until 2 hours later. It had been put in the safe and after looking at my contact information, they...", "I needed to pick up a few things for dinner in between Dr.'s appointments.\nI stopped in here at Ralph's.\nThe prices were OUTRAGEOUS!!!!! So much so that I...", "More like zero stars. Employee Ray watches me like a hawk and makes me feel very uncomfortable shopping there. I would rather go to Walmart.......Ralph's..."], "rating": [5, 1, 1], "TBscore": [0.0, -0.33, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [[], ["dinner"], []]}
{"id": "3eWrczxch9z0JCdVdHXHeA", "text": ["I picked up a quick crossant before boarding the airplane. The kiosk was neat and tidy, easy to see all items for purchase.  The clerk was very pleasant and...", "I placed my order at 9:30 this morning and it arrived nearly 2 hours later. I tried to call the # listed on my confirmation e-mail after the estimated...", "We ordered sushi the other day from Puget sound 2 go. Sushi at a dine in usually takes a long time so I was super impressed when out food got to us in the..."], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.22], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], ["sushi"]]}
{"id": "KkyRqeeQD9GlvpH5xc917g", "text": ["The people giving this place 5 stars are either DELUSIONAL, or haven't been to another meat market before.\nI really hate giving local places a low rating,...", "The best butcher shop I've ever been to. Very friendly staff. I always go there during the weekend and buy several pounds of the sale products. You can...", "I too found this place to have an awful smell.  I thought maybe it was just an off day till I saw the review from a month earlier.  If there is something..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "sVuB0U5opLuGboaG5rhs1Q", "text": ["Awesome selection of jerky. As soon as you get out of the car you can smell the smokey goodness! \nThe smoked turkey bites are great too! They have smoked...", "We've been a patron of Johnson's for about 18 years now. In our opinion there is no other competitor can that can compare to the quality, flavor and variety...", "Excellent jerky sticks and chops.\n\nTop notch customer service."], "rating": [5, 5, 5], "TBscore": [1.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["turkey"], [], []]}
{"id": "EW-5ToUwid3_PM_GMqYnOQ", "text": ["The service wasn't bad at all. The two girls working there were very nice and friendly.\nI ordered the steak and cheese sub with the new sesame seed bread...", "Just walked out after watching multiple employees not was hands, specifically one who came straight out of the restroom. Extremely disappointed in the...", "I've never had a bad experience with the employees or food. I am disappointed the owner never honors the coupons or deals that Subway advertises. I would..."], "rating": [3, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 0.2], "keywords": [["steak"], [], []]}
{"id": "8rw44mvgenYumAVkSRweBg", "text": ["Lorena Gelpi is seriously rude! She was so rude from the start and when you walk away she just keeps running her mouth about you. She instigates you, she...", "This is the best subway in Olympia (though the one in Tumwater is nicer). Located in the food court, basically what you'd expect at a subway is what they...", "I'm usually side for the \"if you can't say something nice, don't say anything at all\" rule, but this place is ridiculous. The staff is very friendly, so..."], "rating": [1, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "3k1GN0jSxKh3f-nkYnY7Nw", "text": ["Food tasted terrible (all the additives and fillers in their bread and \"meat\" probably contribute to this) and the service was very rude and unhelpful.", "Stood in line for over half hour because two ladies helping one gentleman make multiple orders and the gentleman kept going back and forth changing and...", "Talk about rude! The guy \"Levi\" making our sandwiches was rude as hell. We said hi and he ignored us. Then he seemed pissed off that we were courteous..."], "rating": [1, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, -0.2], "keywords": [[], [], ["sandwich"]]}
{"id": "wh5L0CST-yLqjXrqacNvEA", "text": ["I have lived next door to this location for over 10 years.\nThe employees are always nice and funny with great personalities. \nI love there deals every week...", "I love coming in after church on Sundays with my three kids. My oldest has celiac disease which prevents her from eating food with glutton in it. They take...", "Tried this location a couple days ago and got great customer service from Paige.  She was cheerful and patient.  Very efficient.  The store was nice and..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "MGDLvptYHEFF7cycFThKIQ", "text": ["Hometown butcher shop \n\nFor those of you who only shop at national grocery chains and Costco, you are missing out. Try this local shop. The variety of meats...", "Western Meat Co is a nice little local meat shop. They have beef, pork, poultry, sausages, and some smoked items. I purchased some house cut bacon 4lbs for...", "I found this meat company about a month ago. I love it! The meat is fresh, the employees are nice. \nTrying to maintain a Keto lifestyle is easier, since I..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], ["beef"], []]}
{"id": "uviupMPAPwJROm0_udM7tg", "text": ["I ordered an Italian sandwich. I paid $9 for a stupid little sandwich that was the worst Italian sandwich I ever had. I will never go back there either...", "It has been a couple of years since I was downtown for lunch and loved coming here for the club and went today and was really disappointed.    I asked for...", "Called Bayview on a Sunday to see if their upstairs seating area was open.  I was told that it was, as they do not hold cooking classes on Sundays.  I also..."], "rating": [2, 1, 1], "TBscore": [-0.33, 0.0, 0.0], "normalisedRating": [-0.2, -0.6, -0.6], "keywords": [["italian", "sandwich"], ["lunch"], []]}
{"id": "R2XSwai9_HG-jldRP1Q9JQ", "text": ["Great meats and seafood. Best meatloaf in town by Clarice. Mushroom and onion...yumm. Great produce and very courteous staff. High prices though, but when I...", "You have a female who was stocking in the soda/seltzer isle at 11:30am on 5/6/2018 that should NOT be working around the general public or in a customer...", "This is by far the best grocery store in town.  Its clean, lots of organics and local products.  They have fresh quality meats and a butcher there everyday...."], "rating": [3, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "hjuRRu8FL-7d0wm1QgdxWA", "text": ["Never know what you will find! The people working here are so nice and helpful. They keep the place organized and clean.\nThey have a 1/2 aisle dedicated to...", "The headphones, earbuds, speakers, and charging cables sold in the front of the store are all Chinese \"Bulk factory rejects\". Expect them not to work out of...", "Truly unimpressed with this store. The aisles are cluttered and the employees were extremely rude. I ended up buying a gallon of milk, sponges, cupcakes and..."], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [[], ["chineese"], []]}
{"id": "A9tj_o0NpxT3s5SmUS2Hzg", "text": ["There is literally no better Subway than this one. Working there are the Michael Angelos of sandwich artistry, complete with the attitude and patience of a...", "Not very impressed with this location, and Subway in general.  First, Subway really charges too much.  $8 for just a Six inch sandwich is too much.  With...", "Ridiculous. 1 star is to much when there's two people working and both sitting on their butts at the door when I walk in and they discard my 3 sandwich..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["sandwich"], ["sandwich"], ["sandwich"]]}
{"id": "uDtBplMf5Uv6S6ofv7vzpg", "text": ["I go this subway quite a bit since it's like 2 mins from my work and most of the time I'm satisfied but there's been times where they've messed my order up...", "We go to this Subway all the time and are consistently impressed by the friendly staff. The food is what you'd expect from a Subway; nothing too out of this...", "Worst subway I have ever been to and to top the horrible service they don't ever do the 5 ant footlong when all the others do"], "rating": [4, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "yC4zjF_Jwwt1vINKjw4ceg", "text": ["Great deli. Prices are high though. Awesome beer selection and the staff are very nice and helpful. They have a loyal local following and have been there...", "The sad part is that this is a facility that offers a cooking school, a full grocery store, bakery, and just about any conceivable kitchen gadget...", "I never miss an opportunity to badmouth this place. High prices. Bad attitude. Walk in there wearing a backpack and you'll be treated like a thief and told..."], "rating": [3, 1, 1], "TBscore": [0.44, 0.0, 0.0], "normalisedRating": [0.2, -0.6, -0.6], "keywords": [["deli"], [], []]}
{"id": "6n69UoLaSOVXdQPGU1o3rw", "text": ["This downtown Starbucks is extremely convenient for myself, I often walk right over from work. If you are in a rush, there is some street parking (a gamble...", "In many ways this is your average Starbucks.  The one thing that stood out were the several patrons who appeared to the be homeless.  They had drinks (in...", "Spent a fun evening with friends downtown Olympia. Had a great time. Decided to stop in at Starbucks on the way to the car.  Walked in and saw someone and..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "PFWVuz3PkwfmkmNXJ9gNmg", "text": ["Ordered a 3 scoop sundae and asked for cup of ice and would not give a full cup of ice because \"store policy\". \"We only have so much ice\". Love Baskin...", "My husband and our friends visited this store August 11, 2018 at approximately 8:30pm. I was treated so poorly by the employee that I actually considered...", "My review can be summed up by saying: I love this place!! And so do my kids (I have four)... I have lived in the same neighborhood as the location of this..."], "rating": [1, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "fg13Zx-h-MgZuW0uuALh6Q", "text": ["I appreciate Menchie's with its commercial polish, consistency and execution. I like that calorie counts are accurate, that this particular location takes...", "Good frozen yogurt.\n\nThey need to bring back the salted caramel.\n\nImagine our surprise and disappointment when we went in to get the salted caramel and it...", "Came here after dinner to enjoy some frozen yogurt and the nice summer weather.  There weren't any exciting flavors, and even one machine was down and..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], ["dinner"]]}
{"id": "moW-9_O4NCd3YAj2MzZSqw", "text": ["Quick service and super friendly. Chocolate dipped waffle cones were fresh and delicious. They were open on 4th of July. There was a bit of a line but the...", "Awesome place and great service!!\nHad an ice cream here with chocolate dipped waffle that was so fresh I could bet it was made just a few hours prior. The...", "Who doesn't love ice cream? Well to be honest I know a couple of people but we're talking about me right now. I always get the \"Love It,\" judge me for all..."], "rating": [5, 5, 5], "TBscore": [0.39, 0.42, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["waffle"], ["waffle"], []]}
{"id": "d9S1-4XzZryA085sEbVm5Q", "text": ["Ronda and Miranda, the owners of Ambrosia Catering, are super fantastic women and business owners. This mother and daughter team really know what they're...", "I rented out the space for a baby shower.  Ronda was amazing at set up food prep and assisting with an decorating that needed to be done.  I wanted to slap...", "Ambrosia catered brunch for a Multicare event I attended. It was beautifully arranged and the menu was varied and delicious! Everyone enjoyed the food..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.78], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["brunch"]]}
{"id": "Vr4o6B3eUQEhTOylyeN1lQ", "text": ["When I entered the boba shop, I noticed the appearance of it--not very presentable so I could understand some of the low ratings. \n\nHowever, I've found my...", "I finally found a place that has a solid amount of flavor choices in Lacey/Olympia area! Prices are about even as others. Red bean is my favorite.", "Awesome bubble tea, I got the raspberry real fruit and it was super good. The owner is really nice, funny, and clearly cares about his business and wants to..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "2G2-NVNDjrz3-206ehcQBw", "text": ["We love Carl's and compare their fresh hamburgers among the best. The service was great and both the manager and server were friendly and our order was...", "Food was very good and service was great!  Love their burgers and their cross cut fries.", "Happened to be in the area yesterday and decided to try something new, big mistake. Service was inattentive, prices were ridiculous, and when I finally got..."], "rating": [5, 5, 1], "TBscore": [0.59, 0.6, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["hamburger"], ["burger"], []]}
{"id": "vCTfiylnvexuzFJbp6tcFQ", "text": ["The rice plate I know and love is gone.  Now, the signature shredded pork skin has no seasoning, no roasted rice powder.  It's like eating macaroni without...", "I do not normally venture out of my comfort zone of the various foods I enjoy. However, today I did and must say I enjoyed what I had here. I had a...", "Best Pho in Thurston Co. This place has been around since before noodles became a craze. It's definitely had it's ups and downs in the last 15 or so years,..."], "rating": [3, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "aWx0cEi0ArKZHiHRSZk6nA", "text": ["Place is kept cold so that it does not smell funky like other shops can, lots of ready to go stuff to pick up on the way home to make a real good real...", "Best. Place. Ever. I will never again to go a regular grocery store for meat. This is now the only place I'll go. Such good meat. Homemade pico de Gallo,...", "Benny and his team at Harbor Farms spoiled us in Gig Harbor  -  amazing quality steaks, chops, roasts and ribs and a great selection of meats seasoned and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.55], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["steak"]]}
{"id": "L2-hiR-sSKUKt0YUlQ_O1A", "text": ["The skimpy sauce and cheese situation has gotten so much better! So glad. I'm lazy and I love getting delivery! They still make pretty pizzas and I like all...", "Why is it that restaurants and food outlets spend so much money remodeling their buildings, and, like Domino's, have fancy delivery cars, but absolutely...", "What happened? There was so much sauce on my pizza that it looked like someone took a shotgun to a Costco-sized can of tomato paste. Also, just tons of corn..."], "rating": [4, 2, 1], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["pizza"], [], ["pizza", "corn"]]}
{"id": "2AmXyQzhJyywOKr9aas60w", "text": ["Called in an order for my family, arrived at 9:00pm(when they said to be there), doors where locked. I could clearly see staff and pizzas on the rack, ready...", "I'm a big fan of Papa Murphy's/take and bake.  Delivery style pizza that you bake at your convenience.  No more waiting 30-45 minutes for delivery.  \n\nFrom...", "I love this place! The pizzas are consistently good, with lots of fresh toppings and a healthy amount of sauce! My favorite pizza is the Chicken Bacon..."], "rating": [1, 4, 5], "TBscore": [0.0, 0.0, 0.36], "normalisedRating": [-0.6, 0.6, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza", "chicken"]]}
{"id": "DQhmpPrBcwWBnOeZsz99FQ", "text": ["Okay, so it's a chain, but every time I have a kids party, I call for dominos pizza because KIDS LOVE DOMINOS! \nI call on the way from work or on my way...", "Dude just delivered my pizza with a SUPER smashed up pizza box but I didn't think to open the lid before he pulled off. A bunch of the toppings are stuck to...", "Hanging out waiting for my pizza quite enjoying the happy banter and efficiency of what appears to be a hard working team! Nice work Dominos!  Hope the pie..."], "rating": [4, 2, 4], "TBscore": [0.56, 0.0, 0.42], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "gQRCZV2IBVesI8_jeIm8JQ", "text": ["Island Market is a great store. It has almost anything you could want, which saves you a trip into town. The staff is always friendly, and helpful. Prices...", "Ok little market if you need to pick something up quick.  You have to watch expiration dates on refrigerated items.  Expired items in cold case like orange...", "Who would think this little market / gas station had the best pizza in the area? Love.Love. Love. Try the chicken pesto or combo. Hard to beat the fresh..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], ["pizza", "chicken"]]}
{"id": "cXSqIgOg3vNmhwMW5voRjg", "text": ["What's wrong with papa Murphy's pizzas are starting to go down hill and they stop taking punch cards we need a figaros pizza in Olympia lots better pizza", "Yet another problem with Papa Murphy's in using coupons or any kind of discounts. Husband just picked up a pizza and came home with the $3 off coupon. When...", "Always a great pizza and it's consistent!     Their large is really a large, and the family does feed a family.   Love the meat lovers as a family size and..."], "rating": [1, 3, 5], "TBscore": [0.0, 0.6, 0.41], "normalisedRating": [-0.6, 0.2, 1.0], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "JgBUcrCcaaBmrhCAIkmcGw", "text": ["Things have seemed to change since Steamboat Wood Fired Pizza first opened... Let's just say I have not been impressed. I have tried several times to call...", "Pizzas good, but their line to order is always turned off. It does straight to voicemail. Not sure why you'd advertise delivery as an option when your only...", "Husband and daughter just stopped by.  According to yelp they close in 43 minutes.  Husband said they were making a couple pizzas and told him they were..."], "rating": [2, 3, 1], "TBscore": [0.42, 0.0, 0.0], "normalisedRating": [-0.2, 0.2, -0.6], "keywords": [["pizza"], ["pizza"], ["pizza"]]}
{"id": "jqGseydphmoHaLsgZfp64w", "text": ["I have never even written a Yelp review before, so for starters that should give you a heads up about my experience. I understand when a business gets busy...", "I ordered a pizza that they don't have to cook and it took 15 minutes. Not cool. Won't be back. I came here because I'm tired and I wanted to get home.", "They've raised the prices and have gotten more stingy with the ingredients. About 1/2 the cheese as other Papa Murphy's and they take longer. You'd think..."], "rating": [2, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, -0.2, -0.2], "keywords": [[], ["pizza"], []]}
{"id": "QND8TWPMqC6LeabNKIlitw", "text": ["I've been to this location twice now and have to say they does it right! I've been turned off by a couple other Pizza Hut locations in the past but glad I...", "Long wait and did not receive the pizzas I ordered.  Q: When does a Hawaiian pizza not have pineapple on it?  A: When this Pizza Hut makes it.  Also paid...", "Can't deliver 10 min away? Really!this is joke, sorry gas prices are to much? Maybe no gps? Confused"], "rating": [4, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["pizza"], ["pizza"], []]}
{"id": "YQtudu5T4Dei8N6HrZDBCQ", "text": ["Was visiting Seattle (staying in Port Orchard)for a few days and was looking for a place to eat at about 9pm. A lot of places were closed so we decided to...", "Pizza was old and rubbery for lunch, no where as good as Port Orchard.  Salad was the worst.  They used cheap lettuce.  So sad.  \n\nAnyone that knows Spiro's...", "I've given this place two chances. First time the order was least correct even if the ravioli was over cooked and melted butter isn't a sauce. The second..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], ["pizza", "lunch"], []]}
{"id": "oG80dFcPevypgvJbwDcZbQ", "text": ["Chai was so good.  It's a very small Cafe, managed by the same people in the salon next door (you enter through the salon). They don't serve any real food,...", "This place is kind of an unconventional set up but it actually is quite nice and peaceful! The door going into the Chai place has a sign on it and says that...", "If you love Curry Corner as I do, you'll like this place.  It's run by the same family who runs Curry Corner for seven years now.   Masaala is a small, fast..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "ZzDD2orc0URiBXhOZ0jWcQ", "text": ["The best baristas in town work at Drip! We come in many times a week to get our coffee fix and are never disappointed. They are always rotating in new...", "Drip Espresso bar has a nice selection of coffees, teas, and frozen drinks. Although small, the cafe has comfortable seating, serve-yourself ice cold water,...", "Honestly, this is a great little coffee shop. They've got a small selection of pastries, but what I tried was delicious. Around the corner they have a..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["bar"], []]}
{"id": "HeqkuCsGGNZ4d6xfh0Pnpg", "text": ["I order the same thing every time I've been by (large latte with house-made vanilla) and it is delicious every. single. time. The coffee tastes of cocoa and...", "What a cute local coffee shop! The design of the restaurant is minimalistic and clean. I thought it was neat that you can see how they make the coffee in...", "Local. Good. Chic. \n\nThis cute trendy shop seems like where all the local of Olympia seems to be hanging out. \n\nThe shop is very clean, chic and open. They..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "X8lSp904NxJcZ9VDyUULjA", "text": ["I got two items today from the farmer's market stall. \n\n#1 Russian Pretzel was really awful. Worse than cardboard, it was dry, hard and clearly stale. I...", "Visiting Wagners at the  Farmer's Market is one of our favorite weekend errands! Andrea goes out of her way to warmly welcome us, and she has the best...", "Wagner's Marketplace Bakery\n\nWagner's Farmer's Market Stall is very good. I keep reading issues about customer service at the main location. Customer..."], "rating": [2, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "KUxgBwkWAbnZadJNcP2D7A", "text": ["Olympia Coffee Roasting is a great stop when traveling from PDX to Seattle.  Great space and vibe to enjoy their various coffee offerings.\n\nMy favorite is...", "I gave them 1 star based on their coffee - not their great customer service. They do not offer anything other than very acidic medium roasts.\n\nThere is a...", "1. Location: 4/5. Good location. A quiet neighbor.\n2. Service: 5/5. Excellent.\n3. Quality: 5/5. Very very good! I ordered a cup of hot Americano. It is even..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "cj6OKD0RlUfPpvk92pw9Xg", "text": ["One of three branches of Olympia Coffee Roasting in Olympia.\n\nGreat outdoor space ( on a nice day)with super interesting furniture.\n\nI had the Latte.  Well...", "Love how their hot lattes always come with a little design on top! Cute location, super friendly workers, yummy coffee and quiches.", "Ever seen that huge wooden coffee sign in Olympia?  It's OCR westside!\n\nMy usual is a latte.  The first few times, my latte was lukewarm.  Kind of a bummer..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "YSo9toEfyltgoxA8gTwGTQ", "text": ["Mud Bay coffee is the perfect place to meet someone for a long overdue chat, or just a nice place to get some reading done. \n\nI love that they have a...", "What a cool little place with so much potential, this Mud Bay Coffee Co.  First, to address technicalities, I always thought that Mud Bay was up around...", "Don't want to hate on a local coffee place. But the coffee here is terrible. I'm sure they have nice staff and it's nice inside but if I have to plug my..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "8iU31e0aC_nnwNjy9pkKYQ", "text": ["I haven't been able to enjoy Starbucks coffee again since coming here. This little drive thru definitely lives up to it's name.", "I really like this little coffee stand. They're always quick, and I've never had a bad drink! The baristas are friendly, but don't try to make as much...", "The coffee wasn't that great or hot. The barista was gossiping to her coworker half the time and I felt really rushed so I didn't get to actually look at..."], "rating": [5, 4, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.2], "keywords": [[], [], []]}
{"id": "87A2IsTV9rAU2-QTTtSJ8Q", "text": ["There's something great about a coffee stand where you feel energized before you even have your coffee. The baristas here have more energy in the 3 minutes...", "seriously the cutest little coffee shack ive been too!!! my vanilla chai is so good i think im instantly addicted & cant really get here from cali daily ;)...", "Cute little shop in a parking lot. This was recommended by our CF coach since we were not from the area. They do have all the alternative milk, but..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "WwkXx_7s_frgxSM9yckR0Q", "text": ["I love this coffee shop.  They are so sweet and nice and funny.  When the line gets backed up they come down the line and grab your order.  They are a...", "The coffee I've gotten here has been pretty good, but they seem WAY over priced. I got 2 mochas and a muffin last time I went and my total was $17. I was...", "This small drive thru has good coffee and an unpredictable availability of pastries, which are pretty good. It seems like the staff know most of the..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "Ing24pEqRgAPqnOIsJ_fLw", "text": ["What a great local coffee shop!  The only place I've found in Lacey that offers dark chocolate!  Ask for a punch card and they will actually save it for you...", "Great coffee and fast and friendly service. This coffee shop is a perfect location to meet with friends or for business with a small group since they have...", "Was very excited about trying this place but was disappointed in the breakfast sandwich I would be better off just going to McDonald's but the bagels from..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["breakfast", "sandwich"]]}
{"id": "4MRdcaB66x8UqV46kIIZOQ", "text": ["I am sure the staff are wonderful individually.  They always seem to have decent attitudes.  That being said, this is the only Starbucks of several that I...", "Very friendly staff members. We got three drinks and they came up quickly. My nephew loves their strawberry banana smoothie with coconut milk.", "The staff is not nice AT ALL. A girl name Syndee was SO rude to my boyfriend when he asked for a large water. It was ridiculous. I used to work at the mall..."], "rating": [1, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "MUX0St4JZbPpdC05_wvRkA", "text": ["Absolutely delicious! The tacos were generous and well priced ($1.55) and the salsas were DOPE! 4 salsas! In the AMPM Parking lot.", "This taco truck definitely delivers! I ordered the three taco combo which comes with three carne asada (or meat of your choice) tacos, rice, beans, and hot...", "Decided to give them a try while on the way to chipotle again. I got a regular carne asada burrito and my husband got the chicken, bacon burrito. Definitely..."], "rating": [5, 5, 5], "TBscore": [1.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["tacos"], ["tacos"], ["chicken"]]}
{"id": "Q_O7wXvMVxnBjZfO_MKAEg", "text": ["The beers here are awesome, but what really tips this from a 4 to a 5 is the experience. Love the open layout, quick service, huge amt. of space/seating...", "This is going to end up being one of my favorite breweries. I found them by chance really. My local bottle shop had a couple of their beers. First we tried...", "I finally was able to try this place out after been dying to try it after multiple rave reviews by friends. We came here on a Saturday late afternoon and..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "EYUB3SoD_xyP4o318pZHoA", "text": ["Ok... typical dive bar at first glance.... which I am a fan of so do not get me wrong... but where this one stands out in my opinion - Thursday Taco night!...", "Went last night to enjoy a game of pool and beer the bartender was not very friendly today but ok after I finished a game of pool went to get another round...", "Pretty fun place.  This is now one of our favorite neighborhood spots.  My favorite options are the sandwiches; probably the 2 mile dip, the philly, and and..."], "rating": [4, 1, 4], "TBscore": [0.0, 0.0, 0.39], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["bar"], [], ["sandwich"]]}
{"id": "hFplRL19V7KhkFE8oVG-PQ", "text": ["I LOVE THIS PLACE. One of the last times I went tho one of the dudes working mad dogged me bc I came in like 30 mins before they closed and I get it, but...", "I do not normally give such negative reviews, but if I can save even one person the experience of this place I will be glad. Thinking about my experience...", "Very happy with our kids meals!! \nLarge amount of chips and a larger size taco shell!"], "rating": [5, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.6], "keywords": [[], [], []]}
{"id": "CieRh2qtKVOkQWNKTvQb8g", "text": ["Delicious, strong coffee with friendly employees. Their coffee is always good and strong, with reasonable prices. I also look forward to the complimentary...", "Who ever was closing on Thanksgiving day needs customer service training and a little self awarness. The stand had all it's open lights on with a big...", "I live very close to Hill of Beans. First off, what a cute name. Not that that matters, but it is cute. Every single person that works at this espresso..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "xMQdujQtftW-addeNvJzBQ", "text": ["Delicious, fresh and fast spot for lunch! Updated menu and open 11am-2:30pm Monday-Friday", "Love it. Everything is fresh, full of flavor and this guy knows how to accommodate for every dietary need or desire without skipping a beat. You're missing...", "Delicious! Good portions. Authentic. Worth it. Great price. Fast. Simple. Everyone loved it. Amazing taste. Awesome!"], "rating": [5, 5, 5], "TBscore": [0.39, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["lunch"], [], []]}
{"id": "ThLV9ahFtwGOZI5cMfIuww", "text": ["Pretty good gyro.  The sauce was excellent. The pita bread was soft and warm my favorite part. And the meet was great. I would come here again. My husband...", "Delicious! I've had many different gyros at many different places and this is at the top! Tender meat and great sauce! Will be back!", "I've tried some different gyros and their salads, and they're good. You get friendly, fast service, and I'm a fan."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "hK6Q3sDMXdCSlYRdyqRgAQ", "text": ["Mousetrap Olympia gets two thumbs up!  \n\nWhat a delight to find an independent cremerie right in the downtown area of our capital city.\n\nAnd I could not...", "Just had Sunday brunch at the Mouse Trap in downtown Olympia. Oh my goodness!  It was amazing!", "I'm going to start with a three and a high probability that this will go higher with more visits to Mouse Trap.\n\nMy first visit was when I was down town on..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.75, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], ["brunch"], []]}
{"id": "1Gr1KZn9lfBUZFWjIYy_Vg", "text": ["Super quick service. The prep area is open to the ordering area so you can see everything that's going on with prepping your juice. Everything is super...", "Update to review:\n\nI received a private message from the owner explaining the health department does not allow them to put the protein packets in.  I wish...", "The smoothies and acai bowls were really yummy. The bowls have plenty of toppings but they're a bit small for the price. In fact, everything here is a bit..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "vr_Na_BYcwk0ivQ_xgq6kw", "text": ["I come here from time to time to pick up bread , bagels and snacks at a discountfast friendly counter people.", "A good find.  Great selection and options - want a fresher loaf?  Head to the right as you enter the store.  Willing to take a slightly older loaf?  Head to...", "bakery item ...ok. .. poor customer service . not worth the trip"], "rating": [3, 4, 1], "TBscore": [0.38, 0.0, 0.0], "normalisedRating": [0.2, 0.6, -0.6], "keywords": [["snack"], [], []]}
{"id": "edN56DnGQdTZ1NuBLgXm7w", "text": ["The ladies that work here are always super friendly! My husband and I usually get lattes which are very consistent and taste delicious. This is our favorite...", "This is one of my favorite coffee stands in Tumwater. The gals working are always fast and friendly.  Great coffee and decent pricing.  They also have a...", "It's a great stand. Awesome service, great girls, and excellent drinks. Located in the Southgate Mall in Tumwater."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "OZB-AA5AMMNDyFszN_XRSA", "text": ["A solid little coffee shop pouring D'arte (an especially forgiving and chocolaty roast). Service is super friendly and the whole vibe is upbeat. The store...", "Coffee Central is an oasis amid a desert of state office buildings.  It's directly across Israel road from the Tumwater post office.  Kinda hard to see from...", "This place was super hard to find! It is tiny and cute and tucked between many large office buildings. When I was here it was pretty slow and they let me..."], "rating": [4, 4, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 0.6], "keywords": [[], [], []]}
{"id": "3wpsW0YQznHLHYWUFTtqsg", "text": ["Always the best. Very nice customer service. Rented kayaks a while ago, and they are very helpful for those, like me who get freaked out easily. Highly...", "We absolutely love coming here by boat!  I will say that it has been difficult finding a parking spot since the dock has taken a long time to repair due to...", "Best place in the Olympia area to drink a beer or wine or cider on a day when the weather is perfect.* Good bicycle parking. The marina is a great place to..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "xLbwzyQ5aU8Lse6n8y8d3A", "text": ["Hot Pho on a cold day.  Perfect timing.  Really good broth with fresh veggies and herbs hit the spot.  Good spring roll, fresh and tasty with the peanut...", "My favorite place in town to get Bubble Tea (or Boba) however you wanna call it. Flavors are great and large is a good price. You get a good amount for what...", "The closest place we could get boba. Will do the trick if you're having some cravings and too lazy to drive to get a better milk tea."], "rating": [4, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "24cMo0qf4vjMtvJD_EhnqQ", "text": ["Delicious smoothies plus great customer service!  This is located in the same strip mall as Teriyaki to go and a mailbox place. Parking is plentiful and...", "Delicious well made smoothies... but it's just super inconvenient that they close at 6pm.. like what kind of business closes at 6pm. Most people don't even...", "Don't go to Trosper location ... ordered a large got a regular when I asked about it she rolled her eyes at me then threw ice in it blended it and handed it..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], []]}
{"id": "zl0V5Qldq6RTzbJStBLPGw", "text": ["My first time here was over a year ago. My mother and I both went for massages. I got a deep tissue and a citrus detox (which I LOVED the citrus detox) I...", "Similar to some previous posts, we were met with pretty poor customer service. Upon entering, a student of mine asked where the rose essential oils were and...", "I love this place. It has such amazing vibes and helpful employees! Everything from bulk herbs, bulk shampoo/conditioner, crystals, and incense to massages..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "R3hb4lLGEH2Qgc_bInFH8Q", "text": ["Really great cup of coffee, and the barista was very welcoming (she seemed to know all the regulars' names).", "If you want super strong americano come here reasonably priced also tried a flavored drink very tasty that one kinda pricey but the place is cute and they...", "Love this shop, the coffee and baristas! Come check out the new remodel! The shop is so beautiful and as always the coffee is delicious and served by..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "T0u-i-Ocbm1ATvT46E6t7Q", "text": ["In a way, I'm really glad this 7-Eleven got rid of it's gas station as it just wasn't angled right especially if you were coming off Carpenter Rd. They had...", "You can't hope for much from a 7 Eleven. They are all pretty typical and standard fare. This location removed the gas pumps, so now all they offer are...", "stopped in for nachos and mini tacos today. The guy that helped me did not understand english. the tacos were old and burnt and the nacho cheese when I got..."], "rating": [3, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, 0.2, -0.6], "keywords": [[], [], ["tacos"]]}
{"id": "outhkdxlEsHKV0gCMX5uJg", "text": ["Drive through coffee and delicious. The nicest server ever. If I lived the area I would be there every day.", "I will delete this but want the owner to know my daughter just got food poisoning from a green tea purchased there around 1 pm\nToday. Please do a thorough...", "I go here almost everyday even tho I have a coffee stand literally less than a minute drive from my house. I find this one has better tasting drinks AND..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "d7T19uqClDS8VXMCLcajEQ", "text": ["Another coffee shack/stand - or more succinctly - a coffee/espresso lighthouse! This one has an Olympia, WA address. \n\nOrdered a triple shot iced latte with...", "I love this awesome little drive thru coffee spot! Super cool barista's serving up proper drinks in lightning speed time. Delicious coffee! I plan on...", "Nice little coffee joint without the half naked females, either a good thing or bad thing whatever you choose.  The coffee was good, service was nice and..."], "rating": [5, 5, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.2], "keywords": [[], [], []]}
{"id": "XKZqU9La4QP0sK-tr68lKQ", "text": ["Got some really yummy buttermilk and fruit here. Also a cookie for the monster.\n\nDon't forget to get the codes because the volunteer cashiers rely on you to...", "And another update yet again (but this one is more positive):\nI know I said I would never shop here again because of how I was being treated, but it's hard...", "I really enjoy this co-op, we just relocated here from out of state and this was the first place we came to and we were greeted with such hospitality,..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "MrBE4RAJNC-mBCKE-xEzrg", "text": ["No vanilla, no lids, no spoons? This place closing down? The last few times we've been here in about half a year. They either don't have this or that. Now...", "Not sure if I went at a bad time but the frozen yogurt wasn't frozen enough. \n\nIt was sort of runny frozen yogurt like it was melting even though I just put...", "Great customer service! Yummy frozen yogurt and tons of add ins! Love the guessing game!"], "rating": [1, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "rRFtTRJpjdK9B5XOcilG8Q", "text": ["This place is great.  The owner Chaz is super helpful and friendly.  The inside is fun they have a ton of bicycle memorabilia.  The ebikes they sell are...", "Such a cool business. Really cute cafe with some food items as well. Cafe has tables, lounge chairs, bar seating and a game table. Good selection of...", "HORRIBLE service. I don't see myself ever returning. Fortunately, for this review, I was on the phone for most of my time here -- and thus, I was able to..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.23, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["bar"], []]}
{"id": "onu2VsoTyWlWbc_CLNDTBA", "text": ["Was greeted with a smile and a hello. We joined the co-op as soon as we move to Olympia, I love the diverse selections and local product. And I love...", "so many healthy options to choose from.  whether it be organic, fair trade, gluten free, they have it all.  The staff is very helpful, the coop is a very...", "I love this place. Go-to for all of my needs! Greats bulk section. Don't forget you jars and bags!"], "rating": [4, 4, 5], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [[], ["gluten"], []]}
{"id": "fsyB-dXUFGUFCTORRnlZRg", "text": ["This bar is JUST what I have been looking for! Too bad it is not in the town where I live in! I don't like the bar scene all that much in Tacoma. All the...", "This bar is unique. If it weren't for the large shrine for the Devil, I probably would go back but... nah! I did like the little booths they have to sit in...", "Usually love this place. My boyfriend had never been. I talked it up to him and told him about the great cocktails they make. We walked up to the bar and..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.65], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "qEKmPBwlpicswX4IvLEP5Q", "text": ["We stopped in here on a Monday during our one night stop in Olympia. We entered without knowing anything about the place and it was the best surprise of our...", "Waitresss was clearing my table, I said god bless and she confronted me on my religious views. Not a religious man, just sharing the Blessings!", "The Brotherhood is still one of my top three choices in Oly for hanging out, even though the Billy Dee Williams sign has gone missing. \n\nCheck out the..."], "rating": [5, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "IzEPI_HLWoRPRQc0sBa-kQ", "text": ["I've always driven by this place and wanted to stop. I finally went with a friend and now I've dubbed this as my favorite place to relax and chill. It is...", "Chill tap house! Plenty of places outside to hangout and enjoy your local brews with benches and lawn chairs on the grass. On the other side of the building...", "Just stopped by for a quick few beers tonight. I had the pineapple lime cider. It was great. I'm not much of regular beer drinker to let you know a lot of..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "yud9Hps59KucMbGkiQrLWA", "text": ["Quiet during happy hour,  but you won't be sorry talking to Andy,  Brian or Pete during these non musical times.  All bartenders are personable and...", "It's okay. I had a delicious Tom Collins (definitely the best I've had in town). There's very minimal seating, however, and the charge to get in is fairly...", "I went to the Monday Night Jazz and enjoyed it very much. There is an open & airy feel to this bar and I like the casual seating arrangement. It's the..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], [], ["bar"]]}
{"id": "N_ZpAPaI-Id6hq8gLjJ90w", "text": ["All of the beers! Great staff with knowledge and spot on suggestions for those narrowing down what you like. Growlers to go and an ever rotating list of...", "Wow and wow! This place doesn't look like much, but the drinks I tried were really something special. I tried the lemon basil cider. Yes, lemon and basil...", "I love the owners, employees, amazing selection of spirits, and that Wally's will bring over my sandwich. Highly recommended!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.43], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["sandwich"]]}
{"id": "BMvk7GajniNgbW5O23EHzg", "text": ["I won't be coming here again. The bar tenders were very rude. I am annoyed that I gave them my business. They patronized my friend for no good reason and...", "What a fun bar in Olympia.\nI've been to Eastside a few times and have loved every experience I've had.\nThey have a large selection of beers at a reasonable...", "Love the beer selection! Bartenders are knowledgeable and patient. My favorite bar in Oly!"], "rating": [1, 5, 5], "TBscore": [-0.38, 0.24, 0.62], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [["bar"], ["bar"], ["bar"]]}
{"id": "wb1jIY9Q9IvIvaz0TOng-A", "text": ["This is a charming and inviting neighborhood wine bar. They offer an excellent selection and will craft a flight for you based on your preferences. I'm new...", "I attended a wine tasting session known as, \"Rose for days.\" My friend had seen the event on Facebook for $17. Upon arrival, I was under that the event was...", "This was our first time in here!!! It was great! Thank you Lori for staying open late for us and taking excellent care of us. We had a great time and will..."], "rating": [5, 5, 5], "TBscore": [0.61, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], [], []]}
{"id": "OJgUVCrU84TN4oGv3qftNg", "text": ["I think I read a negative review of this place, but I don't know why.\n\nWe stopped in on Thursday before Memorial Day weekend. It was a slow afternoon, and...", "The Growler Garage is my favorite place in Olympia to go try out local beers all over Washington. They have a wide variety's of beers and ciders which Brett...", "This is an awesome place. They have a massive amount of cold fresh beers with so many choices!  I never spent the time counting but there are at least 40 or..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "dhPEwRjSfyd9q0i9Xk7Pgw", "text": ["This is a dope place! I really like the setup of the bar. So many beers to choose from and good deals on the samplers. Free pretzels while you get your...", "They want $17 for a growler full of Manny's Pale. It's $10 over on College and Yelm at Lacey Liquor & Beverage. $5 for certain taps.", "Great selection of beer, cider, kombucha and wine.  Watched Monday Night Football and enjoyed a Schooler Exact pale ale. 34 taps for you to enjoy,..."], "rating": [5, 1, 5], "TBscore": [0.45, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["bar"], [], []]}
{"id": "woavXALmhEP69eQEFvQ0xA", "text": ["I thought this place was good, my group of friends and I had a great time. Drinks are a little more here than the rest of town but only by like a dollar. My...", "DJs literally plays the same songs every weekend and ask you \"are you having a good night\" 20 times  Security gaurds are the only cool dudes in there. Get...", "This club is TRASH! The staff are terrible. They only have 2 one-person restrooms. We spent over $300 for vip and then got kicked out and drug out by the..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], []]}
{"id": "16vzeoAoubzXIRp_07rQSg", "text": ["Wow probably the best bar in olympia.  Great friendly staff, great food and great fun.  I would recommend this bar to anyone.", "Description:\n-Bartenders are really nice\n-Has pool tables\n-You probably won't catch much judgment for being however you are\n-Dirty and broken down\n-Not a...", "I'm not sure that this place qualifies as a gay bar. It was certainly over crowded with straight people--which is fine because people should feel..."], "rating": [5, 1, 1], "TBscore": [0.6, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.6], "keywords": [["bar"], [], ["bar"]]}
{"id": "v10V-PCZdHb2L-Yn1FXJOQ", "text": ["The McCoy Tavern is Oly's good ol' metal dive bar for day drinking. I spotted it and knew I wanted to pop in for a cold one. I had to drag my brother from...", "The only redeeming factor of this bar was the cheap drinks. That's as far as I can go to tolerate this place. The place has a reputation for being a dive...", "This place is awesome myself, my sister, niece and  my sister's boyfriend all went to this place and listen to Three bands and the bands were awesome the..."], "rating": [4, 1, 5], "TBscore": [0.0, 0.25, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "m-E18TxW8rd9JviL9k4okA", "text": ["Best taco Tuesday in town but it's always busy so be prepared to wait, it'll be worth it! I wouldn't recommend the NY steak on Saturday, otherwise their...", "This is a great local bar / restaurant for me, only about 20 minutes from my home.  It is located right near the community college but on a back road from...", "They did kind of ignore us the first time we came here but it was a very hot evening and they didn't have a/c. We ended up leaving which is probably what..."], "rating": [4, 4, 5], "TBscore": [0.49, 0.0, 0.0], "normalisedRating": [0.6, 0.6, 1.0], "keywords": [["steak"], ["bar"], []]}
{"id": "so0T8-jQU0pgeo1zbQrSBg", "text": ["Normally I like hitting craft beer places but every once in a while a good cider place hits the spot! Whitewood is just such a place!\nI first heard about...", "I really liked this cider spot! It's in a super cute tiny house tap room. There's two tables and a small bar as well as an outdoor area. They have a differ...", "So disappointing.  Cider was local, but too acidic and kind of moldy tasting. The place is good at hyping their local roots, but not much else.  Tried their..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.27, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], ["bar"], []]}
{"id": "Tob2kYmHB07kzbSKTm-Iwg", "text": ["Our 1st time was with a group of 10, at 8pm on a Monday. It was very busy, but the staff was outstanding! Drinks for all in minutes, then another large...", "2 Long Island limit. Only real service for \"regulars\" you're basically a second class patron unless your popular. Never offered a menu or refill unless I...", "One could say this is part of local chain of Pint's restaurants in the Olympia Area, but each has its own menu and feel, so they almost do not seem related...."], "rating": [4, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 0.2], "keywords": [[], [], []]}
{"id": "Qme01jjev6b__KvpLPdEkA", "text": ["This is a dive bar people. Not a bar you seek out based on yelp reviews. Don't go in there if you're easily offended or looking for a young crowd. This...", "This bar has the most unique punch board experience I've ever experienced. Add in the 10 cent price for the punch board mixed with the best Bloody Mary mix...", "Really?  Only one star because someone hurt your feelings?  Don't be butthurt.  This place is a dive, sure. One of the last true taverns in town, which..."], "rating": [5, 5, 5], "TBscore": [0.27, 0.31, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], ["bar"], []]}
{"id": "7DNsu7lrmvnAmKpwsYHIWQ", "text": ["We just received our order for delivery..this is the best I have  had, they are very fast in delivery, and I asked for alot of sauces, I got ALOT...I love...", "Delicious! Very reasonably priced and friendly and attentive service. I had the Kung Pao Chicken and it was really very good.", "Very good food super fast delivery. And very nice staff when I actually dined in. I like this little place it's very close to my home and it's the best..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.39, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "ppsz5HdXwOu1AG1Q8J7-6A", "text": ["My fav pho place in town! I always get fresh roll appetizer, a bowl of pho and either ice milk coffee or bubble tea. Very consistently/reliably delicious....", "We've been eating here for years. Good, reliable vegetarian pho; it's always been my go to. We often order take-out, I love how they package everything up...", "Decent Pho, but bad service.\n\nI don't appreciate the implication that I'm stupid or dishonest after you get my order wrong.\n\nIf your employees are incapable..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "jtPWrEVeutwgQlbICftvuw", "text": ["Got a take-out order of chicken pad thai. Phone order was fast and easy, and the food was ready in ten minutes. Only took a couple of minutes to run in and...", "Although compared to my favorite Thai restaurant in Seattle it is not a 5 star in my opinion, but it is pretty darn close. I have had a few different types...", "I love this place so much. Spice levels more accurate than most, great flavors, fantastic dishes."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chicken"], [], []]}
{"id": "HL1NC8xDQs5FaPK3uLX04A", "text": ["1. Location: 3/5. Little far from downtown.\n2. Service: 5/5. Excellent.\n3. Quality and taste: 4.5/5. Amazingly good. Very genuine Thai cuisine.\n4. Price:...", "Went back to give them another shot after being frustrated before- unfortunately it was worse. I use to feel like they had small servings and high prices,...", "This is literally my favorite place to eat Thai food in Olympia, but that just changed. You can't have Thai food without fresh spring rolls, they have..."], "rating": [5, 2, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.2], "keywords": [[], [], []]}
{"id": "SDxfyBmecUxMjnUZ6zxR8g", "text": ["Love their pad Thai for lunch (always take out). \n\nBut like their star system for heat, a four star rating can mean different things depending on the day....", "No. No no no no.\nIf you love Thai and have been to many a Thai restaurant, don't come here. \nIf you are starved and think, ah we'll stop here. Don't. \nI've...", "We stopped by this place driving up the coast and are sorry we did.  I am actually writing this while sitting at the restaurant because the food was..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["lunch"], [], []]}
{"id": "l7bt0bSaz-sKTFwMtIqH7w", "text": ["This has to be my hands down favorite Thai place in the universe. Every time I go I think, \"it can't be as good as you remember it being- you are idealizing...", "I feel like I have a pretty good handle on Thai food as it's one of my favorites. Furthermore, why doesn't Tumwater/Lacy area have great food spots?!...", "We have been to the Lemon Grass in Tumwater several times and have been disappointed each time.  Not going back.  Tonight we ordered almond chicken for take..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, -0.34], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], [], ["chicken"]]}
{"id": "maNDatzNGe6xSk1fgE1ktg", "text": ["Great tasting quality Thai food! Excellent value for Lunch. I had the Almond Chicken and rice.\nIt was delicious. I asked for very mild. \nThe place was...", "The food as usual was excellent. I got the chicken pad Thai and no complaints at all. My issue was with the Employee Doris. Very rude and very...", "Paying for their real estate, not for good food. \n\nThe staff is nice, the kitchen is slow, and the dining area looks good. \n\nThe rice noodles NEED WORK! In..."], "rating": [4, 1, 1], "TBscore": [0.57, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["chicken", "lunch"], ["chicken"], []]}
{"id": "txVpYAQfRrZOK4qvSBVSYw", "text": ["The pho was excellent. I got the steak and brisket and it came with the standard bean sprouts and lime wedges to add to taste. I like that the bowls were...", "I've been a fairly regular customer at this place because it's one of the few places open late around here & food has been decent except for a time when I...", "Such a big disappointment!!! We came all the way from San Jose to Seattle to travel and were so happy to find a Vietnamese restaurant in a remote area that..."], "rating": [4, 1, 1], "TBscore": [0.5, 0.0, 0.0], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["steak"], [], []]}
{"id": "uhiMkW6fDuGehEykMTvZFQ", "text": ["Well, I've been in the Olympia area for 7 months and have only tried about 4 Pho places but I think this one will be my go to. \nMy review is weighed heavily...", "I wanted to give 2 stars but my husband said, just 1 star and I agreed with him but our waitress was very nice. \nFood, OMG, the worst fried rice I ever had....", "We come here all the time because they are amazing! Number 1 pho and the spring rolls are our favorite. Very fast and friendly service!"], "rating": [4, 1, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.6, 1.0], "keywords": [[], [], []]}
{"id": "rXTlxCt8sNIkSjUOzlAO-g", "text": ["This is a great place to order food for not much, but the fact that the people put the tray upside down and on a dirty surface made me disgusted. But other...", "This is a fairly good ripoff of Sarku branded teriyaki. You can even tell by the colors of the place that it used to be the franchise. The sauce is ok, not...", "These guys make the best Teriyaki in town. The staff is very efficient and makes a great plate of Teriyaki Chicken."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.35], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], ["chicken"]]}
{"id": "QTfj6XWECn9zc2q2oCGAQw", "text": ["We were stuck in traffic, starving, pull off freeway and felt like having teriyaki chicken.\nSaw this place and went in.\n1. One woman show, was on phone and...", "Not Closed - but should be.  I stopped in for the lunch speacial as I was at Men's Warehouse.  I have eaten here before and the woman behind the counter has...", "The rice and chicken were not half bad, and the vegetables were awesome, but the sauce left something to be desired only because there is a taste..."], "rating": [1, 1, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, -0.6, 0.6], "keywords": [[], ["lunch"], ["chicken"]]}
{"id": "JCAmjH-pERIA8gU7eWCtyQ", "text": ["Restaurant quality: very clean and decorated well ~ Pleasing environment!\nStaff: staff are very prompt and friendly~ feel free to ask them questions \nFood:...", "This is by far the worst Indian food in the country. I have tried Indian food in many states.\nI am a Chef and an Indian, I know the difference between the...", "Walked in and was greeted and was able to seat myself. The host brought water right away. I was having the lunch buffet... \n\nThere are different Curry's to..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.26], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], ["indian"], ["lunch"]]}
{"id": "Eg7R_4KPpb-m8I3ZXd_8eQ", "text": ["This is one of my new favorite spots! \nThe food is delicious and priced very well. My husband isn't a huge fan of Indian cuisine and he left very satisfied...", "It was my second visit  there but it was an absolute disappointment, I ordered butter chicken and chicken tikka and tandoori chicken during my two trips,...", "Came here for dinner by myself. They treated me very well.\n\nI ordered the vegetable samosas and the non-vegetarian Curry house special which came with the..."], "rating": [5, 1, 5], "TBscore": [0.43, -0.37, 0.28], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["indian"], ["chicken"], ["dinner"]]}
{"id": "KzrBB2401TZ6P3g132dxsA", "text": ["Curry in a Hurry is a hidden gem of Olympia. They don't have any locations outside of the farmers market, so if you weren't at the market, you'd probably...", "Very weak, watered down curries and small portions. \nNot very flavorful nor appetizing. \nTried them twice hoping it was a bad day but no luck. Pass!", "Convicted of a crime I didn't commit, I sit on the concrete bench waiting, the Warden asks for my request for a last meal and I ask for the chicken curry..."], "rating": [5, 1, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 0.2], "keywords": [[], [], ["chicken"]]}
{"id": "2O6jYEZ61F4yXMWTDnNZoQ", "text": ["What a welcoming treat to your community! Excellent, friendly services, wonderful atmosphere and more importantly great food!  Had the buffet on their first...", "The tandoori and masala chicken were surprisingly tender for a buffet, and delicious.  Great vegetarian sides and sauces.  A large piece of Naan came with...", "Food was so delicious!!! Staff very friendly and professional.  It would be hard to not frequent this place.  I will be back."], "rating": [5, 5, 5], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["chicken"], []]}
{"id": "i1iLXCzNIEh7AYEG8WMp8w", "text": ["Easily my favorite place to eat in town. Whether you're new to Indian food or have tried every dish under the sun, this place is the place to go. I have...", "Servicable all-you-can-eat Indian buffet, in just the way you'd expect. Very reasonably priced. Descent renditions if Indian buffet classics like chicken...", "This was a nice, quiet, clean place to have lunch.  The food was delicious and the buffet had nice flavor and good variety.  The fresh Naaan was especially..."], "rating": [5, 4, 5], "TBscore": [0.32, 0.0, 0.45], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["indian"], ["indian", "chicken"], ["lunch"]]}
{"id": "x0ArKyanO8wjxH97D4HUAw", "text": ["My parents have been here before but this was our first time joining them. My husband has never been to an Indian restaurant before and he absolutely loved...", "Their naan bread is so soft, so flaky, so buttery, so delicious, I have literally yanked a left turn while driving past and ordered some to go on the spot....", "I feel like you know a place has mediocre food when no one at the table wants to take home their leftovers. I think i was just in a picky mood yesterday..."], "rating": [5, 4, 4], "TBscore": [0.47, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["indian"], [], []]}
{"id": "NPdcKB5uMj8L97dIDn-9BA", "text": ["I have been back many times, and have tried the veggie and chicken pakora, the samosa, and the garlic or plain naan are all winners. \n\nthe Chicken in any of...", "I have been coming here for ages, and every visit I always have an amazing experience. The food is delicious, and the staff are also amazing. If you are...", "Y'all, I'm half indian. The daily lunch buffet has a small selection. Everything is so bland. Lack of Masala. I do not recommend the lunch buffet. I give it..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["chicken"], [], ["indian", "lunch"]]}
{"id": "kujR1oCsgO984RMGSLthug", "text": ["This is my favorite restaurant in Bremerton, bar none. The food is always spectacular, and it's one of the few places that believes you when you order...", "Amazing food, great service, very knowledgable staff for vegan options!!!!  Great nann, friendly staff.  Food came fast and tasty.", "Updated interior still the same smiles and excellent service!!  Love the smells as you walk towards the restaurant, makes entering all the sweeter!"], "rating": [5, 5, 5], "TBscore": [0.3, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["bar"], [], []]}
{"id": "Kh0sAsTVjEco2gexz7xT4w", "text": ["Love this place!! Service is really nice and they actually believed when I asked for it to be spicy.  He just asked if I would eat habineros! I was so happy...", "BROKE DA MOUFF !! I'm glad I didn't let one bad review stop me from trying out this place ; it's a hidden gem !! My husband and I had the coconut curry...", "I can't say enough about this place. It's definitely one of our go-tos for takeout. Everything we have tried has been absolutely delicious. It's almost a..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "gYCinUMddEaUFSkRbSJyvw", "text": ["This is my go-to Indian place in Federal Way. I tried their lunch buffet a few times, but I prefer the a la carte menu items. I've never been a fan of...", "I had a hankering for Indian food and selected this placed based on other Yelpers reviews.  I ordered veggie samosas and Dahl soup with naan bread.  The oil...", "I love coming here doing the AYCE lunch on some Sundays. East India Grill is my favorite Indian restaurant in South King County. I love just about..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.5], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [["indian", "lunch"], ["indian"], ["indian", "lunch"]]}
{"id": "uhR4iU3vQ5v4_7ueIonKQw", "text": ["This is some of the best Indian food I've ever had. The staff is great and helpful when it comes to recommendations. There are lots of vegan, vegetarian,...", "Absolutely a five-star joint if they had any semblance of service and time management. So bad I almost dropped two stars.\n\nEnough negativity; let's get to...", "Love it! We always get it to go and the order is always on time and packed perfectly!\n\nOur \"usual\" order is chicken tikka masala, tandoori chicken on the..."], "rating": [5, 4, 5], "TBscore": [0.9, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["indian"], [], ["chicken"]]}
{"id": "D4lQ9A2BRQe73tHYPtUjpA", "text": ["Time and time again, this place never fails me. I've been here with my boyfriend a few times, as well as family. It is time for me to give this place a...", "This place is not horrible but not good. I came here on a Friday night with my family after multiple people recommended it to me. \n\nWe got seated promptly...", "This place is wonderful. \n\nThe service was good, although you get served by everyone, you still get well taken care of and we didn't feel like we were..."], "rating": [5, 2, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, 1.0], "keywords": [[], [], []]}
{"id": "SKBrtmQeCyerKD32_rIwaA", "text": ["This place has some of the most delicious dishes I've ever tasted. My first India cuisine experience was here and when I heard about how spicy you could get...", "Kent, WA: friendly \n\nImmediately welcomed and seated upon entering.\n\nFOOD\nChicken Malai\nVegetable Biryani\n\nPortions were decent. My dining companions wanted...", "I visited this place with my friends after a hike. It might be a little difficult to locate this place as the board is very small compared to other..."], "rating": [5, 4, 4], "TBscore": [0.58, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["indian"], [], []]}
{"id": "Z0V5qm0Tpw_elLjSPXGA8Q", "text": ["This is a good 4 1/2 star restaurant. 5 for the food 4 for the service. \n\nFood is authentic! We ordered the dinner for 2 for $42. It came with a choice of 2...", "Food was okay, service was horrible!!\n\nWe went there with friends while returning home from our trip. Along with our order we ordered veg biryani and matar...", "Ridiculous food. I ordered vegetable samosas, chicken tikka masala and plain naan. The vegetable samosas were burnt, it was super hard and was straight up..."], "rating": [4, 2, 1], "TBscore": [0.66, 0.0, 0.0], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["dinner"], [], ["chicken"]]}
{"id": "7h9cqRLdkOSu5brLTlL7yQ", "text": ["Authentic Indian cuisine!!  \n\nPalak Paneer, Butter Chicken, Dal Mahkni, and Naan.  It's all you need.\n\nThe palak paneer has big cubes of cheese, which I...", "We really enjoy dining here, but we wish they would work on a few issues. First the good news - we love their food and service. Everyone there is so...", "Came here around 4 on a Sunday. The food was good, but the service wasn't great. The restaurant wasn't even half full and we waited at least 15 minutes..."], "rating": [5, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.6], "keywords": [["indian", "chicken"], [], []]}
{"id": "sVcRhm-R2thWL8UruMA1nQ", "text": ["If it's your first time coming here, I'd recommend going with a semi-large group so you can try a number of dishes. With six adults and three kiddos in our...", "I've been here so many times, I don't know why it's taken me so long to review it.  Their dinner menu is solid.  All of their goat options are great, my...", "I've been going here since they first opened and this is my go to place when I have a craving for something different from what I normally eat.    I think..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.31, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["dinner"], []]}
{"id": "Xjb0Su2ZiTXvctk2x0SkKw", "text": ["After leaving Wiggle Works we stopped by the food court for lunch.\n\nNaan bread, vegetable korma, lamb tikki masala and chicken curry. More than enough for a...", "I was recently in Puyallup for a quick business trip that only lasted a couple of days/nights. I flew from the Indianapolis airport, through Houston, and -...", "For the price of $7.99 two entree, rice, & naan. That's a steal. I would have gave 5 star if there was just a little bit more spices, a bit bland for my..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["chicken"], [], []]}
{"id": "_4rv6ssRb9RpYdXQZgEQOw", "text": ["What a perfect foid experience. I tried something new: lamb coconut curry.  Yummm!! My husband is in love with the vegetarian samosas", "Somewhere in the middle of being very good and average .. may be a notch short of good is how I would rather say.\n\nOrdered via yelp for lunch today .....", "Found what appears to be a roach in the butter chicken sauce.\n\nIt would be less concerning if I found a whole one. But unfortunately, I found half of..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.29, -0.25], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], ["lunch"], ["chicken"]]}
{"id": "pkcTiyrjgLrkPJYySDbcjQ", "text": ["First time here and they were short handed but the service was fantastic. Very Attentive. I had the cream of spinach with lamb since I wasn't hungry and it...", "Been here twice, once for dinner and once for there weekend buffet and both experience was great. The food is the fairly standard Indian restaurant menu,...", "Came here for a business meeting during lunch hours and we were the only ones there. Good thing for us, that meant no waiting and we never had to wave down..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.4, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["dinner", "indian"], ["lunch"]]}
{"id": "RTEgDw0bl9ahbMX188aKfw", "text": ["Probably the best Indian food I had in recent times.\nWe travelled to Seattle from Chicago for the thanks giving weekend to meet friends and found this...", "This is one of my new favorite places and super near my parents' house. Butter paneer is soooo good, and so is their gobi Manchurian. I know it's really an...", "Newly opened Indian restaurant in south Bellevue. I went for dinner on a weekday. They had a very expansive menu even though the guy said they are just..."], "rating": [5, 4, 4], "TBscore": [0.4, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [["indian"], [], ["dinner", "indian"]]}
{"id": "WiPw_V03ZhYugDNevaEXNg", "text": ["Went on a Portland/Seattle trip last weekend and stumbled across this gem late night. \n\nTLDR: Best butter chicken I've had in my life. A bit pricey for what...", "I am torn about my rating. Every time I've come here in person for lunch I've had a great experience. Their bathrooms are clean, waiters are nice, the...", "I've never had someone be as rude or as obnoxious as \"Pogie\" or \"Bogie\" or whatever he said his name is. He was completely disrespectful and actually gave..."], "rating": [4, 3, 1], "TBscore": [0.0, 0.59, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["chicken"], ["lunch"], []]}
{"id": "nOm4781Zpxw9ElalW06O-Q", "text": ["Absolutely wonderful. Don't let outside appearances deceive you. The garlic naan is spot on - crispy and soft at the same time. And the vegetable pakoras...", "I wanted to expand my horizon and decided to try some Indian food out. This was my first time at this restaurant. I ordered the butter chicken and garlic...", "Holy Moly!!  Ate there today and it was so good!!!\nTheir garlic naans is the best I've ever had.  We ordered chicken in a cream sauce with nuts and raisins...."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.47], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], ["indian", "chicken"], ["chicken"]]}
{"id": "xhjfifw4iXUIm3_zXHtqJA", "text": ["The Best Vegetarian restaurant you can find! Went on a Friday evening it was not very crowded there still a lot of tables empty. We were able to change...", "This place has been on radar for a while so I decided to finally give it a try. The place is located in the same area as feast buffet and Fred Meyer so...", "One of the best places to eat vegetarian food in seatac and its neighbouring cities. We asked for a vegetarian thali and it tasted soo good. \n(Either it was..."], "rating": [4, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.6], "keywords": [[], [], []]}
{"id": "oQSaZB9QsTNcrli2BKuFzg", "text": ["Been coming here for almost a year now and every time the food is delicious, especially for the low prices. So far we have tried a bunch of curries, garlic...", "I am sad to write this review because the food is great and the prices are reasonable, but the service is awful. I've been to this restaurant several times...", "Ordered online....  when picking up, rude, arrogant and acted like I was bothering them.  Made me feel like CRAP!  NOT FRIENDLY, HELPFUL and RUDE!  \nTHE..."], "rating": [5, 1, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.6, -0.2], "keywords": [[], [], []]}
{"id": "6DIsvKzSU0IScmaOglVZPQ", "text": ["I really like their Haleem and chicken dum briyani. I think their Haleem is actually one of the best in the Seattle area and chicken Palak. This is why I...", "Rude people. You feel really unwelcome. I would never visit there. They threat us if we are dumb people with money to spend. I would eat noodle instead of...", "I am a sucker for good food. I could care less about the ambiance and service if food is out of this world. That was my expectation when I walked into Naan..."], "rating": [4, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 0.2], "keywords": [["chicken"], [], []]}
{"id": "i_eKMzNL0B7YAuZY4TKvBA", "text": ["The food is as good as it gets :) and why I was here is also some where a neat story :D \nIn short - the thing is at we play cricket in Spokane, formally. I...", "One of my favorite Indian food place.Good food and clean place.\nDelicious and varied lunch buffet. Great food and delicious and nice staff.", "During our visit to Apnaa Bazar for groceries, had dinner at this Maharaja as it looks and sounds royal. But the food definitely does not live up to its..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.71, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["indian", "lunch"], ["dinner"]]}
{"id": "Z3sM3XzJI9DX4o5IQyoPZw", "text": ["We tried this place out via doordash....I have one word for you: mmmmmmmmmmmmm!!! Everything was authentic and delish!\n\nThis place doesn't disappoint!  Bravo!", "This is my go to place for Indian food. Nice little spot in federal way twin lake area. I have a lot of middle eastern friends and I eat home cooked Indian...", "Unbelievable. Came here by myself and my bill was $13.20. I tipped $4, making my bill $17.20. On my bank statement I was charged $27.20 so I went back two..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], ["indian"], []]}
{"id": "Mr0V6LFiJn01nJTLIVdHhA", "text": ["Really awesome that this place exists. The amount of authentic Nepali dishes on this menu is unparalleled in the Seattle area. Obviously a family ran place...", "I order here through door dash. I absolutely love Indian food but this place is lacking in flavor. I understand it's Nepali style but I've had Nepali style...", "I've ordered delivery from here twice and dined in once. The difference is crazy! I honestly think they just serve old leftovers that have been sitting..."], "rating": [4, 3, 2], "TBscore": [0.0, 0.5, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [[], ["indian"], []]}
{"id": "YJqoWZ2MRlCvMVTGBhnX3g", "text": ["We had the Shahi Paneer and the Butter Chicken (I swapped the chicken for Paneer) and they were both ABSOLUTELY DELICIOUS. My husband and I are very...", "We really enjoyed coming here for dinner. The somosas were very tasty. Tandoori chicken was quite nice and the tikka masala sauce very good. They have Dosa...", "The 5th time we have been at this restaurant and it never dissapoints! First, nice and good natured chef and servers. Second, unlimited free tasty tea and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.32, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["chicken"], ["dinner", "chicken"], []]}
{"id": "zT5gi6FnFR-qna_orP1fwA", "text": ["Ok I have been here 10 times now so I think it's about time I penn down my thought about this place. Let me start out by saying that having grown up in...", "Love this place- vegetarian paradise. The other restaurant most similar in terms of food quality and creativity is poppy, who also serve thalis. Think of...", "The food is very rich in flavors and yummy.  Have been here a couple of times and all of the times the food lived up to my expectations.  If you are South..."], "rating": [4, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 1.0, 0.6], "keywords": [[], [], []]}
{"id": "hXrIlofZm9-fuFUrDQb1bQ", "text": ["They have an online ordering system off Yelp that's really easy to order instead of calling to be put on hold and honestly I can't even pronounce a lot of...", "We hadn't been to India gate for lunch for years. The prices are reasonable. we like the assortment of Vegetarian and other dishes. It was nice that they...", "I rarely went to india place but this place is less than decent.\n\nService was ok, thanks for splatters of.my water refill \n\nTheir food was not bad , their..."], "rating": [5, 4, 3], "TBscore": [0.0, 0.23, 0.22], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [[], ["indian", "lunch"], ["indian"]]}
{"id": "TH-GMXoL3m34rmaTCJNUCg", "text": ["For the most part, it lives up to the Dhaba experience you get in India. I have looked for good seekh kebabs since moving here and although they weren't...", "It was... okay. Here's a quick review.\n\nPros:\n- Food is a little above average\n- Open late till 2am\n\nCons: \n- Dirty and rundown environment, recommend...", "I ordered from this restaurant through Grubhub. I specified delivery. After the deliver time came and went, I called and was told they thought it was for..."], "rating": [4, 3, 1], "TBscore": [0.6, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.6], "keywords": [["indian"], [], []]}
{"id": "i0IISmUQtB6IH1OlZn13hQ", "text": ["2nd Year - Favorite Catering Location!\nChole and Aloo Gobi - Consistently great quality!\nJalebi and Gulab Jamun - Thumbs Up!\nTo top it off - Great hospitality!", "Ignore all the previous inaccurate reviews. You still get the best makki roti and saag here.\nPaneer parantha was excellent. \nGood and fast service.", "Tooooo slow service .. not upto mark food... \nsamosa - 2/10\nPani Puri - 1/10 - very sour pani\nMasala Chai - 2 /10 took 30 mins and no taste ..."], "rating": [5, 4, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, -0.6], "keywords": [[], [], []]}
{"id": "2vK5jO0iN8qLZaejIODbkA", "text": ["Naansense serves one of the best Indian food I had in Seattle. Their menu is simple but everything on it is delicious. I am sure they have spent lot of time...", "Naansense is a deceptively great food truck, serving up great Indian food.\n\nI've had Naansense several times and I've never walked away disappointed. In...", "Grabbed a butter chicken with naan for my first meal in Seattle because the truck is around the corner from my friend's place. Service was quick and..."], "rating": [5, 4, 3], "TBscore": [0.48, 0.21, 0.0], "normalisedRating": [1.0, 0.6, 0.2], "keywords": [["indian"], ["indian"], ["chicken"]]}
{"id": "qAov2v7rBZbroUdGsUuGLA", "text": ["All I can say is I give this a ten.. Two thumbs up and I'm tough to please..\n\nI had the Spanish plate and tacos and both were vegetarian, with vegan...", "I really, really wanted to like this place. There's a major lack of variety in plant-based fare in Kitsap County, so I was excited to hear of this new...", "This place was great for guilt free breakfast. I order the smoked pot belly scramble and coffee. The smoked pot belly was good, I was just bummed I had to..."], "rating": [5, 2, 4], "TBscore": [0.0, 0.0, 0.63], "normalisedRating": [1.0, -0.2, 0.6], "keywords": [["tacos"], [], ["breakfast"]]}
{"id": "cvHTVYWuUfipbtekJlHYvQ", "text": ["This was one of the best lunches that I have had in a long time.  Immensely flavorful and filling and unique.  By far the best I have had reserved on...", "A great quick service food truck serving up some Indian street food.\n\nI loved the flavors of my pod but wish they filled it up a little more. For the price...", "I have ordered the roll combination a couple of times and this time I had the Aloo Gobi and Aloo Roll. \nAloo Roll is super yum which is what I usually..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.42, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["indian"], []]}
{"id": "NaGADNWJ-ns05-QVT3xqSQ", "text": ["I used to order from Can-Am in Kent when we lived there, so glad they have one here in Federal Way. I love their Butter Chicken and Tandoori Chicken Pizza....", "Interesting concept, less than Stellar execution. I should have guessed when they answered phone with hello... hello and it took me 5 tries to get them to...", "I love can am pizza, but I hate this place of the rude customer service and negative vibe this place sheds off. This the second incident that have happened..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [["pizza", "chicken"], [], ["pizza"]]}
{"id": "N8ErMcwiHhf6fUP0xBY1lQ", "text": ["The food was great! I did a to go order and I feel like the portion was wayyy too small especially for the price (I posted a picture on how their to go...", "After long weekday, felt happy to see Indian Restaurant and more happiness with a Indian chai, well prepared.\n\nOrdered some food for dinner to go, will...", "The food and service was really bad . The food does not have no taste and they are unfriendly"], "rating": [2, 5, 1], "TBscore": [0.0, 0.49, 0.0], "normalisedRating": [-0.2, 1.0, -0.6], "keywords": [[], ["dinner", "indian"], []]}
{"id": "375XWF8Wrj2G_-aWvF4Rqg", "text": ["Gateway to India has been one of my go to spots in Tacoma for years. I have never made it to a lunch buffet, but I have eaten here many, many times. They...", "Sat down to eat with three generations and we were all very pleased. The food was good we came at the end of the lunch menu and some things were gone and...", "Um... I'm confused about the high ratings of other users.  My first clue about the penny-pinching owners was that they don't refill the chai.  Then the..."], "rating": [5, 3, 2], "TBscore": [0.5, 0.4, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [["indian", "lunch"], ["lunch"], []]}
{"id": "75KaUFno4TQjb4YeJQmkQA", "text": ["Not sure I've ever given a 4 star rating to a restaurant with a B health-code sign on their door (wait, who am I kidding, I dine in Chinatown all the...", "We ordered to go, and this review is based on food alone.  We ordered both vegetarian dishes:\n\n- Paneer Tika Masala: the soup is flavorful and creamy so I...", "This place was out of this world. Food was really good, just what I expected. Elegantly decorated, friendly environment. Server was attentive and helpful...."], "rating": [4, 3, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, 0.2, 1.0], "keywords": [[], [], []]}
{"id": "7itqiy7Tel5pt9DwAJY2pw", "text": ["This place is soooo worth it! The food was hella delicious and the price shocked me.\nNormally a buffet is like $15-$20 and this is only $11 with delicious...", "Good flavors, huge menu, full bar, and decent service. However Ambiance was a -4. Huge banquet hall with a few tables at the end where you eat. Indian music...", "This was the best Indian food I have had in a long time. The Eggplant Bhartha was wonderful, but the Navratan Korma was amazingly, fantastically good. The..."], "rating": [5, 3, 5], "TBscore": [0.0, 0.3, 0.65], "normalisedRating": [1.0, 0.2, 1.0], "keywords": [[], ["indian", "bar"], ["indian"]]}
{"id": "E44SDiWifUAS5iOK1duMDw", "text": ["We are visiting from So California and found this restaurant through restaurants.com and decided to try something different for us.  We were all very...", "The owner seemed to be nice guy but service was very slow, found a piece of story me in rice. Curry had no flavor but only meshed onions while I asked for...", "I made it a point to come here and try their buffet in addition to their regular dinner service.\n\nDon't get confused by this place because it's in the same..."], "rating": [4, 2, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.6, -0.2, 0.6], "keywords": [[], [], ["dinner"]]}
{"id": "N16fET725jgFcb1RpeBsrg", "text": ["The reviews below are a bit dumb tbh.  It's a local Indian sweet shop and people are acting like it's a fine dining restaurant.\n\nThe sweets were good,...", "I went there today for the first time I really didn't like it,  the food didn't taste good ,  me and husband ordered cholay batura and baigaan bharta, the...", "I usually dnt go to Jot's because my indian friends already warned me how unsanitary they are. But today, one of my friend gave me sweets from Jot's. I..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, -0.25], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [["indian"], [], ["indian"]]}
{"id": "KMAHhiDKmFnsszK0E0J0BA", "text": ["I highly recommend the aged rib eye steak.\nThe meat was super tender and the sauce with it is very tasteful. The owner was super nice and friendly.\n\nI just...", "Best steak burger I've ever had. Large portion size with fries on the side. Perfectly tender meat. You won't be disappointed.\n\nPlace is clean, much better...", "This place was one of our finest finds in the area. My husband and I went out furniture shopping which did not turn out to be very successful. However, our..."], "rating": [5, 4, 4], "TBscore": [0.0, 0.39, 0.0], "normalisedRating": [1.0, 0.6, 0.6], "keywords": [[], ["steak", "burger"], []]}
{"id": "8ldhAsIIXJDLnjeRBG3_kQ", "text": ["This is the best Korean bbq restaurant i've ever been, so far. Grill makes the meat as you would want them to be cooked, clean surface and doesn't make your...", "Worth the drive? Must say it depends!\n\nI have had Cham Garden bookmarked for quite some time now, as it has always been \"deemed\" the best Korean BBQ in WA....", "Being from California and all my reviews, trust me when I say this is the best it's gonna get for Kbbq in Washington! When I'm craving kbbq I always drive..."], "rating": [5, 4, 5], "TBscore": [0.49, 0.69, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [["korean"], ["korean"], []]}
{"id": "NxticjHtJdWy193Np6GtJg", "text": ["This is my second time to come here.They have the best food，everything is delicious！The tall man is so nice，i can't eat very spicy food，he told me about...", "Why are there no chinese restaurants in Shelton? With the Ming Tree up for sale, the Royal Shanghai has room for improvement.  \n\nIf you are in a pinch, the...", "We have dined at the Royal Buffet in Shelton several times. We take my Mom there because of the choices, but today will be the last time. We were there..."], "rating": [5, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, -0.2, -0.6], "keywords": [[], ["chineese"], []]}
{"id": "1_nLwfbaM4EFXdVY4ZJ05g", "text": ["From one Californian to any others reading this. \nThis is likely the best mexican food within 50 miles. \nI know, you have yet to find anything you consider...", "This is delicious and authentic. Rice is flavorful and not dry. Beans taste homemade because they are. I've been to many Mexican restaurants over many years...", "Absolutely terrible! Ordered a taco salad and it literally only had the tortilla bowl, ground beef and lettuce . Nothing like what the picture looked like..."], "rating": [5, 5, 1], "TBscore": [0.33, 0.42, -0.5], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [["mexican"], ["mexican"], ["beef"]]}
{"id": "PzIYRy1atsbWTgSZ1idJDA", "text": ["We love Vincent! If you are looking for a awesome 90's theme bar then this is the place! If you are looking for simply a fantastic bar, then come here when...", "Ordered the nachos and an ice tea. No one ever came back to refill my tea. O well they are busy.  Waited for the check and waited.  \n\nWent up to the counter...", "We were on foot and we passed so many fast food Mexican places and we're so glad we kept walking to o rind this amazing restaurant. We had carne asada..."], "rating": [5, 1, 5], "TBscore": [0.67, 0.0, 0.36], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["bar"], [], ["mexican"]]}
{"id": "d6R1dMkAQmKjH5ejAQdRfw", "text": ["Puerto Vallarta is a wonderful restaurant. I started coming to this restaurant for its lunch buffet.  However, when getting fit for summer, I order a salad...", "This place came highly recommended by my friend so I had to give it a try. We came here for a late lunch with our two littles.\nService was good once we...", "This is just OK.  I ordered enchiladas and forgot to say green sauce - did the waiter ask for my preference?  No. I think they should ask. This place..."], "rating": [5, 3, 3], "TBscore": [0.7, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [["lunch"], ["lunch"], []]}
{"id": "qNW9NdmfNAhXREPjfk7Hbw", "text": ["3 things to point out. \n1- I called my order to go, staff were very nice. I felt really welcomed and they were helpful as can be. \n2- I ordered a chicken...", "We use to come for lunch here all the time but we found bones in the chicken nachos and haven't eaten here since then. Today we decided to go ahead and come...", "I recently placed a review that was irresponsible  and Totally uncalled for due unfortunately to\nMy inebriated behavior , I immediately retracted the post..."], "rating": [3, 2, 5], "TBscore": [0.0, -0.6, 0.0], "normalisedRating": [0.2, -0.2, 1.0], "keywords": [["chicken"], ["chicken", "lunch"], []]}
{"id": "1INCFMbc3ZeEYN3McAUurA", "text": ["Excellent fresh food!!  The papusas are some of the best I've ever had!!  Very large servings!", "We love this place...papusas are so amazing. Best we've had. The rice and beans are great here too. We try every hot sauce they make because we can't decide...", "I'm glad that there was a pupuseria close to satisfy my cravings! I ordered a loroco pupusa and a spinach one, super fresh, buttery, and yummy. Rice and..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "nPdFDAP7tk2nq1Jpo6I0vg", "text": ["Didn't expect to find the flavor OR portions like this in the PNW after leaving SW Texas! Mayan Mexican R during lunch was a pleasant surprise , price,...", "If I could put a ZERO I would. \n\nWORST EXPERIENCE OF MY LIFE. My waiter was an older man, no one had name tags on. Never once said his name. Every single...", "Good Mexican Food.  Fast, friendly service.  Great lunch specials.  Went on a Saturday afternoon for lunch.  Our food came out very quickly. Everything we..."], "rating": [4, 1, 4], "TBscore": [0.37, 0.0, 0.42], "normalisedRating": [0.6, -0.6, 0.6], "keywords": [["mexican", "lunch"], [], ["mexican", "lunch"]]}
{"id": "FfgZszjo8fmowETd06qGZQ", "text": ["This is the restaurant at Indian Summer Golf and Country Club. I heard the former chef went to Oly G&CC...and he had a good rep. Anyway, I was just there...", "Not bad.  The Dungeness Cocktail was good.  Martini was tasty.  The members think highly of themselves, thus the reason I would never join a country club.", "Went here for our staff Christmas lunch.   4 of us ordered the filet mignon with rice and vegitables.  The vegitables were not fresh, more then likely..."], "rating": [4, 3, 2], "TBscore": [0.35, 0.0, 0.0], "normalisedRating": [0.6, 0.2, -0.2], "keywords": [["indian"], [], ["lunch"]]}
{"id": "lkRf2uUns0WJ-5RkxrVWNg", "text": ["went for lunch with party of 5.  It was ok- eggplant was bitter, still had skin on.  Salads and sandwiches looked good, french fries were great.  Good...", "It was excellent! Our server was Nicole, and she was very sweet and attentive. Food was very good. We have lived in the area for years and never been here....", "Waited 75 minutes last night and finally left.  We had reservations for 6 people and the service and wait were inexcusable.  Our waitress finally stopped..."], "rating": [2, 5, 1], "TBscore": [0.43, 0.0, 0.0], "normalisedRating": [-0.2, 1.0, -0.6], "keywords": [["lunch", "sandwich"], [], []]}
{"id": "VWJ0A0wFVnU7InpmLL0VnA", "text": ["Super friendly and helpful. Went back today, our second visit to the store. They give you a discount if you bring back your bottles. We refilled our Butter...", "We discovered this little oasis about two years ago. Once you understand what FRESH, HIGH QUALITY olive oil should taste like, you'll be a repeat customer....", "I travel from Tacoma to go to OOO.  They have a great variety and you get to try everything!  Just went back to get my refills (4 bottles) and bought a new..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "IGWBhIPY9hRmf6seuB8eLw", "text": ["Beautiful cakes! Stephanie did an amazing job on my daughters birthday cake- she was also a sweetheart. I will definitely have her do my cakes in the future.", "Delicious!!!  I wasn't looking for beauty so much as taste, but we got both with Truffles Cakery!  Coconut Cream Cheese frosting was fork and finger licking...", "Amazing!! So delicious and beautiful. The cake turned out so well, I didn't even want to eat it!!! But I did and it was delicious. Strawberry cake with a..."], "rating": [5, 5, 5], "TBscore": [0.4, 0.0, 0.98], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [["cake"], [], ["cake"]]}
{"id": "P20MhI_92LuX9BRLSR-Cgg", "text": ["Abby is so great! She made the cupcakes for our wedding, and they were delicious and so cute! Our guests couldn't decide which flavor they liked best :) I'd...", "Ok so we arrived like 3 minutes after they closed and the young lady was taking out trash.  We asking nicely since I'm visiting from Texas if they had any...", "These are great cupcakes! Very friendly service and quite affordable! Nice surprise treat for family or coworkers to brighten their day!"], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], []]}
{"id": "-ynfzKydNM-d9h9HKDVmUw", "text": ["I ordered cookies from Sugar Canvas for my daughters high school graduation party. The details were absolutely amazing.  They were super easy to work...", "I've ordered cookies a few times now and they are always delicious, and the icing is on point perfect!  Super cute designs and the baker is easy to work...", "I ordered a smash cake for my son's 1st birthday party. He loved it and the cake was delicious. The cake design was cute too with the navy blue anchor. The..."], "rating": [5, 5, 5], "TBscore": [0.0, 0.0, 0.55], "normalisedRating": [1.0, 1.0, 1.0], "keywords": [[], [], ["cake"]]}
{"id": "ODoAfWGPKg95BYzU0GkAfw", "text": ["So this place is amazing!!!! If you like cupcakes that are tasty and not like pouring straight sugar in your mouth then this is a great place for you. I...", "I was really excited to try the cupcakes here. They look absolutely delectable! We bought 4 different kinds and the cinnamon roll to celebrate my birthday....", "This is now called The Sweetest Things which has Miss Moffett's as a business partner though Miss Moffett's is still painted on the window. It is a sparsely..."], "rating": [5, 3, 2], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.2], "keywords": [[], [], []]}
{"id": "E5bj22BEzdqm6616uiH-ig", "text": ["Come often.  First review.  Their Blizzards are absolutely delicious.   Love to try out the flavor of the month. Haven't found one that I haven't liked....", "All I have to say is blizzard and dipped cone haha but for real clean easily accessible great staff", "Simply would not make a blizzed the way I asked. Didn't mind paying for extra but she still couldn't add the topping. This is the only DQ to do this. I go..."], "rating": [5, 5, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, -0.6], "keywords": [[], [], []]}
{"id": "F9p2VOR-RSWDYYg00Snpkg", "text": ["Love our Market.  Wish it was open later in the day though during Spring and Summer months", "Hubs and I decided we needed to visit our newly adopted state's capital city and made the hour plus drive down to Olympia to see the state house. We'd also...", "Great market with a variety of produce, prepared items, and gifts. Many of the stands are covered, which can come in handy on a rainy day! We made out with..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], []]}
{"id": "l561TMDSe3DXHhn9k0XTWw", "text": ["Ok so literally last 2 times I've went there, I've been verbally attacked not by employees but other customers!!! I don't know who they think they are, but...", "Thank you so much Kate at the bakery for helping with a last minute birthday cake for a little boys birthday. You went above and beyond to make a cake with...", "This is my neighborhood Albertsons, they have changed to Haggen and back to Albertsons. The employees are extremely friendly and super helpful. I was in the..."], "rating": [1, 5, 5], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 1.0, 1.0], "keywords": [[], ["cake"], []]}
{"id": "B11ecc_s1LKpcEGEvBPK1g", "text": ["Man, I do not know what is up with the bakery in this place, but they have magical powers. I rarely shop here but whenever I am nearby, I stop in to grab...", "This store is a bit smaller than many, yet the dairy is spread between three or four areas of the store.  The produce looks good but the selection of...", "I like this store, and I like having cashiers.  UNFORTUNATELY, the management of Kroger has decided that Self-Check is the preferred method.   I oppose the..."], "rating": [5, 3, 3], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, 0.2], "keywords": [[], [], []]}
{"id": "weD9_D57Rm3mjm5JqjztJw", "text": ["We had Marv's cater our wedding reception two weeks ago and it was the best experience imaginable!  Lance and Chris are wonderful to work with and make the...", "Marv's catered my cousins wedding reception. It couldn't have been better, and the guys that came with the bbq and trucks couldn't have been more awesome...", "Catered a company deal. Had whole hog that was pretty good. Chicken was better than average. Sides were beans that were fairly tasty. Cheesy potatoes did..."], "rating": [5, 5, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 1.0, 0.6], "keywords": [[], [], ["chicken"]]}
{"id": "LeRJaQ2P9JL8_su2AezM0A", "text": ["Went to this place when they were at a social location for an event, so they had a reduced menu. We tried pulled pork sandwiches and some seafood gumbo. The...", "When we arrived at this food cart in downtown Olympia, the Procession of the Species had just been through-- and I think quite a few of the ravenous animals...", "We seen this food truck at the Sand in the City Festival! It was really tasty! These guys can definitely barbecue! Service wasn't the best and a little..."], "rating": [1, 3, 4], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, 0.6], "keywords": [["sandwich"], [], []]}
{"id": "lJSnkNeUiISTiF-86w-sPw", "text": ["the pho was excellent. I got the steak and brisket and its tased super yummm . \nI like the bowl were well priced and were size reasonably. Too many pho...", "I have ordered from this \"restaurant\" 4 times now. Each time saying \"NO PEANUTS\" as I am very allergic. EVERY TIME my food has come with peanuts. This last...", "We come here every week. Best Pho around town. We have tried several around the area and this is by far the best. The flavor in food is delicious. We always..."], "rating": [5, 1, 5], "TBscore": [0.51, 0.0, 0.0], "normalisedRating": [1.0, -0.6, 1.0], "keywords": [["steak"], [], []]}
{"id": "euR1tzzQQkD2RpbYum23Sg", "text": ["Good service generally. You can see many don't really don't want to be working but that's not the store. Food is as expected. \n\nMy only real issue is that...", "My husband and I needed to grab food on the run today.  I grabbed a mcbiscuit and he grabbed a burger.  He asked for BBQ sauce for his burger and 2 ketchup....", "Disgusting!!! Today we stopped in for some cheap drinks and ice cream. Some kid puked in the play structure slide. So, male employee climbs up with a spray..."], "rating": [3, 2, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [0.2, -0.2, -0.6], "keywords": [[], ["burger"], []]}
{"id": "0LGcDhlNJFqjbPW3Czzgbg", "text": ["Our first, and most likely last, time eating here. Yikes! The salt had very little fries. Maybe take it easy. If you wanna be heavy handed with something,...", "Wendy's is Wendy's, but this one is the best in town. I almost always order a spicy chicken sandwich and it's always fresher here than what you get on the...", "Freaking gross! I ordered late night because I work a night shift so you would think that they would have to make some fresh fries. Nope. They were cold and..."], "rating": [1, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [-0.6, 0.2, -0.6], "keywords": [[], ["chicken", "sandwich"], []]}
{"id": "6Hqh-WZq5E7eqxjVaw2jcg", "text": ["Friendly employees! \nThis place is busy so many times there is a wait. \nOur favorite part is that this place has community parties. My kids and I have been...", "I did a mobile order  #1936 today I did not get all of my food. I didn't check until I got home as the gal who brought it out said she checked and...", "When we first moved out here, I'll be honest, I was BLOWN away by the chicken club they had. I never except much from McDonald's, for great reason as I'm..."], "rating": [4, 1, 1], "TBscore": [0.0, 0.0, 0.25], "normalisedRating": [0.6, -0.6, -0.6], "keywords": [[], [], ["chicken"]]}
{"id": "cYr3SqHPGrMUl-tc4D7pMg", "text": ["So I'm New To Washington, Im from California. And I must say this is probably theee Best McDonalds I've ever been to.. McDonalds was actually my first job....", "Stopped at this McDonalds on a road trip to let the kiddo run off some energy in their giant play place! It did the trick, but I'm not sure if the play...", "I don't know what kind of business they got running here but the employees and customer service here is terrible. I went through the drive thru and tried to..."], "rating": [5, 3, 1], "TBscore": [0.0, 0.0, 0.0], "normalisedRating": [1.0, 0.2, -0.6], "keywords": [[], [], []]}
{"id": "WtPFzb4yDgijBYzAzpDdqA", "text": ["Sweet potato fries (tater tots) so yummy; mild taco sauce very nice and truly mild.  Shop is clean, chicken crispy taco tasty.  Liked it!", "I always feel a little sleazy yelping on a fast food restaurant. I mean probably 90% of them would probably disgust us if we really saw what happens in the...", "I was very disappointed in the extremely slow service at dinner time in the drive thru at this location.  By the time I even got to the window,  I was so..."], "rating": [4, 2, 1], "TBscore": [0.33, 0.0, -0.64], "normalisedRating": [0.6, -0.2, -0.6], "keywords": [["chicken"], [], ["dinner"]]}
{"id": "4aR7tJYpYZH-clvUVNf7NQ", "text": ["Great Pho!  My wife kept saying the food is so fresh!  She had some salad #26 maybe (no photo) it was that good and gone fast.  I had fried roll with my Pho...", "We did takeout here since we were looking for pho in the area - literally the only thing that makes us feel better when we're sick!\n\nWe both ordered the...", "Great teriyaki chicken. Also had the fried crab wanton appetizers which were amazing -- I could've eaten just those for a meal! The portions were very..."], "rating": [5, 4, 5], "TBscore": [0.0, 0.0, 0.29], "normalisedRating": [1.0, 0.6, 1.0], "keywords": [[], [], ["chicken"]]}
